{"patent_id": "10-2023-0077375", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0176889", "출원번호": "10-2023-0077375", "발명의 명칭": "발광 표시 장치", "출원인": "삼성디스플레이 주식회사", "발명자": "이상신"}}
{"patent_id": "10-2023-0077375", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 두 개의 단위 화소로 구성된 하나의 단위 화소 그룹을 포함하고,하나의 상기 단위 화소는 삼원색에 대응하는 제1 발광층, 제2 발광층, 및 제3 발광층을 포함하며, 상기 제1 발광층은 하나의 상기 단위 화소에 두 개의 제1 발광층이 포함되며, 상기 단위 화소 그룹 중 일 부분에는 레이저 드릴링의 위치가 형성되며,상기 레이저 드릴링 위치에 인접하는 상기 제2 발광층 및 상기 제3 발광층은 홈을 포함하는 제2 변형 발광층 및제3 변형 발광층으로 형성되고,상기 레이저 드릴링 위치에서 떨어져 위치하는 상기 제2 발광층 및 상기 제3 발광층은 홈을 포함하지 않는 제2노멀 발광층 및 제3 노멀 발광층으로 형성되어 있으며,상기 제2 변형 발광층의 면적과 상기 제2 노멀 발광층의 면적은 동일하거나 10% 이내의 면적 차이를 가지며,상기 제3 변형 발광층의 면적과 상기 제3 노멀 발광층의 면적은 동일하거나 10% 이내의 면적 차이를 가지는 발광 표시 장치."}
{"patent_id": "10-2023-0077375", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에서,상기 제2 변형 발광층의 상기 홈과 상기 제3 변형 발광층의 상기 홈은 각각 상기 제2 변형 발광층과 상기 제3변형 발광층 중 상기 레이저 드릴링 위치 측에 형성되어 있는 발광 표시 장치."}
{"patent_id": "10-2023-0077375", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에서,상기 제2 변형 발광층은 상기 제2 노멀 발광층의 변 부분에서 확장되고, 상기 제2 변형 발광층의 상기 홈은 상기 제2 노멀 발광층의 모서리 부분에서 축소되어 있으며, 상기 제3 변형 발광층은 상기 제3 노멀 발광층의 변 부분에서 확장되고, 상기 제3 변형 발광층의 상기 홈은 상기 제3 노멀 발광층의 모서리 부분에서 축소되어 있는 발광 표시 장치."}
{"patent_id": "10-2023-0077375", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에서,상기 제2 노멀 발광층 및 상기 제3 노멀 발광층의 평면 모양은 사각형 모양을 가지며, 모서리 부분이 모따기 되거나 둥근 모서리를 가지는 발광 표시 장치."}
{"patent_id": "10-2023-0077375", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에서,상기 제1 발광층은 홈을 포함하지 않는 제1 노멀 발광층으로 형성되어 있으며,하나의 상기 단위 화소에 포함되는 상기 제1 발광층은 제1-1 발광층 및 제1-2 발광층을 포함하며,상기 제1-1 발광층 및 상기 제1-2 발광층은 평면 모양으로 각각 직사각형 모양을 가지며, 모서리 부분이 모따기되거나 둥근 모서리를 가지고,상기 제1-1 발광층이 길게 배치된 방향과 상기 제1-2 발광층이 길게 배치된 방향은 서로 다른 발광 표시 장치.공개특허 10-2024-0176889-3-청구항 6 제5항에서,하나의 상기 단위 화소에 포함되며, 상기 제1-1 발광층을 포함하는 발광 소자와 상기 제1-2 발광층을 포함하는발광 소자는 동일한 화소 구동부와 연결선을 통하여 전기적으로 연결되어 있는 발광 표시 장치."}
{"patent_id": "10-2023-0077375", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에서,상기 하나의 상기 단위 화소에 상기 레이저 드릴링 위치가 전부 위치하는 경우, 상기 연결선 중 일 부분은 상기단위 화소의 외곽을 따라서 연장되는 발광 표시 장치."}
{"patent_id": "10-2023-0077375", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제4항에서,상기 레이저 드릴링 위치에 인접하는 상기 제1 발광층은 홈을 포함하는 제1 변형 발광층으로 형성되고, 상기 레이저 드릴링 위치에서 떨어져 위치하는 상기 제1 발광층은 홈을 포함하지 않는 제1 노멀 발광층으로 형성되어있으며,상기 제1 변형 발광층의 면적과 상기 제1 노멀 발광층의 면적은 동일하거나 10% 이내의 면적 차이를 가지는 발광 표시 장치."}
{"patent_id": "10-2023-0077375", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에서,상기 제1 노멀 발광층은 평면 모양으로 각각 직사각형 모양을 가지며, 모서리 부분이 모따기 되거나 둥근 모서리를 가지고,하나의 상기 단위 화소의 내에는 상기 제1 변형 발광층이 두 개 포함되어 있으며, 상기 두 개의 상기 제1 변형 발광층은 길게 배치된 방향이 서로 다른 발광 표시 장치."}
{"patent_id": "10-2023-0077375", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제4항에서,상기 제2 변형 발광층은 추가적으로 상기 제2 노멀 발광층의 모서리 부분에서도 확장되어 있으며, 상기 제3 변형 발광층은 추가적으로 상기 제3 노멀 발광층의 모서리 부분에서도 확장되어 있는 발광 표시 장치."}
{"patent_id": "10-2023-0077375", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에서,상기 하나의 단위 화소 그룹은 4개의 상기 단위 화소를 포함하고,상기 레이저 드릴링 위치는 상기 4개의 상기 단위 화소 모두에 걸쳐 위치하는 발광 표시 장치."}
{"patent_id": "10-2023-0077375", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에서,상기 레이저 드릴링 위치의 중심은 상기 4개의 상기 단위 화소 중 하나의 상기 단위 화소에 위치하는 발광 표시장치."}
{"patent_id": "10-2023-0077375", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에서,상기 레이저 드릴링 위치의 중심은 상기 4개의 상기 단위 화소가 만나는 점에 위치하는 발광 표시 장치.공개특허 10-2024-0176889-4-청구항 14 제1항에서,상기 하나의 단위 화소 그룹은 4개의 상기 단위 화소를 포함하고,상기 레이저 드릴링 위치는 상기 4개의 상기 단위 화소 중 두 개의 상기 단위 화소에 걸쳐 위치하는 발광 표시장치."}
{"patent_id": "10-2023-0077375", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항에서,상기 하나의 단위 화소 그룹은 4개의 상기 단위 화소를 포함하고,상기 레이저 드릴링 위치는 상기 4개의 상기 단위 화소 중 한 개의 상기 단위 화소 내에 위치하는 발광 표시 장치."}
{"patent_id": "10-2023-0077375", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제1항에서,적어도 두 개의 서로 다른 상기 단위 화소 그룹에서 상기 레이저 드릴링 위치는 서로 다른 발광 표시 장치."}
{"patent_id": "10-2023-0077375", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "적어도 두 개의 단위 화소로 구성된 하나의 단위 화소 그룹을 포함하고,하나의 상기 단위 화소는 삼원색에 대응하는 제1 발광층, 제2 발광층, 및 제3 발광층을 포함하며, 상기 제1 발광층은 하나의 상기 단위 화소에 두 개의 제1 발광층이 포함되며, 상기 단위 화소 그룹 중 일 부분에는 레이저 드릴링의 위치가 형성되며,상기 제1 발광층은 홈을 포함하지 않는 제1 노멀 발광층으로 형성되고,상기 제2 발광층 및 상기 제3 발광층은 홈을 포함하는 제2 변형 발광층 및 제3 변형 발광층으로 형성되는 발광표시 장치."}
{"patent_id": "10-2023-0077375", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에서,상기 제2 변형 발광층 및 상기 제3 변형 발광층 중 상기 레이저 드릴링 위치에 인접하는 것은 상기 홈이 각각상기 제2 변형 발광층과 상기 제3 변형 발광층 중 상기 레이저 드릴링 위치 측에 형성되어 있는 발광 표시장치."}
{"patent_id": "10-2023-0077375", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에서,상기 레이저 드릴링 위치에서 떨어져 위치하는 상기 제2 변형 발광층 및 상기 제3 변형 발광층은 상기 홈이 각각 상기 레이저 드릴링 위치에 인접하는 상기 제2 변형 발광층 및 상기 제3 변형 발광층에서 상기 홈이 위치하는 측과 다른 측에 위치하는 발광 표시 장치."}
{"patent_id": "10-2023-0077375", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에서,상기 하나의 단위 화소 그룹은 4개의 상기 단위 화소를 포함하고,상기 제2 변형 발광층 및 상기 제3 변형 발광층은 상기 홈을 제외하면 사각형 모양을 가지며, 모서리가 모따기되거나 둥근 모서리를 가지며,상기 하나의 단위 화소 그룹에 상기 제2 변형 발광층 및 상기 제3 변형 발광층이 각각 4개씩 포함되고,공개특허 10-2024-0176889-5-상기 레이저 드릴링 위치에 인접하는 상기 제2 변형 발광층 및 상기 제3 변형 발광층은 각각 1개이고,상기 레이저 드릴링 위치에서 떨어져 위치하는 상기 제2 변형 발광층 및 상기 제3 변형 발광층은 각각 3개이며,상기 레이저 드릴링 위치에 인접하는 상기 제2 변형 발광층 및 상기 제3 변형 발광층에서 상기 홈이 위치하는모서리와 상기 레이저 드릴링 위치에서 떨어져 위치하는 상기 제2 변형 발광층 및 상기 제3 변형 발광층의 상기홈이 위치하는 모서리는 모두 다른 발광 표시 장치."}
{"patent_id": "10-2023-0077375", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "실시예들에 따르면, 적어도 두 개의 단위 화소로 구성된 하나의 단위 화소 그룹을 포함하고, 하나의 상기 단위 화소는 삼원색에 대응하는 제1 발광층, 제2 발광층, 및 제3 발광층을 포함하며, 상기 제1 발광층은 하나의 상기 단위 화소에 두 개의 제1 발광층이 포함되며, 상기 단위 화소 그룹 중 일 부분에는 레이저 드릴링의 위치가 형성 되며, 상기 레이저 드릴링 위치에 인접하는 상기 제2 발광층 및 상기 제3 발광층은 홈을 포함하는 제2 변형 발광 층 및 제3 변형 발광층으로 형성되고, 상기 레이저 드릴링 위치에서 떨어져 위치하는 상기 제2 발광층 및 상기 제3 발광층은 홈을 포함하지 않는 제2 노멀 발광층 및 제3 노멀 발광층으로 형성되어 있으며, 상기 제2 변형 발 광층의 면적과 상기 제2 노멀 발광층의 면적은 동일하거나 10% 이내의 면적 차이를 가지며, 상기 제3 변형 발광 층의 면적과 상기 제3 노멀 발광층의 면적은 동일하거나 10% 이내의 면적 차이를 가진다."}
{"patent_id": "10-2023-0077375", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 발광 표시 장치에 관한 것이다."}
{"patent_id": "10-2023-0077375", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "표시 장치는 화면을 표시하는 장치로서, 액정 표시 장치(Liquid Crystal Display, LCD), 유기 발광 표시 장치 (Organic Light Emitting Diode, OLED) 등이 있다. 이러한 표시 장치는 휴대 전화, 네비게이션, 디지털 사진 기, 전자 북, 휴대용 게임기, 또는 각종 단말기 등과 같이 다양한 전자 기기들에 사용되고 있다. 유기 발광 표시 장치는 자발광(self-luminance) 특성을 가지며, 액정 표시 장치와 달리 별도의 광원을 필요로 하지 않으므로 두께와 무게를 줄일 수 있다. 또한, 유기 발광 표시 장치는 낮은 소비 전력, 높은 휘도 및 빠른 응답 속도 등의 고품위 특성을 가진다."}
{"patent_id": "10-2023-0077375", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "실시예들은 레이저를 사용하는 등의 방법으로 캐소드로 전압을 전달할 수 있는 공간을 확보한 발광 표시 장치를 제공하기 위한 것이다. 실시예들은 고 해상도의 발광 표시 장치를 제공하기 위한 것이다. 실시예들은 동일한 색의 발광 소자가 동일한 수명을 가지는 발광 표시 장치를 제공하기 위한 것이다."}
{"patent_id": "10-2023-0077375", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "실시예에 따른 발광 표시 장치는 적어도 두 개의 단위 화소로 구성된 하나의 단위 화소 그룹을 포함하고, 하나 의 상기 단위 화소는 삼원색에 대응하는 제1 발광층, 제2 발광층, 및 제3 발광층을 포함하며, 상기 제1 발광층 은 하나의 상기 단위 화소에 두 개의 제1 발광층이 포함되며, 상기 단위 화소 그룹 중 일 부분에는 레이저 드릴 링의 위치가 형성되며, 상기 레이저 드릴링 위치에 인접하는 상기 제2 발광층 및 상기 제3 발광층은 홈을 포함 하는 제2 변형 발광층 및 제3 변형 발광층으로 형성되고, 상기 레이저 드릴링 위치에서 떨어져 위치하는 상기 제2 발광층 및 상기 제3 발광층은 홈을 포함하지 않는 제2 노멀 발광층 및 제3 노멀 발광층으로 형성되어 있으 며, 상기 제2 변형 발광층의 면적과 상기 제2 노멀 발광층의 면적은 동일하거나 10% 이내의 면적 차이를 가지며, 상기 제3 변형 발광층의 면적과 상기 제3 노멀 발광층의 면적은 동일하거나 10% 이내의 면적 차이를 가 진다. 상기 제2 변형 발광층의 상기 홈과 상기 제3 변형 발광층의 상기 홈은 각각 상기 제2 변형 발광층과 상기 제3 변형 발광층 중 상기 레이저 드릴링 위치 측에 형성될 수 있다. 상기 제2 변형 발광층은 상기 제2 노멀 발광층의 변 부분에서 확장되고, 상기 제2 변형 발광층의 상기 홈은 상 기 제2 노멀 발광층의 모서리 부분에서 축소되어 있으며, 상기 제3 변형 발광층은 상기 제3 노멀 발광층의 변 부분에서 확장되고, 상기 제3 변형 발광층의 상기 홈은 상기 제3 노멀 발광층의 모서리 부분에서 축소될 수 있 다. 상기 제2 노멀 발광층 및 상기 제3 노멀 발광층의 평면 모양은 사각형 모양을 가지며, 모서리 부분이 모따기 되 거나 둥근 모서리를 가질 수 있다. 상기 제1 발광층은 홈을 포함하지 않는 제1 노멀 발광층으로 형성되어 있으며, 하나의 상기 단위 화소에 포함되 는 상기 제1 발광층은 제1-1 발광층 및 제1-2 발광층을 포함하며, 상기 제1-1 발광층 및 상기 제1-2 발광층은 평면 모양으로 각각 직사각형 모양을 가지며, 모서리 부분이 모따기 되거나 둥근 모서리를 가지고, 상기 제1-1 발광층이 길게 배치된 방향과 상기 제1-2 발광층이 길게 배치된 방향은 서로 다를 수 있다. 하나의 상기 단위 화소에 포함되며, 상기 제1-1 발광층을 포함하는 발광 소자와 상기 제1-2 발광층을 포함하는 발광 소자는 동일한 화소 구동부와 연결선을 통하여 전기적으로 연결될 수 있다. 상기 하나의 상기 단위 화소에 상기 레이저 드릴링 위치가 전부 위치하는 경우, 상기 연결선 중 일 부분은 상기 단위 화소의 외곽을 따라서 연장될 수 있다. 상기 레이저 드릴링 위치에 인접하는 상기 제1 발광층은 홈을 포함하는 제1 변형 발광층으로 형성되고, 상기 레 이저 드릴링 위치에서 떨어져 위치하는 상기 제1 발광층은 홈을 포함하지 않는 제1 노멀 발광층으로 형성되어 있으며, 상기 제1 변형 발광층의 면적과 상기 제1 노멀 발광층의 면적은 동일하거나 10% 이내의 면적 차이를 가 질 수 있다. 상기 제1 노멀 발광층은 평면 모양으로 각각 직사각형 모양을 가지며, 모서리 부분이 모따기 되거나 둥근 모서 리를 가지고, 하나의 상기 단위 화소의 내에는 상기 제1 변형 발광층이 두 개 포함되어 있으며, 상기 두 개의 상기 제1 변형 발광층은 길게 배치된 방향이 서로 다를 수 있다. 상기 제2 변형 발광층은 추가적으로 상기 제2 노멀 발광층의 모서리 부분에서도 확장되어 있으며, 상기 제3 변 형 발광층은 추가적으로 상기 제3 노멀 발광층의 모서리 부분에서도 확장될 수 있다. 상기 하나의 단위 화소 그룹은 4개의 상기 단위 화소를 포함하고, 상기 레이저 드릴링 위치는 상기 4개의 상기 단위 화소 모두에 걸쳐 위치할 수 있다. 상기 레이저 드릴링 위치의 중심은 상기 4개의 상기 단위 화소 중 하나의 상기 단위 화소에 위치할 수 있다. 상기 레이저 드릴링 위치의 중심은 상기 4개의 상기 단위 화소가 만나는 점에 위치할 수 있다. 상기 하나의 단위 화소 그룹은 4개의 상기 단위 화소를 포함하고, 상기 레이저 드릴링 위치는 상기 4개의 상기 단위 화소 중 두 개의 상기 단위 화소에 걸쳐 위치할 수 있다. 상기 하나의 단위 화소 그룹은 4개의 상기 단위 화소를 포함하고, 상기 레이저 드릴링 위치는 상기 4개의 상기 단위 화소 중 한 개의 상기 단위 화소 내에 위치할 수 있다. 적어도 두 개의 서로 다른 상기 단위 화소 그룹에서 상기 레이저 드릴링 위치는 서로 다를 수 있다. 일 실시예에 따른 발광 표시 장치는 적어도 두 개의 단위 화소로 구성된 하나의 단위 화소 그룹을 포함하고, 하 나의 상기 단위 화소는 삼원색에 대응하는 제1 발광층, 제2 발광층, 및 제3 발광층을 포함하며, 상기 제1 발광 층은 하나의 상기 단위 화소에 두 개의 제1 발광층이 포함되며, 상기 단위 화소 그룹 중 일 부분에는 레이저 드 릴링의 위치가 형성되며, 상기 제1 발광층은 홈을 포함하지 않는 제1 노멀 발광층으로 형성되고, 상기 제2 발광 층 및 상기 제3 발광층은 홈을 포함하는 제2 변형 발광층 및 제3 변형 발광층으로 형성된다. 상기 제2 변형 발광층 및 상기 제3 변형 발광층 중 상기 레이저 드릴링 위치에 인접하는 것은 상기 홈이 각각 상기 제2 변형 발광층과 상기 제3 변형 발광층 중 상기 레이저 드릴링 위치 측에 형성될 수 있다. 상기 레이저 드릴링 위치에서 떨어져 위치하는 상기 제2 변형 발광층 및 상기 제3 변형 발광층은 상기 홈이 각 각 상기 레이저 드릴링 위치에 인접하는 상기 제2 변형 발광층 및 상기 제3 변형 발광층에서 상기 홈이 위치하 는 측과 다른 측에 위치할 수 있다. 상기 하나의 단위 화소 그룹은 4개의 상기 단위 화소를 포함하고, 상기 제2 변형 발광층 및 상기 제3 변형 발광 층은 상기 홈을 제외하면 사각형 모양을 가지며, 모서리가 모따기 되거나 둥근 모서리를 가지며, 상기 하나의 단위 화소 그룹에 상기 제2 변형 발광층 및 상기 제3 변형 발광층이 각각 4개씩 포함되고, 상기 레이저 드릴링 위치에 인접하는 상기 제2 변형 발광층 및 상기 제3 변형 발광층은 각각 1개이고, 상기 레이저 드릴링 위치에서 떨어져 위치하는 상기 제2 변형 발광층 및 상기 제3 변형 발광층은 각각 3개이며, 상기 레이저 드릴링 위치에 인접하는 상기 제2 변형 발광층 및 상기 제3 변형 발광층에서 상기 홈이 위치하는 모서리와 상기 레이저 드릴링 위치에서 떨어져 위치하는 상기 제2 변형 발광층 및 상기 제3 변형 발광층의 상기 홈이 위치하는 모서리는 모두 다를 수 있다."}
{"patent_id": "10-2023-0077375", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "실시예들에 따르면, 인접하는 단위 화소에 걸쳐 레이저 드릴링과 같이 캐소드에 전원을 인가하는 구조를 형성할 수 있으며, 이로 인하여 감소되는 면적에도 불구하고 동일한 색의 발광 소자의 면적이 동일하고 수명도 동일하 도록 하기 위하여 적어도 하나의 발광 소자의 평면 모양을 변경할 수 있다. 실시예들에 따르면, 인접하는 두 개의 단위 화소에서 동일한 색의 발광 영역 또는 발광 소자가 인접하게 배치되 지 않도록 하여 사용자에 의하여 해상도가 낮게 보이지 않도록 하여 고 해상도의 발광 표시 장치를 제공할 수 있다."}
{"patent_id": "10-2023-0077375", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부한 도면을 참고로 하여 본 발명의 여러 실시예들에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예들에 한정되지 않는다. 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 동일 또는 유사한 구성요소에 대해서는 동일한 참조 부호를 붙이도록 한다. 또한, 도면에서 나타난 각 구성의 크기 및 두께는 설명의 편의를 위해 임의로 나타내었으므로, 본 발명이 반드 시 도시된 바에 한정되지 않는다. 도면에서 여러 층 및 영역을 명확하게 표현하기 위하여 두께를 확대하여 나타 내었다. 그리고 도면에서, 설명의 편의를 위해, 일부 층 및 영역의 두께를 과장되게 나타내었다. 또한, 층, 막, 영역, 판, 구성 요소 등의 부분이 다른 부분 \"위에\" 또는 \"상에\" 있다고 할 때, 이는 다른 부분 \"바로 위에\" 있는 경우뿐 아니라 그 중간에 또 다른 부분이 있는 경우도 포함한다. 반대로 어떤 부분이 다른 부 분 \"바로 위에\" 있다고 할 때에는 중간에 다른 부분이 없는 것을 뜻한다. 또한, 기준이 되는 부분 \"위에\" 또는 \"상에\" 있다고 하는 것은 기준이 되는 부분의 위 또는 아래에 위치하는 것이고, 반드시 중력 반대 방향 쪽으로 \"위에\" 또는 \"상에\" 위치하는 것을 의미하는 것은 아니다. 또한, 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\" 한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 또한, 명세서 전체에서, \"평면상\"이라 할 때, 이는 대상 부분을 위에서 보았을 때를 의미하며, \"단면상\"이라 할 때, 이는 대상 부분을 수직으로 자른 단면을 옆에서 보았을 때를 의미한다. 또한, 명세서 전체에서, \"연결된다\"라고 할 때, 이는 둘 이상의 구성요소가 직접적으로 연결되는 경우만을 의미 하는 것이 아니고, 둘 이상의 구성요소가 다른 구성요소를 통하여 간접적으로 연결되는 경우, 물리적으로 연결 되는 경우나 전기적으로 연결되는 경우, 뿐만 아니라, 위치나 기능에 따라 상이한 명칭들로 지칭되었으나 실질 적으로 일체인 각 부분이 서로 연결되는 것을 포함할 수 있다.또한, 명세서 전체에서, 배선, 층, 막, 영역, 판, 구성 요소 등의 부분이 \"제1 방향 또는 제2 방향으로 연장된 다\"라고 할 때, 이는 해당 방향으로 곧게 뻗은 직선 형상만을 의미하는 것이 아니고, 제1 방향 또는 제2 방향을 따라 전반적으로 연장되는 구조로, 일 부분에서 꺾이거나, 지그재그 구조를 가지거나, 곡선 구조를 포함하면서 연장되는 구조도 포함한다. 또한, 명세서에서 설명된 표시 장치, 표시 패널 등이 포함된 전자 기기(예를 들면, 휴대폰, TV, 모니터, 노트북 컴퓨터, 등)나 명세서에서 설명된 제조 방법에 의하여 제조된 표시 장치, 표시 패널 등이 포함된 전자 기기도 본 명세서의 권리 범위에서 배제되지 않는다. 먼저, 도 1을 통하여 발광 표시 장치에 포함되는 4개의 단위 화소의 평면 구조를 살펴본다. 도 1은 일 실시예에 의한 발광 표시 장치에서 발광 소자 및 레이저 드릴링 위치를 도시한 평면도이다. 도 1에서는 점선으로 단위 화소(PXU11, PXU12, PXU21, PXU22)의 평면 위치를 개략적으로 도시하고 있다. 도 1에 서 도시되어 있는 4개의 단위 화소(PXU11, PXU12, PXU21, PXU22)는 하나의 단위 화소 그룹을 구성할 수 있다. 각 단위 화소(PXU11, PXU12, PXU21, PXU22)에는 도 24에서 후술하는 바와 같이 3개의 화소 구동부(도 24의 PCa, PCb, PCc 참고)를 포함할 수 있으며, 기판 위에 3개의 화소 구동부(PCa, PCb, PCc)가 형성되고, 그 위에 도 1에서 도시하고 있는 바와 같이 4개의 발광 소자가 위치할 수 있다. 각 발광 소자는 애노드, 발광층 및 캐소드를 포함할 수 있으며, 도 1에서는 애노드 및 캐소드는 생략하였으며, 각 발광층(EML11a1, EML12a1, EML21a1, EML22a1, EML11a2, EML12a2, EML21a2, EML22a2, EML11b, EML12b, EML21b, EML22b, EML11c, EML12c, EML21c, EML22c)의 평면 모양이 도시도어 있다. 도 1에서 도시된 각 발광층 (EML11a1, EML12a1, EML21a1, EML22a1, EML11a2, EML12a2, EML21a2, EML22a2, EML11b, EML12b, EML21b, EML22b, EML11c, EML12c, EML21c, EML22c)의 평면 모양은 발광 영역을 구성할 수 있으며, 발광 소자의 평면 모 양 또는 화소 정의막(도 10의 380 참고)의 오프닝(도 10의 OP 참고)의 모양에 대응할 수 있다. 구체적으로, 화 소 정의막의 오프닝(OP)은 애노드의 적어도 일부는 노출시키고, 화소 정의막의 오프닝(OP)의 내에는 각 발광층(EML11a1, EML12a1, EML21a1, EML22a1, EML11a2, EML12a2, EML21a2, EML22a2, EML11b, EML12b, EML21b, EML22b, EML11c, EML12c, EML21c, EML22c)이 위치할 수 있다. 그 결과, 발광층(EML11a1, EML12a1, EML21a1, EML22a1, EML11a2, EML12a2, EML21a2, EML22a2, EML11b, EML12b, EML21b, EML22b, EML11c, EML12c, EML21c, EML22c)은 화소 정의막의 오프닝(OP)의 내에 구획되어, 발광층(EML11a1, EML12a1, EML21a1, EML22a1, EML11a2, EML12a2, EML21a2, EML22a2, EML11b, EML12b, EML21b, EML22b, EML11c, EML12c, EML21c, EML22c)은 화소 정의막의 오프닝(OP)의 평면 모양과 동일한 평면 모양을 가질 수 있다. 여기서, 각 발광층 (EML11a1, EML12a1, EML21a1, EML22a1, EML11a2, EML12a2, EML21a2, EML22a2, EML11b, EML12b, EML21b, EML22b, EML11c, EML12c, EML21c, EML22c)은 화소 정의막의 오프닝(OP) 내에 잉크젯 방식으로 형성될 수 있으며, 실시예에 따라서는 양자점(quantum dot) 물질 중 적어도 어느 하나를 포함할 수 있다. 화소 정의막 및 각 발광층(EML11a1, EML12a1, EML21a1, EML22a1, EML11a2, EML12a2, EML21a2, EML22a2, EML11b, EML12b, EML21b, EML22b, EML11c, EML12c, EML21c, EML22c)은 도 10을 참고하면, 일체로 형성된 캐소드(도 10 의 Cathode 참고)로 덮여 있을 수 있다. 각 발광층(EML11a1, EML12a1, EML21a1, EML22a1, EML11a2, EML12a2, EML21a2, EML22a2, EML11b, EML12b, EML21b, EML22b, EML11c, EML12c, EML21c, EML22c)은 서로 다른 색을 방출할 수 있는 제1 발광층(EML11a1, EML12a1, EML21a1, EML22a1, EML11a2, EML12a2, EML21a2, EML22a2), 제2 발광층(EML11b, EML12b, EML21b, EML22b), 및 제3 발광층(EML11c, EML12c, EML21c, EML22c)으로 구분될 수 있으며, 제1 발광층(EML11a1, EML12a1, EML21a1, EML22a1, EML11a2, EML12a2, EML21a2, EML22a2)은 동일한 색을 방출할 수 있는 제1-1 발광 층(EML11a1, EML12a1, EML21a1, EML22a1)과 제1-2 발광층(EML11a2, EML12a2, EML21a2, EML22a2)으로 구분될 수 있다. 여기서, 제1 발광층은 적색의 빛을 방출할 수 있으며, 제2 발광층은 녹색의 빛을 방출하고, 제3 발광층은 청색의 빛을 방출할 수 있다. 하지만, 실시예에 따라서는 두 개의 발광층(제1-1 발광층 및 제1-2 발광층)으로 나뉘어 있는 제1 발광층이 청색 또는 녹색의 빛을 방출할 수 있으며, 나머지 두 개의 빛이 각각 제2 발광층과 제3 발광층에 대응할 수 있다. 또한, 실시예에 따라서는 적색, 녹색, 청색의 빛이 아닌 다른 빛의 삼원색의 빛 을 방출할 수도 있다. 각 단위 화소(PXU11, PXU12, PXU21, PXU22)의 내에서 제2 발광층(EML11b, EML12b, EML21b, EML22b)과 제3 발광 층(EML11c, EML12c, EML21c, EML22c)은 제1 사선 방향으로 배치되어 있으며, 제1-1 발광층(EML11a1, EML12a1, EML21a1, EML22a1)과 제1-2 발광층(EML11a2, EML12a2, EML21a2, EML22a2)은 제1 사선 방향과 교차하는 제2 사선 방향으로 배치될 수 있다. 여기서, 제1 사선 방향은 제1 방향(DR1)의 역방향과 제2 방향(DR2)의 사이 방향으 로 제1 방향(DR1)의 역방향 또는 제2 방향(DR2)과 45도의 각도를 가질 수 있다. 한편, 제2 사선 방향은 제1 방 향(DR1)과 제2 방향(DR2)의 사이 방향으로 제1 방향(DR1) 또는 제2 방향(DR2)과 45도의 각도를 가질 수 있다. 3개의 화소 구동부(PCa, PCb, PCc)는 각각 제1 발광층(EML11a1, EML12a1, EML21a1, EML22a1, EML11a2, EML12a2, EML21a2, EML22a2)을 포함하는 제1 발광 소자, 제2 발광층(EML11b, EML12b, EML21b, EML22b)을 포함 하는 제2 발광 소자, 및 제3 발광층(EML11c, EML12c, EML21c, EML22c)을 포함하는 제3 발광 소자와 전기적으로 연결되어 있다. 한편, 제1 발광 소자와 연결되어 있는 화소 구동부는 제1-1 발광층(EML11a1, EML12a1, EML21a1, EML22a1)을 포함하는 제1-1 발광 소자 및 제1-2 발광층(EML11a2, EML12a2, EML21a2, EML22a2)을 포함하는 제1- 2 발광 소자 모두와 전기적으로 연결되어 있으며, 이 때 제1-1 발광 소자와 제1-2 발광 소자는 병렬로 연결될 수 있다. 하지만, 실시예에 따라서는 직렬로 연결될 수도 있다. 도 1을 참고하면, 레이저 드릴링이 수행되는 위치(LDP; 이하 레이저 드릴링의 위치라고도 함)도 도시되어 있다. 도 1에서 레이저 드릴링의 위치(LDP)는 하나의 단위 화소 그룹 내에서 각 단위 화소(PXU11, PXU12, PXU21, PXU22) 모두 만나는 모서리를 중심으로 형성되며, 모든 단위 화소(PXU11, PXU12, PXU21, PXU22)에 걸쳐 형성된 다. 또한, 도 1의 실시예에서 레이저 드릴링의 위치(LDP)의 중심은 4개의 단위 화소(PXU11, PXU12, PXU21, PXU22)의 경계와 일치하지 않으며, 도 1의 실시예에서는 단위 화소(PXU22)의 내에 레이저 드릴링의 위치(LDP)의 중심이 위치한다. 이는 레이저 드릴링의 위치(LDP)가 인접하는 4개의 발광층(EML11c, EML12a2, EML21a1, EML22b) 중 크기가 가장 큰 발광층(EML11c)으로부터 멀리 위치시켰기 때문일 수 있다. 레이저 드릴링의 위치(LDP)의 하부에는 캐소드로 제공될 전압이 인가되는 연결 부재(도 24의 CE 참고)가 위치할 수 있다. 레이저 드릴링은 연결 부재(CE)와 전체적으로 형성되어 있는 캐소드(Cathode)를 레이저를 조사하여 둘 사이에 위치하는 절연층을 녹이면서 전기적으로 연결한다. 이 때, 레이저에 의하여 녹는 부분의 면적이 넓고 자칫 발광 층 및/또는 애노드, 그리고 다른 도전체 등에 레이저가 조사되는 경우 쇼트가 발생하면서 화소가 오동작하는 문 제가 발생할 수 있다. 그러므로 일정 면적을 레이저 드릴링을 위하여 할당할 필요가 있다. 도 1의 실시예에서는 레이저 드릴링의 위치(LDP)에 인접하게 위치하는 두 발광층(EML11c, EML22b)이 옴폭한 홈을 가지는 구조로 형성 되어 레이저 드릴링의 위치(LDP)와의 간격을 유지하도록 형성되어 있다. 도 1의 발광층(EML11a1, EML12a1, EML21a1, EML22a1, EML11a2, EML12a2, EML21a2, EML22a2, EML11b, EML12b, EML21b, EML22b, EML11c, EML12c, EML21c, EML22c)은 크게 오목하게 들어간 홈을 포함하지 않는 노멀 발광층 (EML11a1, EML12a1, EML21a1, EML22a1, EML11a2, EML12a2, EML21a2, EML22a2, EML11b, EML12b, EML21b, EML12c, EML21c, EML22c)과 홈을 포함하는 변형 발광층(EML11c, EML22b)으로 구분될 수 있다. 여기서, 노멀 발 광층은 레이저 드릴링의 위치(LDP)에서 멀리 위치할 수 있으며, 변형 발광층은 레이저 드릴링의 위치(LDP)에서 인접하여 위치한다. 홈을 포함하지 않는 제1 발광층(이하 제1 노멀 발광층이라고도 함; EML11a1, EML12a1, EML21a1, EML22a1, EML11a2, EML12a2, EML21a2, EML22a2)은 직사각형 모양의 평면 모양을 가지며, 모서리 부분이 모따기 되거나 둥근 모서리를 가지는 구조를 가질 수 있다. 제1 노멀 발광층(EML11a1, EML12a1, EML21a1, EML22a1, EML11a2, EML12a2, EML21a2, EML22a2) 중 일부(제1-1 노멀 발광층(EML11a1, EML12a1, EML21a1, EML22a1))는 제1 방향 (DR1)으로 길게 배치되고, 나머지 일부(제1-2 노멀 발광층(EML11a2, EML12a2, EML21a2, EML22a2))는 제2 방향 (DR2)으로 길게 배치될 수 있다. 한편, 홈을 포함하지 않는 제2 발광층(이하 제2 노멀 발광층이라고도 함; EML11b, EML12b, EML21b)은 정사각형 모양의 평면 모양을 가지며, 모서리 부분이 모따기 된 구조를 가질 수 있으며, 실시예에 따라서는 모서리가 둥 근 모서리일 수도 있다. 이하에서는 모따기된 실시예를 중심으로 살펴본다. 또한, 홈을 포함하지 않는 제3 발광층(이하 제3 노멀 발광층이라고도 함; EML12c, EML21c, EML22c)은 정사각형 모양의 평면 모양을 가지며, 모서리 부분이 모따기 된 구조를 가질 수 있으며, 실시예에 따라서는 모서리가 둥 근 모서리일 수도 있다. 이하에서는 모따기된 실시예를 중심으로 살펴본다. 도 1의 실시예에서는 제2 노멀 발광층(EML11b, EML12b, EML21b)은 제3 노멀 발광층(EML12c, EML21c, EML22c)보 다 상대적으로 작은 면적으로 형성되어 있다. 하지만, 실시예에 따라서는 면적이 서로 동일하거나 제2 노멀 발 광층(EML11b, EML12b, EML21b)이 더 큰 면적을 가질 수도 있다.실시예에 따라 제1 노멀 발광층(EML11a1, EML12a1, EML21a1, EML22a1, EML11a2, EML12a2, EML21a2, EML22a2), 제2 노멀 발광층(EML11b, EML12b, EML21b) 및 제3 노멀 발광층(EML12c, EML21c, EML22c)은 삼각형 등의 다각형 모양을 가지거나 원형 또는 타원형의 모양을 가질 수 있으며, 다각형의 경우 모서리가 모따기 되거나 둥근 모서 리를 가질 수도 있다. 한편, 홈을 포함하는 변형 발광층(EML11c, EML22b)은 레이저 드릴링의 위치(LDP)에서 인접하여 위치하며, 레이 저 드릴링의 위치(LDP)로부터 일정 간격을 가지도록 하기 위하여 오목하게 들어간 홈을 포함하고 있다. 변형 발광층(EML11c, EML22b)은 도 1에서 단위 화소(PXU11)에 위치하는 제3 변형 발광층(EML11c)과 단위 화소 (PXU22)에 위치하는 제2 변형 발광층(EML22b)은 실선으로 도시되어 있으며, 이와 중첩하는 점선도 도시되어 있 다. 여기서, 점선은 다른 부분에 위치하는 제3 노멀 발광층(EML12c, EML21c, EML22c)과 제2 노멀 발광층 (EML11b, EML12b, EML21b)의 크기를 나타내는 것으로, 구체적으로는 도 2 내지 도 5를 통하여 살펴본다. 도 2 내지 도 5는 도 1의 실시예에 따른 변형 발광층의 평면 모양을 설명하는 도면이다. 도 2 및 도 3은 단위 화소(PXU11)에 위치하는 제3 발광층(EML11c)에 대한 도면이고, 도 4 및 도 5는 단위 화소 (PXU22)에 위치하는 제2 발광층(EML22b)에 대한 도면이다. 먼저, 도 2 및 도 3을 통하여 단위 화소(PXU11)에 위치하는 제3 발광층(EML11c)의 평면 모양에 대하여 살펴본다. 도 2에서는 변형 발광층으로는 단위 화소(PXU11)에 위치하는 제3 변형 발광층(EML11c)이 도시되어 있으며, 제3 변형 발광층(EML11c)은 실선으로 도시되어 있다. 한편, 도 2에서는 노멀 발광층도 점선으로 도시되어 있으며, 노멀 발광층은 단위 화소(PXU12)에 위치하는 제3 노멀 발광층(EML12c)이 도시되어 있다. 도 2에서 점선과 실선 이 중첩하는 모서리 부분에서는 두 선이 중첩되면서 실선으로 도시되어 있다. 도 2에서 제3 변형 발광층 (EML11c)의 실선과 제3 노멀 발광층(EML12c)의 점선이 중첩하는 모서리 부분을 제외하고 서로 다른 부분에는 각 각 도면 부호를 부여하였다. 구체적으로, 제3 변형 발광층(EML11c)에는 변 부분(EML11c-1)과 홈 부분(EML11c- 2)에 도면 부호를 부여하였으며, 제3 노멀 발광층(EML12c)에는 변 부분(EML12c-1)과 제3 변형 발광층(EML11c)의 홈 부분(EML11c-2)에 대응하는 모서리 부분(EML12c-2)에 도면 부호를 부여하였다. 도 2에서 화살표가 도시되어 있으며, 화살표는 제3 노멀 발광층(EML12c)에서 변형이 발생되어 제3 변형 발광층 (EML11c)으로 변경되는 방향을 도시한 것이다. 즉, 제3 노멀 발광층(EML12c)의 변 부분(EML12c-1)에서 제3 변형 발광층(EML11c)의 변 부분(EML11c-1)으로 확장되며, 제3 노멀 발광층(EML12c)의 모서리 부분(EML12c-2)에서 제 3 변형 발광층(EML11c)의 홈 부분(EML11c-2)으로 축소되는 것을 나타내고 있다. 도 2에서 제3 노멀 발광층(EML12c)과 제3 변형 발광층(EML11c)의 면적 중 차이가 나는 부분 간의 관계가 도 3에 도시되어 있다. 도 3 중 좌측에는 제3 변형 발광층(EML11c)이 제3 노멀 발광층(EML12c)보다 넓게 형성되는 부분만을 도시한 것 이며, 도 3 중 우측에는 제3 노멀 발광층(EML12c)이 제3 변형 발광층(EML11c)보다 넓게 형성되는 부분만을 도시 한 것이다. 도 3 중 좌측에 위치하는 부분은 제3 변형 발광층(EML11c)의 변 부분(EML11c-1)과 제3 노멀 발광층(EML12c)의 변 부분(EML12c-1) 간의 면적으로, 상측에 위치하는 상측 면적(Aus), 하측에 위치하는 하측 면적(Abs), 좌측에 위치하는 좌측 면적(Als), 및 우측에 위치하는 우측 면적(Ars)으로 구분되어 도시되어 있다. 도 3 중 우측에 위치하는 부분은 제3 노멀 발광층(EML12c)의 모서리 부분(EML12c-2)과 제3 변형 발광층(EML11 c)의 홈 부분(EML11c-2) 간의 면적으로, 홈측 면적(Ald)으로 도시되어 있다. 도 3의 중앙에는 등호가 도시되어 있으며, 등호는 도 3 중 좌측에 도시된 면적의 총 합과 도 3 중 우측에 도시 된 면적이 서로 동일함을 나타내고 있다. 그러므로, 제3 변형 발광층(EML11c)과 제3 노멀 발광층(EML12c, EML21c, EML22c)은 모두 동일한 면적을 가지며, 발광층의 수명은 발광층의 평면 면적에 비례하므로, 모든 제3 발광층(EML11c, EML12c, EML21c, EML22c)은 동일한 수명을 가질 수 있다. 제3 발광층(EML11c, EML12c, EML21c, EML22c)의 면적은 면적은 발광층을 구성하는 물질에 따라서 다양하게 형성될 수 있다. 한편, 실제 제조 공정에 서 발생할 수 있는 산포 또는 오차로 인하여 양측의 면적 차이가 발생할 수 있다. 여기서, 산포 또는 오차로 인 하여 발광층의 가장자리의 위치가 1 ㎛ 이내에서 변동될 수 있으며, 산포 또는 오차에 의하여 노멀 발광층과 변 형 발광층 간에 발생할 수 있는 면적 차이는 최대 10% 이내의 면적 차이를 가질 수 있다. 이러한 면적 차이로인하여 발광층의 수명 차이가 발생할 수 있지만, 이 정도의 수명 차이는 무시할 수 있는 정도일 수 있다. 한편, 이하에서는 도 4 및 도 5를 통하여 단위 화소(PXU22)에 위치하는 제2 발광층(EML22b)의 평면 모양에 대하 여 살펴본다. 도 4에서는 변형 발광층으로는 단위 화소(PXU22)에 위치하는 제2 변형 발광층(EML22b)이 도시되어 있으며, 제2 변형 발광층(EML22b)은 실선으로 도시되어 있다. 한편, 도 4에서는 노멀 발광층도 점선으로 도시되어 있으며, 노멀 발광층은 단위 화소(PXU21)에 위치하는 제2 노멀 발광층(EML21b)이 도시되어 있다. 도 4에서 점선과 실선 이 중첩하는 모서리 부분에서는 두 선이 중첩되면서 실선으로 도시되어 있다. 도 4에서 제2 변형 발광층 (EML22b)의 실선과 제2 노멀 발광층(EML21b)의 점선이 중첩하는 모서리 부분을 제외하고 서로 다른 부분에는 각 각 도면 부호를 부여하였다. 구체적으로, 제2 변형 발광층(EML22b)에는 변 부분(EML22b-1)과 홈 부분(EML22b- 2)에 도면 부호를 부여하였으며, 제2 노멀 발광층(EML21b)에는 변 부분(EML21b-1)과 제2 변형 발광층(EML22b)의 홈 부분(EML22b-2)에 대응하는 모서리 부분(EML21b-2)에 도면 부호를 부여하였다. 도 4에서 화살표가 도시되어 있으며, 화살표는 제2 노멀 발광층(EML21b)에서 변형이 발생되어 제2 변형 발광층 (EML22b)으로 변경되는 방향을 도시한 것이다. 즉, 제2 노멀 발광층(EML21b)의 변 부분(EML21b-1)에서 제2 변형 발광층(EML22b)의 변 부분(EML22b-1)으로 확장되며, 제2 노멀 발광층(EML21b)의 모서리 부분(EML21b-2)에서 제 2 변형 발광층(EML22b)의 홈 부분(EML22b-2)으로 축소되는 것을 나타내고 있다. 도 4에서 제2 노멀 발광층(EML21b)과 제2 변형 발광층(EML22b)의 면적 중 차이가 나는 부분 간의 관계가 도 5에 도시되어 있다. 도 5 중 우측에는 제2 변형 발광층(EML22b)이 제2 노멀 발광층(EML21b)보다 넓게 형성되는 부분만을 도시한 것 이며, 도 5 중 좌측에는 제2 노멀 발광층(EML21b)이 제2 변형 발광층(EML22b)보다 넓게 형성되는 부분만을 도시 한 것이다. 도 5 중 우측에 위치하는 부분은 제2 변형 발광층(EML22b)의 변 부분(EML22b-1)과 제2 노멀 발광층(EML21b)의 변 부분(EML21b-1) 간의 면적으로, 상측에 위치하는 상측 면적(Aus), 하측에 위치하는 하측 면적(Abs), 좌측에 위치하는 좌측 면적(Als), 및 우측에 위치하는 우측 면적(Ars)으로 구분되어 도시되어 있다. 도 5 중 좌측에 위치하는 부분은 제2 노멀 발광층(EML21b)의 모서리 부분(EML21b-2)과 제2 변형 발광층(EML22 b)의 홈 부분(EML22b-2) 간의 면적으로, 홈측 면적(Ald)으로 도시되어 있다. 도 5의 중앙에는 등호가 도시되어 있으며, 등호는 도 5 중 좌측에 도시된 면적과 도 5 중 우측에 도시된 면적의 총 합이 서로 동일함을 나타내고 있다. 그러므로, 제2 변형 발광층(EML22b)과 제2 노멀 발광층(EML11b, EML12b, EML21b)은 모두 동일한 면적을 가지며, 발광층의 수명은 발광층의 평면 면적에 비례하므로, 모든 제2 발광층 (EML11b, EML12b, EML21b, EML22b)은 동일한 수명을 가질 수 있다. 제3 발광층(EML11b, EML12b, EML21b, EML22b)의 면적은 면적은 발광층을 구성하는 물질에 따라서 다양하게 형성될 수 있다. 한편, 실제 제조 공정에 서 발생할 수 있는 산포 또는 오차로 인하여 양측의 면적 차이가 발생할 수 있다. 여기서, 산포 또는 오차로 인 하여 발광층의 가장자리의 위치가 1 ㎛ 이내에서 변동될 수 있으며, 산포 또는 오차에 의하여 노멀 발광층과 변 형 발광층 간에 발생할 수 있는 면적 차이는 최대 10% 이내의 면적 차이를 가질 수 있다. 이러한 면적 차이로 인하여 발광층의 수명 차이가 발생할 수 있지만, 이 정도의 수명 차이는 무시할 수 있는 정도일 수 있다. 도 3에서 도시되어 있는 제3 노멀 발광층(EML12c)의 모서리 부분(EML12c-2)과 제3 변형 발광층(EML11c)의 홈 부 분(EML11c-2) 간의 면적인 홈측 면적(Ald)과 도 5에서 도시되어 있는 제2 노멀 발광층(EML21b)의 모서리 부분 (EML21b-2)과 제2 변형 발광층(EML22b)의 홈 부분(EML22b-2) 간의 면적인 홈측 면적(Ald)은 서로 다른 면적을 가질 수 있다. 하지만, 실시예에 따라서는 도 3과 도 5의 홈측 면적(Ald)이 서로 동일하게 설정될 수도 있다. 도 2 내지 도 5에서 도시된 바와 같이, 제3 변형 발광층(EML11c)의 홈 부분(EML11c-2)과 제2 변형 발광층 (EML22b)의 홈 부분(EML22b-2)으로 인하여 레이저 드릴링의 위치(LDP)와 두 변형 발광층(EML11c, EML22b)간에 일정 수준 이상의 간격을 유지할 수 있어, 레이저 드릴링을 수행하더라도 발광층, 애노드, 및/또는 발광 영역에 손상이 발생되지 않아 레이저 드릴링시 발광 소자가 손상되지 않는다. 또한, 레이저 드릴링의 위치(LDP)가 일정 면적을 필요로 할 때, 도 1의 실시예에서와 같이 인접하는 복수의 단 위 화소(PXU11, PXU12, PXU21, PXU22)에 걸쳐 형성되도록 하면 되므로, 고해상도나 인치당 화소수가 높은 발광 표시 장치에서도 레이저 드릴링이 가능하도록 형성할 수 있다. 이상과 같은 변형 발광층으로 인하여 인접하는 발광층 간의 간격이 변경될 수 있으므로, 도 6 및 도 7을 통하여 발광층 간의 수평 간격을 보다 구체적으로 살펴본다. 도 6은 비교예에서 발광층 간의 간격을 설명하는 도면이고, 도 7은 도 1의 실시예에서 발광층 간의 간격을 설명 하는 도면이다. 도 6의 비교예는 도 1의 실시예에서 레이저 드릴링이 형성되지 않은 예로 복수의 단위 화소(PXU11, PXU12, PXU21, PXU22) 내에는 레이저 드릴링의 위치(LDP)가 포함되어 있지 않다. 그 결과 각 발광층(EML11a1, EML12a1, EML21a1, EML22a1, EML11a2, EML12a2, EML21a2, EML22a2, EML11b, EML12b, EML21b, EML22b, EML11c, EML12c, EML21c, EML22c)간의 간격이 Gap1로 모두 동일함을 확인할 수 있다. 하지만, 도 6의 비교예에서 레이저 드릴링의 위치(LDP)가 포함되는 도 1의 실시예로 변경되면서 각 발광층 (EML11a1, EML12a1, EML21a1, EML22a1, EML11a2, EML12a2, EML21a2, EML22a2, EML11b, EML12b, EML21b, EML22b, EML11c, EML12c, EML21c, EML22c)간의 간격이 변경되며, 이는 도 7에서 Gap1, Gap2, Gap3로 도시되어 있다. 도 7을 참고하면, 제1 노멀 발광층(EML11a1, EML12a1, EML21a1, EML22a1, EML11a2, EML12a2, EML21a2, EML22a2), 제2 노멀 발광층(EML11b, EML12b, EML21b) 및 제3 노멀 발광층(EML12c, EML21c, EML22c)간의 간격은 도 6에서와 같이 Gap1을 가질 수 있다. 하지만, 변형 발광층(EML11c, EML22b)과 노멀 발광층 간의 간격은 Gap1 과 다른 간격을 가질 수 있다. 구체적으로, 제3 변형 발광층(EML11c)은 인접하는 노멀 발광층(EML11a1, EML11a2, EML12a2, EML21a1)과의 간격 으로 Gap2를 가지며, 제2 변형 발광층(EML22b)은 인접하는 노멀 발광층(EML12a2, EML21a1, EML22a1, EML22a2) 과의 간격으로 Gap3를 가질 수 있다. 도 7을 참고하면, 제3 변형 발광층(EML11c)의 평면 면적이 제2 변형 발광 층(EML22b)의 평면 면적보다 크다. 더 큰 면적을 가지는 제3 변형 발광층(EML11c)이 인접하는 노멀 발광층 (EML11a1, EML11a2, EML12a2, EML21a1)과의 간격인 Gap2가 더 작은 면적을 가지는 제2 변형 발광층(EML22b)이 인접하는 노멀 발광층(EML12a2, EML21a1, EML22a1, EML22a2)과의 간격인 Gap3보다 큰 값을 가질 수 있다. 여기 서, Gap1은 Gap2 및 Gap3에 비하여 큰 값을 가질 수 있으며, Gap1을 100이라고 했을 때, Gap2는 약 95일 수 있 으며, 실시예에 따라 Gap2는 92 이상 98 이하 일 수 있고, Gap3는 약 93일 수 있으며, 실시예에 따라 Gap3는 90 이상 96 이하일 수 있다. 하지만, 실시예에 따라서는 Gap3가 Gap2보다 더 큰 값을 가질 수 있다. 한편, 도 7에서 레이저 드릴링의 위치(LDP)의 양측에 위치하는 제3 변형 발광층(EML11c)의 홈 부분(도 2의 EML11c-2)과 제2 변형 발광층(EML22b)의 홈 부분(도 4의 EML22b-2)간의 간격(이하 변형 발광층 간의 간격이라고 도 함)은 Gap1의 두 배에 준하는 간격을 가질 수 있으며, Gap1을 100이라고 했을 때, 180이상 200이하의 값을 가질 수 있다. 여기서, 변형 발광층 간의 간격은 레이저 드릴링의 위치(LDP)의 중심을 지날 수 있다. 한편, 변 형 발광층 간의 간격 중 레이저 드릴링의 위치(LDP)에 해당하는 길이, 즉, 레이저 드릴링의 위치(LDP)의 지름의 길이는 Gap1에 준하는 간격을 가질 수 있으며, 레이저 드릴링의 위치(LDP)와 일 변형 발광층 간의 간격은 Gap1 의 절반에 준하는 간격을 가질 수 있다. Gap1을 100이라고 했을 때, 레이저 드릴링의 위치(LDP)의 지름의 길이 는 90이상 100이하의 값을 가질 수 있으며, 레이저 드릴링의 위치(LDP)와 변형 발광층 간의 간격은 50 이상 55 이하의 값을 가질 수 있다. 한편, 레이저 드릴링의 위치(LDP)가 차지하는 면적은 레이저 기술의 발전에 따라서 는 90 이하의 값을 가질 수도 있으며, 이 때, 변형 발광층 간의 간격 등의 값도 감소되거나 변동될 수 있다. 도 1 및 도 7의 실시예에서는 레이저 드릴링을 통하여 캐소드에 전원을 인가하는 실시예가 도시되어 있지만, 캐 소드에 전압을 인가할 수 있는 방식은 이에 한정되지 않을 수 있다. 즉, 오프닝을 통하여 캐소드로 제공될 전압 이 인가되는 연결 부재(도 24의 CE 참고)가 노출되도록 한 후, 캐소드를 형성하여 캐소드에 전압이 인가되도록 형성할 수도 있으며, 이에 대해서는 도 19를 통하여 살펴본다. 이 때, 캐소드로 제공될 전압이 인가되는 연결 부재(도 24의 CE 참고)가 노출되는 오프닝은 레이저 드릴링의 위치(LDP)가 가지는 면적보다 작을 수 있으며, 오 프닝이 가지는 지름의 길이는 Gap1 보다 작은 값을 가질 수 있으며, Gap1을 100이라고 했을 때, 30이상 100미만 의 값을 가질 수 있다. 이하에서는 도 8 및 도 9를 통하여 비교예와 실시예의 특징을 수치적으로 살펴본다. 도 8 및 도 9는 각 비교예와 실시예에 대한 특징을 보여주는 표이다. 먼저, 도 8과 도 9에서는 서로 다른 ppi(pixel per inch) 값을 가지는 발광 표시 장치를 기초로 측정한 값이며, 도 8에서는 도 1 및 도 7과 동일한 발광 표시 장치이고, 도 9에서는 도 1 및 도 7과 다른 발광 표시 장치이다. 여기서, 도 8은 218ppi의 발광 표시 장치이고, 도 9는 254ppi의 발광 표시 장치일 수 있다.먼저, 도 8을 통하여 비교예 1 및 실시예 1을 비교하여 살펴본다. 비교예 1은 도 6에서 도시되어 있으며, 실시 예 1은 도 1 및 도 7과 같을 수 있다. 또한, 도 8 및 도 9에서 R은 적색에 대응하는 발광층으로 도 1, 도 6, 및 도 7의 제1 발광층에 대응하고, G는 녹색에 대응하는 발광층으로 도 1, 도 6, 및 도 7의 제2 발광층에 대응하고, B는 청색에 대응하는 발광층으로 도 1, 도 6, 및 도 7의 제3 발광층에 대응할 수 있다. 도 8을 참고하면, 비교예 1에서는 레이저 드릴링(Laser Drilling)을 수행하지 않으며, 실시예 1에서는 레이저 드릴링(Laser Drilling)이 수행되었음도 나타내고 있다. 도 8에서는 비교예 1에서의 각 색의 개구율과 실시예 1에서의 각 색의 개구율은 동일함을 나타내고 있으며, 이 때, 화소 정의막(도 10의 380 참고)의 간격(380 GAP), 즉, 발광층 간의 간격이 표시되어 있다. Gap1은 도 6의 노멀 발광층 간의 간격이며, 실시예 1에서도 노멀 발광층 간의 간격(Normal부)과 동일할 수 있다. 하지만, 실시예 1에서 레이저 드릴링이 수행된 부분(L/D부)에서는 Gap2 또는 Gap3의 값을 가질 수 있으며, Gap2 및 Gap3의 위치는 도 7과 같을 수 있다. 여기서, Gap1은 약 25㎛ 일 수 있으며, Gap2는 약 24㎛이 고, Gap3는 약 23.5㎛일 수 있다. 한편, 도 9를 통하여 비교예 2 및 실시예 2를 살펴보면 다음과 같다. 비교예 2는 도 6과 유사하지만 ppi값이 달라 실제 Gap1의 크기가 비교예 1과 다를 수 있으며, 실시예 2는 도 7 과 유사하지만 ppi값이 달라 실제 Gap1, Gap2, Gap3의 크기가 다를 수 있다. 도 9를 참고하면, 비교예 2에서는 레이저 드릴링(Laser Drilling)을 수행하지 않으며, 실시예 2에서는 레이저 드릴링(Laser Drilling)이 수행되었음이 나타나 있으며, 추가적으로 비교예 2에서의 각 색의 개구율과 실시예 2 에서의 각 색의 개구율이 완전히 동일하지는 않지만 거의 동일하게 형성되어 있음을 확인할 수 있다. 한편, 비교예 2와 실시예 2에서의 화소 정의막(도 10의 380 참고)의 간격(380 GAP), 즉, 발광층 간의 간격은 아 래와 같을 수 있다. Gap1'은 비교예 2에서의 노멀 발광층 간의 간격이며, 실시예 2에서도 노멀 발광층 간의 간격(Normal부)과 동일 할 수 있다. 하지만, 실시예 2에서 레이저 드릴링이 수행된 부분(L/D부)에서는 Gap2' 또는 Gap3'의 값을 가질 수 있다. Gap2' 및 Gap3'의 위치는 각각 도 7에서 Gap2 및 Gap3의 위치와 같을 수 있다. 여기서, Gap1'은 약 21.5㎛ 일 수 있으며, Gap2'는 약 20㎛이고, Gap3'는 약 19.8㎛일 수 있다. 도 8 및 도 9를 참고하면, 노멀 발광층 간의 간격(Gap1, Gap1')은 변형 발광층과의 간격(Gap2, Gap3, Gap2', Gap3')에 비하여 큰 값을 가질 수 있으며, 노멀 발광층 간의 간격(Gap1, Gap1')을 100이라고 했을 때, 변형 발 광층과의 간격(Gap2, Gap3, Gap2', Gap3')은 90 이상 98 이하의 값을 가질 수 있다. 이상과 같은 간격은 실시예 에 따라서 변경될 수도 있다. 이하에서는 도 10을 통하여 일 실시예에 따른 발광 표시 장치의 단면 구조를 개략적으로 살펴본다. 도 10은 일 실시예에 의한 발광 표시 장치의 단면도이다. 도 10의 단면도상 캐소드(Cathode), 화소 정의막, 기능층(FL)과 발광층(EML)을 포함하는 중간층, 애노드 (Anode)에 대응하는 층을 발광 소자층이라고도 하며, 발광 소자층의 하부, 즉, 애노드(Anode)의 하부에 위치하 는 평탄화막 및 그 이하에 위치하는, 트랜지스터, 커패시터를 구성하는 도전층, 반도체층, 및 절연층에 대 해서는 구동 소자층이라고도 할 수 있다. 발광 소자층에는 발광 소자가 위치할 수 있다. 도 10에서는 하나의 발광 소자를 도시하고 있으며, 화소 정의막에 위치하여 애노드(Anode)의 일 부분을 노 출시키는 오프닝(OP)과 함께, 화소 구동부(도 24의 PCa, PCb, PCc 참고)의 일 트랜지스터로부터 애노드(Anode) 로 전류가 전달되는 오프닝(OP2)도 도시되어 있다. 또한, 도 10에서는 레이저 드릴링이 수행되는 위치(LDP)도 개략적으로 도시되어 있다. 도 10에서는 애노드(Anode)의 하부의 구조, 즉 구동 소자층의 구조는 간략하게 도시하여 하나의 트랜지스터만 도시되어 있다. 기판에서부터 층간 절연막까지의 구동 소자층 구조를 간략하게 살펴보면 아래와 같다. 기판은 유리 등의 리지드(rigid)한 특성을 가져 휘지 않는 물질을 포함하거나 플라스틱이나 폴리 이미드 (Polyimid)와 같이 휠 수 있는 플렉서블한 물질을 포함할 수 있다. 플렉서블한 기판인 경우, 폴리 이미드(Polyimid)와 그 위에 무기 절연 물질로 형성되는 베리어층의 이층 구조가 반복 형성된 구조를 가질 수 있다. 기판 위에는 금속을 포함하는 하부 실딩층(BML)이 위치하며, 하부 실딩층(BML)은 화소에 포함되는 화소 구 동부(PCa, PCb, PCc)에 위치하는 트랜지스터 중 하나의 채널과 평면상 중첩할 수 있다. 실시예에 따라서 하부 실딩층(BML)과 동일한 층에 구동 저전압(ELVSS)가 인가되는 구동 저전압선(도 24의 174 참고)이 위치할 수 있다. 기판 및 하부 실딩층(BML)은 버퍼층에 의하여 덮여있다. 버퍼층은 반도체층(ACT)에 불순 원소의 침투를 차단하는 역할을 하며, 산화 규소(SiOx) 또는 질화규소(SiNx), 산질화규소(SiONx) 등을 포함하는 무기 절연막일 수 있다. 버퍼층의 위에는 실리콘 반도체(예를 들면 다결정 반도체(P-Si))나 산화물 반도체로 형성된 반도체층(AC T)이 위치한다. 반도체층(ACT)은 화소에 포함되는 화소 구동부(PCa, PCb, PCc)에 위치하는 반도체층으로, 구동 트랜지스터를 포함하는 트랜지스터의 채널과 그 양측에 위치하는 제1 영역 및 제2 영역을 포함할 수 있다. 여기 서 트랜지스터의 채널은 반도체층(ACT) 중 게이트 전극(GE)과 중첩하는 부분일 수 있으며, 제1 영역 및 제2 영 역은 게이트 전극(GE)과 중첩되지 않는 반도체층(ACT)의 부분일 수 있다. 즉, 반도체층(ACT)의 채널 양측에 위 치하는 제1 영역 및 제2 영역은 게이트 전극(GE)으로 가려지지 않아 플라즈마 처리 또는 도핑에 의하여 도전층 특성을 가져 트랜지스터의 제1 전극 및 제2 전극의 역할을 수행할 수 있다. 반도체층(ACT)의 위에는 제1 게이트 절연막이 위치할 수 있다. 제1 게이트 절연막은 산화 규소(SiOx) 또는 질화규소(SiNx), 산질화규소(SiONx) 등을 포함하는 무기 절연막일 수 있다. 제1 게이트 절연막 위에 화소 구동부(PCa, PCb, PCc)에 위치하는 트랜지스터의 게이트 전극(GE)을 포함하 는 제1 게이트 도전층이 위치할 수 있다. 제1 게이트 도전층에는 보조 구동 저전압선(174-1)이 위치하며, 또한, 화소 구동부(PCa, PCb, PCc)에 위치하는 트랜지스터의 게이트 전극(GE) 외에 스캔선이 형성될 수도 있다. 한편, 제1 게이트 도전층은 화소 구동부(PCa, PCb, PCc)에 위치하는 일 커패시터의 일 전극을 포함할 수 있다. 제1 게 이트 도전층은 알루미늄(Al), 구리(Cu), 몰리브덴(Mo), 티타늄(Ti), 등의 금속이나 금속 합금을 포함할 수 있으 며, 단일층 또는 다중층으로 구성될 수 있다. 제1 게이트 도전층을 형성한 후 플라즈마 처리 또는 도핑 공정을 수행하여 제1 반도체층의 노출된 영역을 도체 화시킬 수 있다. 즉, 게이트 전극(GE)에 의해 가려진 반도체층(ACT)은 도체화되지 않고, 게이트 전극(GE)에 의 해 덮여 있지 않은 반도체층(ACT)의 부분은 도전층과 동일한 특성을 가질 수 있다. 제1 게이트 도전층 및 제1 게이트 절연막 위에는 층간 절연막이 위치할 수 있다. 제1 층간 절연막 은 산화 규소(SiOx) 또는 질화규소(SiNx), 산질화규소(SiONx) 등을 포함하는 무기 절연막을 포함할 수 있 으며, 실시예에 따라서는 무기 절연 물질을 두껍게 형성할 수 있다. 또한, 실시예에 따라서는 층간 절연막(16 1)을 유기 절연막으로 형성할 수 있으며, 폴리 이미드, 폴리아마이드, 아크릴 수지, 벤조사이클로부텐 및 페놀 수지로 이루어진 군에서 선택되는 하나 이상의 물질을 포함할 수 있다. 층간 절연막의 위에는 애노드(Anode) 및 연결 부재(CE)를 포함하는 애노드층이 위치한다. 애노드(Anode)는 층간 절연막 및 제1 게이트 절연막에 위치하는 오프닝(OP2; 이하 애노드용 오프닝이라고도 함)을 통 하여 트랜지스터의 제2 전극의 역할을 하는 반도체층(ACT)의 제2 영역과 연결되어 있다. 그 결과 애노드(Anod e)는 트랜지스터의 출력을 전달받을 수 있다. 연결 부재(CE)는 애노드(Anode)와 동일한 물질로 형성되며, 층간 절연막에 위치하는 오프닝(OP1; 이하 레이저 드릴링용 오프닝이라고도 함)을 통하여 보조 구동 저전압선 (174-1)과 연결되어 있다. 그 결과 연결 부재(CE)는 구동 저전압(ELVSS)을 전달받는다. 애노드층은 투명 전도성 산화막 또는 금속 물질을 포함하는 단일층 또는 이들을 포함하는 다중층으로 구성될 수 있다. 투명 전도성 산화 막은 ITO(Indium Tin Oxide), 폴리(poly)-ITO, IZO(Indium Zinc Oxide), IGZO(Indium Gallium Zinc Oxide) 및 ITZO(Indium Tin Zinc Oxide) 등을 포함할 수 있다. 금속 물질은 은(Ag), 몰리브덴(Mo), 구리(Cu), 금(Au) 및 알루미늄(Al) 등을 포함할 수 있다. 애노드층의 위에는 오프닝(OP)을 포함하는 화소 정의막이 형성되어 있다. 화소 정의막의 오프닝(OP; 이하 발광 소자 오프닝이라고도 함)은 발광 영역 및/또는 발광층(EML)에 대응하 는 부분으로, 애노드(Anode)의 일 부분을 노출시키며, 테이퍼진 측벽을 가질 수 있다. 화소 정의막의 오프닝(OP)의 내에는 발광층(EML)이 위치하며, 실시예에 따라서는 도 10과 같이 발광층 (EML)이 화소 정의막의 위에도 위치할 수 있다. 발광층(EML)은 잉크젯 방식으로 형성될 수 있으며, 실시예에 따라서는 양자점(quantum dot) 물질 중 적어도 어느 하나를 포함할 수 있다. 발광층(EML)을 잉크젯 방식으로 형성할 때, 화소 정의막은 분사된 액이 구획될 수 있도록 하는 역할을 수행할 수 있으며, 이 때에는 발광 층(EML)이 화소 정의막의 오프닝(OP)의 내에만 위치할 수 있다. 발광층(EML)은 양자점(quantum dot) 물질을 포함할 수 있으며, 실시예에 따라서는 양자점(quantum dot) 물질을 포함하는 색 변환층이 캐소드(Cathode)보다 상부에 별도로 위치할 수도 있다. 본 명세서 중, 양자점은 반도체 화합물의 결정을 의미하며, 결정의 크기에 따라 또는 양자점 화합물내의 원소비 를 조절함에 따라 다양한 발광 파장의 광을 방출할 수 있는 임의의 물질을 포함할 수 있다. 양자점의 직경은, 예를 들어 약 1 nm 내지 10 nm일 수 있다. 양자점은 습식 화학 공정, 유기 금속 화학 증착 공정, 분자선 에피택시 공정 또는 이와 유사한 공정 등에 의해 합성될 수 있다. 습식 화학 공정은 유기 용매와 전구체 물질을 혼합한 후 양자점 입자 결정을 성장시키는 방법이다. 결정이 성 장할 때, 유기 용매가 자연스럽게 양자점 결정 표면에 배위된 분산제 역할을 하고, 결정의 성장을 조절하기 때 문에, 유기 금속 화학 증착(MOCVD, Metal Organic Chemical Vapor Deposition)이나 분자선 에피택시(MBE, Molecular Beam Epitaxy) 등의 기상 증착법보다 더 용이하고, 저비용의 공정을 통해, 양자점 입자의 성장을 제 어할 수 있다. 양자점은, III-VI족 반도체 화합물; II-VI족 반도체 화합물; III-V족 반도체 화합물; III-VI족 반도체 화합물; I-III-VI족 반도체 화합물; IV-VI족 반도체 화합물; IV족 원소 또는 화합물; 또는 이의 임의의 조합을 포함할 수 있다. II-VI족 반도체 화합물의 예는 CdS, CdSe, CdTe, ZnS, ZnSe, ZnTe, ZnO, HgS, HgSe, HgTe, MgSe, MgS 등과 같 은 이원소 화합물; CdSeS, CdSeTe, CdSTe, ZnSeS, ZnSeTe, ZnSTe, HgSeS, HgSeTe, HgSTe, CdZnS, CdZnSe, CdZnTe, CdHgS, CdHgSe, CdHgTe, HgZnS, HgZnSe, HgZnTe, MgZnSe, MgZnS 등과 같은 삼원소 화합물; CdZnSeS, CdZnSeTe, CdZnSTe, CdHgSeS, CdHgSeTe, CdHgSTe, HgZnSeS, HgZnSeTe, HgZnSTe 등과 같은 사원소 화합물; 또는 이의 임의의 조합을 포함할 수 있다. III-V족 반도체 화합물의 예는 GaN, GaP, GaAs, GaSb, AlN, AlP, AlAs, AlSb, InN, InP, InAs, InSb 등과 같은 이원소 화합물; GaNP, GaNAs, GaNSb, GaPAs, GaPSb, AlNP, AlNAs, AlNSb, AlPAs, AlPSb, InGaP, InNP, InAlP, InNAs, InNSb, InPAs, InPSb, GaAlNP 등과 같은 삼원소 화합물; GaAlNAs, GaAlNSb, GaAlPAs, GaAlPSb, GaInNP, GaInNAs, GaInNSb, GaInPAs, GaInPSb, InAlNP, InAlNAs, InAlNSb, InAlPAs, InAlPSb 등과 같은 사원 소 화합물; 또는 이의 임의의 조합을 포함할 수 있다. 한편, III-V족 반도체 화합물은 II족 원소를 더 포함할 수 있다. II족 원소를 더 포함한 III-V족 반도체 화합물의 예는, InZnP, InGaZnP, InAlZnP 등을 포함할 수 있 다. III-VI족 반도체 화합물의 예는, GaS, Ga2S3, GaSe, Ga2Se3, GaTe, InS, InSe, In2Se3, InTe 등과 같은 이원소 화합물; InGaS3, InGaSe3 등과 같은 삼원소 화합물; 또는 이의 임의의 조합을 포함할 수 있다. I-III-VI족 반도체 화합물의 예는, AgInS, AgInS2, AgInSe2, AgGaS, AgGaS2, AgGaSe2, CuInS, CuInS2, CuInSe2, CuGaS2, CuGaSe2, CuGaO2, AgGaO2, AgAlO2 등과 같은 삼원소 화합물; AgInGaS2, AgInGaSe2 등과 같은 사원소 화합 물; 또는 이의 임의의 조합을 포함할 수 있다. IV-VI족 반도체 화합물의 예는 SnS, SnSe, SnTe, PbS, PbSe, PbTe 등과 같은 이원소 화합물; SnSeS, SnSeTe, SnSTe, PbSeS, PbSeTe, PbSTe, SnPbS, SnPbSe, SnPbTe 등과 같은 삼원소 화합물; SnPbSSe, SnPbSeTe, SnPbSTe 등과 같은 사원소 화합물; 또는 이의 임의의 조합을 포함할 수 있다. IV족 원소 또는 화합물은 Si, Ge 등과 같은 단일원소 화합물; SiC, SiGe 등과 같은 이원소 화합물; 또는 이의 임의의 조합을 포함할 수 있다. 이원소 화합물, 삼원소 화합물 및 사원소 화합물과 같은 다원소 화합물에 포함된 각각의 원소는 균일한 농도 또 는 불균일한 농도로 입자 내에 존재할 수 있다. 즉, 화학식은 화합물에 포함되는 원소의 종류를 의미하는 것이 며, 화합물 내의 원소비는 상이할 수 있다. 예를 들어, AgInGaS2는 AgInxGa1-xS2 (x는 0~1 사이의 실수)를 의미 할 수 있다.한편, 양자점은 해당 양자점에 포함된 각각의 원소의 농도가 균일한 단일 구조 또는 코어-쉘의 이중 구조를 가 질 수 있다. 예를 들어, 코어에 포함된 물질과 쉘에 포함된 물질은 서로 상이할 수 있다. 양자점의 쉘은 코어의 화학적 변성을 방지하여 반도체 특성을 유지하기 위한 보호층 역할 및/또는 양자점에 전 기 영동 특성을 부여하기 위한 차징층(charging layer)의 역할을 수행할 수 있다. 쉘은 단층 또는 다중층일 수 있다. 코어와 쉘의 계면은 쉘에 존재하는 원소의 농도가 중심으로 갈수록 낮아지는 농도 구배(gradient)를 가 질 수 있다. 양자점의 쉘의 예로는 금속 또는 비금속의 산화물, 반도체 화합물 또는 이들의 조합 등을 들 수 있다. 금속 또 는 비금속의 산화물의 예는 SiO2, Al2O3, TiO2, ZnO, MnO, Mn2O3, Mn3O4, CuO, FeO, Fe2O3, Fe3O4, CoO, Co3O4, NiO 등과 같은 이원소 화합물; MgAl2O4, CoFe2O4, NiFe2O4, CoMn2O4 등과 같은 삼원소 화합물; 또는 이의 임의의 조합 을 포함할 수 있다. 반도체 화합물의 예는, 본 명세서에 기재된 바와 같은, III-VI족 반도체 화합물; II-VI족 반도체 화합물; III-V족 반도체 화합물; III-VI족 반도체 화합물; I-III-VI족 반도체 화합물; IV-VI족 반도체 화합물; 또는 이의 임의의 조합을 포함할 수 있다. 예를 들어, 반도체 화합물은 CdS, CdSe, CdTe, ZnS, ZnSe, ZnTe, ZnSeS, ZnTeS, GaAs, GaP, GaS, GaSe, AgGaS, AgGaS2, GaSb, HgS, HgSe, HgTe, InAs, InP, InGaP, InSb, AlAs, AlP, AlSb, 또는 이의 임의의 조합을 포함할 수 있다. 이원소 화합물, 삼원소 화합물과 같은 다원소 화합물에 포함된 각각의 원소는 균일한 농도 또는 불균일한 농도 로 입자 내에 존재할 수 있다. 즉, 화학식은 화합물에 포함되는 원소의 종류를 의미하는 것이며, 화합물 내의 원소비는 상이할 수 있다. 양자점은 약 45nm 이하, 구체적으로 약 40nm 이하, 더욱 구체적으로 약 30nm 이하의 발광 파장 스펙트럼의 반치 폭(full width of half maximum, FWHM)을 가질 수 있으며, 이 범위에서 색순도나 색재현성을 향상시킬 수 있다. 또한 이러한 양자점을 통해 발광되는 광은 전 방향으로 방출되는바, 광 시야각이 향상될 수 있다. 또한, 양자점의 형태는 구체적으로 구형, 피라미드형, 다중 가지형(multi-arm), 또는 입방체(cubic)의 나노 입 자, 나노 튜브, 나노와이어, 나노 섬유, 나노 판상 입자 등의 형태일 수 있다. 양자점의 크기를 조절하거나 양자점 화합물내의 원소비를 조절함에 따라, 에너지 밴드 갭의 조절이 가능하므로, 양자점 발광층에서 다양한 파장대의 빛을 얻을 수 있다. 따라서 상기와 같은(서로 다른 크기의 양자점을 사용 하거나 양자점 화합물내의 원소비를 다르게한) 양자점을 사용함으로써, 여러 파장의 빛을 방출하는 발광 소자를 구현할 수 있다. 구체적으로, 양자점의 크기나 양자점 화합물내의 원소비의 조절은 적색, 녹색 및/또는 청색광 이 방출되도록 선택될 수 있다. 또한, 양자점들은 다양한 색의 빛이 결합되어, 백색광을 방출하도록 구성될 수 있다. 애노드(Anode)와 발광층(EML)의 사이에는 제1 기능층(FL1)이 위치하고, 발광층(EML)의 위에는 제2 기능층(FL2) 이 위치할 수 있다. 여기서, 제1 기능층(FL1)은 정공 주입층 및/또는 정공 전달층을 포함할 수 있으며, 제2 기 능층(FL2)은 전자 전달층 및/또는 전자 주입층을 포함할 수 있다. 여기서, 기능층(FL)과 발광층(EML)을 합하여 중간층이라고 할 수 있다. 제1 기능층(FL1) 및 제2 기능층(FL2)은 화소 정의막의 위 및 오프닝(OP)의 내에 도 형성되어 있다. 그러므로, 도 10의 실시예에서는 중간층 모두 화소 정의막의 위 및 오프닝(OP)의 내에 위치한다. 하지만, 실시예에 따라서는 화소 정의막의 오프닝(OP)의 내에만 발광층(EML)이 위치하고, 기능 층(FL)은 화소 정의막의 위 및 오프닝(OP)의 내에도 형성될 수 있다. 제2 기능층(FL2)의 위이며, 화소 정의막 및 오프닝(OP)의 위에는 캐소드(Cathode)가 형성되어 있다. 애노드(Anode), 발광층(EML), 및 캐소드(Cathode)는 발광 소자를 구성하며, 발광 소자는 기능층(FL)을 더 포함 할 수 있다. 애노드(Anode)로 전달된 전류는 제1 기능층(FL1), 발광층(EML), 및 제2 기능층(FL2)을 지나 캐소드(Cathode)로 전달된다. 이 때, 발광층(EML)을 흐르는 전류로 인하여 발광층(EML)이 빛을 방출하게 되어, 제1 발광 소자는 휘 도를 나타낸다. 도 10을 참고하면, 캐소드(Cathode)는 레이저 드릴링이 수행되는 위치(LDP)에서 연결 부재(CE)와 연결되어, 연 결 부재(CE)를 통하여 보조 구동 저전압선(174-1)으로부터 구동 저전압(ELVSS)을 전달받는다. 도 10에서는 레이저 드릴링이 수행되는 위치(LDP)의 단면 구조가 도시되어 있으며, 캐소드(Cathode), 기능층 (FL), 발광층(EML), 화소 정의막이 깔끔하게 오프닝을 가지면서 하부의 연결 부재(CE)와 연결되는 것처럼도시되어 있다. 하지만, 레이저에 의하여 중간층 및 화소 정의막이 녹아서 캐소드(Cathode)와 연결 부재 (CE)가 전기적으로 연결되는 것이므로, 도 10과 달리 깔끔하지 않은 단면 구조를 가질 수도 있다. 한편, 실시예에 따라서는 화소 정의막의 위에 스페이서(도시하지 않음)가 더 형성되어 있을 수 있으며, 스 페이서는 화소 정의막과 같이 테이퍼진 측벽을 가질 수 있다. 도 10에서는 캐소드 위의 구조는 도시하고 있지 않지만, 실시예에 따라서는 봉지층이 위치할 수 있다. 봉지층은 적어도 하나의 무기막과 적어도 하나의 유기막을 포함하며, 제1 무기 봉지층, 유기 봉지층 및 제2 무기 봉지층 을 포함하는 삼중층 구조를 가질 수 있다. 봉지층은 외부로부터 유입될 수 있는 수분이나 산소 등으로부터 발광 층(EML)을 보호하기 위한 것일 수 있다. 실시예에 따라 봉지층은 무기층과 유기층이 순차적으로 더 적층된 구조 를 포함할 수 있다. 실시예에 따라서는 봉지층 위에 터치 감지를 위하여 감지 절연층 및 복수의 감지 전극이 위치할 수도 있다. 실시예에 따라서는 봉지층 위에 외부 광의 반사를 줄이기 위하여 편광판을 포함하는 필름이 부착될 수 있다. 또 한, 색 품질을 향상시키기 위하여 컬러 필터나 색 변환층이 더 형성될 수 있으며, 이 때, 편광판이 부착되지 않 을 수도 있다. 컬러 필터나 색 변환층의 사이에는 차광 부재가 위치할 수도 있다. 또한, 실시예에 따라서는 외 부 광중 일부 파장의 빛을 흡수할 수 있는 물질(이하 반사 조정 물질이라고 함)이 형성되어 있는 층을 더 포함 할 수 있으며, 이 때, 편광판이 부착되지 않을 수도 있다. 또한, 실시예에 따라서는 추가적인 유기막(평탄화막 이라고도 함)으로 덮여 발광 표시 장치의 전면을 평탄하게 할 수 있다. 도 10은 일 실시예에 따른 단면 구조이므로, 다양한 변형 구조도 가능할 수 있다. 이하에서는 도 11 내지 도 23을 통하여 이상의 실시예의 변형 실시예에 대하여 각각 살펴본다. 도 11 내지 도 23은 각 변형 실시예를 상세하게 보여주는 도면이다. 먼저, 도 11 및 도 12는 발광 표시 장치에서 레이저 드릴링의 위치(LDP)를 도 1 또는 도 7과 다르게 변형한 실 시예들을 살펴본다. 도 11에서는 인접하는 4개의 단위 화소(PXU11, PXU12, PXU21, PXU22) 중 두 개의 단위 화소에 걸쳐 레이저 드릴 링의 위치(LDP)가 배치되는 실시예가 두 개 도시되어 있다. 도 11(A)에서는 레이저 드릴링의 위치(LDP)가 두 개의 단위 화소(PXU11, PXU21)에 걸쳐 형성되고 있으며, 레이 저 드릴링의 위치(LDP)에 인접하는 두 발광층(EML11c, EML21b)은 홈을 포함하는 변형 발광층으로 형성되어 있으 며, 나머지 발광층(EML11a1, EML12a1, EML21a1, EML22a1, EML11a2, EML12a2, EML21a2, EML22a2, EML11b, EML12b, EML22b, EML12c, EML21c, EML22c)은 노멀 발광층으로 형성되어 있다. 여기서, 홈은 변형 발광층 (EML11c, EML21b) 중 레이저 드릴링의 위치(LDP) 측에 형성되어 있다. 한편, 도 11(B)에서는 레이저 드릴링의 위치(LDP)가 두 개의 단위 화소(PXU11, PXU12)에 걸쳐 형성되고 있으며, 레이저 드릴링의 위치(LDP)에 인접하는 두 발광층(EML11c, EML12b)은 홈을 포함하는 변형 발광층으로 형성되어 있으며, 나머지 발광층(EML11a1, EML12a1, EML21a1, EML22a1, EML11a2, EML12a2, EML21a2, EML22a2, EML11b, EML21b, EML22b, EML12c, EML21c, EML22c)은 노멀 발광층으로 형성되어 있다. 여기서, 홈은 변형 발광층 (EML11c, EML12b) 중 레이저 드릴링의 위치(LDP) 측에 형성되어 있다. 하나의 발광 표시 장치는 레이저 드릴링의 위치(LDP)가 도 11(A)과 같은 위치에만 형성되거나, 도 11(B)와 같은 위치에만 형성될 수 있다. 하지만, 실시예에 따라서는 하나의 발광 표시 장치에 도 11(A) 및 도 11(B)와 같은 위치에 각각 형성되는 레이저 드릴링의 위치(LDP)가 교대로 배치될 수 있다. 한편, 실시예에 따라서는 하나의 발광 표시 장치에 도 11(A) 및 도 11(B)와 같은 위치뿐만 아니라 도 1과 같은 위치에 각각 형성되는 레이저 드 릴링의 위치(LDP)도 포함하여 3개의 위치가 교대로 배치될 수 있다. 이상과 같이 레이저 드릴링의 위치(LDP)가 다양하게 배치되는 경우 발광 표시 장치 전 영역에 걸쳐 표시 품질이 일정한 장점을 가질 수 있다. 특히, 사용 자가 발광 표시 장치를 90도 회전시켜 보는 경우에도 레이저 드릴링의 위치(LDP)가 일측에 치우지지 않아 표시 품질이 일정할 수 있는 장점을 가질 수 있다. 한편, 도 12에서는 인접하는 4개의 단위 화소(PXU11, PXU12, PXU21, PXU22) 중 한 개의 단위 화소 내에 레이저 드릴링의 위치(LDP)가 위치되는 실시예가 두 개 도시되어 있다. 도 12(A)에서는 레이저 드릴링의 위치(LDP)가 단위 화소(PXU11)의 내에 형성되고 있으며, 레이저 드릴링의 위치 (LDP)에 인접하는 두 발광층(EML11c, EML11b)은 홈을 포함하는 변형 발광층으로 형성되어 있으며, 나머지 발광층(EML11a1, EML12a1, EML21a1, EML22a1, EML11a2, EML12a2, EML21a2, EML22a2, EML12b, EML21b, EML22b, EML12c, EML21c, EML22c)은 노멀 발광층으로 형성되어 있다. 여기서, 홈은 변형 발광층(EML11c, EML11b) 중 레 이저 드릴링의 위치(LDP) 측에 형성되어 있다. 한편, 도 12(C)에서는 레이저 드릴링의 위치(LDP)가 단위 화소(PXU22) 내에 형성되고 있으며, 레이저 드릴링의 위치(LDP)에 인접하는 두 발광층(EML22c, EML22b)은 홈을 포함하는 변형 발광층으로 형성되어 있으며, 나머지 발광층(EML11a1, EML12a1, EML21a1, EML22a1, EML11a2, EML12a2, EML21a2, EML22a2, EML11b, EML12b, EML21b, EML11c, EML12c, EML21c)은 노멀 발광층으로 형성되어 있다. 여기서, 홈은 변형 발광층(EML22c, EML22b) 중 레 이저 드릴링의 위치(LDP) 측에 형성되어 있다. 도 12에서는 도 12(B)도 추가로 도시되어 있으며, 도 12(B)는 도 1과 동일한 위치에 레이저 드릴링의 위치(LD P)가 형성되어 있다. 하나의 발광 표시 장치는 레이저 드릴링의 위치(LDP)가 도 12(A)과 같은 위치에만 형성되거나, 도 12(C)와 같은 위치에만 형성될 수 있다. 하지만, 실시예에 따라서는 하나의 발광 표시 장치에 도 12(A) 내지 도 12(C)와 같은 위치에 각각 형성되는 3개의 레이저 드릴링의 위치(LDP)가 교대로 배치될 수 있다. 이상과 같이 레이저 드릴링 의 위치(LDP)가 다양하게 배치되는 경우 발광 표시 장치 전 영역에 걸쳐 표시 품질이 일정한 장점을 가질 수 있 다. 특히, 사용자가 발광 표시 장치를 90도 회전시켜 보는 경우에도 레이저 드릴링의 위치(LDP)가 일측에 치우 지지 않아 표시 품질이 일정할 수 있는 장점을 가질 수 있다. 도 11 및 도 12를 참고하면, 발광 표시 장치에 포함되는 적어도 두 개의 서로 다른 단위 화소 그룹에서 레이저 드릴링의 위치(LDP)는 서로 다를 수 있다. 이하에서는 도 13 및 도 14를 통하여 변형 발광층을 도 2 내지 도 5와 다른 방식으로 변형하는 실시예를 살펴보 면, 도 13은 도 2의 발광층을 기준으로 추가 변형한 도면으로, 단위 화소(PXU11)에 위치하는 제3 발광층 (EML11c)의 평면 모양이 추가적으로 변형되어 있다. 구체적으로, 도 13에서의 제3 변형 발광층(EML11c)은 도 2의 실시예와 달리, 모서리 부분(EML11-c3)에서도 확장 되어 있다. 도 13에서 제3 노멀 발광층(EML12c)은 점선으로 도시되어 있으며, 제3 노멀 발광층(EML12c)은 변 부분(EML12c- 1)과 제3 변형 발광층(EML11c)의 홈 부분(EML11c-2)에 대응하는 모서리 부분(EML12c-2)을 가질 뿐만 아니라, 추 가적으로 모서리 부분(EML12c-3)을 포함한다. 한편, 제3 변형 발광층(EML11c)은 실선으로 도시되어 있으며, 제3 변형 발광층(EML11c)은 변 부분(EML11c-1)과 홈 부분(EML11c-2)을 가질 뿐만 아니라, 추가적으로 모서리 부분 (EML11-c3)을 포함한다. 도 13에서 화살표가 도시되어 있으며, 화살표는 제3 노멀 발광층(EML12c)에서 변형이 발생되어 제3 변형 발광층 (EML11c)으로 변경되는 방향을 도시한 것이다. 즉, 제3 노멀 발광층(EML12c)의 변 부분(EML12c-1)에서 제3 변형 발광층(EML11c)의 변 부분(EML11c-1)으로 확장되며, 제3 노멀 발광층(EML12c)의 모서리 부분(EML12c-3)에서 제 3 변형 발광층(EML11c)의 모서리 부분(EML11-c3)으로 확장되고, 제3 노멀 발광층(EML12c)의 모서리 부분 (EML12c-2)에서 제3 변형 발광층(EML11c)의 홈 부분(EML11c-2)으로 축소되는 것을 나타내고 있다. 한편, 도 14에서는 제3 노멀 발광층(EML12c)과 제3 변형 발광층(EML11c)의 면적 중 차이가 나는 부분 간의 관계 가 도시되어 있다. 도 14 중 좌측에는 제3 변형 발광층(EML11c)이 제3 노멀 발광층(EML12c)보다 넓게 형성되는 부분만을 도시한 것 이며, 도 14 중 우측에는 제3 노멀 발광층(EML12c)이 제3 변형 발광층(EML11c)보다 넓게 형성되는 부분만을 도 시한 것이다. 도 14 중 좌측에 위치하는 부분은 제3 변형 발광층(EML11c)의 변 부분(EML11c-1) 및 모서리 부분(EML11-c3)과 제3 노멀 발광층(EML12c)의 변 부분(EML12c-1) 및 모서리 부분(EML12c-3) 간의 면적으로, 상측에 위치하는 상측 면적(Aus), 하측에 위치하는 하측 면적(Abs), 좌측에 위치하는 좌측 면적(Als), 우측에 위치하는 우측 면적 (Ars), 및 이들을 연결하는 3개의 모서리 면적(Ach)으로 구성되어 있으며, 이들은 서로 연결되어 있다. 도 14 중 우측에 위치하는 부분은 제3 노멀 발광층(EML12c)의 모서리 부분(EML12c-2)과 제3 변형 발광층 (EML11c)의 홈 부분(EML11c-2) 간의 면적으로, 홈측 면적(Ald)으로 도시되어 있다. 도 14의 중앙에는 등호가 도시되어 있으며, 등호는 도 14 중 좌측에 도시된 면적의 총 합과 도 14 중 우측에 도 시된 면적이 서로 동일함을 나타내고 있다. 그러므로, 제3 변형 발광층(EML11c)과 제3 노멀 발광층(EML12c, EML21c, EML22c)은 모두 동일한 면적을 가지며, 발광층의 수명은 발광층의 평면 면적에 비례하므로, 모든 제3 발광층(EML11c, EML12c, EML21c, EML22c)은 동일한 수명을 가질 수 있다. 제3 발광층(EML11c, EML12c, EML21c, EML22c)의 면적은 면적은 발광층을 구성하는 물질에 따라서 다양하게 형성될 수 있다. 한편, 실제 제조 공정에 서 발생할 수 있는 산포 또는 오차로 인하여 양측의 면적 차이가 발생할 수 있다. 여기서, 산포 또는 오차로 인 하여 발광층의 가장자리의 위치가 1 ㎛ 이내에서 변동될 수 있으며, 산포 또는 오차에 의하여 노멀 발광층과 변 형 발광층 간에 발생할 수 있는 면적 차이는 최대 10% 이내의 면적 차이를 가질 수 있다. 이러한 면적 차이로 인하여 발광층의 수명 차이가 발생할 수 있지만, 이 정도의 수명 차이는 무시할 수 있는 정도일 수 있다. 도 13 및 도 14의 실시예와 도 2 및 도 3의 실시예에서 홈측 면적(Ald)이 동일한 경우에는 도 13 및 도 14의 실 시예의 상측에 위치하는 상측 면적(Aus), 하측에 위치하는 하측 면적(Abs), 좌측에 위치하는 좌측 면적(Als), 및 우측에 위치하는 우측 면적(Ars)은 각각 도 2 및 도 3의 실시예의 상측에 위치하는 상측 면적(Aus), 하측에 위치하는 하측 면적(Abs), 좌측에 위치하는 좌측 면적(Als), 및 우측에 위치하는 우측 면적(Ars)보다 작은 면적 을 가질 수 있다. 도 13 및 도 14에서는 도 2 및 도 3에 대응하는 도면이지만, 도 4 및 도 5도 도 13 및 도 14와 같이 모서리 부 분이 확장되어 모서리 면적(Ach)을 가질 수 있다. 도 15에서는 제2 발광층(EML11b, EML12b, EML21b, EML22b) 및 제3 발광층(EML11c, EML12c, EML21c, EML22c)이 모두 동일하게 홈을 가지는 변형 발광층으로 형성된 실시예가 도시되어 있다. 도 15의 실시예에서는 제2 발광층(EML11b, EML12b, EML21b, EML22b) 각각이 가지는 홈의 위치가 서로 다르게 배치되어 있으며, 제3 발광층(EML11c, EML12c, EML21c, EML22c) 각각도 홈의 위치가 서로 다르게 배치되어 있다. 여기서, 레이저 드릴링의 위치(LDP)에 인접하게 위치하는 두 발광층(EML11c, EML22b)은 홈의 위치가 레이 저 드릴링의 위치(LDP) 측에 위치하는 것으로 고정되며, 그 외의 발광층의 홈의 위치는 자유롭게 위치할 수 있 지만, 전체적으로 각 방향의 모서리에 각각 홈이 위치하도록 배치할 수 있다. 즉, 레이저 드릴링의 위치(LDP)에서 떨어져 위치하는 제2 변형 발광층(EML11b, EML12b, EML21b) 및 상기 제3 변 형 발광층(EML12c, EML21c, EML22c)은 홈이 각각 레이저 드릴링의 위치(LDP)에 인접하는 제2 변형 발광층 (EML22b) 및 제3 변형 발광층(EML11c)에서 홈이 위치하는 측과 다른 측에 위치할 수 있다. 도 15를 참고하면, 4개의 단위 화소(PXU11, PXU12, PXU21, PXU22)로 구성되는 하나의 단위 화소 그룹에서, 제2 변형 발광층(EML11b, EML12b, EML21b, EML22b) 및 제3 변형 발광층(EML11c, EML12c, EML21c, EML22c)은 홈을 제외하면 노멀 발광층과 같이 사각형 모양을 가지며, 모서리가 모따기 되거나 둥근 모서리를 가질 수 있으며, 하나의 단위 화소 그룹에 제2 변형 발광층(EML11b, EML12b, EML21b, EML22b) 및 제3 변형 발광층(EML11c, EML12c, EML21c, EML22c)이 각각 4개씩 포함되고, 레이저 드릴링의 위치(LDP)에 떨어져 위치하는 제2 변형 발광 층(EML11b, EML12b, EML21b) 및 제3 변형 발광층(EML12c, EML21c, EML22c)은 각각 3개이고, 레이저 드릴링의 위치(LDP)에서 인접하여 위치하는 제2 변형 발광층(EML22b) 및 제3 변형 발광층(EML11c)은 각각 1개 이며, 레이저 드릴링의 위치(LDP)에 인접하는 제2 변형 발광층(EML22b) 및 제3 변형 발광층(EML11c)에서 홈이 위치하 는 모서리와 레이저 드릴링의 위치(LDP)에서 떨어져 위치하는 제2 변형 발광층(EML11b, EML12b, EML21b) 및 제3 변형 발광층(EML12c, EML21c, EML22c)의 홈이 위치하는 모서리는 모두 다를 수 있다. 도 15의 실시예에 의하면, 사용자가 변형 발광층의 홈의 위치를 용이하게 인식할 수 없으며, 특히, 사용자가 발 광 표시 장치를 90도 회전시켜 보는 경우에도 변형 발광층의 홈의 위치를 시인하기 어려워 표시 품질이 일정할 수 있는 장점을 가질 수 있다. 한편, 도 16에서는 도 1의 실시예와 달리, 레이저 드릴링의 위치(LDP)에 인접하게 위치하는 제1 발광층 (EML12a2, EML21a1)도 변형 발광층으로 형성되어 있다. 도 16에서 도 1과 동일한 구조를 가지는 두 변형 발광층 (EML11c, EML22b)은 추가적인 설명을 생략한다. 도 16을 참고하면, 제1 발광층(EML11a1, EML12a1, EML21a1, EML22a1, EML11a2, EML12a2, EML21a2, EML22a2) 중 레이저 드릴링의 위치(LDP)에 인접하게 위치하는 두 제1 발광층(EML12a2, EML21a1)이 홈을 가지는 변형 발광층 으로 형성되어 있다. 구체적으로, 제1 변형 발광층(EML12a2, EML21a1)은 도 16에서 단위 화소(PXU12)에 위치하는 제1 변형 발광층 (EML12a2)과 단위 화소(PXU21)에 위치하는 제1 변형 발광층(EML21a1)은 실선으로 도시되어 있으며, 이와 중첩하는 점선도 도시되어 있다. 여기서, 점선은 다른 부분에 위치하는 제1 노멀 발광층(EML11a1, EML12a1, EML22a1, EML11a2, EML21a2, EML22a2)의 크기를 나타내는 것으로, 구체적으로는 도 2 내지 도 5를 통하여 살펴본다. 도 16의 실시예에 따른 제1 변형 발광층(EML12a2, EML21a1)은 길게 연장되는 방향만 차이가 있으며, 전체적으로 동일한 모양을 가질 수 있다. 이하에서는 두 제1 변형 발광층(EML12a2, EML21a1) 중 단위 화소(PXU21)에 위치하 는 제1 변형 발광층(EML21a1)의 평면 모양을 구체적으로 살펴본다. 실선으로 도시된 제1 변형 발광층(EML21a1)의 경계는 홈을 제외하고는 점선보다 외측에 위치하고 있다. 그 결과 홈을 제외하고는 제1 변형 발광층(EML21a1)은 제1 노멀 발광층(EML11a1, EML12a1, EML22a1)보다 크게 확장되어 있음을 확인할 수 있다. 하지만, 제1 변형 발광층(EML21a1)의 홈이 위치하는 부분에서는 제1 노멀 발광층 (EML11a1, EML12a1, EML22a1)이 더 크게 형성되어 있다. 또한, 도 17에서 도시하고 있는 바와 같이, 제1 변형 발광층(EML21a1)과 제1 노멀 발광층(EML11a1, EML12a1, EML22a1)은 모두 동일한 면적을 가질 수 있다. 구체적으로, 도 17 중 우측에는 제1 변형 발광층(EML21a1)이 제1 노멀 발광층(EML11a1, EML12a1, EML22a1)보다 넓게 형성되는 부분만을 도시한 것이며, 도 17 중 좌측에는 제1 노멀 발광층(EML11a1, EML12a1, EML22a1)이 제1 변형 발광층(EML21a1)보다 넓게 형성되는 부분만을 도시한 것이다. 도 17 중 우측에 위치하는 부분은 제1 변형 발광층(EML21a1)의 변 부분과 제1 노멀 발광층(EML11a1, EML12a1, EML22a1)의 변 부분 간의 면적으로, 상측에 위치하는 상측 면적(Aus), 하측에 위치하는 하측 면적(Abs), 좌측에 위치하는 좌측 면적(Als), 및 우측에 위치하는 우측 면적(Ars)으로 구분되어 도시되어 있다. 도 17 중 좌측에 위치하는 부분은 제1 노멀 발광층(EML11a1, EML12a1, EML22a1)의 모서리 부분과 제1 변형 발광 층(EML21a1)의 홈 부분 간의 면적으로, 홈측 면적(Ald)으로 도시되어 있다. 도 17의 중앙에는 등호가 도시되어 있으며, 등호는 도 17 중 우측에 도시된 면적의 총 합과 도 17 중 좌측에 도 시된 면적이 서로 동일함을 나타내고 있다. 그러므로, 제1 변형 발광층(EML21a1)과 제1 노멀 발광층(EML11a1, EML12a1, EML22a1)은 모두 동일한 면적을 가진다. 또한, 도 16에 도시되어 있는 단위 화소(PXU12)에 위치하는 제1 변형 발광층(EML12a2)도 제1 변형 발광층 (EML21a1)과 동일한 특성을 가질 수 있다. 즉, 제1 변형 발광층(EML12a2)의 면적은 제1 노멀 발광층(EML11a2, EML21a2, EML22a2)과 동일한 면적을 가진다. 여기서, 발광층의 수명은 발광층의 평면 면적에 비례하므로, 모든 제1 발광층(EML11a1, EML12a1, EML21a1, EML22a1, EML11a2, EML12a2, EML21a2, EML22a2)은 동일한 수명을 가질 수 있다. 제1 발광층(EML11a1, EML12a1, EML21a1, EML22a1, EML11a2, EML12a2, EML21a2, EML22a2)의 면적은 면적은 발광층을 구성하는 물질에 따라서 다양하게 형성될 수 있다. 한편, 실제 제조 공정에서 발생할 수 있는 산포 또는 오차로 인하여 양측의 면적 차 이가 발생할 수 있다. 여기서, 산포 또는 오차로 인하여 발광층의 가장자리의 위치가 1 ㎛ 이내에서 변동될 수 있으며, 산포 또는 오차에 의하여 노멀 발광층과 변형 발광층 간에 발생할 수 있는 면적 차이는 최대 10% 이내 의 면적 차이를 가질 수 있다. 이러한 면적 차이로 인하여 발광층의 수명 차이가 발생할 수 있지만, 이 정도의 수명 차이는 무시할 수 있는 정도일 수 있다. 한편, 도 18의 실시예에서는 레이저 드릴링의 위치(LDP)가 인접하는 4개의 단위 화소(PXU11, PXU12, PXU21, PXU22)의 정 중앙에 위치하는 실시예가 도시되어 있다. 즉, 레이저 드릴링의 위치(LDP)의 중심과 단위 화소 (PXU11, PXU12, PXU21, PXU22) 4개가 모두 만나는 점은 서로 일치할 수 있다. 이 경우, 레이저 드릴링의 위치 (LDP)에 인접하는 변형 발광층(EML11c, EML22b)과 레이저 드릴링의 위치(LDP)가 같거나 서로 다를 수도 있다. 다만, 변형 발광층(EML11c, EML22b)과 레이저 드릴링의 위치(LDP) 간의 간격은 일정 수준 이상으로 형성하여 레 이저 드릴링시 발광층에 손상이 가해지지 않도록 할 수 있다. 여기서, 일정 수준은 도 7에서 살펴본 바와 같이, 노멀 발광층 간의 간격(Gap1)의 절반에 준하는 간격을 가질 수 있으며, Gap1을 100이라고 했을 때, 레이저 드릴 링의 위치(LDP)와 변형 발광층 간의 간격은 50이상 55이하의 값을 가질 수 있다. 한편, 도 19의 실시예에서는 레이저 드릴링이 다른 방식을 사용하여 연결 부재(도 24의 CE)와 전체적으로 형성 되어 있는 캐소드(Cathode)를 연결하는 방식을 설명한다. 도 19를 참고하면, 오프닝(VCP)을 통하여 구동 저전압(ELVSS)이 전달되는 연결 부재(도 24의 CE)를 노출 시킨 후, 캐소드(Cathode)가 전체적으로 형성되면서 오프닝(VCP)를 통하여 구동 저전압(ELVSS)이 캐소드(Cathode)로 전달된다. 여기서, 오프닝(VCP)은 레이저 드릴링의 위치(LDP)가 가지는 면적보다 작을 수 있으며, 오프닝이 가지는 지름의 길이는 Gap1 보다 작은 값을 가질 수 있으며, Gap1을 100이라고 했을 때, 30이상 100미만의 값을 가질 수 있다. 또한, 오프닝(VCP)은 도 19에서 도시한 바와 같이 사각형의 평면 모양을 가질 수 있다. 이 때, 오프닝(VCP)에 인접하는 두 발광층(EML11c, EML22b)은 변형 발광층(EML11c, EML22b)으로 형성될 수 있으며, 두 (EML11c, EML22b)은 각각 오프닝(VCP)의 일 변과 평행한 변을 가질 수 있다. 또한, 변형 발광층(EML11c, EML22b)의 면적 은 다른 노멀 발광층 중 동일한 색을 표시하는 노멀 발광층의 면적과 동일할 수 있다. 한편 실시예에 따라서 오 프닝(VCP)은 도 19에서 도시한 바와 달리, 원형 등 다양한 평면 모양을 가질 수 있다. 도 19에서는 하나의 실시예로만 도시하고 있지만, 본 출원서에서 레이저 드릴링이 사용되는 실시예의 모든 변형 구조도 적용될 수 있다. 한편, 도 20 및 도 21의 실시예에서는 레이저 드릴링 의 위치(LDP)가 다양하게 변경되면서 배치되는 실시예를 도시하고 있다. 먼저, 도 20에서는 도 1의 실시예 등에서와 같이, 레이저 드릴링의 위치(LDP)가 인접하는 4 개의 단위 화소에 걸쳐 배치되는 실시예의 변형 실시예이다. 도 20을 참고하면, 레이저 드릴링의 위치(LDP)가 일 방향으로 연속적 으로 배치되지 않고 인접하는 위치와 교대로 배치되어 인접하는 4개의 레이저 드릴링의 위치(LDP)를 연결하면 마름모 모양을 가질 수 있다. 한편, 도 21에서는 도 11에서와 같이, 레이저 드릴링의 위치(LDP)가 인접하는 두 개의 단위 화소에 걸쳐 배치되 는 실시예의 변형 실시예이다. 도 21을 참고하면, 레이저 드릴링의 위치(LDP)가 교대로 배치되어 인접하는 4개 의 레이저 드릴링의 위치(LDP)를 연결하면 마름모 모양을 가질 수 있다. 도 20 및 도 21과 같이 레이저 드릴링의 위치(LDP)가 일정 간격을 가지면서 교대로 배치되는 실시예에서는 얼룩 이 생기지 않는 장점이 있을 수 있다. 즉, 레이저 드릴링을 통하여 연결되는 연결 부재(도 24의 CE) 및 이와 연 결되는 전압선이 형성되어야 하는데, 레이저 드릴링의 위치(LDP)에 따라서 연결 부재(도 24의 CE) 및 이와 연결 되는 전압선이 위치하지 않는 행도 형성될 수도 있다. 하지만, 연결 부재(도 24의 CE) 및 이와 연결되는 전압선 이 위치하지 않는 행이 위치되는 경우에는 일부 화소행에 얼룩이 발생하는 단점이 발생할 수 있다. 하지만, 도 20 및 도 21의 실시예와 같이 레이저 드릴링의 위치(LDP)가 일정 간격을 가지면서 교대로 배치되는 경우에는 얼 룩이 발생하지 않을 수 있다. 한편, 도 22에서는 하나의 단위 화소(PXU11, PXU12, PXU21, PXU22)내에 위치하며, 동일한 색을 표시하는 두 발 광층(제1-1 발광층(EML11a1, EML12a1, EML21a1, EML22a1)과 제1-2 발광층(EML11a2, EML12a2, EML21a2, EML22a2))의 연결 구조를 개략적으로 도시한 도면이다. 제1-1 발광층(EML11a1, EML12a1, EML21a1, EML22a1)과 제1-2 발광층(EML11a2, EML12a2, EML21a2, EML22a2)은 하나의 화소 구동부(PCa)와 전기적으로 연결되어 두 제1-1 발광층(EML11a1, EML12a1, EML21a1, EML22a1)과 제 1-2 발광층(EML11a2, EML12a2, EML21a2, EML22a2)도 연결될 필요가 있다. 도 22에서는 단위 화소(PXU11)를 중심으로 설명하고 있으며, 도 22(A)에서는 단위 화소(PXU11) 내에 레이저 드 릴링의 위치(LDP)가 전부 위치하지 않는 실시예이고, 도 22(B)에서는 단위 화소(PXU11) 내에 레이저 드릴링의 위치(LDP)가 전부 위치하는 실시예이다. 먼저, 도 22(A)를 참고하면, 제1-1 발광층(EML11a1)을 포함하는 발광 소자와 제1-2 발광층(EML11a2)을 포함하는 발광 소자가 단위 화소(PXU11)의 중심 영역을 지나는 연결선(CLa)에 의하여 서로 전기적으로 연결될 수 있다. 연결선(CLa)은 화소 회로부(도 24의 PCa 참고)와 제1-1 발광층(EML11a1)의 하부에 위치하는 애노드, 및 제1-2 발광층(EML11a2)의 하부에 위치하는 애노드를 전기적으로 연결할 수 있다. 연결선(CLa)은 기판과 애노드의 사이 에 위치하는 도전층 중 하나에 위치할 수 있다. 한편, 도 22(B)를 참고하면, 제1-1 발광층(EML11a1)을 포함하는 발광 소자와 제1-2 발광층(EML11a2)을 포함하는 발광 소자가 단위 화소(PXU11)의 외곽을 따라서 연장되는 부분을 포함하는 연결선(CLb)에 의하여 서로 전기적으 로 연결될 수 있다. 연결선(CLb)은 화소 회로부(도 24의 PCa 참고)와 제1-1 발광층(EML11a1)의 하부에 위치하는 애노드, 및 제1-2 발광층(EML11a2)의 하부에 위치하는 애노드를 전기적으로 연결할 수 있다. 연결선(CLb)은 기 판과 애노드의 사이에 위치하는 도전층 중 하나에 위치할 수 있다. 이상에서는 연결선(CLa, CLb)에 의하여 제1-1 발광층(EML11a1)을 포함하는 발광 소자의 애노드와 제1-2 발광층 (EML11a2)을 포함하는 발광 소자의 애노드를 연결하는 것으로 기술하였지만, 실시예에 따라서는 하나의 발광 소자의 애노드와 다른 발광 소자의 캐소드가 연결되거나, 두 발광 소자의 캐소드와 연결될 수도 있다. 도 23에서는 레이저 드릴링의 위치(LDP)가 4개의 단위 화소 마다 형성되지 않는 실시예를 도시하고 있다. 단위 화소 그룹은 하나의 레이저 드릴링의 위치(LDP)가 형성되는 단위 화소의 그룹을 의미할 수 있으며, 도 23 의 실시예를 구체적으로 살펴보면 아래와 같다. 도 23(A)에서는 단위 화소 그룹이 6개의 단위 화소를 포함하는 실시예가 도시되어 있으며, 6개의 단위 화소 중 인접하는 4개의 단위 화소에 걸쳐 레이저 드릴링의 위치(LDP)가 형성되는 실시예가 도시되어 있다. 한편, 도 23(B)에서는 단위 화소 그룹이 8개의 단위 화소를 포함하는 실시예가 도시되어 있으며, 8개의 단위 화 소 중 가운데에 위치하는 인접하는 4개의 단위 화소에 걸쳐 레이저 드릴링의 위치(LDP)가 형성되는 실시예가 도 시되어 있다. 실시예에 따라서는 레이저 드릴링의 위치(LDP)는 단위 화소 그룹 중 도 11, 12, 18의 실시예와 같은 위치에도 위치할 수 있다. 실시예에 따라서 단위 화소 그룹에 포함되는 단위 화소의 개수는 4개, 6개, 8개 외에 다양한 수를 가질 수 있다. 이 때, 레이저 드릴링의 위치(LDP)는 4개, 6개, 8개 외에 다양한 수의 단위 화소마다 하나씩 형성될 수 있다. 이상에서는 발광 표시 장치 중 발광 소자에 포함되는 발광층의 구조 및 캐소드에 전압을 인가하는 구조를 중심 으로 다양한 실시예를 살펴보았다. 이하에서는 도 24을 통하여 발광 소자의 하부에 위치하는 화소 구동부의 개략적인 평면 구조를 살펴본다. 도 24은 일 실시예에 의한 발광 표시 장치의 발광 소자 하부의 개략 평면도이다. 도 24에서는 표시 영역 중 일 부분을 도시하고 있으며, 하나의 화소는 발광 소자와 화소 구동부를 포함한다. 도 24에서는 발광 소자를 도시하고 있지 않으며, 발광 소자의 하부에 위치하는 화소 구동부의 구조를 중심으로 도 시하고 있다. 도 24에서 점선으로 인접하는 총 3개의 및 화소 구동부(PCa, PCb, PCc)가 개략적으로 도시되어 있다. 세 개의 화소 구동부(PCa, PCb, PCc)는 각각 단위 화소(PXU)의 화소 구동부를 구성하며, 도 24에서는 총 4개의 단위 화소(PXU)가 도시되어 있다. 이하에서 설명하는 실시예에서는 4개의 단위 화소(PXU)를 묶어서 하나의 단위 화소 그룹이라고도 한다. 하나의 단위 화소(PXU)는 삼원색에 대응하는 3개의 화소를 포함할 수 있다. 하나의 단위 화소(PXU)에 속하는 3 개의 화소 구동부(PCa, PCb, PCc)는 각각 제1 방향(DR1)으로 길게 연장되는 구조를 가질 수 있으며, 3개는 각각 빛의 삼원색을 표시하는 화소에 대응하는 화소 구동부(PCa, PCb, PCc)일 수 있다. 화소 구동부(PCa, PCb, PCc) 의 구조는 다양할 수 있으며, 일 실시예에 의하면 도 25와 동일한 회로 구조를 가질 수 있다. 도 24에서는 추가적으로 화소 구동부(PCa, PCb, PCc)와 연결되어 있는 배선 중 일부가 추가적으로 도시되어 있 다. 도 24에서는 제1 방향(DR1)으로 연장되어 있는 제1 스캔 신호선 및 제2 스캔 신호선(151-1)이 도시되 어 있으며, 또한, 제2 방향(DR2)으로 연장되어 있는 데이터선(171a, 171b, 171c), 구동 전압선, 초기화 전 압선, 및 구동 저전압선(174; 이하 제2 구동 전압선이라고도 함)도 도시되어 있다. 여기서, 화소 구동부(PCa, PCb, PCc)는 제1 스캔 신호선, 제2 스캔 신호선(151-1), 구동 전압선, 초 기화 전압선, 및 구동 저전압선에 공통으로 연결될 수 있다. 또한, 제1 화소 구동부(PCa)는 제1 데이 터선(171a)에 연결되며, 제2 화소 구동부(PCb)는 제2 데이터선(171b)에 연결되고, 제3 화소 구동부(PCc)는 제3 데이터선(171c)에 연결될 수 있다. 화소 구동부(PCa, PCb, PCc) 각각은 제1 스캔 신호선, 제2 스캔 신호선(151-1), 및 구동 저전압선에 의하여 구획되는 평면 영역을 세 영역으로 나눈 각 영역에 대응할 수 있다. 한편, 도 24에서는 제1 방향(DR1)으로 연장되어 있는 보조 구동 저전압선(174-1; 이하 보조 제2 구동 전압선이 라고도 함)도 도시되어 있다. 보조 구동 저전압선(174-1)은 구동 저전압선과 다른 도전층에 위치하며, 다 른 방향으로 연장되어 있다. 구체적으로, 보조 구동 저전압선(174-1)은 제2 방향(DR2)으로 연장되어 있는 구동 저전압선과 연결되어 있으며, 구동 저전압(ELVSS)이 제1 방향(DR1) 및 제2 방향(DR2)으로 전달될 수 있어 발광 표시 장치의 전 표시 영역에 걸쳐 일정한 레벨의 구동 저전압(ELVSS)이 인가될 수 있다. 구동 저전압(ELVSS)은 발광 소자의 캐소드에도 인가되어야 한다. 도 10을 참고하면, 캐소드(Cathode)는 화소 정의막(도 10 의 380 참고)의 위이며, 제3 방향(DR3)으로 가장 상측에 위치한다. 가장 상측에 위치하는 캐소드(Cathode)와 보 조 구동 저전압선(174-1)을 전기적으로 연결하기 위하여 본 실시예에서는 레이저 드릴링 방식을 사용할 수 있다. 레이저 드릴링 방식은 캐소드(Cathode)까지 형성된 상태에서 레이저를 조사하여 조사된 부분을 녹여 하부 에 위치하는 보조 구동 저전압선(174-1)과 캐소드(Cathode)를 전기적으로 연결되도록 하는 방식이다. 도 24의 실시예에서는 연결 부재(CE)를 단면상 보조 구동 저전압선(174-1)과 캐소드(Cathode)의 사이에 형성하여 보조 구동 저전압선(174-1)과 캐소드(Cathode)가 전기적으로 연결되는 것을 매개하는 구조를 가진다. 보다 구체적으 로, 도 24의 실시예에서 연결 부재(CE)는 오프닝(OP1)을 통하여 보조 구동 저전압선(174-1)과 전기적으로 연결 되어 있다. 연결 부재(CE)는 레이저 드릴링을 통하여 캐소드(Cathode)와 전기적으로 연결된다. 그 결과 캐소드 (Cathode)는 보조 구동 저전압선(174-1)을 통하여 구동 저전압(ELVSS)을 전달받을 수 있다. 이와 같은 실시예에 서, 연결 부재(CE)는 평면상 레이저 드릴링이 발생하는 위치에 대응할 수 있다. 또한, 연결 부재(CE)와 평면상 중첩하지만, 하부에 위치하는 제1 스캔 신호선 및 제2 스캔 신호선(151-1)은 레이저 드릴링시 연결 부재 (CE)로 막혀 연결 부재(CE)와 쇼트되지 않으며, 구동 저전압(ELVSS)이 전달되지 않도록 한다. 그러므로, 연결 부재(CE)를 사용하면 레이저 드릴링이 수행되는 영역의 하측에 배선을 형성할 수 있어 좁은 면적에 배선 및 소 자를 형성할 수 있어 집적도를 향상시킬 수 있다. 한편, 실시예에 따라서는 별도의 오프닝을 형성하여 캐소드(Cathode)와 연결 부재(CE)를 전기적으로 연결할 수 도 있다. 한편, 앞서 설명한 다양한 실시예에서와 같이 레이저 드릴링의 위치(LDP)의 위치가 변경되는 실시예에서는 보조 구동 저전압선(174-1)과 연결 부재(CE)의 위치가 함께 변경될 수 있다. 화소 구동부(PCa, PCb, PCc)의 제3 방향(DR3)의 위에는 발광 소자(또는 발광 영역)가 위치할 수 있다. 도 1의 실시예에서는 발광 소자 중 각 발광층(EML11a1, EML12a1, EML21a1, EML22a1, EML11a2, EML12a2, EML21a2, EML22a2, EML11b, EML12b, EML21b, EML22b, EML11c, EML12c, EML21c, EML22c)의 평면 모양이 도시되어 있다. 제1 화소 구동부(PCa)는 제1-1 발광층(EML11a1, EML12a1, EML21a1, EML22a1)을 포함하는 제1-1 발광 소자 및 제1-2 발광층(EML11a2, EML12a2, EML21a2, EML22a2)을 포함하는 제1-2 발광 소자와 전기적으로 연결될 수 있다. 여기서, 제1-1 발광 소자 및 제1-2 발광 소자는 도 22에서 도시된 연결선(CLa, CLb)에 의하여 연결될 수 있다. 한편, 제2 화소 구동부(PCb)는 제2 발광층(EML11b, EML12b, EML21b, EML22b)을 포함하는 제2 발광 소자 와 전기적으로 연결되며, 제3 화소 구동부(PCc)는 제3 발광층(EML11c, EML12c, EML21c, EML22c)을 포함하는 제 3 발광 소자와 전기적으로 연결될 수 있다. 이상과 같은 화소 구동부(PCa, PCb, PCc)와 각 발광 소자의 연결 및 각 화소 구동부(PCa, PCb, PCc)의 회로 구 조에 대해서 도 25의 실시예를 통하여 구체적으로 살펴본다. 도 25는 일 실시예에 의한 발광 표시 장치의 화소의 회로도이다. 도 25에서는 세 화소(PXa, PXb, PXc)의 회로도를 도시하고 있다. 복수의 화소는 제1 화소(PXa), 제2 화소(PXb) 및 제3 화소(PXc)를 포함할 수 있다. 제1 화소(PXa), 제2 화소 (PXb) 및 제3 화소(PXc) 각각은 복수의 트랜지스터(T1, T2, T3), 유지 커패시터(Cst) 및 발광 소자(EDa1, EDa2, EDb, EDc)를 포함한다. 여기서, 하나의 화소(PXa, PXb, PXc)는 발광 소자(EDa1, EDa2, EDb, EDc)와 화소 구동부(PCa, PCb, PCc)로 구분될 수 있으며, 화소 구동부(PCa, PCb, PCc)는 도 24에서 점선으로 도시된 부분에 대응할 수 있다. 도 25를 참고하면, 화소 구동부(PCa, PCb, PCc)는 각 화소(PXa, PXb, PXc)에서 발광 소자 (EDa1, EDa2, EDb, EDc)를 제외한 부분에 대응하여 복수의 트랜지스터(T1, T2, T3) 및 유지 커패시터(Cst)를 포함할 수 있다. 또한, 실시예에 따라서는 발광 소자(EDa1, EDa2, EDb, EDc)의 양단에 연결되어 있는 커패시터(Cleda, Cledb, Cledc; 이하 발광부 커패시터라고 함)를 더 포함할 수 있으며, 발광부 커패시터(Cleda, Cledb, Cledc)는 화소 구동부에 포함되지 않을 수 있으며, 발광 소자(EDa1, EDa2, EDb, EDc)에 포함될 수 있다. 구체적으로, 제1 화소 구동부(PCa)는 제1-1 발광 소자(EDa1) 및 제1-2 발광 소자(EDa2)와 전기적으로 연결되어 있으며, 제2 화소 구동부(PCb)는 제2 발광 소자(EDb)와 전기적으로 연결되며, 제3 화소 구동부(PCc)는 제3 발광 소자(EDc)와 전기적으로 연결될 수 있다. 도 25의 실시예에 따른 화소 구동부(PCa, PCb, PCc)의 회로 구조를 구체적으로 살펴보면 아래와 같다. 복수의 트랜지스터(T1, T2, T3)는 하나의 구동 트랜지스터(T1; 제1 트랜지스터라고도 함)와 두 개의 스위칭 트 랜지스터(T2, T3)로 형성되며, 두 개의 스위칭 트랜지스터는 입력 트랜지스터(T2; 제2 트랜지스터라고도 함)와 초기화 트랜지스터(T3; 제3 트랜지스터라고도 함)로 구분된다. 각 트랜지스터(T1, T2, T3)는 게이트 전극, 제1 전극 및 제2 전극을 각각 포함하며, 채널을 포함하는 반도체층도 포함하여 게이트 전극의 전압에 따라서 반도체 층의 채널에 전류가 흐르거나 차단된다. 여기서, 제1 전극과 제2 전극은 각 트랜지스터(T1, T2, T3)에 인가되는 전압에 따라서 두 전극 중 하나가 소스 전극이고 다른 하나가 드레인 전극일 수 있다. 구동 트랜지스터(T1)의 게이트 전극은 유지 커패시터(Cst)의 일단과 연결되어 있으며, 입력 트랜지스터(T2)의 제2 전극(출력측 전극)과도 연결되어 있다. 또한, 구동 트랜지스터(T1)의 제1 전극은 구동 전압(ELVDD)을 전달 하는 구동 전압선과 연결되어 있고, 구동 트랜지스터(T1)의 제2 전극은 발광 소자(EDa1, EDa2, EDb, EDc) 의 애노드, 유지 커패시터(Cst)의 타단, 초기화 트랜지스터(T3)의 제1 전극, 및 발광부 커패시터(Cleda, Cledb, Cledc)의 일단과 연결되어 있다. 구동 트랜지스터(T1)는 입력 트랜지스터(T2)의 스위칭 동작에 따라 데이터 전 압(DVa, DVb, DVc)을 게이트 전극으로 전달받으며, 게이트 전극의 전압에 따라 발광 소자(EDa1, EDa2, EDb, EDc)에 구동 전류를 공급할 수 있다. 이 때, 유지 커패시터(Cst)는 구동 트랜지스터(T1)의 게이트 전극의 전압 을 저장하고 유지한다. 입력 트랜지스터(T2)의 게이트 전극은 제1 스캔 신호(SC)를 전달하는 제1 스캔 신호선과 연결되어 있다. 입력 트랜지스터(T2)의 제1 전극은 데이터 전압(DVa, DVb, DVc)을 전달하는 데이터선(171a, 171b, 171c)과 연 결되어 있고, 입력 트랜지스터(T2)의 제2 전극은 유지 커패시터(Cst)의 일단 및 구동 트랜지스터(T1)의 게이트 전극과 연결되어 있다. 복수의 데이터선(171a, 171b, 171c)은 서로 다른 데이터 전압(DVa, DVb, DVc)을 각각 전 달하며, 각 화소(PXa, PXb, PXc)의 입력 트랜지스터(T2)는 서로 다른 데이터선(171a, 171b, 171c)에 연결되어 있다. 각 화소(PXa, PXb, PXc)의 입력 트랜지스터(T2)의 게이트 전극은 동일한 제1 스캔 신호선에 연결되 어 동일한 타이밍의 제1 스캔 신호(SC)를 입력받을 수 있다. 동일한 타이밍의 제1 스캔 신호(SC)에 의하여 각 화소(PXa, PXb, PXc)의 입력 트랜지스터(T2)는 동시에 턴 온되어도, 서로 다른 데이터선(171a, 171b, 171c)을 통하여 서로 다른 데이터 전압(DVa, DVb, DVc)이 각 화소(PXa, PXb, PXc)의 구동 트랜지스터(T1)의 게이트 전극 및 유지 커패시터(Cst)의 일단으로 전달된다. 도 25의 실시예는 초기화 트랜지스터(T3)의 게이트 전극이 입력 트랜지스터(T2)의 게이트 전극과 다른 스캔 신 호를 전달받는 실시예이다. 초기화 트랜지스터(T3)의 게이트 전극은 제2 스캔 신호(SS)를 전달하는 제2 스캔 신호선(151-1)과 연결되어 있 다. 초기화 트랜지스터(T3)의 제1 전극은 유지 커패시터(Cst)의 타단, 구동 트랜지스터(T1)의 제2 전극, 발광 소자(EDa1, EDa2, EDb, EDc)의 애노드 및 발광부 커패시터(Cleda, Cledb, Cledc)의 일단과 연결되어 있고, 초 기화 트랜지스터(T3)의 제2 전극은 초기화 전압(VINT)을 전달하는 초기화 전압선과 연결되어 있다. 초기화 트랜지스터(T3)는 제2 스캔 신호(SS)에 따라 턴 온되어 초기화 전압(VINT)을 발광 소자(EDa1, EDa2, EDb, ED c)의 애노드, 발광부 커패시터(Cleda, Cledb, Cledc)의 일단, 및 유지 커패시터(Cst)의 타단에 전달하여 발광 소자(EDa1, EDa2, EDb, EDc)의 애노드의 전압을 초기화시킨다. 초기화 전압선은 초기화 전압(VINT)을 인가하기 전에 발광 소자(EDa1, EDa2, EDb, EDc)의 애노드의 전압을 감지하는 동작을 수행하여 감지 배선(SL)으로의 역할을 수행할 수도 있다. 감지 동작을 통하여 제1 애노드의 전 압이 타겟 전압으로 유지되고 있는지 확인할 수 있다. 감지 동작과 초기화 전압(VINT)을 전달하는 초기화 동작 은 시간적으로 구분되어 진행될 수 있으며, 감지 동작이 수행된 후 초기화 동작이 수행될 수 있다. 도 25의 실시예에서는 초기화 트랜지스터(T3)와 입력 트랜지스터(T2)의 턴 온 구간이 구분될 수 있어, 입력 트 랜지스터(T2)가 수행하는 기입 동작과 초기화 트랜지스터(T3)가 수행하는 초기화 동작(및/또는 감지 동작)이 서 로 다른 타이밍에 수행될 수 있다. 유지 커패시터(Cst)의 일단은 구동 트랜지스터(T1)의 게이트 전극 및 입력 트랜지스터(T2)의 제2 전극과 연결되 어 있고, 타단은 초기화 트랜지스터(T3)의 제1 전극, 구동 트랜지스터(T1)의 제2 전극, 발광 소자(EDa1, EDa2, EDb, EDc)의 애노드 및 발광부 커패시터(Cleda, Cledb, Cledc)의 일단과 연결되어 있다. 발광 소자(EDa1, EDa2, EDb, EDc)는 애노드로 구동 트랜지스터(T1)의 출력 전류가 전달되며, 발광 소자(EDa1, EDa2, EDb, EDc)의 캐소드는 구동 저전압선을 통하여 구동 저전압(ELVSS)을 전달받으며, 발광 소자(EDa1, EDa2, EDb, EDc)는 구동 트랜지스터(T1)의 출력 전류에 따라 빛을 방출하여 계조를 표시한다. 또한, 발광 소자(EDa1, EDa2, EDb, EDc)의 양단에는 발광부 커패시터(Cleda, Cledb, Cledc)가 형성되어 있어 발광 소자(EDa1, EDa2, EDb, EDc) 양단 전압이 일정하게 유지될 수 있도록 하여 발광 소자(EDa1, EDa2, EDb, EDc)가 일정한 휘도를 표시할 수 있도록 한다. 이하에서는 도 25와 같은 회로를 가지는 화소의 동작에 대하여 간단하게 살펴본다. 도 25에서는 각 트랜지스터(T1, T2, T3)가 N형 트랜지스터인 실시예이며, 하이 레벨의 전압이 게이트 전극으로 인가되면 턴 온되는 특징을 가진다. 하지만, 실시예에 따라서는 각 트랜지스터(T1, T2, T3)가 P형 트랜지스터 일 수 있다. 발광 구간이 종료하면서 한 프레임이 시작된다. 그 후, 하이 레벨의 제2 스캔 신호(SS)가 공급되어 초기화 트랜 지스터(T3)가 턴 온 된다. 초기화 트랜지스터(T3)가 턴 온 되면, 초기화 동작 및/또는 감지 동작이 수행될 수 있다. 초기화 동작과 감지 동작이 모두 수행되는 실시예를 중심으로 살펴보면 아래와 같다. 초기화 동작이 수행되기 전 먼저 감지 동작이 수행될 수 있다. 즉, 초기화 트랜지스터(T3)가 턴 온 되면서 초기 화 전압선이 감지 배선(SL)의 역할을 수행하여 발광 소자(EDa1, EDa2, EDb, EDc)의 애노드의 전압을 감지 한다. 감지 동작을 통하여 애노드의 전압이 타겟 전압으로 유지되고 있는지 확인할 수 있다. 그 후, 초기화 동작이 수행될 수 있으며, 유지 커패시터(Cst)의 타단, 구동 트랜지스터(T1)의 제2 전극 및 발광 소자(EDa1, EDa2, EDb, EDc)의 애노드의 전압이 초기화 전압선으로부터 전달된 초기화 전압(VINT)으로 변 경되도록 하여 초기화를 수행한다. 이와 같이, 감지 동작과 초기화 전압(VINT)을 전달하는 초기화 동작은 시간적으로 구분되어 진행되어 최소한의 트랜지스터를 사용하면서 화소가 차지하는 면적을 줄이면서 화소가 다양한 동작을 수행하도록 할 수 있다. 그 결과 표시 패널의 해상도가 향상될 수 있다. 초기화 동작과 함께 또는 별도의 타이밍에 제1 스캔 신호(SC)도 하이 레벨으로 변경되면서 인가되어, 입력 트랜 지스터(T2)가 턴 온 되고, 기입 동작이 수행된다. 즉, 턴 온된 입력 트랜지스터(T2)를 통해 데이터선(171a, 171b, 171c)으로부터의 데이터 전압(DVa, DVb, DVc)이 구동 트랜지스터(T1)의 게이트 전극 및 유지 커패시터 (Cst)의 일단으로 입력되고 저장된다. 초기화 동작 및 기입 동작에 의하여 유지 커패시터(Cst)의 양단에는 각각 데이터 전압(DVa, DVb, DVc)과 초기화 전압(VINT)이 인가된다. 초기화 트랜지스터(T3)가 턴 온되어 있는 상태에서는 구동 트랜지스터(T1)에서 출력 전 류가 생성되더라도 초기화 트랜지스터(T3) 및 초기화 전압선을 통하여 외부로 출력될 수 있어 제1 발광 소 자(EDa1, EDb1, EDc1)의 제1 애노드로 입력되지 않을 수 있다. 또한, 실시예에 따라서는 하이 레벨의 제1 스캔 신호(SC)가 공급되는 기입 구간 동안 구동 전압(ELVDD)을 로우 레벨의 전압으로 인가하거나, 구동 저전압 (ELVSS)을 하이 레벨의 전압으로 인가하여 발광 소자(EDa1, EDa2, EDb, EDc)에 전류가 흐르지 않도록 할 수 있 다. 그 후, 제1 스캔 신호(SC)가 로우 레벨로 변경되면, 구동 트랜지스터(T1)에 인가되는 하이 레벨의 구동 전압 (ELVDD) 및 유지 커패시터(Cst)에 저장된 구동 트랜지스터(T1)의 게이트 전압에 의하여 구동 트랜지스터(T1)가 출력 전류를 생성하고 출력한다. 구동 트랜지스터(T1)의 출력 전류는 발광 소자(EDa1, EDa2, EDb, EDc)로 입력 되어 발광 소자(EDa1, EDa2, EDb, EDc)가 빛을 방출하게 되는 발광 구간이 진행된다. 이상과 같은 발광 표시 장치의 실시예는 전자 기기에 포함될 수 있으며, 본 실시예에 따른 발광 표시 장치가 사 용될 수 있는 전자 기기로는 모니터 또는 TV와 같은 중 대형 전자 기기에 사용될 수 있다. 하지만, 전자 기기의 예는 이에 한정되는 것은 아니다. 이하에서는 본 실시예에 따른 발광 표시 장치가 포함될 수 있는 전자 기기 중 하나의 실시예를 도 26을 통하여 살펴본다. 도 26은 본 발명의 실시예들에 따른 전자 기기의 블록도이다. 전자 기기는 운영체제 내에서 표시 모듈(MD2)을 통해서 다양한 정보를 출력한다. 프로세서(PROC)가 메모리 (MM)에 저장된 어플리케이션을 실행시키면, 표시 모듈(MD2)은 표시 패널(MD21)을 통해 어플리케이션 정보를 사 용자에게 제공한다. 여기서 표시 패널(MD21)은 앞서 설명한 발광 표시 장치가 사용될 수 있다. 프로세서(PROC)는 입력 모듈(MD1) 또는 센서 모듈(MD41)을 통해 외부 입력을 획득하고, 외부 입력에 대응하는 어플리케이션을 실행시킨다. 예를 들어, 사용자가 표시 패널(MD21)에 표시된 카메라 아이콘을 선택한 경우, 프 로세서(PROC)는 입력 센서(MD41-2)를 통해서 사용자 입력을 획득하고, 카메라 모듈(MD51)을 활성화시킨다. 프로 세서(PROC)는 카메라 모듈(MD51)을 통해 획득한 촬영 이미지에 대응하는 영상 데이터를 표시 모듈(MD2)에 전달 한다. 표시 모듈(MD2)은 촬영 이미지에 대응하는 이미지를 표시 패널(MD21) 통해 표시할 수 있다. 또 다른 예로, 표시 모듈(MD2)에서 개인 정보 인증이 실행되는 경우, 지문센서(MD41-1)는 입력된 지문 정보를 입력 데이터로써 획득한다. 프로세서(PROC)는 지문센서(MD41-1)를 통해 획득한 입력 데이터를 메모리(MM)에 저 장된 인증 데이터와 비교하고, 비교 결과에 따라 어플리케이션을 실행한다. 표시 모듈(MD2)은 어플리케이션의 로직에 따라 실행된 정보를 표시 패널(MD21)을 통해 표시할 수 있다. 또 다른 예로, 표시 모듈(MD2)에 표시된 음악 스트리밍 아이콘이 선택된 경우, 프로세서(PROC)는 입력 센서 (MD41-2)를 통해서 사용자 입력을 획득하고, 메모리(MM)에 저장된 음악 스트리밍 어플리케이션을 활성화시킨다. 음악 스트리밍 어플리케이션에서 음악 실행 명령이 입력되면 프로세서(PROC)는 음향 출력 모듈(MD43)을 활성화 시켜 음악 실행 명령에 부합하는 음향 정보를 사용자에게 제공한다. 이상에서, 전자 기기가 동작을 간략히 설명하였다. 이하에서 전자 기기의 구성에 대해 상세히 설명한다. 후술하는 전자 기기의 구성들 중 일부는 일체화되어 하나의 구성으로 제공될 수 있고, 하나의 구성이 2 이상 의 구성으로 분리되어 제공될 수도 있다. 도 26을 참조하면, 전자 기기는 네트워크(예컨대, 근거리 무선 통신 네트워크 또는 원거리 무선 통신 네트워 크)를 통하여 외부 전자 장치와 통신할 수 있다. 일 실시예에 따르면, 전자 기기는 프로세서(PROC), 메모 리(MM), 입력 모듈(MD1), 표시 모듈(MD2), 전원 모듈(MD3), 내장형 모듈(MD4), 및 외장형 모듈(MD5)을 포함할 수 있다. 일 실시예에 따르면, 전자 기기는 상술한 구성요소들 중 적어도 하나가 생략되거나, 하나 이상의 다른 구성 요소가 추가될 수 있다. 일 실시예에 따르면, 상술한 구성요소들 중 일부의 구성요소는(예컨대, 센서 모듈(MD41), 안테나 모듈(MD42), 또는 음향 출력 모듈(MD43))은 다른 하나의 구성요소(예컨대, 표시 모듈(MD 2))에 통합될 수 있다. 프로세서(PROC)는, 소프트웨어를 실행하여 프로세서(PROC)에 연결된 전자 기기의 적어도 하나의 다른 구성요 소(예컨대, 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이터 처리 또는 연산을 수행할 수 있다. 일 실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서(PROC)는 다른 구성요소(예컨대, 입력 모듈(MD1), 센서 모듈(MD41) 또는 통신 모듈(MD53))로부터 수신된 명령 또는 데이터를 휘발성 메모리(MM1)에 저장하고, 휘발성 메모리(MM1)에 저장된 명령 또는 데이터를 처리하고, 결과 데이터는 비 휘발성 메모리(MM2)에 저장될 수 있다. 프로세서(PROC)는 메인 프로세서(MPROC)와 보조 프로세서(SPROC)를 포함할 수 있다. 메인 프로세서(MPROC)는 중 앙처리장치(MPROC-1, CPU: central processing unit) 또는 어플리케이션 프로세서(AP: application processor) 중 하나 이상을 포함할 수 있다. 메인 프로세서(MPROC)는 그래픽처리장치(MPROC-2, GPU: graphic processing unit), 커뮤니케이션 프로세서(CP: communication processor), 및 이미지 신호 프로세서(ISP: image signal processor) 중 어느 하나 이상을 더 포함할 수도 있다. 메인 프로세서(MPROC)는 신경망 처리 장치(MPROC-3, NPU: neural processing unit)를 더 포함할 수도 있다. 신경망 처리 장치는 인공지능 모델의 처리에 특화된 프 로세서로, 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 인공지능 모델은, 복수의 인공 신경망 레이어들 을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이 상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적 으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있다. 상술한 처리 장치(processing unit) 및 프로세서 중 적어도 두 개가 하나의 통합된 구성(예컨대, 단일 칩)으로 구현되거나, 각각이 독립된 구성(예컨대, 복수 개의 칩)으로 구현될 수 있다. 보조 프로세서(SPROC)는 컨트롤러(SPROC-1)를 포함할 수 있다. 컨트롤러(SPROC-1)는 인터페이스 변환 회로 및 타이밍 제어 회로를 포함할 수 있다. 컨트롤러(SPROC-1)는 메인 프로세서(MPROC)로부터 영상 신호를 수신하고, 표시 모듈(MD2)과의 인터페이스 사양에 맞도록 영상 신호의 데이터 포맷을 변환하여 영상 데이터를 출력한다. 컨트롤러(SPROC-1)는 표시 모듈(MD2)의 구동에 필요한 각종 제어 신호를 출력할 수 있다. 보조 프로세서(SPROC)는 데이터 변환회로(SPROC-2), 감마 보정회로(SPROC-3), 렌더링 회로(SPROC-4) 등을 더 포함할 수 있다. 데이터 변환회로(SPROC-2)는 컨트롤러(SPROC-1)로부터 영상 데이터를 수신하고, 전자 기기 의 특성 또는 사용자의 설정 등에 따라 원하는 휘도로 영상이 표시되도록 영상 데이터를 보상하거나, 소비 전력 의 저감 또는 잔상 보상 등을 위해 영상 데이터를 변환할 수 있다. 감마 보정회로(SPROC-3)는 전자 기기에 표시되는 영상이 원하는 감마 특성을 갖도록 영상 데이터 또는 감마 기준 전압 등을 변환할 수 있다. 렌더링 회 로(SPROC-4)는 컨트롤러(SPROC-1)로부터 영상 데이터를 수신하고, 전자 기기에 적용되는 표시 패널(MD21)의 화소 배치 등을 고려하여 영상 데이터를 렌더링할 수 있다. 데이터 변환회로(SPROC-2), 감마 보정회로(SPROC- 3), 렌더링 회로(SPROC-4) 중 적어도 하나는 다른 구성요소(예컨대, 메인 프로세서(MPROC) 또는 컨트롤러 (SPROC-1))에 통합될 수 있다. 데이터 변환회로(SPROC-2), 감마 보정회로(SPROC-3), 렌더링 회로(SPROC-4) 중 적어도 하나는 후술하는 데이터 드라이버(MD23)에 통합될 수도 있다. 메모리(MM)는 전자 기기의 적어도 하나의 구성 요소(예컨대, 프로세서(PROC) 또는 센서 모듈(MD41))에 의해 사용되는 다양한 데이터 및, 이와 관련된 명령에 대한 입력 데이터 또는 출력 데이터를 저장할 수 있다. 메모리 (MM)는 휘발성 메모리(MM1) 및 비휘발성 메모리(MM2) 중 적어도 하나 이상을 포함할 수 있다. 입력 모듈(MD1)은 전자 기기의 구성 요소(예컨대, 프로세서(PROC), 센서 모듈(MD41) 또는 음향 출력 모듈 (MD43))에 사용될 명령 또는 데이터를 전자 기기의 외부(예컨대, 사용자 또는 외부의 전자 장치)로부터 수신할 수 있다. 입력 모듈(MD1)은 사용자로부터 명령 또는 데이터가 입력되는 제1 입력 모듈(MD11) 및 외부 전자 장치로부터 명령 또는 데이터가 입력되는 제2 입력 모듈(MD12)을 포함할 수 있다. 제1 입력 모듈(MD11)은 마이크, 마우스, 키보드, 키(예컨대, 버튼) 또는 펜(예컨대, 패시브 펜 또는 액티브 펜)을 포함할 수 있다. 제2 입력 모듈(MD1 2)은 외부 전자 장치와 유선 또는 무선으로 연결할 수 있는 지정된 프로토콜을 지원할 수 있다. 일 실시 예 에 따르면, 제2 입력 모듈(MD12)은 HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터페이스, 또는 오디오 인터페이스를 포함할 수 있다. 제2 입력 모듈(MD12)은 외부 전자 장치와 물리적으로 연결시킬 수 있는 커넥터, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예컨대, 헤드폰 커넥터)를 포함할 수 있다. 표시 모듈(MD2)은 사용자에게 시각적으로 정보를 제공한다. 표시 모듈(MD2)은 표시 패널(MD21), 스캔 드라이버 (MD22), 및 데이터 드라이버(MD23)를 포함할 수 있다. 표시 모듈(MD2)은 표시 패널(MD21)을 보호하기 위한 윈도 우, 샤시, 브라켓을 더 포함할 수 있다. 표시 패널(MD21)은 액정 표시 패널, 유기 발광 표시 패널, 또는 무기 발광 표시 패널을 포함할 수 있으며, 표시 패널(MD21)의 종류는 특별히 제한되지 않는다. 표시 패널(MD21)은 리지드 타입이거나, 롤링이 가능하거나 폴딩 이 가능한 플렉서블 타입일수 있다. 표시 모듈(MD2)은 표시 패널(MD21)을 지지하는 서포터, 브라켓, 또는 방열 부재 등을 더 포함할 수 있다. 스캔 드라이버(MD22)는 구동칩으로써 표시 패널(MD21)에 실장될 수 있다. 또한, 스캔 드라이버(MD22)는 표시 패 널(MD21)에 집적화될 수 있다. 예컨대, 스캔 드라이버(MD22)는 표시 패널(MD21)에 내제화된 ASG(Amorphous Silicon TFT Gate driver circuit), LTPS(Low Temperature Polycrystalline Silicon) TFT Gate driver circuit 또는 OSG(Oxide Semiconductor TFT Gate driver circuit)을 포함할 수 있다. 스캔 드라이버(MD22)는 컨트롤러(SPROC-1)로부터 제어 신호를 수신하고, 제어 신호에 응답하여 표시 패널(MD21)에 스캔 신호들을 출력 한다. 표시 패널(MD21)은 발광 드라이버를 더 포함할 수 있다. 발광 드라이버는 컨트롤러(SPROC-1)로부터 수신한 제어 신호에 응답하여 표시 패널(MD21)에 발광 제어 신호를 출력한다. 발광 드라이버는 스캔 드라이버(MD22)와 구별 되어 형성되거나, 스캔 드라이버(MD22)에 통합될 수 있다. 데이터 드라이버(MD23)는 컨트롤러(SPROC-1)로부터 제어 신호를 수신하고, 제어 신호에 응답하여 영상 데이터를 아날로그 전압(예컨대, 데이터 전압)으로 변환한 후 표시 패널(MD21)에 데이터 전압들을 출력한다. 데이터 드라이버(MD23)는 다른 구성요소(예컨대, 컨트롤러(SPROC-1))에 통합될 수 있다. 상술한 컨트롤러 (SPROC-1)의 인터페이스 변환 회로 및 타이밍 제어 회로의 기능은 데이터 드라이버(MD23)에 통합될 수도 있다. 표시 모듈(MD2)은 발광 드라이버 및 전압 발생회로 등을 더 포함할 수 있다. 전압 발생회로는 표시 패널(MD21) 의 구동에 필요한 각종 전압들을 출력할 수 있다. 전원 모듈(MD3)은 전자 기기의 구성 요소에 전력을 공급한다. 전원 모듈(MD3)은 전원 전압을 충전하는 배터 리를 포함할 수 있다. 배터리는 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 전원 모듈(MD3)은 PMIC(power management integrated circuit)를 포함할 수 있다. PMIC는 상술한 모 듈 및 후술하는 모듈 각각에 최적화된 전원을 공급한다. 전원 모듈(MD3)은 배터리와 전기적으로 연결된 무선 전 력 송수신 부재를 포함할 수 있다. 무선 전력 송수신 부재는 코일 형태의 복수의 안테나 방사체를 포함할 수 있 다. 전자 기기는 내장형 모듈(MD4)과 외장형 모듈(MD5)을 더 포함할 수 있다. 내장형 모듈(MD4)은 센서 모듈 (MD41), 안테나 모듈(MD42), 및 음향 출력 모듈(MD43)을 포함할 수 있다. 외장형 모듈(MD5)은 카메라 모듈 (MD51), 라이트 모듈(MD52), 및 통신 모듈(MD53)을 포함할 수 있다. 센서 모듈(MD41)은 사용자의 신체에 의한 입력 또는 제1 입력 모듈(MD11) 중 펜에 의한 입력을 감지하고, 상기 입력에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 센서 모듈(MD41)은 지문 센서(MD41-1), 입력 센 서(MD41-2), 및 디지타이저(MD41-3) 중 적어도 어느 하나 이상을 포함할 수 있다. 지문 센서(MD41-1)는 사용자의 지문에 대응하는 데이터 값을 생성할 수 있다. 지문 센서(MD41-1)는 광 방식 또 는 정전 용량 방식의 지문 센서 중 어느 하나를 포함할 수 있다. 입력 센서(MD41-2)는 사용자의 신체에 의한 입력 또는 펜에 의한 입력의 좌표 정보에 대응하는 데이터 값을 생 성할 수 있다. 입력 센서(MD41-2)는 입력에 의한 정전용량 변화량을 데이터 값으로 생성한다. 입력 센서(MD41- 2)는 패시브 펜에 의한 입력을 감지하거나, 액티브 펜과 데이터를 송수신할 수 있다. 입력 센서(MD41-2)는 혈압, 수분, 또는 체지방과 같은 생체 신호를 측정할 수도 있다. 예컨대, 사용자가 센서층 또는 센싱 패널에 신체 일부를 접촉하고 일정한 시간 동안 움직이지 않는 경우, 신체 일부에 의한 전기장 (electric field) 변화에 기초하여, 입력 센서(MD41-2)는 생체 신호를 감지하여 하여 사용자가 원하는 정보를 표시 모듈(MD2)로 출력할 수 있다. 디지타이저(MD41-3)는 펜에 의한 입력의 좌표 정보에 대응하는 데이터 값을 생성할 수 있다. 디지타이저(MD41- 3)는 입력에 의한 전자기 변화량을 데이터 값으로 생성한다. 디지타이저(MD41-3)는 패시브 펜에 의한 입력을 감 지하거나, 액티브 펜과 데이터를 송수신할 수 있다. 지문 센서(MD41-1), 입력 센서(MD41-2), 및 디지타이저(MD41-3) 중 적어도 하나는 연속공정을 통해 표시 패널 (MD21) 상에 형성된 센서층으로 구현될 수도 있다. 지문 센서(MD41-1), 입력 센서(MD41-2), 및 디지타이저 (MD41-3)는 표시 패널(MD21)의 상측에 배치될 수 있고, 지문 센서(MD41-1), 입력 센서(MD41-2), 및 디지타이저 (MD41-3) 중 어느 하나, 예컨대 디지타이저(MD41-3)는 표시 패널(MD21)의 하측에 배치될 수 있다. 지문 센서(MD41-1), 입력 센서(MD41-2), 및 디지타이저(MD41-3) 중 적어도 2 이상은 동일한 공정을 통해서 하나 의 센싱 패널로 일체화되도록 형성될 수 있다. 하나의 센싱 패널로 일체화될 경우, 센싱 패널은 표시 패널 (MD21)과 표시 패널(MD21)의 상측에 배치되는 윈도우 사이에 배치될 수 있다. 일 실시예에 따르면, 센싱 패널은 윈도우 상에 배치될 수도 있으며, 센싱 패널의 위치는 특별히 제한되지 않는다. 지문 센서(MD41-1), 입력 센서(MD41-2), 및 디지타이저(MD41-3) 중 적어도 하나는 표시 패널(MD21)에 내장될 수 있다. 즉, 표시 패널(MD21)에 포함된 소자들(예를 들어, 발광 소자, 트랜지스터 등)을 형성하는 공정을 통해 지 문 센서(MD41-1), 입력 센서(MD41-2), 및 디지타이저(MD41-3) 중 적어도 하나를 동시에 형성할 수 있다. 그밖에 센서 모듈(MD41)은 전자 기기의 내부 상태 또는 외부 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 센서 모듈(MD41)은 예를 들어 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센 서를 더 포함할 수 있다. 안테나 모듈(MD42)은 신호 또는 전력을 외부로 송신하거나 외부로부터 수신하기 위한 하나 이상의 안테나들을 포함할 수 있다. 일 실시 예에 따르면, 통신 모듈(MD53)은 통신 방식에 적합한 안테나를 통하여 신호를 외부 전 자 장치로 송신하거나, 외부 전자 장치로부터 수신할 수 있다. 안테나 모듈(MD42)의 안테나 패턴은 표시 모듈 (MD2)의 하나의 구성(예컨대 표시 패널(MD21)) 또는 입력 센서(MD41-2) 등에 일체화될 수도 있다. 음향 출력 모듈(MD43)은 음향 신호를 전자 기기의 외부로 출력하기 위한 장치로서, 예를 들면, 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용되는 스피커와 전화 수신 전용으로 사용되는 리시버를 포함할 수 있다. 일 실시 예에 따르면, 리시버는 스피커와 일체 또는 별도로 형성될 수 있다. 음향 출력 모듈(MD43)의음향 출력 패턴은 표시 모듈(MD2)에 일체화될 수도 있다. 카메라 모듈(MD51)은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시 예에 따르면, 카메라 모듈(MD51)은 하나 이상의 렌즈, 이미지 센서, 또는 이미지 시그널 프로세서를 포함할 수 있다. 카메라 모듈(MD51)은 사용자의 유 무, 사용자의 위치, 사용자의 시선 등을 측정할 수 있는 적외선 카메라를 더 포함할 수 있다. 라이트 모듈(MD52)은 광을 제공할 수 있다. 라이트 모듈(MD52)은 발광 다이오드 또는 제논 램프(xenon lamp)를 포함할 수 있다. 라이트 모듈(MD52)은 카메라 모듈(MD51)과 연동하여 동작하거나 독립적으로 동작할 수 있다. 통신 모듈(MD53)은 전자 기기와 외부 전자 장치 사이의 유선 또는 무선 통신 채널의 수립, 및 수립된 통 신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈(MD53)은 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또 는 GNSS(global navigation satellite system) 통신 모듈과 같은 무선 통신 모듈과 LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈과 같은 유선 통신 모듈 중 어는 하나를 포함하거나 모두 포함할 수 있다. 통 신 모듈(MD53)은 블루투스, WiFi direct 또는 IrDA(infrared data association) 같은 근거리 통신 네트워크 또 는 셀룰러 네트워크, 인터넷, 또는 컴퓨터 네트워크(예컨대, LAN 또는 WAN)와 같은 원거리 통신 네트워크를 통 하여 외부 전자 장치와 통신할 수 있다. 상술한 여러 종류의 통신 모듈(MD53)은 하나의 칩으로 구현되거나 또는 각각 별도의 칩으로 구현될 수 있다. 입력 모듈(MD1), 센서 모듈(MD41), 카메라 모듈(MD51) 등은 프로세서(PROC)와 연동하여 표시 모듈(MD2)의 동작 을 제어하는데 활용될 수 있다. 프로세서(PROC)는 입력 모듈(MD1)로부터 수신된 입력 데이터에 근거하여, 표시 모듈(MD2), 음향 출력 모듈 (MD43), 카메라 모듈(MD51), 또는 라이트 모듈(MD52)에 명령 또는 데이터를 출력한다. 예컨대, 프로세서(PROC) 는 마우스 또는 액티브 펜 등을 통해 인가된 입력 데이터에 대응하여 영상 데이터를 생성하여 표시 모듈(MD2)에 출력하거나, 입력 데이터에 대응하여 명령 데이터를 생성하여 카메라 모듈(MD51) 또는 라이트 모듈(MD52)에 출 력할 수 있다. 프로세서(PROC)는 입력 모듈(MD1)로부터 일정 시간동안 입력 데이터가 수신되지 않을 경우, 전자 기기의 동작 모드를 저전력 모드 또는 슬립 모드(sleep mode)로 전환시켜 전자 기기에서 소비되는 전력을 저감시킬 수 있다. 프로세서(PROC)는 센서 모듈(MD41)로부터 수신된 센싱 데이터에 근거하여, 표시 모듈(MD2), 음향 출력 모듈 (MD43), 카메라 모듈(MD51), 또는 라이트 모듈(MD52)에 명령 또는 데이터를 출력한다. 예컨대, 프로세서(PROC) 는 지문 센서(MD41-1)에 의해 인가된 인증 데이터를 메모리(MM)에 저장된 인증 데이터와 비교한 후, 비교 결과 에 따라 어플리케이션을 실행할 수 있다. 프로세서(PROC)는 입력 센서(MD41-2) 또는 디지타이저(MD41-3)에 의해 감지된 센싱 데이터에 근거하여 명령을 실행하거나 대응하는 영상 데이터를 표시 모듈(MD2)에 출력할 수 있다. 센서 모듈(MD41)에 온도 센서가 포함되는 경우, 프로세서(PROC)는 센서 모듈(MD41)로부터 측정된 온도에 대한 온도 데이터를 수신하고, 온도 데이터를 근거로 영상 데이터에 대한 휘도 보정 등을 더 실시할 수 있다. 프로세서(PROC)는 카메라 모듈(MD51)로부터 사용자의 유무, 사용자의 위치, 사용자의 시선 등에 대한 측정 데이 터를 수신할 수 있다. 프로세서(PROC)는 측정 데이터를 근거로 영상 데이터에 대한 휘도 보정 등을 더 실시할 수 있다. 예컨대, 카메라 모듈(MD51)로부터의 입력을 통해 사용자의 유무를 판단한 프로세서(PROC)는 데이터 변 환회로(SPROC-2) 또는 감마 보정회로(SPROC-3)를 통해 휘도가 보정된 영상 데이터를 표시 모듈(MD2)에 출력할 수 있다. 상기 구성 요소들 중 일부 구성 요소들은 주변 기기들간 통신 방식, 예컨대, 버스, GPIO(general purpose input/output), SPI(serial peripheral interface), MIPI(mobile industry processor interface), 또는 UPI(Ultra path interconnect) 링크를 통해 서로 연결되어 신호(예컨대, 명령 또는 데이터)를 상호간에 교환할 수 있다. 프로세서(PROC)는 표시 모듈(MD2)과 서로 약속된 인터페이스로 통신할 수 있으며, 예컨대, 상술한 통 신 방식 중 어느 하나를 이용할 수 있고, 상술한 통신 방식에 제한되지 않는다. 본 문서에 개시된 다양한 실시 예들에 따른 전자 기기는 다양한 형태의 장치가 될 수 있다. 전자 기기는, 예를 들면, 휴대용 통신 장치 (예컨대, 스마트 폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨어러블 장치, 또는 가전 장치 중 적어도 하나를 포함할 수 있다. 본 문서의 실시 예에 따른 전자 기 기는 전술한 기기들에 한정되지 않는다. 이상에서 본 발명의 실시예에 대하여 상세하게 설명하였지만 본 발명의 권리범위는 이에 한정되는 것은 아니고 다음의 청구범위에서 정의하고 있는 본 발명의 기본 개념을 이용한 당업자의 여러 변형 및 개량 형태 또한 본발명의 권리범위에 속하는 것이다."}
{"patent_id": "10-2023-0077375", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 의한 발광 표시 장치에서 발광 소자 및 레이저 드릴링 위치를 도시한 평면도이다. 도 2 내지 도 5는 도 1의 실시예에 따른 변형 발광층의 평면 모양을 설명하는 도면이다. 도 6은 비교예에서 발광층 간의 간격을 설명하는 도면이다. 도 7은 도 1의 실시예에서 발광층 간의 간격을 설명하는 도면이다. 도 8 및 도 9는 각 비교예와 실시예에 대한 특징을 보여주는 표이다. 도 10은 일 실시예에 의한 발광 표시 장치의 단면도이다. 도 11 내지 도 23은 각 변형 실시예를 상세하게 보여주는 도면이다. 도 24은 일 실시예에 의한 발광 표시 장치의 발광 소자 하부의 개략 평면도이다. 도 25는 일 실시예에 의한 발광 표시 장치의 화소의 회로도이다. 도 26은 본 발명의 실시예들에 따른 전자 기기의 블록도이다."}
