{"patent_id": "10-2023-0139139", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0011870", "출원번호": "10-2023-0139139", "발명의 명칭": "실측연산이 적용된 시설물 상태평가 시스템", "출원인": "우리기술 주식회사", "발명자": "이석현"}}
{"patent_id": "10-2023-0139139", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "시설물 관리자가 직접 이동하면서 육안으로 관리가 가능한 시설물인 유인 감시용 시설물(A1)의 관리를 위해, 시설물 관리자가 탑승하는 것으로, 전력 또는 화석연료를 이용하여 구동시키는 구동부()가 구비되고, 상기 구동부()를 운전조작하는 운전조작부()가 구비된 본체(510), 상기 본체(510) 상에 구비되어 시설물 관리자가 탑승하는작업대(520), 상기 작업대(520)와 상기 본체(510) 사이에 연결되어 상기 작업대(520)를 상승 또는 하강시키는승강부(530), 상기 작업대(520)에 설치되는 장비측 카메라(540), GPS위성으로부터 경도와 위도를 포함하는 장비측 위치좌표정보를 기지정된 주기마다 수신하는 GPS수신부(550), 상기 본체(510)에 설치되는 장비측 정보출력부(560), 정보를 송수신하는 인터페이스 기능을 수행하는 장비측 무선통신부(571) 및 장비측 무선통신부(571)를통해 유인시설물 검사정보신호가 중계전송되면, 그 중계전송된 유인시설물 검사정보신호에서 육안검사 수행영역별 작업대 위치좌표를 추출하고, 기지정주기마다 수신되는 상기 장비측 위치좌표정보를 참조하여, 추출된 상기육안검사 수행영역별 작업대 위치좌표로 이동시키는 이동좌표인 장비측 이동위치좌표정보를 기지정주기마다 생성하여 상기 정보출력부(560)를 통해 출력하며, 상기 장비측 이동위치좌표정보가 상기 육안검사 수행영역별 작업대 위치좌표와 일치하면, 상기 장비측 카메라(540)를 구동제어하고, 상기 장비측 이동위치좌표정보가 상기 육안검사 수행영역별 작업대 위치좌표에서 벗어나면, 상기 장비측 카메라(540)의 구동이 종료되도록 제어하여 유인시설물 영상정보가 생성되도록 제어하며, 위치연산모듈(591)을 운영하여, 그 생성된 유인시설물 영상정보 내에서 레이저광의 점멸 변화 또는 색상 변화가 존재하면, 이를 검출 후 상기 육안검사 수행영역별 작업대 위치좌표와 일치된 상기 장비측 이동위치좌표정보를 토대로 레이저광의 위치를 연산하여, 조사된 레이저광의 평면좌표인 종류별 손상위치좌표 및 종류별 손상면적을 생성하며, 그 생성된 종류별 손상위치좌표, 종류별 손상면적 및상기 유인시설물 영상정보를 포함하는 유인시설물 검사획득신호를 장비측 무선통신부(571)를 통해 무선전송되도록 제어하는 장비측 제어부(590)를 포함하는 고소작업장비(500)와; 유인 감시용 시설물(A1) 및 무인 감시용 시설물(A2)을 포함하는 시설물의 위치가 행정구역으로 구분되어 표시되는 시설물 행정구역 위치, 시설물의 종류를 나타내는 시설물 종류정보, 시설물을 완공한 일자를 나타내는 시설물 완공일자, 유인 감시용 시설물(A1)을 식별하는 유인시설물 식별자 및 무인 감시용 시설물(A2)을 식별하는 무인시설물 식별자를 포함하는 시설물 식별자로 이루어진 시설물 설명정보와, 유인 감시용 시설물(A1)의 외관형상이 전자도면으로 표시되는 유인감시용 시설물 도면, 상기 유인감시용 시설물 도면에 표시되는 것으로, 유인 감시용 시설물(A1)을 육안검사를 수행하기 위한 영역으로 구분하되, 유인 감시용 시설물(A1)에 배치되는 고소작업장비(500)에서 승강되는 작업대(520)에 시설물 관리자가 탑승하여 육안 검사 시 작업대(520)의 좌측 및 우측에서 관찰가능한 영역으로 구분되는 육안검사 수행영역(A11,A12,A13), 상기 육안검사 수행영역(A11,A12,A13)마다상기 작업대(520)가 위치하는 위치좌표인 육안검사 수행영역별 작업대 위치좌표 및 상기 유인감시용 시설물 도면에 표시되는 것으로, 개개의 육안검사 수행영역(A11,A12,A13)마다 구비되어, 육안검사 수행영역(A11,A12,A13)을 식별하는 육안검사 수행영역별 식별자로 이루어진 유인감시용 시설물 도면정보가 시설물별로 구분되어 저장관리되는 시설물 관리정보 DB(411), 종류별 손상면적이 발생된 유인 감시용 시설물(A1)의 육안검사 수행영역(A11,A12,A13)을 촬영한 유인시설물 영상정보 및 무인 감시용 시설물(A2)의 안전검사를 위해 해당 무인 감시용시설물(A2)을 이루는 검사수행 시설물구획(A21,A22,A23,A24)을 촬영한 영상인 무인시설물 영상정보를 포함하는시설물 영상정보가 누적 저장되는 시설물별 시설물 영상정보 DB(412), 종류별 손상면적에 해당하는 손상의명칭, 종류별 손상면적이 발생된 유인 감시용 시설물(A1)의 육안검사 수행영역(A11,A12,A13)를 식별하는 육안검사 수행영역별 식별자정보, 육안검사 수행영역별 작업대 위치좌표와 일치된 장비측 이동위치좌표정보를 토대로연산된 조사된 레이저광의 평면좌표인 종류별 손상위치좌표, 종류별 손상면적이 기록된 유인시설물 손상리스트정보를 포함하는 시설물 손상리스트정보가 시설물별로 구분되어 저장관리되는 시설물별 손상 리스트정보DB(413)가 구비된 DB부(410)를 포함하고, 유인 감시용 시설물(A1)을 식별하는 식별자인 유인시설물 식별자를 포함하는 것으로, 유인 감시용 시설물(A1)의 시설물 검사 시 필요한 유인 감시용 시설물(A1)의 정보를 요청하는유인시설물 검사정보 요청신호가 무선전송되면, 상기 유인시설물 검사정보 요청신호에 포함된 유인시설물 식별자를 DB부(410)와 매칭하여, 해당 유인 감시용 시설물(A1)의 시설물 설명정보 및 유인감시용 시설물 도면정보를추출하고, 그 추출된 시설물 설명정보 및 유인감시용 시설물 도면정보를 포함하는 유인시설물 검사정보신호로가공하고, 그 가공된 유인시설물 검사정보신호를 무선전송하며, 무선전송되는 육안검사 수행영역별 식별자정보공개특허 10-2025-0011870-4-및 종류별 손상이 취합된 유인시설물 검사획득신호를 상기 DB부(410)에 누적관리하는 시설물 관리서버(400)와; 상기 시설물 관리서버(400)에 접속하여, 유인 감시용 시설물(A1)의 육안검사를 수행하고자 하는 해당 유인 감시용 시설물(A1)을 식별하는 유인시설물 식별자를 포함하는 것으로, 유인 감시용 시설물(A1)의 시설물 검사 시 필요한 유인 감시용 시설물(A1)의 정보를 요청하는 유인시설물 검사정보 요청신호를 무선전송하고, 무선전송되는유인시설물 검사정보신호를 상기 고소작업장비(500)로 중계전송하며, 상기 고소작업장비(500)로부터 유인시설물검사획득신호를 무선전송받고, 그 무선전송된 유인시설물 검사획득신호에 종류별 손상면적이 발생된 유인 감시용 시설물(A1)의 육안검사 수행영역(A11,A12,A13)에 해당하는 육안검사 수행영역별 식별자정보 및 종류별 손상면적에 해당하는 손상의 명칭을 나타내는 종류별 손상을 취합시키며, 육안검사 수행영역별 식별자정보 및 종류별 손상이 취합된 유인시설물 검사획득신호를 상기 시설물 관리서버(400)로 전송하는 시설물관리자단말(600)과; 손에 파지가 가능한 핸들몸체(701), 상기 핸들몸체(701)에 설치되어, 레이저광 출력의 개시를 요청하는 광출력개시요청신호를 생성하는 광출력 개시버튼(712) 및 레이저광 출력의 종료를 요청하는 광출력 종료요청신호를 생성하는 광출력 종료버튼(713)을 포함하는 포인터측 정보입력부(710), 상기 핸들몸체(701)에 설치되어, 유인 감시용 시설물(A1) 쪽으로 레이저광을 출력하는 레이저출력부(720) 및 상기 광출력 개시요청신호가 생성되면, 상기 레이저출력부(720)를 구동제어하고, 상기 레이저출력부(720)를 통해 출력되는 레이저광을 일정주기로 점멸시키거나 2 이상의 색상들이 일정주기마다 번갈아 출력되도록 제어하며, 상기 광출력 종료요청신호가 생성되면,상기 레이저출력부(720)의 구동이 종료되도록 제어하는 포인터측 제어부(730)를 포함하는 레이저 포인터(700);를 포함하는 것을 특징으로 하는 실측연산이 적용된 유인 감시용 시설물 및 무인 감시용 시설물의 상태평가 시스템."}
{"patent_id": "10-2023-0139139", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 무인 감시용 시설물(A2)에 설치되는 것으로, 태양광을 이용하여 전기를 생산하는 태양광모듈(101), 상기 태양광모듈(101)로부터 생산되는 전기가 충전되는 배터리부(103), 상기 무인 감시용 시설물(A2)의 검사수행 시설물구획(A21,A22,A23,A24)마다 기설정된 간격으로 고정설치되고, 그 고정설치된 검사수행 시설물구획(A21,A22,A23,A24)의 위치를 나타내는 시설물구획 설치좌표정보를 갖는 시설물영역별 스캐너(105)들, 유선을 통해 통신인터페이스 기능을 수행하는 시설물측 유선통신부(109)가 구비되는 무인시설물 위치특정부재(100)와; 시설물 설명정보, 무인시설물 손상리스트정보 및 병합 시설물별 공간이동경로정보를 포함하는 통신 음영지역 대비용 자율주행 제어신호를 무선전송받아, 드론측 정보저장부(240)에 저장관리하고, 기설정주기마다 수신되는 드론작동 제어신호에 의해 상기 무인 감시용 시설물(A2)을 이루는 검사수행 시설물구획(A21,A22,A23,A24)을 따라비행하면서 카메라(220)를 통해 손상영역(DZ)을 촬영하여, 무인시설물 영상정보를 생성하고, 상기 생성된 무인시설물 영상정보를 실시간으로 무선전송하는 드론(200)과; 시설물 영상을 촬영하고자 하는 해당 무인 감시용 시설물(A2)을 식별하는 식별자인 무인시설물 식별자를 포함하는 통신 음영지역 대비용 자율주행정보 요청신호를 무선전송하고, 무선전송되는 시설물 설명정보, 무인시설물손상리스트정보 및 병합 시설물별 공간이동경로정보를 포함하는 통신 음영지역 대비용 자율주행 제어신호를 상기 드론(200)으로 무선전송하며, 기설정주기마다 드론작동 제어신호를 상기 드론(200)으로 무선전송하여 구동제어하고, 상기 드론(200)으로부터 무인시설물 영상정보를 실시간으로 무선전송받으며, 유선을 통해 통신인터페이스 기능을 수행하는 운영측 유선통신부(320)가 구비되는 드론제어장치(300);를 더 포함하고, 상기 시설물 관리서버(400)에서, 상기 드론제어장치(300)로부터 통신 음영지역 대비용 자율주행정보 요청신호가무선전송되면, 통신 음영지역 대비용 자율주행정보 요청신호에 포함된 무인시설물 식별자를 DB부(410)와 매칭하여, 해당 무인 감시용 시설물(A2)의 시설물 설명정보, 무인시설물 손상리스트정보 및 병합 시설물별 공간이동경로정보를 추출하고, 그 추출된 시설물 설명정보, 무인시설물 손상리스트정보 및 병합 시설물별 공간이동경로정보를 포함하는 통신 음영지역 대비용 자율주행 제어신호로 가공하여, 상기 드론제어장치(300)로 무선전송하며, 상기 드론(200)에서, 상기 드론제어장치(300)와 전파수신이 어려운 통신 음영지역에 위치되면, 통신 음영지역에위치된 것을 인식하고, 자신이 위치하는 평면의 위치를 나타내는 드론위치특정 평면좌표정보를 생성하여, 자신이 위치하는 해당 검사수행 시설물구획(A21,A22,A23,A24)을 인식하고, 공개특허 10-2025-0011870-5-상기 드론(200)에서, 자신이 위치하는 곳의 수직높이인 승강 수직위치좌표를 연산하고, 상기 드론위치특정 평면좌표정보와 상기 승강 수직위치좌표를 토대로 자신의 공간위치를 나타내는 드론 공간위치 좌표정보를 생성하며, 상기 드론(200)에서, 드론 공간위치 좌표정보를 토대로 상기 무인 감시용 시설물(A2)을 이루는 개개의 검사수행시설물구획(A21,A22,A23,A24) 중 자신이 위치하는 검사수행 시설물구획(A21,A22,A23,A24)을 인식한 상태에서,드론측 정보저장부(240)에 저장된 병합 시설물별 공간이동경로정보를 토대로, 자신이 위치하는 검사수행 시설물구획(A21,A22,A23,A24)부터 마지막 검사수행 시설물구획(A21,A22,A23,A24)까지 기지정된 공간이동경로로 각 검사수행 시설물구획(A21,A22,A23,A24)을 카메라(220)를 통해 촬영하여, 통신 음영지역에서도 자율적으로 무인시설물 영상정보를 생성하고, 상기 생성되는 무인시설물 영상정보를 드론측 정보저장부(240)에 저장하며, 마지막검사수행 시설물구획(A21,A22,A23,A24)까지 무인시설물 영상정보의 생성을 완료한 후 상기 드론제어장치(300)로복귀하는 것을 특징으로 하는 실측연산이 적용된 유인 감시용 시설물 및 무인 감시용 시설물의 상태평가시스템."}
{"patent_id": "10-2023-0139139", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 시설물 관리정보 DB(411)의 시설물 설명정보에는, 무인 감시용 시설물(A2)을 이루는 각 검사수행 시설물구획(A21,A22,A23,A24)의 표면에 설치된 조도센서(113)의 위치를 나타내는 좌표인 구획별 조도센서 설치좌표 및무인 감시용 시설물(A2)을 이루는 각 검사수행 시설물구획(A21,A22,A23,A24)의 표면 하부에 설치된 레이저 발광부(111)의 수직높이를 나타내는 구획별 발광부 수직위치 좌표를 포함하여 저장관리되고, 상기 시설물별 손상 리스트정보 DB(413)에는, 무인 감시용 시설물(A2)을 이루는 각 검사수행 시설물구획(A21,A22,A23,A24)에 존재하는 종류별로 구분되는 손상인 종류별 손상, 해당 종류별 손상이 해당 검사수행 시설물구획(A21,A22,A23,A24)에 위치하는 좌표인 종류별 손상위치좌표, 해당 종류별 손상의 면적을 나타내는 종류별손상면적, 해당 손상 종류에 최적화된 조명밝기를 나타내는 손상유형별 조명밝기값, 해당 종류별 손상면적의 크기에 따라 점등되는 LED램프의 개수를 나타내는 손상면적별 조명 점등 개수, 손상면적에 따라 해당 검사수행 시설물구획(A21,A22,A23,A24)의 손상표면과 드론 사이의 촬영거리를 나타내는 촬영이격거리가 기록된 무인시설물손상리스트정보를 포함하여 저장관리되며, 상기 DB부(410)에는, 전국각지의 시설물 중 유인 감시용 시설물(A1)에서 기존에 발생된 종류별 손상이 촬영된영상정보인 종류별 손상 유인시설물영상정보들 및 전국각지의 시설물 중 무인 감시용 시설물(A2)에서 기존에 발생된 종류별 손상이 촬영된 영상정보인 종류별 손상 무인시설물영상정보들을 포함하는 종류별 손상 시설물영상정보들이 손상 종류별로 구분되어 저장관리하는 종류별 손상 시설물 영상정보 DB(414)와; 상기 시설물별 시설물 영상정보 DB(412)에 누적저장관리되는 무인시설물 영상정보 중 직전에 저장된 해당 무인감시용 시설물(A2)의 무인시설물 영상정보에 종류별 손상추적모델(431)을 이용하여, 해당 무인 감시용 시설물(A2)을 이루는 각 검사수행 시설물구획(A21,A22,A23,A24)에 존재하는 손상을 종류별로 탐색하고, 탐색된 종류별로 구분되는 손상인 종류별 손상이 위치하는 좌표인 종류별 손상위치좌표를 획득하며, 해당 종류별 손상의 연산된 면적값인 종류별 손상면적을 획득하고, 상기 종류별 손상, 상기 종류별 손상위치좌표 및 상기 종류별 손상면적을 이용하여, 상기 무인 감시용 시설물(A2)을 이루는 개개의 검사수행 시설물구획(A21,A22,A23,A24)을 기지정된 순서로 시설물영상 촬영을 위한 드론(200)의 이동경로인 인공지능기반 시설물별 공간이동경로정보를 형성하되, 상기 무인 감시용 시설물(A2)을 이루는 개개의 검사수행 시설물구획(A21,A22,A23,A24) 중 종류별 손상이 발생된 검사수행 시설물구획(A21,A22,A23,A24)은 종류별 손상이 발생된 영역에서 해당 종류별 손상의 확장 가능한영역을 예측한 인공지능 확장예측영역까지 이동하는 인공지능기반 시설물별 공간이동경로정보가 누적 저장관리되는 인공지능기반 시설물별 공간이동경로정보 DB(415)와; 해당 무인 감시용 시설물(A2)을 이루는 개개의 검사수행 시설물구획(A21,A22,A23,A24)을 기지정된 순서로 촬영한 상기 무인시설물 영상정보를 토대로 시설물 관리자에 의해 구동제어된 드론(200)의 이동경로인 인적기반 시설물별 공간이동경로정보를 형성하되, 상기 무인 감시용 시설물(A2)을 이루는 개개의 검사수행 시설물구획(A21,A22,A23,A24) 중 종류별 손상이 발생된 검사수행 시설물구획(A21,A22,A23,A24)은 종류별 손상이 발생된 영역에서 시설물 관리자가 예측한 해당 종류별 손상의 확장 가능한 인적 확장예측영역까지 이동하는 인적기반 시설물별 공간이동경로정보가 누적 저장관리되는 인적기반 시설물별 공간이동경로정보 DB(416)와; 공개특허 10-2025-0011870-6-해당 시설물의 무인시설물 영상정보를 토대로 형성된 상기 인공지능기반 시설물별 공간이동경로정보에 구비되는드론(200)의 이동경로 중 인공지능 확장예측영역과 상기 인적기반 시설물별 공간이동경로정보에 구비되는 드론(200)의 이동경로 중 인적 확장예측영역을 대비하여 다른 경로가 존재하는 경우 상기 인공지능 확장예측영역과다른 상기 인적 확장예측영역의 부분을 상기 인공지능 확장예측영역에 병합하여 병합 확장예측영역으로 가공하고, 상기 가공된 병합 확장예측영역을 상기 인공지능기반 시설물별 공간이동경로정보에 반영한 병합 시설물별공간이동경로정보가 누적 저장관리되는 병합 시설물별 공간이동경로정보 DB(417);를 더 포함하는 것을 특징으로하는 실측연산이 적용된 유인 감시용 시설물 및 무인 감시용 시설물의 상태평가 시스템."}
{"patent_id": "10-2023-0139139", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 시설물 관리서버(400)에는, 딥러닝엔진(420); 및 손상예측경로 추적엔진(430);을 포함하고, 상기 딥러닝엔진(420)은, 상기 종류별 손상 시설물 영상정보 DB(414)에 저장관리되는 종류별 손상 무인시설물영상정보들을 인공신경망(CNN)을 통해 기계학습하여 종류별 손상추적모델(431)을 생성하고, 이를 상기 손상예측경로 추적엔진(430)에 탑재되도록 제어하는 것을 특징으로 하는 실측연산이 적용된 유인 감시용 시설물 및 무인감시용 시설물의 상태평가 시스템."}
{"patent_id": "10-2023-0139139", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 손상예측경로 추적엔진(430)은, 상기 시설물별 시설물 영상정보 DB(412)에 누적저장관리되는 무인시설물영상정보 중 직전에 저장된 해당 무인 감시용 시설물(A2)의 무인시설물 영상정보에 탑재된 종류별 손상추적모델(431)을 이용하여, 해당 무인 감시용 시설물(A2)을 이루는 각 검사수행 시설물구획(A21,A22,A23,A24)에 존재하는 손상을 종류별로 탐색하고, 탐색된 종류별로 구분되는 손상인 종류별 손상이 위치하는 좌표인 종류별 손상위치좌표를 획득하며, 해당 종류별 손상의 연산된 면적값인 종류별 손상면적을 획득하고, 해당 손상 종류에 최적화된 조명밝기를 나타내는 손상유형별 조명밝기값을 설정하며, 해당 종류별 손상면적의 크기에 따라 점등되는LED램프의 개수를 나타내는 손상면적별 조명 점등 개수를 설정하고, 손상면적에 따라 해당 검사수행 시설물구획(A21,A22,A23,A24)의 손상표면과 드론 사이의 촬영거리를 나타내는 촬영이격거리를 설정하고, 확인된 각 정보를무인시설물 손상리스트정보로 가공하여 상기 시설물별 손상 리스트정보 DB(413)에 시설물별로 구분하여 누적 저장관리되도록 제어하며, 상기 종류별 손상, 상기 종류별 손상위치좌표 및 상기 종류별 손상면적을 이용하여, 상기 무인 감시용 시설물(A2)을 이루는 개개의 검사수행 시설물구획(A21,A22,A23,A24)을 기지정된 순서로 시설물영상 촬영을 위한 드론(200)의 이동경로인 인공지능기반 시설물별 공간이동경로정보를 형성하되, 상기 무인 감시용 시설물(A2)을 이루는 개개의 검사수행 시설물구획(A21,A22,A23,A24) 중 종류별 손상이 발생된 검사수행 시설물구획(A21,A22,A23,A24)은 종류별 손상이 발생된 영역에서 해당 종류별 손상의 확장 가능한 영역을 예측한인공지능 확장예측영역까지 이동하는 인공지능기반 시설물별 공간이동경로정보가 상기 인공지능기반 시설물별공간이동경로정보 DB(415)에 누적 저장관리되도록 제어하는 것을 특징으로 하는 실측연산이 적용된 유인 감시용시설물 및 무인 감시용 시설물의 상태평가 시스템."}
{"patent_id": "10-2023-0139139", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 시설물 관리서버(400)에는, 시설물 관리엔진(440);을 더 포함하고, 상기 시설물 관리엔진(440)은, 상기 시설물별 시설물 영상정보 DB(412)에 저장된 무인시설물 영상정보 중 직전에 저장된 무인시설물 영상정보를 토대로, 시설물 관리자에 의해 구동제어된 드론(200)의 이동경로인 인적기반시설물별 공간이동경로정보를 형성하되, 무인 감시용 시설물(A2)을 이루는 개개의 검사수행 시설물구획(A21,A22,A23,A24) 중 종류별 손상이 발생된 검사수행 시설물구획(A21,A22,A23,A24)은 종류별 손상이 발생된 영역에서 시설물 관리자가 예측한 해당 종류별 손상의 확장 가능한 인적 확장예측영역까지 이동하는 인적기반 시공개특허 10-2025-0011870-7-설물별 공간이동경로정보를 형성하고, 이를 상기 인적기반 시설물별 공간이동경로정보 DB(416)에 누적 저장관리되도록 제어하는 것을 특징으로 하는 실측연산이 적용된 유인 감시용 시설물 및 무인 감시용 시설물의 상태평가시스템."}
{"patent_id": "10-2023-0139139", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 시설물 관리엔진(440)은, 상기 인공지능기반 시설물별 공간이동경로정보 DB(415) 및 인적기반 시설물별 공간이동경로정보 DB(416)에 저장된 정보 중 직전에 저장된 동일한 무인 감시용 시설물(A2)에 해당하는 인공지능기반 시설물별 공간이동경로정보에 구비되는 드론(200)의 이동경로 중 인공지능 확장예측영역과 인적기반 시설물별 공간이동경로정보에 구비되는 드론(200)의 이동경로 중 인적 확장예측영역을 대비하여 다른 경로가 존재하는 경우 상기 인공지능 확장예측영역과 다른 상기 인적 확장예측영역의 부분을 상기 인공지능 확장예측영역에병합하여 병합 확장예측영역으로 가공하고, 상기 가공된 병합 확장예측영역을 상기 인공지능기반 시설물별 공간이동경로정보에 반영한 병합 시설물별 공간이동경로정보로 재설정하고, 이를 상기 병합 시설물별 공간이동경로정보 DB(417)에 누적 저장관리되도록 제어하는 것을 특징으로 하는 실측연산이 적용된 유인 감시용 시설물 및무인 감시용 시설물의 상태평가 시스템."}
{"patent_id": "10-2023-0139139", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 시설물 관리자가 유인 감시용 시설물과 무인 감시용 시설물을 함께 유지관리 가능하게 안내하여 줄 뿐 만 아니라 유인 감시용 시설물에서 시설물의 영역 위치를 자동으로 인지하고, 시설물 관리자가 육안검사 중 발견 된 손상 위치를 지정하면, 그 지정된 시설물의 영역 위치를 실측으로 연산하여, 이를 자동으로 등록하고, 무인 (뒷면에 계속)"}
{"patent_id": "10-2023-0139139", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 시설물 관리자가 유인 감시용 시설물과 무인 감시용 시설물을 함께 유지관리 가능하게 안내하여 줄 뿐만 아니라 유인 감시용 시설물에서 시설물의 영역 위치를 자동으로 인지하고, 시설물 관리자가 육안검사 중 발견된 손상 위치를 지정하면, 그 지정된 시설물의 영역 위치를 실측으로 연산하여, 이를 자동으로 등록하고, 무인 감시용 시설물의 통신 음영지역에 진입한 드론이 자신이 위치하는 공간위치를 스스로 인지하고, 원격지에 서 원격제어 없이도 스스로 시설물 안전검사를 위한 시설물의 각 구획을 영상 촬영가능하게 안내하는 실측연산 이 적용된 시설물 상태평가 시스템에 관한 것이다."}
{"patent_id": "10-2023-0139139", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 시설물은 크게 교량, 터널, 항만, 댐, 건축물, 하천, 상하수도, 옹벽 및 절토사면, 공동구로 분류 되며, 각각은 구조형식과 규모에 따라서 제1종 시설물과 제2종 시설물로 분류된다. 이러한 시설물은 안전한 사용을 위해 점검 및 유지관리가 매우 중요한데, 종래에 있어 시설물 유지관리는 인력 기반 방식으로서, 급경사지(사면), 고가 교량, 댐 체제 등 인력이 접근하기 힘든 시설은 라펠(Rappel) 또는 고 소차 등을 이용해 직접 점검하고 있다. 그러나, 종래와 같은 인력기반 방식의 점검은 비용과 시간이 많이 소요됨은 물론 육안검사로 인한 효율성이 떨 어지고 장비 탑승 으로 인해 추락 및 충돌 등 안전사고 발생 우려가 높은 문제점이 있었다. 이에, 최근에는 인력기반 방식의 시설물 유지관리 방법과 계측 데이터에 대한 신뢰성을 보완하기 위해 시설물에 접촉 또는 내장된 센서를 활용한 구조물 모니터링 시스템이 제안된 바 있다. 하지만, 이러한 센서를 통한 시설물 점검 및 유지관리 방식은 센서의 설치 영역 주변으로 검사 영역이 제한되는 한계점으로 지적되고 있다. 또한, 2018년 1월 18일 시행된 ‘시설물의 안전 및 유지관리에 관한 특별법’은 기존 중대형 규모의 시설물뿐만 아니라 소규모 시설물까지 전문가의 안전관리를 받도록 규정하고 있으며, 기존 제1종 및 제2종 시설물과 더불어 신규 제3종 시설물에 대한 안전점검 및 유지관리까지 실시하여야 한다. 즉, 시설물 관리자가 제3종 시설물 중 하천, 옹벽, 절토사면과 같이 소형 규모의 시설로서 시설물 관리자가 직 접 이동하면서 해당 시설물을 촬영하여 실측으로 관리 가능한 시설물인 유인 감시용 시설물을 관리하는 기능과 더불어 제1종 및 제2종 시설물 중 교량, 터널, 항만, 상하수도, 댐과 같이 중대형 규모의 시설로서 시설물 관리 자가 직접 이동하면서 시설물을 촬영하여 실측으로 관리하지 못하는 시설물인 무인 감시용 시설물도 관리하는기능을 함께 수행가능한 장치의 유리관리 운영시스템이 요구되고 있는 실정이다. 한편, 유인 감시용 시설물은 시설물 관리자가 사다리차를 통해 이동하면서, 육안점검을 수행하는데, 이러한 외 관조사에서는 시설물의 파손 및 외관 상태 등의 확인이 주목적으로, 시설물의 위험도가 확인된 경우 이를 종이 도면 또는 전자도면에 위험도가 확인된 영역 위치를 직접 입력하여, 시설물의 상태평가를 수행하는 자료로 활용 하는 바 자료입력과정이 시설물 관리자에 의한 수기로 입력되어, 시간이 오래 소요될 뿐만 아니라 그 정확성 또 한 반감되는 문제점이 있다. 이와 더불어, 무인 감시용 시설물의 안전 진단을 위해 드론(특허문헌 1 참조)을 이용하는 추세에 있지만, 이 또 한, 터널, 지하철, 공동구와 같은 전파수신이 어려운 통신 음영지역의 적용 사례가 전무하다는 한계가 있다. 이는 드론이 통신 음영지역에서 진입한 경우 촬영되는 영상정보의 전송이 불가능하여, 드론의 원격제어 자체가 불가능하기 때문이다. 이에 따라, 시설물 관리자가 유인 감시용 시설물과 무인 감시용 시설물을 함께 유지관리하여 주는 시스템의 구 현과 더불어 유인 감시용 시설물에서 시설물 관리자가 위험도가 확인된 시설물의 영역 위치를 지정하면, 실시간 으로 그 지정된 시설물의 영역 위치를 실측으로 연산하여, 이를 자동으로 등록하고, 무인 감시용 시설물의 통신 음영지역에 진입한 드론이 자신이 위치하는 공간위치를 스스로 인지하고, 원격지에서 원격제어 없이도 스스로 시설물 안전검사를 위한 시설물의 각 구획을 영상 촬영가능하게 안내하는 시스템의 필요성이 대두되었다. 선행기술문헌 특허문헌 (특허문헌 0001) KR 10-2018-0038595 A"}
{"patent_id": "10-2023-0139139", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기 종래기술의 문제점을 해결하기 위한 것으로, 본 발명의 목적은 시설물 관리자가 유인 감시용 시 설물과 무인 감시용 시설물을 함께 유지관리 가능하게 안내하여 줄 뿐만 아니라 유인 감시용 시설물에서 시설물 의 영역 위치를 자동으로 인지하고, 시설물 관리자가 육안검사 중 발견된 손상 위치를 지정하면, 그 지정된 시 설물의 영역 위치를 실측으로 연산하여, 이를 자동으로 등록하고, 무인 감시용 시설물의 통신 음영지역에 진입 한 드론이 자신이 위치하는 공간위치를 스스로 인지하고, 원격지에서 원격제어 없이도 스스로 시설물 안전검사 를 위한 시설물의 각 구획을 영상 촬영가능하게 안내하는 실측연산이 적용된 시설물 상태평가 시스템을 제공하 는데 있다."}
{"patent_id": "10-2023-0139139", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명을 달성하기 위한 기술적 사상으로 본 발명의 실측연산이 적용된 시설물 상태평가 시스템은, 시설물 관 리자가 직접 이동하면서 육안으로 관리가 가능한 시설물인 유인 감시용 시설물의 관리를 위해, 시설물 관리자가 탑승하는 것으로, 전력 또는 화석연료를 이용하여 구동시키는 구동부가 구비되고, 상기 구동부를 운전조작하는 운전조작부가 구비된 본체, 상기 본체 상에 구비되어 시설물 관리자가 탑승하는 작업대, 상기 작업대와 상기 본 체 사이에 연결되어 상기 작업대를 상승 또는 하강시키는 승강부, 상기 작업대에 설치되는 장비측 카메라, GPS 위성으로부터 경도와 위도를 포함하는 장비측 위치좌표정보를 기지정된 주기마다 수신하는 GPS수신부, 상기 본 체에 설치되는 장비측 정보출력부, 정보를 송수신하는 인터페이스 기능을 수행하는 장비측 무선통신부 및 장비 측 무선통신부를 통해 유인시설물 검사정보신호가 중계전송되면, 그 중계전송된 유인시설물 검사정보신호에서 육안검사 수행영역별 작업대 위치좌표를 추출하고, 기지정주기마다 수신되는 상기 장비측 위치좌표정보를 참조 하여, 추출된 상기 육안검사 수행영역별 작업대 위치좌표로 이동시키는 이동좌표인 장비측 이동위치좌표정보를 기지정주기마다 생성하여 상기 정보출력부를 통해 출력하며, 상기 장비측 이동위치좌표정보가 상기 육안검사 수 행영역별 작업대 위치좌표와 일치하면, 상기 장비측 카메라를 구동제어하고, 상기 장비측 이동위치좌표정보가상기 육안검사 수행영역별 작업대 위치좌표에서 벗어나면, 상기 장비측 카메라의 구동이 종료되도록 제어하여 유인시설물 영상정보가 생성되도록 제어하며, 위치연산모듈을 운영하여, 그 생성된 유인시설물 영상정보 내에서 레이저광의 점멸 변화 또는 색상 변화가 존재하면, 이를 검출 후 상기 육안검사 수행영역별 작업대 위치좌표와 일치된 상기 장비측 이동위치좌표정보를 토대로 레이저광의 위치를 연산하여, 조사된 레이저광의 평면좌표인 종 류별 손상위치좌표 및 종류별 손상면적을 생성하며, 그 생성된 종류별 손상위치좌표, 종류별 손상면적 및 상기 유인시설물 영상정보를 포함하는 유인시설물 검사획득신호를 장비측 무선통신부를 통해 무선전송되도록 제어하 는 장비측 제어부를 포함하는 고소작업장비와; 유인 감시용 시설물 및 무인 감시용 시설물을 포함하는 시설물의 위치가 행정구역으로 구분되어 표시되는 시설물 행정구역 위치, 시설물의 종류를 나타내는 시설물 종류정보, 시 설물을 완공한 일자를 나타내는 시설물 완공일자, 유인 감시용 시설물을 식별하는 유인시설물 식별자 및 무인 감시용 시설물을 식별하는 무인시설물 식별자를 포함하는 시설물 식별자로 이루어진 시설물 설명정보와, 유인 감시용 시설물의 외관형상이 전자도면으로 표시되는 유인감시용 시설물 도면, 상기 유인감시용 시설물 도면에 표시되는 것으로, 유인 감시용 시설물을 육안검사를 수행하기 위한 영역으로 구분하되, 유인 감시용 시설물에 배치되는 고소작업장비에서 승강되는 작업대에 시설물 관리자가 탑승하여 육안 검사 시 작업대의 좌측 및 우측 에서 관찰가능한 영역으로 구분되는 육안검사 수행영역, 상기 육안검사 수행영역마다 상기 작업대가 위치하는 위치좌표인 육안검사 수행영역별 작업대 위치좌표 및 상기 유인감시용 시설물 도면에 표시되는 것으로, 개개의 육안검사 수행영역마다 구비되어, 육안검사 수행영역을 식별하는 육안검사 수행영역별 식별자로 이루어진 유인 감시용 시설물 도면정보가 시설물별로 구분되어 저장관리되는 시설물 관리정보 DB, 종류별 손상면적이 발생된 유인 감시용 시설물의 육안검사 수행영역을 촬영한 유인시설물 영상정보 및 무인 감시용 시설물의 안전검사를 위해 해당 무인 감시용 시설물을 이루는 검사수행 시설물구획을 촬영한 영상인 무인시설물 영상정보를 포함하는 시설물 영상정보가 누적 저장되는 시설물별 시설물 영상정보 DB, 종류별 손상면적에 해당하는 손상의 명칭, 종 류별 손상면적이 발생된 유인 감시용 시설물의 육안검사 수행영역를 식별하는 육안검사 수행영역별 식별자정보, 육안검사 수행영역별 작업대 위치좌표와 일치된 장비측 이동위치좌표정보를 토대로 연산된 조사된 레이저광의 평면좌표인 종류별 손상위치좌표, 종류별 손상면적이 기록된 유인시설물 손상리스트정보를 포함하는 시설물 손 상리스트정보가 시설물별로 구분되어 저장관리되는 시설물별 손상 리스트정보 DB가 구비된 DB부를 포함하고, 유 인 감시용 시설물을 식별하는 식별자인 유인시설물 식별자를 포함하는 것으로, 유인 감시용 시설물의 시설물 검 사 시 필요한 유인 감시용 시설물의 정보를 요청하는 유인시설물 검사정보 요청신호가 무선전송되면, 상기 유인 시설물 검사정보 요청신호에 포함된 유인시설물 식별자를 DB부와 매칭하여, 해당 유인 감시용 시설물의 시설물 설명정보 및 유인감시용 시설물 도면정보를 추출하고, 그 추출된 시설물 설명정보 및 유인감시용 시설물 도면정 보를 포함하는 유인시설물 검사정보신호로 가공하고, 그 가공된 유인시설물 검사정보신호를 무선전송하며, 무선 전송되는 육안검사 수행영역별 식별자정보 및 종류별 손상이 취합된 유인시설물 검사획득신호를 상기 DB부에 누 적관리하는 시설물 관리서버와; 상기 시설물 관리서버에 접속하여, 유인 감시용 시설물의 육안검사를 수행하고 자 하는 해당 유인 감시용 시설물을 식별하는 유인시설물 식별자를 포함하는 것으로, 유인 감시용 시설물의 시 설물 검사 시 필요한 유인 감시용 시설물의 정보를 요청하는 유인시설물 검사정보 요청신호를 무선전송하고, 무 선전송되는 유인시설물 검사정보신호를 상기 고소작업장비로 중계전송하며, 상기 고소작업장비로부터 유인시설 물 검사획득신호를 무선전송받고, 그 무선전송된 유인시설물 검사획득신호에 종류별 손상면적이 발생된 유인 감 시용 시설물의 육안검사 수행영역에 해당하는 육안검사 수행영역별 식별자정보 및 종류별 손상면적에 해당하는 손상의 명칭을 나타내는 종류별 손상을 취합시키며, 육안검사 수행영역별 식별자정보 및 종류별 손상이 취합된 유인시설물 검사획득신호를 상기 시설물 관리서버로 전송하는 시설물 관리자단말과; 손에 파지가 가능한 핸들몸 체, 상기 핸들몸체에 설치되어, 레이저광 출력의 개시를 요청하는 광출력 개시요청신호를 생성하는 광출력 개시 버튼 및 레이저광 출력의 종료를 요청하는 광출력 종료요청신호를 생성하는 광출력 종료버튼을 포함하는 포인터 측 정보입력부, 상기 핸들몸체에 설치되어, 유인 감시용 시설물 쪽으로 레이저광을 출력하는 레이저출력부 및 상기 광출력 개시요청신호가 생성되면, 상기 레이저출력부를 구동제어하고, 상기 레이저출력부를 통해 출력되는 레이저광을 일정주기로 점멸시키거나 2 이상의 색상들이 일정주기마다 번갈아 출력되도록 제어하며, 상기 광출 력 종료요청신호가 생성되면, 상기 레이저출력부의 구동이 종료되도록 제어하는 포인터측 제어부를 포함하는 레 이저 포인터;를 포함한다. 본 발명의 실측연산이 적용된 시설물 상태평가 시스템에는, 상기 고소작업장비의 본체에서 승강되는 작업대에 설치되는 것으로, 기설정 주기마다 지면과 작업대 사이의 높이를 감지하여, 높이감지신호를 생성하고, 그 생성 된 높이감지신호를 기설정 주기마다 상기 고소작업장비로 무선전송하는 수직측 거리감지센서;를 더 포함하고, 상기 장비측 제어부는, 상기 유인시설물 검사정보신호가 중계전송되면, 상기 수직측 거리감지센서로부터 무선전 송되는 높이감지신호에 해당하는 지면과 작업대 사이의 높이를 상기 장비측 위치좌표정보에 반영하여 보정하는기능을 수행한다. 본 발명의 실측연산이 적용된 시설물 상태평가 시스템에는, 상기 고소작업장비의 작업대에 설치되는 것으로, 고 소작업장비의 작업대와 유인 감시용 시설물의 육안검사 수행영역 사이의 수평거리를 감지하여, 수평거리 감지신 호를 생성하고, 그 생성된 수평거리 감지신호를 기설정 주기마다 상기 고소작업장비로 무선전송하는 수평측 거 리감지센서;를 더 포함하며, 상기 장비측 제어부는, 상기 유인시설물 검사정보신호가 중계전송되면, 상기 수평 측 거리감지센서로부터 무선전송되는 수평거리 감지신호에 해당하는 작업대와 유인 감시용 시설물의 육안검사 수행영역 사이의 수평거리를 상기 장비측 위치좌표정보에 반영하여 보정하는 기능을 수행한다. 본 발명의 실측연산이 적용된 시설물 상태평가 시스템에는, 무인 감시용 시설물에 설치되는 것으로, 태양광을 이용하여 전기를 생산하는 태양광모듈, 상기 태양광모듈로부터 생산되는 전기가 충전되는 배터리부, 상기 무인 감시용 시설물의 검사수행 시설물구획마다 기설정된 간격으로 고정설치되고, 그 고정설치된 검사수행 시설물구 획의 위치를 나타내는 시설물구획 설치좌표정보를 갖는 시설물영역별 스캐너들, 유선을 통해 통신인터페이스 기 능을 수행하는 시설물측 유선통신부가 구비되는 무인시설물 위치특정부재와; 시설물 설명정보, 무인시설물 손상 리스트정보 및 병합 시설물별 공간이동경로정보를 포함하는 통신 음영지역 대비용 자율주행 제어신호를 무선전 송받아, 드론측 정보저장부에 저장관리하고, 기설정주기마다 수신되는 드론작동 제어신호에 의해 상기 무인 감 시용 시설물을 이루는 검사수행 시설물구획을 따라 비행하면서 카메라를 통해 손상영역을 촬영하여, 무인시설물 영상정보를 생성하고, 상기 생성된 무인시설물 영상정보를 실시간으로 무선전송하는 드론과; 시설물 영상을 촬 영하고자 하는 해당 무인 감시용 시설물을 식별하는 식별자인 무인시설물 식별자를 포함하는 통신 음영지역 대 비용 자율주행정보 요청신호를 무선전송하고, 무선전송되는 시설물 설명정보, 무인시설물 손상리스트정보 및 병 합 시설물별 공간이동경로정보를 포함하는 통신 음영지역 대비용 자율주행 제어신호를 상기 드론으로 무선전송 하며, 기설정주기마다 드론작동 제어신호를 상기 드론으로 무선전송하여 구동제어하고, 상기 드론으로부터 무인 시설물 영상정보를 실시간으로 무선전송받으며, 유선을 통해 통신인터페이스 기능을 수행하는 운영측 유선통신 부가 구비되는 드론제어장치;를 더 포함하고, 상기 시설물 관리서버에서, 상기 드론제어장치로부터 통신 음영지 역 대비용 자율주행정보 요청신호가 무선전송되면, 통신 음영지역 대비용 자율주행정보 요청신호에 포함된 무인 시설물 식별자를 DB부와 매칭하여, 해당 무인 감시용 시설물의 시설물 설명정보, 무인시설물 손상리스트정보 및 병합 시설물별 공간이동경로정보를 추출하고, 그 추출된 시설물 설명정보, 무인시설물 손상리스트정보 및 병합 시설물별 공간이동경로정보를 포함하는 통신 음영지역 대비용 자율주행 제어신호로 가공하여, 상기 드론제어장 치로 무선전송하며, 상기 드론에서, 상기 드론제어장치와 전파수신이 어려운 통신 음영지역에 위치되면, 통신 음영지역에 위치된 것을 인식하고, 자신이 위치하는 평면의 위치를 나타내는 드론위치특정 평면좌표정보를 생성 하여, 자신이 위치하는 해당 검사수행 시설물구획을 인식하고, 상기 드론에서, 자신이 위치하는 곳의 수직높이 인 승강 수직위치좌표를 연산하고, 상기 드론위치특정 평면좌표정보와 상기 승강 수직위치좌표를 토대로 자신의 공간위치를 나타내는 드론 공간위치 좌표정보를 생성하며, 상기 드론에서, 드론 공간위치 좌표정보를 토대로 상 기 무인 감시용 시설물을 이루는 개개의 검사수행 시설물구획 중 자신이 위치하는 검사수행 시설물구획을 인식 한 상태에서, 드론측 정보저장부에 저장된 병합 시설물별 공간이동경로정보를 토대로, 자신이 위치하는 검사수 행 시설물구획부터 마지막 검사수행 시설물구획까지 기지정된 공간이동경로로 각 검사수행 시설물구획을 카메라 를 통해 촬영하여, 통신 음영지역에서도 자율적으로 무인시설물 영상정보를 생성하고, 상기 생성되는 무인시설 물 영상정보를 드론측 정보저장부에 저장하며, 마지막 검사수행 시설물구획까지 무인시설물 영상정보의 생성을 완료한 후 상기 드론제어장치로 복귀하는 기능을 수행한다."}
{"patent_id": "10-2023-0139139", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 시설물 관리자가 유인 감시용 시설물과 무인 감시용 시설물을 함께 유지관리 가능하게 안내하여 줄 뿐만 아니라 유인 감시용 시설물에서 시설물의 영역 위치를 자동으로 인지하고, 시설물 관리자가 육안검사 중 발견된 손상 위치를 지정하면, 그 지정된 시설물의 영역 위치를 실측으로 연산하여, 이를 자동으로 등록하고, 무인 감시용 시설물의 통신 음영지역에 진입한 드론이 자신이 위치하는 공간위치를 스스로 인지하고, 원격지에 서 원격제어 없이도 스스로 시설물 안전검사를 위한 시설물의 각 구획을 영상 촬영가능하게 안내하는 영상을 기 반으로 하는 효과를 발휘한다. 또한, 본 발명은 원격지에서 드론을 이용하여 시설물 안전검사 수행 시 전파수신이 어려운 통신 음영지역에서도 무인 감시용 시설물 안전검사 수행을 위해 무인 감시용 시설물을 구분하는 검사수행 시설물구획에 존재하는 손 상을 자율적으로 촬영하는 드론이 최적의 조명 밝기로 촬영가능하게 안내하여 주는 효과도 있다. 또한, 본 발명은 원격지에서 드론을 이용하여 무인 감시용 시설물 안전검사 수행 시 전파수신이 어려운 통신 음 영지역에서도 무인 감시용 시설물 안전검사 수행을 위해 시설물을 구분하는 검사수행 시설물구획에 존재하는 손 상을 자율적으로 촬영하는 드론이 최적의 촬영거리를 유지하며 촬영가능하게 안내하여 주는 효과도 있다. 또한, 본 발명은 본 발명은 원격지에서 드론을 이용하여 무인 감시용 시설물 안전검사 수행 시 전파수신이 어려 운 통신 음영지역에서도 무인 감시용 시설물 안전검사 수행을 위해 시설물을 구분하는 검사수행 시설물구획에 존재하는 손상을 자율적으로 촬영하는 드론이 시설물을 구분하는 검사수행 시설물구획에 발생된 손상의 영역이 어느 방향 쪽으로 확장되었는지를 예측하고, 그 예측된 확장예측영역도 촬영하여 보다 정확한 시설물 안전검사 를 수행할 수 있게 유도하여 주는 효과도 있다."}
{"patent_id": "10-2023-0139139", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술 되어 있는 실 시예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서 로 다른 다양한 형태로 구현될 것이며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하며, 본 발명이 속하"}
{"patent_id": "10-2023-0139139", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명 은 청구항의 기재에 의해 정의된다. 한편, 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한 다(comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성소자, 단계, 동작 및/또는 소자에 하나 이상의 다른 구성소자, 단계, 동작 및/또는 소자의 존재 또는 추가함을 배제하지 않는다. 이하, 첨부된 도면을 참조하 여 본 발명의 실시예를 상세히 설명하기로 한다. 도 1 내지 도 7에 도시된 바와 같이, 시설물 관리자가 유인 감시용 시설물(A1)과 무인 감시용 시설물(A2) 중 제 3종 시설물인 것으로, 하천, 옹벽, 교량, 절토사면과 같이 소형 규모의 시설로서, 시설물의 영역 위치를 자동으로 인지하고, 시설물 관리자가 육안검사 중 발견된 손상 위치를 지정하면, 그 지정된 시설물의 영역 위치를 실 측으로 연산하여, 이를 자동으로 등록하는 과정으로 유인 감시용 시설물(A1)의 검사를 수행하도록, 본 발명의 실측연산이 적용된 시설물 상태평가 시스템은 크게 시설물 관리서버, 고소작업장비, 시설물 관리자단 말 및 레이저 포인터가 구비되어진다. 먼저, 고소작업장비는 시설물 관리자가 유인 감시용 시설물(A1)에서 직접 이동이 가능하게 즉, 시설물 관 리자가 탑승한 상태로 유인 감시용 시설물(A1)에서 전후 및 좌우 이동과 더불어 상승이나 하강 가능하게 안내하 여 주고, 시설물의 영역 위치를 자동으로 인지하여 시설물 관리자가 인지할 수 있게 안내하며, 시설물 관리자가 육안검사 중 발견된 손상 위치를 지정하면, 그 지정된 시설물의 영역 위치를 실측으로 연산하는 차량부재이다. 이러한 기능을 수행하는 고소작업장비의 세부구성은 본체, 작업대, 승강부, 장비측 카메라 , GPS수신부, 장비측 정보출력부, 장비측 무선통신부, 위치연산모듈 및 장비측 제어 부로 이루어진다. 먼저, 본체는 이동이 가능하게 바퀴가 구비되고, 전력 또는 화석연료를 이용하여 구동시키는 구동부() 및 구동부()를 운전조작하는 운전조작부()를 포함한다. 여기서, 운전조작부()는 핸들을 적용하여 사용할 수 있으며, 조이스틱이나 리모콘 등 다양한 조작부재를 적용할 수 있다. 상기 작업대는 시설물 관리자가 탑승하는 부재로서, 탑승하는 시설물 관리자의 안전을 위해 난간이 사방측 면으로 설치되어 제공될 수 있다. 상기 승강부는 작업대와 본체 사이에 연결되어 작업대를 상승 또는 하강시키는 부재로서, 일예로, 다수개의 리프트암이 서로 힌지 결합으로 연결되고, 특정 리프트 암에 승강실린더가 연결되어, 승강기 능을 수행가능하게 안내하여 준다. 상기 장비측 카메라는 유인 감시용 시설물(A1)을 이루는 육안검사 수행영역(A11,A12,A13)을 촬영하도록, 작업대에 설치되는 부재이다. 상기 GPS수신부는 GPS위성으로부터 경도와 위도를 포함하는 장비측 위치좌표정보인 본체의 위치를 기 지정된 주기마다 수신하는 부재이다. 상기 장비측 정보출력부는 육안검사 수행영역(A11,A12,A13) 및 육안검사 수행영역별 식별자정보가 표시되 는 유인감시용 시설물 도면정보와 같이, 시설물 관리자가 본체()에 탑승한 상태에서 직접 이동하면서, 위험도가 확인된 시설물의 영역 위치를 지정하면, 실시간으로 그 지정된 시설물의 영역 위치를 실측으로 연산하여, 이를 자동으로 등록하는 과정을 수행하는데 필요한 각종 정보가 출력되는 부재로서, 스피커 및 디스플레이부로 이루 어질 수 있다. 여기서, 디스플레이부의 경우에는 액정 디스플레이(liquid crystal display, LCD), 박막 트랜지스터 액정 디스 플레이(thin film transistor-liquid crystal display, TFT LCD), 유기 발광 다이오드(organic light-emitting diode, OLED), 플렉시블 디스플레이(flexible display), 3차원 디스플레이(3D display) 등 다양한 출력부재가 선택 적용되어질 수 있다. 상기 장비측 정보저장부는 육안검사 수행영역(A11,A12,A13) 및 육안검사 수행영역별 식별자정보가 표시되 는 유인감시용 시설물 도면정보와 같이, 시설물 관리자가 직접 이동하면서, 위험도가 확인된 시설물의 영역 위 치를 지정하면, 실시간으로 그 지정된 시설물의 영역 위치를 실측으로 연산하여, 이를 자동으로 등록하는 과정 을 수행하는데 필요한 각종 정보가 저장되는 부재이다. 이와 같은, 기능을 수행하는 장비측 정보저장부는 플래시 메모리 타입(flash memory type), 하드디스크 타 입(hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(Random Access Memory, RAM), SRAM(Static Random Access Memory), 롬(Read- Only Memory, ROM), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 하나 또는 이들의 조합으로 이루어질 수 있다. 상기 장비측 무선통신부는 해당 유인 감시용 시설물(A1)의 시설물 설명정보 및 유인감시용 시설물 도면정 보를 추출하고, 그 추출된 시설물 설명정보 및 유인감시용 시설물 도면정보를 포함하는 유인시설물 검사정보신 호와 같은 각종 정보를 후술되는 시설물 관리자단말로부터 무선전송받는 통신 인터페이스 기능을 수행하는부재로서, LTE, WiMAX, 3G, WiFi와 같은 다양한 무선통신모듈을 혼용하여 사용할 수 있다. 상기 위치연산모듈은 유인시설물 영상정보 내에서 레이저광의 점멸 변화 또는 색상 변화가 존재하면, 이를 검출 후 육안검사 수행영역별 작업대 위치좌표와 일치된 장비측 이동위치좌표정보를 토대로 레이저광의 위치를 연산하여, 조사된 레이저광의 평면좌표인 종류별 손상위치좌표 및 종류별 손상면적을 생성하는 응용프로그램 부 재이다. 상기 장비측 제어부는 장비측 무선통신부를 통해 유인시설물 검사정보신호가 중계전송되면, 그 중계 전송된 유인시설물 검사정보신호에서 육안검사 수행영역별 작업대 위치좌표를 추출하고, 기지정주기마다 수신되 는 장비측 위치좌표정보를 참조하여, 추출된 육안검사 수행영역별 작업대 위치좌표로 이동시키는 이동좌표인 장 비측 이동위치좌표정보를 기지정주기마다 생성하여 정보출력부를 통해 출력하며, 장비측 이동위치좌표정보 가 육안검사 수행영역별 작업대 위치좌표와 일치하면, 장비측 카메라를 구동제어하고, 장비측 이동위치좌 표정보가 육안검사 수행영역별 작업대 위치좌표에서 벗어나면, 장비측 카메라의 구동이 종료되도록 제어하 여 유인시설물 영상정보가 생성되도록 제어하며, 위치연산모듈을 운영하여, 그 생성된 유인시설물 영상정 보 내에서 레이저광의 점멸 변화 또는 색상 변화가 존재하면, 이를 검출 후 육안검사 수행영역별 작업대 위치좌 표와 일치된 장비측 이동위치좌표정보를 토대로 레이저광의 위치를 연산하여, 조사된 레이저광의 평면좌표인 종 류별 손상위치좌표 및 종류별 손상면적을 생성하며, 그 생성된 종류별 손상위치좌표, 종류별 손상면적 및 유인 시설물 영상정보를 포함하는 유인시설물 검사획득신호를 장비측 무선통신부를 통해 무선전송되도록 제어하 는 제어부재이다. 여기서, 장비측 제어부는 장비측 이동위치좌표정보가 육안검사 수행영역별 작업대 위치좌표에서 벗어난 이 후에 다음번째 육안검사 수행영역별 작업대 위치좌표와 기지정주기마다 수신되는 장비측 위치좌표정보가 일치하 면, 장비측 카메라를 구동제어를 반복함으로써, 각 육안검사 수행영역(A11,A12,A13)마다 유인시설물 영상 정보가 생성되도록 제어하는 기능을 수행한다. 상기 시설물 관리서버는 시설물 관리자가 직접 이동하면서, 육안검사 중 발견된 손상 위치를 지정하면, 그 지정된 시설물의 영역 위치를 실측으로 연산하여, 이를 자동으로 등록하는 과정을 수행하는데 필요한 각종 정보 를 제공하여 주는 서버부재이다. 이러한 기능을 수행하는 시설물 관리서버에는 유인 감시용 시설물(A1) 및 무인 감시용 시설물(A2)을 포함 하는 시설물의 위치가 행정구역으로 구분되어 표시되는 시설물 행정구역 위치, 시설물의 종류를 나타내는 시설 물 종류정보, 시설물을 완공한 일자를 나타내는 시설물 완공일자, 유인 감시용 시설물(A1)을 식별하는 유인시설 물 식별자 및 무인 감시용 시설물(A2)을 식별하는 무인시설물 식별자를 포함하는 시설물 식별자로 이루어진 시 설물 설명정보와, 유인 감시용 시설물(A1)의 외관형상이 전자도면으로 표시되는 유인감시용 시설물 도면, 유인 감시용 시설물 도면에 표시되는 것으로, 유인 감시용 시설물(A1)을 육안검사를 수행하기 위한 영역으로 구분하 되, 유인 감시용 시설물(A1)에 배치되는 고소작업장비에서 승강되는 작업대에 시설물 관리자가 탑승 하여 육안 검사 시 작업대의 좌측 및 우측에서 관찰가능한 영역으로 구분되는 육안검사 수행영역 (A11,A12,A13), 육안검사 수행영역(A11,A12,A13)마다 작업대가 위치하는 위치좌표인 육안검사 수행영역별 작업대 위치좌표 및 유인감시용 시설물 도면에 표시되는 것으로, 개개의 육안검사 수행영역(A11,A12,A13)마다 구비되어, 육안검사 수행영역(A11,A12,A13)을 식별하는 육안검사 수행영역별 식별자로 이루어진 유인감시용 시 설물 도면정보가 시설물별로 구분되어 저장관리되는 시설물 관리정보 DB, 종류별 손상면적이 발생된 유인 감시용 시설물(A1)의 육안검사 수행영역(A11,A12,A13)을 촬영한 유인시설물 영상정보 및 무인 감시용 시설물 (A2)의 안전검사를 위해 해당 무인 감시용 시설물(A2)을 이루는 검사수행 시설물구획(A21,A22,A23,A24)을 촬영 한 영상인 무인시설물 영상정보를 포함하는 시설물 영상정보가 누적 저장되는 시설물별 시설물 영상정보 DB, 종류별 손상면적에 해당하는 손상의 명칭, 종류별 손상면적이 발생된 유인 감시용 시설물(A1)의 육안 검사 수행영역(A11,A12,A13)를 식별하는 육안검사 수행영역별 식별자정보, 육안검사 수행영역별 작업대 위치좌 표와 일치된 장비측 이동위치좌표정보를 토대로 연산된 조사된 레이저광의 평면좌표인 종류별 손상위치좌표, 종 류별 손상면적이 기록된 유인시설물 손상리스트정보를 포함하는 시설물 손상리스트정보가 시설물별로 구분되어 저장관리되는 시설물별 손상 리스트정보 DB가 구비된 DB부를 포함한다. 이를 통해, 시설물 관리서버는 유인 감시용 시설물(A1)을 식별하는 식별자인 유인시설물 식별자를 포함하 는 것으로, 유인 감시용 시설물(A1)의 시설물 검사 시 필요한 유인 감시용 시설물(A1)의 정보를 요청하는 유인 시설물 검사정보 요청신호가 시설물 관리자단말로부터 무선전송되면, 유인시설물 검사정보 요청신호에 포 함된 유인시설물 식별자를 DB부와 매칭하여, 해당 유인 감시용 시설물(A1)의 시설물 설명정보 및 유인감시용 시설물 도면정보를 추출하고, 그 추출된 시설물 설명정보 및 유인감시용 시설물 도면정보를 포함하는 유인시 설물 검사정보신호로 가공하고, 그 가공된 유인시설물 검사정보신호를 시설물 관리자단말로 무선전송하며, 시설물 관리자단말로부터 무선전송되는 육안검사 수행영역별 식별자정보 및 종류별 손상이 취합된 유인시 설물 검사획득신호를 DB부에 누적관리하는 기능을 수행한다. 즉, 시설물 관리서버는 유인시설물 검사획득신호를 이루는 정보 중 육안검사 수행영역별 식별자정보, 종류 별 손상, 종류별 손상위치좌표, 종류별 손상면적의 정보는 시설물별 손상 리스트정보 DB에 누적저장하고, 유인시설물 검사획득신호를 이루는 정보 중 유인시설물 영상정보는 시설물별 시설물 영상정보 DB에 누적저 장한다. 상기 시설물 관리자단말은 시설물 관리자가 직접 이동하면서, 위험도가 확인된 시설물의 영역 위치를 지정 하면, 실시간으로 그 지정된 시설물의 영역 위치를 실측으로 연산하여, 이를 자동으로 등록하는데 필요한 일련 의 정보를 시설물 관리서버로부터 무선전송받아 고소작업장비로 중계전송하고, 고소작업장비로 부터 무선전송되는 유인시설물 검사획득신호에 정보를 취합하여 시설물 관리서버로 중계전송하는 단말부재 로서, 시설물 관리서버에 접속하여, 유인 감시용 시설물(A1)의 육안검사를 수행하고자 하는 해당 유인 감 시용 시설물(A1)을 식별하는 유인시설물 식별자를 포함하는 것으로, 유인 감시용 시설물(A1)의 시설물 검사 시 필요한 유인 감시용 시설물(A1)의 정보를 요청하는 유인시설물 검사정보 요청신호를 무선전송하고, 무선전송되 는 유인시설물 검사정보신호를 고소작업장비로 중계전송하며, 고소작업장비로부터 유인시설물 검사획 득신호를 무선전송받고, 그 무선전송된 유인시설물 검사획득신호에 종류별 손상면적이 발생된 유인 감시용 시설 물(A1)의 육안검사 수행영역(A11,A12,A13)에 해당하는 육안검사 수행영역별 식별자정보 및 종류별 손상면적에 해당하는 손상의 명칭을 나타내는 종류별 손상을 취합시키며, 육안검사 수행영역별 식별자정보 및 종류별 손상 이 취합된 유인시설물 검사획득신호를 시설물 관리서버로 전송하는 기능을 수행한다. 여기서, 종류별 손상면적에 해당하는 손상의 명칭을 나타내는 종류별 손상의 경우 시설물 관리자가 육안검사를 수행한 후 시설물 관리자단말에 구비된 단말측 정보입력부를 조작하여 입력하고, 육안검사 수행영역 별 식별자정보 또한 선택하여 유인시설물 검사획득신호에 취합할 수 있다. 그리고 시설물 관리자단말은 시설물 관리서버에 프로그레시브 웹 앱 기반으로 접속한다. 이처럼, 시설물 관리자단말가 시설물 관리서버에 프로그레시브 웹 앱 기반으로 접속하는 주된 이유는 유인 감시용 시설물(A1)을 포함하는 토목 시설물의 원활한 유지관리를 수행하고자 별도의 프로그램 설치 없이 웹 기동만으로 시설물 관리자가 쉽게 손상을 관리할 수 있는 체계를 구축함과 더불어 복수의 시설물 관리자 간 에 실시간으로 협업을 수행하는 실시간 네트워크 기반의 스마트 상태평가 플랫폼을 제공하기 위함이다. 이를 통해, 유인시설물 영상정보를 포함하는 유인시설물 검사획득신호인 점검 결과물을 시설물 관리서버에 자동으로 반영하고, 유인 감시용 시설물(A1)의 현장에서 실시간으로 손상의 수정 및 보완을 간편하게 진행할 수 있게 제공한다. 이에 따라, 시설물 관리자가 유인 감시용 시설물(A1)과 무인 감시용 시설물(A2) 중 유인 감시용 시설물(A1)을 포함하는 토목 시설물의 검사를 수행하는 본 발명의 실측연산이 적용된 시설물 상태평가 시스템은 기존에 종이 도면으로 손상 항목을 관리하거나 윈도우즈 응용 프로그램으로 프로젝트 데이터를 여러 작업자 간 동시에 동기 화해야 하는 문제점을 해소하여 주고, 현장에서 사무실로 복귀하여 다시 도면을 열람하고 손상 항목을 수정하는 번거로운 작업 없이 바로 현장에서 안전 점검 작업이 이루어질 수 있게 안내하여 주며, 프로그레시브 웹 앱 기 반의 하이브리드 융합기술로 별도의 프로그램 설치 없이 토목 시설물의 상태평가를 진행할 수 있는 기술의 도입 으로, 손상 항목의 간편한 입력, 손상 항목의 템플릿 입력 지원(일예로, 일반 균열이나 면적 손상 종류), 상태 평가 등급 실시간 계산, 점검 결과 자동 이력 반영을 수행가능하게 하는 이점을 제공한다. 이러한 기능을 수행하는 시설물 관리자단말에는 영상촬영부, 단말측 정보입력부, 단말측 정보저 장부, 단말측 정보출력부, 단말측 무선통신부 및 단말측 제어부가 구비되어진다. 먼저, 영상촬영부는 시설물 관리자가 필요에 따라 유인 감시용 시설물(A1)을 촬영할 수 있도록 인출 및 인 입이 가능한 렌즈가 탑재되어질 수 있고, 해상도 또한, 적어도 1000만 화소 정도의 고해상도가 적용되는 것이 바람직하다. 이러한 기능을 수행하는 영상촬영부는 통상적으로, 촬영된 광신호를 전기적 신호로 변환하는 카메라 센서 및 카메라 센서로부터 촬영되는 아날로그 영상신호를 디지털 데이터로 변환하는 신호처리부가 구비된다. 여기서 카메라 센서는 CCD(Charge Coupled Device) 센서를 주로 사용하며, 신호처리부는 DSP(Digital SignalProcessor: DSP)로 구현할 수 있다. 또한 카메라 센서 및 신호처리부는 일체형으로 구현하거나 또는 분리하여 구현하는 등 다양하게 적용하여 구현할 수도 있다. 상기 단말측 정보입력부는 시설물 관리자가 종류별 손상면적에 해당하는 손상의 명칭을 나타내는 종류별 손상과 같이 각종 정보를 입력하기 위해 필요한 시설물 관리자단말의 동작 제어를 수행하는 부재이다. 이 러한 단말측 정보입력부에는 키패드(key pad) 돔스위치 (dome switch), 터치패드(정압/정전), 조그휠, 조 그 스위치, 터치펜 등이 조합되어 구성될 수 있다. 상기 단말측 정보저장부는 시설물 관리자가 종류별 손상면적에 해당하는 손상의 명칭을 나타내는 종류별 손상과 같이 각종 정보가 저장되는 부재이다. 이와 같은, 기능을 수행하는 단말측 정보저장부는 플래시 메모리 타입(flash memory type), 하드디스크 타 입(hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(Random Access Memory, RAM), SRAM(Static Random Access Memory), 롬(Read- Only Memory, ROM), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 하나 또는 이들의 조합으로 이루어질 수 있다. 상기 단말측 정보출력부는 시설물 관리자가 종류별 손상면적에 해당하는 손상의 명칭을 나타내는 종류별 손상과 같이 각종 정보가 출력되는 부재로서, 스피커 및 디스플레이부로 이루어질 수 있다. 여기서, 디스플레이부의 경우에는 액정 디스플레이(liquid crystal display, LCD), 박막 트랜지스터 액정 디스 플레이(thin film transistor-liquid crystal display, TFT LCD), 유기 발광 다이오드(organic light-emitting diode, OLED), 플렉시블 디스플레이(flexible display), 3차원 디스플레이(3D display) 등 다양한 출력부재가 선택 적용되어질 수 있다. 상기 단말측 무선통신부는 육안검사를 수행하고자 하는 해당 유인 감시용 시설물(A1)을 식별하는 식별자인 시설물 식별자를 포함하는 것으로, 유인 감시용 시설물(A1)의 시설물 검사 시 필요한 유인 감시용 시설물(A1)의 정보를 요청하는 유인시설물 검사정보 요청신호와 같은 각종 정보를 무선전송받고, 이를 다시 중계전송하는 통 신 인터페이스 기능을 수행하는 부재로서, LTE, WiMAX, 3G, WiFi와 같은 다양한 무선통신모듈을 혼용하여 사용 할 수 있다. 상기 단말측 제어부는 시설물 관리자가 직접 이동하면서, 위험도가 확인된 시설물의 영역 위치를 지정하면, 실시간으로 그 지정된 시설물의 영역 위치를 실측으로 연산하여, 이를 자동으로 등록하는데 필요한 일련의 정보를 시설물 관리서버로부터 무선전송받아 고소작업장비로 중계전송하고, 고소작업장비 로부터 무선전송되는 유인시설물 검사획득신호에 정보를 취합하여 시설물 관리서버로 중계전송하는 것과 같은 일련의 과정을 수행하는데 필요한 시설물 관리자단말의 전반적인 동작을 제어하는 기능을 수행 하는 부재이다. 상기 레이저 포인터는 손에 파지가 가능한 핸들몸체, 핸들몸체에 설치되어, 레이저광 출력의 개 시를 요청하는 광출력 개시요청신호를 생성하는 광출력 개시버튼 및 레이저광 출력의 종료를 요청하는 광 출력 종료요청신호를 생성하는 광출력 종료버튼을 포함하는 포인터측 정보입력부, 핸들몸체에 설치되어, 유인 감시용 시설물(A1) 쪽으로 레이저광을 출력하는 레이저출력부 및 광출력 개시요청신호가 생성되면, 레이저출력부를 구동제어하고, 레이저출력부를 통해 출력되는 레이저광을 일정주기로 점멸 시키거나 2 이상의 색상들이 일정주기마다 번갈아 출력되도록 제어하며, 광출력 종료요청신호가 생성되면, 레이 저출력부의 구동이 종료되도록 제어하는 포인터측 제어부를 포함하는 부재이다. 한편, 도면에 도시하지는 않았지만, 레이저 포인터가 구동가능하게 전원을 공급하여 주는 전원공급부를 포 함한다. 또한, 포인터측 정보입력부에는 광출력 개시버튼, 광출력 종료버튼과 더불어 전원공급을 온(ON) 또는 오프(OFF)하는 전원버튼도 구비 제공되어질 수 있다. 또한, 레이저출력부는 레이저 다이오드 등으로 이루어져 단파장의 레이저광을 방출하거나, 적색광, 녹색광, 자색광 등 다양한 색상의 레이저광을 방출할 수 있다. 또한, 핸들몸체는 시설물 관리자가 파지하기 용이하도록, 바(bar) 형상으로 제공되거나 또는 봉 형상으로 도 제공될 수 있다. 또한, 시설물 관리자가 유인 감시용 시설물(A1)의 육안검사를 위한 본 발명의 실측연산이 적용된 시설물 상태평 가 시스템에서는 유인 감시용 시설물(A1)을 이루는 육안검사 수행영역(A11,A12,A13)에서 발생된 손상 부위의 높 이를 보다 정확하게 측정하여 주는 이점을 제공한다. 이를 위해, 시설물 관리자가 유인 감시용 시설물(A1)의 육안검사를 위한 본 발명의 실측연산이 적용된 시설물 상태평가 시스템에는 고소작업장비의 본체에서 승강되는 작업대에 설치되는 것으로, 기설정 주 기마다 지면과 작업대 사이의 높이를 감지하여, 높이감지신호를 생성하고, 그 생성된 높이감지신호를 기설 정 주기마다 고소작업장비로 무선전송하는 수직측 거리감지센서가 구비되어진다. 여기서, 수직측 거 리감지센서는 라이다 센서나 고도센서 등을 적용하여 사용할 수 있다. 이를 통해, 장비측 제어부는 유인시설물 검사정보신호가 중계전송되면, 수직측 거리감지센서로부터 무선전송되는 높이감지신호에 해당하는 지면과 작업대 사이의 높이를 장비측 위치좌표정보에 반영하여 보 정하는 기능을 수행한다. 이와 더불어, 시설물 관리자가 유인 감시용 시설물(A1)의 육안검사를 위한 본 발명의 실측연산이 적용된 시설물 상태평가 시스템에는 고소작업장비의 작업대에 설치되는 것으로, 고소작업장비의 작업대와 유인 감시용 시설물(A1)의 육안검사 수행영역(A11,A12,A13) 사이의 수평거리를 감지하여, 수평거리 감지신호를 생성 하고, 그 생성된 수평거리 감지신호를 기설정 주기마다 고소작업장비로 무선전송하는 수평측 거리감지센서 도 구비되어진다. 여기서, 수평측 거리감지센서는 적외선 센서나 라이다 센서를 사용할 수 있다. 이를 통해, 장비측 제어부는 유인시설물 검사정보신호가 중계전송되면, 수평측 거리감지센서로부터 무선전송되는 수평거리 감지신호에 해당하는 작업대와 유인 감시용 시설물(A1)의 육안검사 수행영역 (A11,A12,A13) 사이의 수평거리를 장비측 위치좌표정보에 반영하여 보정하는 기능을 수행한다. 이와 더불어, 본 발명의 실측연산이 적용된 시설물 상태평가 시스템에서는 시설물 관리자가 유인 감시용 시설물 (A1)과 무인 감시용 시설물(A2) 중 제1종 및 제2종 시설물 중 교량, 터널, 항만, 상하수도, 댐과 같이 중대형 규모의 시설로서 시설물 관리자가 직접 이동하면서 시설물을 촬영하여 관리하지 못하는 시설물인 무인 감시용 시설물(A2)의 검사를 수행하도록 함으로써, 시설물 관리자가 유인 감시용 시설물과 무인 감시용 시설물을 함께 유지관리 가능하게 안내하여 줄 뿐만 아니라 무인 감시용 시설물의 통신 음영지역에 진입한 드론이 자신이 위치 하는 공간위치를 스스로 인지하고, 원격지에서 원격제어 없이도 무인 감시용 시설물을 구분하는 검사수행 시설 물구획에 존재하는 손상을 드론이 자율적으로 인지하여 시설물 촬영을 수행하는 이점도 제공한다. 이를 위해, 본 발명의 실측연산이 적용된 시설물 상태평가 시스템에는 도 7 내지 도 14에 도시된 바와 같이, 무 인 감시용 시설물(A2), 무인시설물 위치특정부재, 드론, 드론제어장치가 추가로 구비되어진다. 먼저, 무인 감시용 시설물(A2)은 제1종 및 제2종 시설물 중 교량, 터널, 항만, 상하수도, 댐과 같이 중대형 규 모의 시설로서, 시설물 관리자가 직접 이동하면서 해당 시설물을 촬영하여 관리하지 못하는 시설물로서, 콘크리 트 구조물로 이루어지고, 해당 콘크리트 구조물이 시설물 안전검사를 수행하기 위해 구분되는 구획인 검사수행 시설물구획(A21,A22,A23,A24)으로 구분된 부재이다. 상기 무인시설물 위치특정부재는 무인 감시용 시설물(A2)에 설치되어, 태양광을 이용하여 전기를 생산하는 태양광모듈, 태양광모듈로부터 생산되는 전기가 충전되는 배터리부, 무인 감시용 시설물(A2)의 검사수행 시설물구획(A21,A22,A23,A24)마다 기설정된 간격으로 고정설치되고, 그 고정설치된 검사수행 시설물구 획(A21,A22,A23,A24)의 위치를 나타내는 시설물구획 설치좌표정보를 갖는 시설물영역별 스캐너들, 유선을 통해 통신인터페이스 기능을 수행하는 시설물측 유선통신부, 검사수행 시설물구획(A21,A22,A23,A24)의 표 면에 설치된 조도센서 및 시설물측 제어부가 구비되는 부재이다. 여기서, 태양광모듈은 무인 감시용 시설물(A2)의 크기에 따라 복수개가 제공될 수 있다. 상기 시설물영역별 스캐너는 시설물측 제어부에 의해 제어되어, 후술되는 드론으로부터 무선전 송되는 시설물 위치안내 요청신호를 인식하면, 해당 시설물 위치안내 요청신호의 수신강도를 측정하여 측정값인 신호수신강도정보를 생성하고, 시설물구획 설치좌표정보 및 신호수신강도정보를 포함하는 드론 평면위치 연산신 호를 기설정주기마다 무선전송하는 부재이다. 이러한 기능을 수행하는 시설물영역별 스캐너는 보다 정확한 시설물 위치안내 요청신호의 수신강도를 측정 하고자 5ｍ ~ 10ｍ 간격으로 설치 제공될 수 있다. 이는, 무인 감시용 시설물(A2)의 크기나 폐쇄 정도에 맞게 가감 변경되어 제공될 수 있다. 상기 시설물측 유선통신부는 원격지에서 드론을 이용하여 시설물 안전검사 수행 중 전파수신이 어려 운 통신 음영지역에서 드론에게 자신의 공간위치를 제공하고자 후술되는 드론제어장치와 유선으로 통 신인터페이스 기능을 수행하는 부재로서, RS-235 직렬통신 또는 전력선 통신 등의 다양한 유선통신수단을 이용 할 수 있다. 상기 시설물측 제어부는 통신 음영지역에 위치하는 드론에게 평면 위치 및 수직 위치를 포함하는 공 간위치를 인식가능하게 무인시설물 위치특정부재를 이루는 각 구성부품을 제어하는 부재이다. 이러한 무인시설물 위치특정부재의 시설물측 제어부는 후술되는 드론제어장치로부터 시설물 위 치안내 요청신호가 유선전송되면, 배터리부에 충전된 전력을 시설물영역별 스캐너들로 인가하여, 시 설물영역별 스캐너들에서, 드론으로부터 무선전송되는 시설물 위치안내 요청신호를 인식하면, 해당 시설물 위치안내 요청신호의 수신강도를 측정하여 측정값인 신호수신강도정보를 생성하고, 시설물구획 설치좌표 정보 및 신호수신강도정보를 포함하는 드론 평면위치 연산신호를 기설정주기마다 무선전송하는 기능을 수행한다. 또한, 무인시설물 위치특정부재의 시설물측 제어부는 드론제어장치로부터 시설물 위치안내 요청 신호가 유선전송되면, 검사수행 시설물구획(A21,A22,A23,A24)의 표면 하부에 설치되되, 드론이 안전하게 이동가능한 최하 수직높이에 설치되는 레이저 발광부로 배터리부에 충전된 전력을 인가하여, 레이저 발광부에서, 레이저광을 조사하는 기능을 수행한다. 또한, 무인시설물 위치특정부재의 시설물측 제어부는 드론제어장치로부터 시설물 위치안내 요청 신호가 유선전송되면, 검사수행 시설물구획(A21,A22,A23,A24)의 표면에 설치된 조도센서로 배터리부 에 충전된 전력을 인가하여, 조도센서로부터 생성되는 검사수행 시설물구획(A21,A22,A23,A24)의 밝기인 조 도감지신호를 기설정 주기마다 입력받고, 그 입력되는 조도감지신호를 기설정 주기마다 무선전송하는 기능을 수 행한다. 상기 드론은 사람이 타지 않고 무선전파의 유도 또는 자체 프로그램에 의해서 비행하는 무인비행체로서, 시설물 설명정보, 무인시설물 손상리스트정보 및 병합 시설물별 공간이동경로정보를 포함하는 통신 음영지역 대 비용 자율주행 제어신호를 무선전송받아, 드론측 정보저장부에 저장관리하고, 기설정주기마다 수신되는 드 론작동 제어신호에 의해 상기 무인 감시용 시설물(A2)을 이루는 검사수행 시설물구획(A21,A22,A23,A24)을 따라 비행하면서 카메라를 통해 손상영역(DZ)을 촬영하여, 무인시설물 영상정보를 생성하고, 상기 생성된 무인 시설물 영상정보를 실시간으로 무선전송하는 부재이다. 이러한 기능을 수행하기 위한 드론의 세부구성은 몸체를 형성 하는 본체와, 본체의 측면을 따라 연결되는 적어도 2개의 연결대와, 연결대의 종단부에 연결되는 날개와, 본체를 지지하는 다리부와, 본체에 탑재되는 모터(미도시)와 캠(미도시)의 작동에 따라 회전 및 상하이동하는 승강부 와, 본체에 탑재되어, 전력을 저장하고 공급하는 전원공급부와, 본체에 설치되어, 무인 감 시용 시설물(A2)을 이루는 검사수행 시설물구획(A21,A22,A23,A24)을 촬영하여 무인시설물 영상정보를 생성하는 카메라와, 본체 및 연결대에 연결지지되는 LED조명부와, 본체에 탑재되는 것으로, 무 인시설물 영상정보가 저장관리되고, 무인 감시용 시설물(A2)을 이루는 각 검사수행 시설물구획 (A21,A22,A23,A24)의 표면에 설치된 조도센서의 위치를 나타내는 좌표인 구획별 조도센서 설치좌표 및 무 인 감시용 시설물(A2)을 이루는 각 검사수행 시설물구획(A21,A22,A23,A24)의 표면 하부에 설치된 레이저 발광부 의 수직높이를 나타내는 구획별 발광부 수직위치좌표를 포함하는 시설물 관리정보가 저장관리되는 드론측 정보저장부와, 본체에 설치되어, 무인 감시용 시설물(A2)을 이루는 검사수행 시설물구획 (A21,A22,A23,A24)을 촬영하여 무인시설물 영상정보를 생성하는 카메라와, 본체에 설치되어, 레이저 광을 수광하는 레이저수광부와, 시설물영역별 스캐너들로부터 기설정주기마다 수신되는 드론 평명위 치 연산신호들에 포함된 정보 중 신호수신강도정보들 중에서 가장 큰 값을 갖는 3개의 신호수신강도정보 및 3개 의 신호수신강도정보와 함께 저장된 시설물구획 설치좌표정보를 추출하고, 추출된 3개의 시설물구획 설치좌표정 보를 토대로 3개의 신호수신강도정보를 삼각측량방식으로 계측하여 드론이 정지비행 중인 해당 검사수행 시설물 구획(A21,A22,A23,A24)의 평면좌표를 나타내는 드론위치특정 평면좌표정보를 기설정 주기마다 생성하고, 카메라 로부터 촬영된 무인시설물 영상정보가 드론측 정보저장부에 저장되도록 제어하고, 드론측 무선통신부 를 통해 드론제어장치로 무선전송되도록 제어하며, 레이저 수광부로 레이저광이 수광되면, 정지 비행(호버링)을 수행하고, 드론측 정보저장부에 저장된 무인 감시용 시설물(A2)을 이루는 각 검사수행 시 설물구획(A21,A22,A23,A24)의 표면 하부에 설치된 레이저 발광부의 수직높이를 나타내는 구획별 발광부 수직위치좌표를 참조하여 자신이 위치하는 검사수행 시설물구획(A21,A22,A23,A24)의 구획별 발광부 수직위치좌표 에 의해 현재 수직높이를 인지한 상태에서, 자신의 승강속도에 따라 승강 수직높이를 연산하여 승강 수직위치좌 표를 기설정주기마다 연산함으로써, 상기 드론위치특정 평면좌표정보와 상기 승강 수직위치좌표를 토대로 자신 의 공간위치를 나타내는 드론 공간위치 좌표정보를 생성하는 드론측 제어부로 이루어질 수 있다. 여기서, LED조명부는 중앙측 LED조명, 좌측 LED조명 및 우측 LED조명으로 이루어진다. 상기 드론측 정보저장부에는 추가로, 해당 무인 감시용 시설물(A2)의 무인시설물 영상정보를 토대로 형성 된 상기 인공지능기반 시설물별 공간이동경로정보에 구비되는 드론의 이동경로 중 인공지능 확장예측영역 과 상기 인적기반 시설물별 공간이동경로정보에 구비되는 드론의 이동경로 중 인적 확장예측영역을 대비하 여 다른 경로가 존재하는 경우 상기 인공지능 확장예측영역과 다른 상기 인적 확장예측영역의 부분을 상기 인공 지능 확장예측영역에 병합하여 병합 확장예측영역으로 가공하고, 상기 가공된 병합 확장예측영역을 상기 인공지 능기반 시설물별 공간이동경로정보에 반영한 병합 시설물별 공간이동경로정보가 저장관리되어진다. 또한, 드론측 정보저장부에는 추가로, 시설물을 이루는 각 검사수행 시설물구획(A21,A22,A23,A24)에 존재 하는 종류별로 구분되는 손상인 종류별 손상 및 해당 손상 종류에 최적화된 조명밝기를 나타내는 손상유형별 조 명밝기값, 해당 종류별 손상면적의 크기에 따라 점등되는 LED램프의 개수를 나타내는 손상면적별 조명 점등위치, 손상면적에 따라 해당 검사수행 시설물구획(A21,A22,A23,A24)의 손상표면과 드론 사이의 촬영거리를 나타내는 촬영이격거리를 포함하는 무인시설물 손상 리스트정보가 저장관리되어진다. 상기 드론측 제어부는 드론측 정보저장부에 저장된 무인시설물 손상 리스트정보 중에서 시설물을 이 루는 각 검사수행 시설물구획(A21,A22,A23,A24)에 존재하는 종류별로 구분되는 손상인 종류별 손상 및 해당 손 상 종류에 최적화된 조명밝기를 나타내는 손상유형별 조명밝기값을 참조한 상태에서, LED조명부의 밝기를 최저 밝기에서 최고 밝기로 조명밝기값을 단계적으로 상승시키되, 기설정주기마다 무선전송되는 조도감지신호의 값이 해당 검사수행 시설물구획(A21,A22,A23,A24)에 존재하는 종류별 손상에 대한 손상유형별 조명밝기값에 도 달할 때까지 상승시키는 기능도 수행한다. 또한, 드론측 제어부는 드론측 정보저장부에 저장된 시설물별 손상 리스트정보 중에서 해당 종류별 손상면적의 크기에 따라 점등되는 LED램프의 개수를 나타내는 손상면적별 조명 점등위치를 토대로, LED조명부 를 이루는 중앙측 LED조명, 좌측 LED조명 및 우측 LED조명 중에서 선택점등하는 기능도 수 행한다. 또한, 드론측 제어부는 드론측 정보저장부에 저장된 시설물별 손상 리스트정보 중에서 손상면적에 따 라 해당 검사수행 시설물구획(A21,A22,A23,A24)의 손상표면과 드론 사이의 촬영거리를 나타내는 촬영이격거리를 참조하여, 해당 촬영이격거리 만큼 이격시킨 상태에서 동영상 촬영을 수행하는 기능도 수행한다. 또한, 드론에는 무인시설물 영상정보를 실시간으로 드론제어장치로 무선전송하기 위한 통신인터페이 스 기능을 수행하는 드론측 무선통신부가 구비되어진다. 이러한 기능을 수행하는 드론측 무선통신부 는 블루투스, 와이파이, 위성통신, 셀룰러 시스템, LTE 또는 5G 이동통신 등 다양한 무선통신수단을 적용하여 사용할 수 있다. 또한, 드론에는 GPS수신부(도시하지 않음)를 구비하여 GPS위성으로부터 경도와 위도를 포함하는 드론 위치 좌표정보를 제공하여, 드론의 실시간 위치까지 제공할 수 있다. 상기 드론제어장치는 시설물 영상을 촬영하고자 하는 해당 무인 감시용 시설물(A2)을 식별하는 식별자인 무인시설물 식별자를 포함하는 통신 음영지역 대비용 자율주행정보 요청신호를 후술되는 시설물 관리서버 로 무선전송하고, 이에 따라 후술되는 시설물 관리서버로부터 무선전송되는 시설물 설명정보, 무인시설물 손상리스트정보 및 병합 시설물별 공간이동경로정보를 포함하는 통신 음영지역 대비용 자율주행 제어신호를 상 기 드론으로 무선전송하며, 기설정주기마다 드론작동 제어신호를 상기 드론으로 무선전송하여 구동제 어하고, 상기 드론으로부터 무인시설물 영상정보를 실시간으로 무선전송받으며, 유선을 통해 통신인터페이 스 기능을 수행하는 운영측 유선통신부가 구비되는 부재이다. 이러한 기능을 수행하는 드론제어장치의 세부구성은 운영측 무선통신부, 운영측 유선통신부, GPS수신부, 운영측 정보저장부, 운영측 정보입력부, 운영측 정보출력부 및 운영측 제어부 로 이루어진다. 먼저, 운영측 무선통신부는 원격지에서 드론을 이용하여 시설물 안전검사 수행을 위해, 기설정주기마다 드 론작동 제어신호를 드론으로 무선전송하여 구동제어하고, 드론으로부터 무인시설물 영상정보를 실시 간으로 무선전송받아 저장하며, 원격지에서 드론을 이용하여 시설물 안전검사 수행 중 전파수신이 어려운 통신 음영지역에서도 시설물 안전검사 수행을 위해 시설물을 구분하는 검사수행 시설물구획에 존재하는 손상을 드론 이 자율적으로 인지하여 시설물 촬영을 위해, 시설물 관리서버와 통신 음영지역 대비용 자율주행정보 요청 신호 및 통신 음영지역 대비용 자율주행 제어신호 등을 통신하는 통신인터페이스 기능을 수행하는 부재이다. 이러한 기능을 수행하는 운영측 무선통신부는 블루투스, 와이파이, 위성통신, 셀룰러 시스템, LTE 또는 5G 이동통신 등 다양한 무선통신수단을 적용하여 사용할 수 있다. 상기 운영측 유선통신부는 원격지에서 드론을 이용하여 시설물 안전검사 수행 중 전파수신이 어려운 통신 음영지역에서 드론에게 자신의 공간위치를 제공하고자 무인시설물 위치특정부재와 유선으로 통 신인터페이스 기능을 수행하는 부재로서, RS-235 직렬통신 또는 전력선 통신 등의 다양한 유선통신수단을 이용 할 수 있다. 상기 GPS수신부는 GPS위성으로부터 경도와 위도를 포함하는 드론제어장치 위치좌표정보를 수신하는 부재로 서, 드론제어장치의 위치를 확인가능하게 안내하여 주는 부재이다. 상기 운영측 정보저장부는 시설물 설명정보, 무인시설물 손상리스트정보 및 병합 시설물별 공간이동경로정 보를 포함하는 통신 음영지역 대비용 자율주행 제어신호와 더불어 드론으로부터 무인시설물 영상정보를 실 시간으로 무선전송받아 저장하며, 원격지에서 드론을 이용하여 시설물 안전검사 수행 중 전파수신이 어려운 통 신 음영지역에서도 시설물 안전검사 수행을 위해 시설물을 구분하는 검사수행 시설물구획에 존재하는 손상을 드 론이 자율적으로 인지하여 시설물 촬영을 위한 각종 정보가 저장되는 부재이다. 여기서, 시설물 설명정보에는 무인 감시용 시설물(A2)에 해당하는 시설물의 위치가 행정구역으로 구분되어 표시 되는 시설물 행정구역 위치, 시설물의 종류를 나타내는 시설물 종류정보, 시설물을 완공한 일자를 나타내는 시 설물 완공일자, 시설물을 식별하는 무인시설물 식별자, 무인 감시용 시설물(A2)을 이루는 각 검사수행 시설물구 획(A21,A22,A23,A24)의 표면에 설치된 조도센서의 위치를 나타내는 좌표인 구획별 조도센서 설치좌표 및 무인 감시용 시설물(A2)을 이루는 각 검사수행 시설물구획(A21,A22,A23,A24)의 표면 하부에 설치된 레이저 발광 부의 수직높이를 나타내는 구획별 발광부 수직위치 좌표가 구비되어진다. 또한, 무인시설물 손상리스트정보에는 안전검사를 위해 해당 무인 감시용 시설물(A2)을 이루는 각 검사수행 시 설물구획(A21,A22,A23,A24)을 기지정된 순서로 촬영한 무인시설물 영상정보가 누적 저장되되, 시설물별로 구분 되어 누적 저장되는 무인시설물 영상정보와, 시설물을 이루는 각 검사수행 시설물구획(A21,A22,A23,A24)에 존재 하는 종류별로 구분되는 손상인 종류별 손상, 해당 종류별 손상이 해당 검사수행 시설물구획(A21,A22,A23,A24) 에 위치하는 좌표인 종류별 손상위치좌표, 해당 종류별 손상의 면적을 나타내는 종류별 손상면적, 해당 손상 종 류에 최적화된 조명밝기를 나타내는 손상유형별 조명밝기값, 해당 종류별 손상면적의 크기에 따라 점등되는 LED 램프의 개수를 나타내는 손상면적별 조명 점등 개수, 손상면적에 따라 해당 검사수행 시설물구획 (A21,A22,A23,A24)의 손상표면과 드론 사이의 촬영거리를 나타내는 촬영이격거리가 구비되어진다. 또한, 운영측 정보저장부에는 시설물 관리자가 현재 비행중인 드론을 인지가능하게 수신되는 무인시 설물 영상정보가 실시간 출력되는 실시간 영상출력부 및 직전에 저장된 해당 무인 감시용 시설물(A2)의 병합 시 설물별 공간이동경로정보가 출력되는 직전 시설물 이동경로출력부로 분할된 시설물 영상출력화면이 저장관리되 어진다. 이러한 기능을 수행하는 운영측 정보저장부는 플래시 메모리 타입(flash memory type), 하드디스크 타 입 (hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들 어 SD 또는 XD 메모리 등), 램(Random Access Memory, RAM), SRAM(Static Random Access Memory), 롬(Read- Only Memory, ROM), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 하나 또는 이들의 조합으로 구성하여 사용할 수 있 다. 상기 운영측 정보입력부는 원격지에서 드론을 이용하여 시설물 안전검사 수행을 위해, 기설정주기마다 드 론작동 제어신호를 드론으로 무선전송하여 구동제어하고, 드론으로부터 무인시설물 영상정보를 실시 간으로 무선전송받아 저장하며, 원격지에서 드론을 이용하여 시설물 안전검사 수행 중 전파수신이 어려운 통신 음영지역에서도 시설물 안전검사 수행을 위해 시설물을 구분하는 검사수행 시설물구획에 존재하는 손상을 드론 이 자율적으로 인지하여 시설물 촬영을 위한 드론제어장치의 동작 제어를 수행하는 부재이다. 이러한 운영측 정보입력부에는 키패드(key pad) 돔스위치 (dome switch), 터치패드(정압/정전), 터치펜, 조그휠, 조그 스위치 등이 조합되어 구성될 수 있다. 상기 운영측 정보출력부는 원격지에서 드론을 이용하여 시설물 안전검사 수행을 위해, 기설정주기마다 드 론작동 제어신호를 드론으로 무선전송하여 구동제어하고, 드론으로부터 무인시설물 영상정보를 실시 간으로 무선전송받아 저장하며, 원격지에서 드론을 이용하여 시설물 안전검사 수행 중 전파수신이 어려운 통신 음영지역에서도 시설물 안전검사 수행을 위해 시설물을 구분하는 검사수행 시설물구획에 존재하는 손상을 드론 이 자율적으로 인지하여 시설물 촬영을 위한 부재로서, 스피커 및 디스플레이부로 이루어질 수 있다. 여기서, 디스플레이부의 경우에는 액정 디스플레이(liquid crystal display, LCD), 박막 트랜지스터 액정 디스 플레이(thin film transistor-liquid crystal display, TFT LCD), 유기 발광 다이오드(organic light-emitting diode, OLED), 플렉시블 디스플레이(flexible display), 3차원 디스플레이(3D display) 등 다양한 출력부재가 선택 적용되어질 수 있다. 상기 운영측 제어부는 원격지에서 드론을 이용하여 시설물 안전검사 수행을 위해, 기설정주기마다 드론작 동 제어신호를 드론으로 무선전송하여 구동제어하고, 드론으로부터 무인시설물 영상정보를 실시간으 로 무선전송받아 저장하며, 원격지에서 드론을 이용하여 시설물 안전검사 수행 중 전파수신이 어려운 통신 음영 지역에서도 시설물 안전검사 수행을 위해 시설물을 구분하는 검사수행 시설물구획에 존재하는 손상을 드론이 자 율적으로 인지하여 시설물 촬영을 수행가능하게 제어하는 제어부재이다. 이러한 기능을 수행하기 위해, 운영측 제어부는 전자야장모듈을 운영한다. 운영측 제어부에 의해 운영되는 전자야장모듈은 벡터 CAD 기반의 컴포넌트 엔진으로 설계하여 무인 감시용 시설물(A2)을 이루는 각 검사수행 시설물구획(A21,A22,A23,A24)에 대한 도면인 인적기반 시설물별 공간 이동경로정보를 벡터 CAD 기반으로 운영측 정보출력부를 통해 출력되도록 제어하고, 그 출력되는 인적기반 시설물별 공간이동경로정보의 편집, 줌인, 줌아웃, 패닝, 레이어, 그리기 객체 추가, 크랙지정, 텍스트 추가 등 을 수행할 수 있도록 구비하고, 인적기반 시설물별 공간이동경로정보의 계층적인 분류가 가능하도록 구비하며, GIS 기반의 맵 편집이 가능하도록 프로그래밍되어진다. 한편, 전자야장모듈은 인적기반 시설물별 공간이동경로정보를 운영측 정보출력부를 통해 출력된 시설 물 영상출력화면 중 직전 시설물 이동경로출력부에 출력한다. 이때, 시설물 영상출력화면에는 시설물 관리자가 현재 비행중인 드론을 인지가능하게 수신되는 무인시설물 영상정보가 실시간 출력되는 실시간 영상출력부가 구비되어, 시설물 관리자가 직전 시설물 이동경로출력부를 통 해 해당 시설물의 기지정된 검사순서 및 종류별 손상 등 시설물 안전검사 관련 정보를 인식한 상태에서, 실시간 영상출력부를 통해 출력되는 현재 비행중인 드론을 기지정된 검사순서로 구동조작 가능하게 안내하여 준다. 또한, 전자야장모듈은 실시간 영상출력부를 통해 출력되는 무인시설물 영상정보에 운영측 정보입력부(35 0)를 조작하여 종류별 손상이 발생된 영역에서 시설물 관리자가 예측한 해당 종류별 손상의 확장 가능한 인적 확장예측영역을 입력한 경우 이를 무인시설물 영상정보에 임시저장하여, 후술되는 시설물 관리서버에서 인적기반 시설물별 공간이동경로정보 형성시 임시저장된 해당 검사수행 시설물구획(A21,A22,A23,A24)의 인적 확 장예측영역도 반영하여 형성되도록 제공한다. 상기 시설물 관리서버는 드론제어장치로부터 통신 음영지역 대비용 자율주행정보 요청신호가 무선전 송되면, 통신 음영지역 대비용 자율주행정보 요청신호에 포함된 무인시설물 식별자를 DB부와 매칭하여, 해 당 무인 감시용 시설물(A2)의 시설물 설명정보, 무인시설물 손상리스트정보 및 병합 시설물별 공간이동경로정보 를 추출하고, 그 추출된 시설물 설명정보, 무인시설물 손상리스트정보 및 병합 시설물별 공간이동경로정보를 포 함하는 통신 음영지역 대비용 자율주행 제어신호로 가공하여, 드론제어장치로 무선전송하는 서버부재이다. 이러한 기능을 수행하고자 시설물 관리서버의 DB부에는 시설물 관리정보 DB, 시설물별 시설물 영상정보 DB, 시설물별 손상 리스트정보 DB, 종류별 손상 시설물 영상정보 DB, 인공지능기반 시 설물별 공간이동경로정보 DB, 인적기반 시설물별 공간이동경로정보 DB 및 병합 시설물별 공간이동경 로정보 DB가 구비되어지는데, 이중 유인 감시용 시설물(A1)에서 언급한 내용과 중복되는 내용은 가급적 생 략하기로 한다. 먼저, 시설물 관리정보 DB에 저장관리되는 시설물 설명정보 중 무인 감시용 시설물(A2)의 시설물 설명정보 에는 무인 감시용 시설물(A2)을 이루는 각 검사수행 시설물구획(A21,A22,A23,A24)의 표면에 설치된 조도센서 의 위치를 나타내는 좌표인 구획별 조도센서 설치좌표 및 무인 감시용 시설물(A2)을 이루는 각 검사수행 시설물구획(A21,A22,A23,A24)의 표면 하부에 설치된 레이저 발광부의 수직높이를 나타내는 구획별 발광부 수직위치 좌표도 저장관리되어진다. 상기 시설물별 손상 리스트정보 DB에서 저장관리되는 무인시설물 손상리스트정보를 보다 자세히 특정하면, 무인 감시용 시설물(A2)을 이루는 각 검사수행 시설물구획(A21,A22,A23,A24)에 존재하는 종류별로 구분되는 손 상인 종류별 손상, 해당 종류별 손상이 해당 검사수행 시설물구획(A21,A22,A23,A24)에 위치하는 좌표인 종류별 손상위치좌표, 해당 종류별 손상의 면적을 나타내는 종류별 손상면적, 해당 손상 종류에 최적화된 조명밝기를 나타내는 손상유형별 조명밝기값, 해당 종류별 손상면적의 크기에 따라 점등되는 LED램프의 개수를 나타내는 손 상면적별 조명 점등 개수, 손상면적에 따라 해당 검사수행 시설물구획(A21,A22,A23,A24)의 손상표면과 드론 사 이의 촬영거리를 나타내는 촬영이격거리로 세세하게 구분되어 저장관리되어진다. 상기 종류별 손상 시설물 영상정보 DB는 유인 감시용 시설물(A1) 및 무인 감시용 시설물(A2)을 포함하는 전국각지의 시설물에서 기존에 발생된 종류별 손상이 촬영된 영상정보인 종류별 손상 유인무인시설물 영상정보 들 및 종류별 손상 무인시설물 영상정보들을 포함하는 종류별 손상 시설물영상 정보들을 손상 종류별로 구분되 어 저장관리하는 데이터베이스부재이다. 상기 인공지능기반 시설물별 공간이동경로정보 DB는 시설물별 시설물 영상정보 DB에 누적저장관리되 는 무인시설물 영상정보 중 직전에 저장된 해당 무인 감시용 시설물(A2)의 무인시설물 영상정보에 종류별 손상 추적모델을 이용하여, 해당 무인 감시용 시설물(A2)을 이루는 각 검사수행 시설물구획(A21,A22,A23,A24)에 존재하는 손상을 종류별로 탐색하고, 탐색된 종류별로 구분되는 손상인 종류별 손상이 위치하는 좌표인 종류별 손상위치좌표를 획득하며, 해당 종류별 손상의 연산된 면적값인 종류별 손상면적을 획득하고, 종류별 손상, 종 류별 손상위치좌표 및 종류별 손상면적을 이용하여, 무인 감시용 시설물(A2)을 이루는 개개의 검사수행 시설물 구획(A21,A22,A23,A24)을 기지정된 순서로 시설물영상 촬영을 위한 드론의 이동경로인 인공지능기반 시설 물별 공간이동경로정보를 형성하되, 무인 감시용 시설물(A2)을 이루는 개개의 검사수행 시설물구획 (A21,A22,A23,A24) 중 종류별 손상이 발생된 검사수행 시설물구획(A21,A22,A23,A24)은 종류별 손상이 발생된 영 역에서 해당 종류별 손상의 확장 가능한 영역을 예측한 인공지능 확장예측영역까지 이동하는 인공지능기반 시설 물별 공간이동경로정보가 누적 저장관리되는 데이터베이스부재이다. 상기 인적기반 시설물별 공간이동경로정보 DB는 해당 무인 감시용 시설물(A2)을 이루는 개개의 검사수행 시설물구획(A21,A22,A23,A24)을 기지정된 순서로 촬영한 무인시설물 영상정보를 토대로 시설물 관리자에 의해 구동제어된 드론의 이동경로인 인적기반 시설물별 공간이동경로정보를 형성하되, 무인 감시용 시설물(A2) 을 이루는 개개의 검사수행 시설물구획(A21,A22,A23,A24) 중 종류별 손상이 발생된 검사수행 시설물구획 (A21,A22,A23,A24)은 종류별 손상이 발생된 영역에서 시설물 관리자가 예측한 해당 종류별 손상의 확장 가능한 인적 확장예측영역까지 이동하는 인적기반 시설물별 공간이동경로정보가 누적 저장관리되는 데이터베이스부재이 다. 상기 병합 시설물별 공간이동경로정보 DB는 해당 시설물의 무인시설물 영상정보를 토대로 형성된 인공지능 기반 시설물별 공간이동경로정보에 구비되는 드론의 이동경로 중 인공지능 확장예측영역과 인적기반 시설 물별 공간이동경로정보에 구비되는 드론의 이동경로 중 인적 확장예측영역을 대비하여 다른 경로가 존재하 는 경우 인공지능 확장예측영역과 다른 인적 확장예측영역의 부분을 인공지능 확장예측영역에 병합하여 병합 확 장예측영역으로 가공하고, 가공된 병합 확장예측영역을 인공지능기반 시설물별 공간이동경로정보에 반영한 병합 시설물별 공간이동경로정보가 누적 저장관리되는 데이터베이스부재이다. 그리고 시설물 관리서버에는 딥러닝엔진 및 손상예측경로 추적엔진과 같은 제어모듈도 구비되어 진다. 먼저, 딥러닝엔진은 종류별 손상 시설물 영상정보 DB에 저장관리되는 종류별 손상 무인시설물 영상정 보들을 인공신경망(CNN)을 통해 기계학습하여 종류별 손상추적모델을 생성하고, 이를 후술되는 손상예측경 로 추적엔진에 탑재되도록 제어하는 모듈이다. 여기서, 종류별 손상에는 균열, 부식, 누수나 철근부식과 같이 시설물에서 야기 가능한 다양한 손상의 종류가 포함되어어진다. 또한, 딥러닝엔진은 종류별 손상 시설물 영상정보 DB에 저장관리되는 종류별 손상 시설물영상 정보들 은 전국각지에서 기설정주기마다 수집되어 누적되기 때문에, 그 누적되는 종류별 손상 시설물영상 정보들을 반 영하여 기설정주기마다 기계학습함으로써, 종류별 손상추적모델을 갱신하여 보다 정밀하게 종류별 손상에 따른 객체추적을 수행가능하게 안내하여 준다. 상기 손상예측경로 추적엔진은, 시설물별 시설물 영상정보 DB시설물별 시설물 영상정보 DB상정 보 중 직전에 저장된 해당 무인 감시용 시설물(A2)의 무인시설물 영상정보에 탑재된 종류별 손상추적모델 을 이용하여, 해당 무인 감시용 시설물(A2)을 이루는 각 검사수행 시설물구획(A21,A22,A23,A24)에 존재하는 손 상을 종류별로 탐색하고, 탐색된 종류별로 구분되는 손상인 종류별 손상이 위치하는 좌표인 종류별 손상위치좌 표를 획득하며, 해당 종류별 손상의 연산된 면적값인 종류별 손상면적을 획득하고, 해당 손상 종류에 최적화된 조명밝기를 나타내는 손상유형별 조명밝기값을 설정하며, 해당 종류별 손상면적의 크기에 따라 점등되는 LED램 프의 개수를 나타내는 손상면적별 조명 점등 개수를 설정하고, 손상면적에 따라 해당 검사수행 시설물구획 (A21,A22,A23,A24)의 손상표면과 드론 사이의 촬영거리를 나타내는 촬영이격거리를 설정하고, 확인된 각 정보를 무인시설물 손상리스트정보로 가공하여 시설물별 손상 리스트정보 DB에 시설물별로 구분하여 누적 저장관 리되도록 제어하며, 종류별 손상, 종류별 손상위치좌표 및 종류별 손상면적을 이용하여, 무인 감시용 시설물 (A2)을 이루는 개개의 검사수행 시설물구획(A21,A22,A23,A24)을 기지정된 순서로 시설물영상 촬영을 위한 드론 의 이동경로인 인공지능기반 시설물별 공간이동경로정보를 형성하되, 무인 감시용 시설물(A2)을 이루는 개 개의 검사수행 시설물구획(A21,A22,A23,A24) 중 종류별 손상이 발생된 검사수행 시설물구획(A21,A22,A23,A24)은 종류별 손상이 발생된 영역에서 해당 종류별 손상의 확장 가능한 영역을 예측한 인공지능 확장예측영역까지 이 동하는 인공지능기반 시설물별 공간이동경로정보가 인공지능기반 시설물별 공간이동경로정보 DB에 누적 저 장관리되도록 제어하는 기능을 수행하는 제어모듈이다. 또한, 시설물 관리서버에는 시설물 관리엔진이 더 구비되어진다. 이처럼, 구비되는 시설물 관리엔진은 시설물별 시설물 영상정보 DB에 저장된 무인시설물 영상정보 중 직전에 저장된 무인시설물 영상정보를 토대로, 시설물 관리자에 의해 구동제어된 드론의 이동경로인 인적 기반 시설물별 공간이동경로정보를 형성하되, 무인 감시용 시설물(A2)을 이루는 개개의 검사수행 시설물구획 (A21,A22,A23,A24) 중 종류별 손상이 발생된 검사수행 시설물구획(A21,A22,A23,A24)은 종류별 손상이 발생된 영 역에서 시설물 관리자가 예측한 해당 종류별 손상의 확장 가능한 인적 확장예측영역까지 이동하는 인적기반 시 설물별 공간이동경로정보를 형성하고, 이를 인적기반 시설물별 공간이동경로정보 DB에 누적 저장관리되도 록 제어하는 기능을 수행한다. 또한, 시설물 관리엔진은, 시설물별 시설물 영상정보 DB에 저장된 무인시설물 영상정보 중 직전에 저 장된 무인시설물 영상정보를 토대로, 시설물 관리자에 의해 구동제어된 드론의 이동경로인 인적기반 시설 물별 공간이동경로정보를 형성하되, 무인 감시용 시설물(A2)을 이루는 개개의 검사수행 시설물구획 (A21,A22,A23,A24) 중 종류별 손상이 발생된 검사수행 시설물구획(A21,A22,A23,A24)은 종류별 손상이 발생된 영 역에서 시설물 관리자가 예측한 해당 종류별 손상의 확장 가능한 인적 확장예측영역까지 이동하는 인적기반 시 설물별 공간이동경로정보를 형성하고, 이를 인적기반 시설물별 공간이동경로정보 DB에 누적 저장관리되도 록 제어하는 기능도 수행한다. 시설물 관리엔진은, 인공지능기반 시설물별 공간이동경로정보 DB 및 인적기반 시설물별 공간이동경로 정보 DB에 저장된 정보 중 직전에 저장된 동일한 무인 감시용 시설물(A2)에 해당하는 인공지능기반 시설물 별 공간이동경로정보에 구비되는 드론의 이동경로 중 인공지능 확장예측영역과 인적기반 시설물별 공간이 동경로정보에 구비되는 드론의 이동경로 중 인적 확장예측영역을 대비하여 다른 경로가 존재하는 경우 인 공지능 확장예측영역과 다른 인적 확장예측영역의 부분을 인공지능 확장예측영역에 병합하여 병합 확장예측영역 으로 가공하고, 가공된 병합 확장예측영역을 인공지능기반 시설물별 공간이동경로정보에 반영한 병합 시설물별 공간이동경로정보로 재설정하고, 이를 병합 시설물별 공간이동경로정보 DB에 누적 저장관리되도록 제어하 는 기능도 수행한다. 이와 같은, 구성으로 이루어진 본 발명의 실측연산이 적용된 시설물 상태평가 시스템을 이용하여 무인 감시용 시설물(A2)의 안전검사를 수행하는 과정은 다음과 같다. 먼저, 시설물 관리자는 안전검사를 수행하고자 하는 무인 감시용 시설물(A2)에 도착한 후 드론을 이용하여 시설물 영상을 촬영하고자, 드론제어장치를 구동 후 운영측 정보입력부를 조작하여 시설물 영상을 촬 영하고자 하는 해당 무인 감시용 시설물(A2)의 무인시설물 식별자를 입력하면, 드론제어장치의 운영측 제 어부는 전자야장모듈을 운영하여, 그 입력된 무인시설물 식별자를 포함하는 통신 음영지역 대비용 자율주행정보 요청신호를 생성하고, 그 생성된 통신 음영지역 대비용 자율주행정보 요청신호를 운영측 무선통신부 를 통해 시설물 관리서버로 무선전송한다. 시설물 관리서버는 드론제어장치로부터 통신 음영지역 대비용 자율주행정보 요청신호가 무선전송되면, 그 무선전송된 통신 음영지역 대비용 자율주행정보 요청신호에 포함된 무인시설물 식별자를 DB부 의 시설물 관리정보 DB와 매칭하여 매칭되는 해당 무인 감시용 시설물(A2)의 시설물 설명정보를 추출 하고, 시설물별 손상 리스트정보 DB에서 해당 무인 감시용 시설물(A2)의 무인시설물 손상리스트정보 중 직 전에 저장된 무인시설물 손상리스트정보를 추출하며, 병합 시설물별 공간이동경로정보 DB에서 해당 무인 감시용 시설물(A2)의 병합 시설물별 공간이동경로정보 중 직전에 저장된 병합 시설물별 공간이동경로정보를 추 출하고, 그 추출된 시설물 설명정보, 무인시설물 손상리스트정보 및 병합 시설물별 공간이동경로정보를 포함하 는 통신 음영지역 대비용 자율주행 제어신호로 가공하고, 이를 드론제어장치로 무선전송한다. 드론제어장치의 전자야장모듈은 운영측 무선통신부를 통해 무선전송되는 통신 음영지역 대비용 자율주행 제어신호를 운영측 정보저장부에 저장함과 아울러 드론으로 중계전송한다. 드론의 드론측 제어부는 드론측 무선통신부를 통해 무선전송되는 통신 음영지역 대비용 자율주 행 제어신호를 드론측 정보저장부에 저장관리한다. 이후, 시설물 관리자는 운영측 정보입력부를 조작하여 병합 시설물별 공간이동경로정보의 출력을 요청하면, 전자야장모듈은 운영측 정보저장부에서 저장관리되는 시설물 영상출력화면 및 해당 무인 감시용 시설물(A2)의 병합 시설물별 공간이동경로정보를 추출하고, 그 추출된 시설물 영상출력화면의 직전 시설 물 이동경로출력부에 삽입한 후 운영측 정보출력부를 통해 출력되도록 제어한다. 여기서, 운영측 정보출력 부를 통해 출력된 시설물 영상출력화면에는 현재 비행중인 드론을 인지가능하게 수신되는 무인시설물 영상정보가 실시간 출력되는 실시간 영상출력부도 구비되어진다. 이를 통해, 시설물 관리자는 드론을 이용하여 해당 무인 감시용 시설물(A2)을 이루는 각 검사수행 시설물 구획(A21,A22,A23,A24)을 촬영하기 전에 시설물 관리자가 직전 시설물 이동경로출력부를 열람하여 해당 시설물 의 기지정된 검사순서 및 종류별 손상 등 시설물 안전검사 관련 정보를 인식한 상태에서, 실시간 영상출력부를 통해 출력되는 현재 비행중인 드론을 기지정된 검사순서로 구동조작 가능하게 제공하여 준다. 시설물 영상출력화면을 통해 해당 무인 감시용 시설물(A2)의 인적기반 시설물별 공간이동경로정보를 열람한 시 설물 관리자는 드론의 비행을 위해 운영측 정보입력부를 조작하여 드론작동 제어신호를 입력하면, 운 영측 제어부는 입력되는 드론작동 제어신호를 운영측 무선통신부를 통해 드론으로 무선전송한다. 드론의 드론측 제어부는 드론측 무선통신부를 통해 무선전송되는 드론작동 제어신호에 의해 무 인 감시용 시설물(A2)을 이루는 검사수행 시설물구획(A21,A22,A23,A24)을 따라 비행하면서 카메라를 통해 손상영역(DZ)을 촬영하여, 무인시설물 영상정보를 생성하고, 그 생성된 무인시설물 영상정보를 드론측 무선통신 부를 통해 실시간으로 무선전송한다. 드론제어장치는 운영측 무선통신부를 통해 무선전송되는 무인시설물 영상정보를 드론측 정보저장부 에 저장함과 아울러 운영측 정보출력부를 통해 출력된 실시간 영상출력부를 통해 표시함으로써, 시설 물 관리자가 비행중인 드론을 구동가능하도록 제공한다. 한편, 비행중인 드론의 드론측 제어부는 드론제어장치로부터 드론작동 제어신호가 전파수신이 어려운 통신 음영지역에 진입하였음을 안내하는 통신 음영지역 진입시간 동안 수신되지 않은 경우 정지비행(호 버링)을 수행한 상태에서, 정지비행중인 드론 자신의 평면좌표위치를 요청하는 시설물 평면좌표 요청신호 를 기설정주기마다 드론측 무선통신부를 통해 무선전송한다. 또한, 드론제어장치는 드론으로부터 무인시설물 영상정보가 전파수신이 어려운 통신 음영지역에 진입 하였음을 안내하는 통신 음영지역 진입시간 동안 수신되지 않은 경우 무인시설물 위치특정부재의 시설물측 유선통신부와 운영측 유선통신부 간을 유선연결한 상태에서, 해당 무인 감시용 시설물(A2)을 이루는 검사수행 시설물구획(A21,A22,A23,A24)의 위치 안내를 요청하는 시설물 위치안내 요청신호를 생성하여, 무인시 설물 위치특정부재로 유선전송한다. 이후, 무인시설물 위치특정부재의 시설물측 제어부는 드론제어장치로부터 시설물 위치안내 요청 신호가 유선전송되면, 배터리부에 충전된 전력을 시설물영역별 스캐너들로 인가하여, 시설물영역별스캐너들에서, 드론으로부터 무선전송되는 시설물 위치안내 요청신호를 인식하면, 해당 시설물 위치 안내 요청신호의 수신강도를 측정하여 측정값인 신호수신강도정보를 생성하고, 시설물구획 설치좌표정보 및 신 호수신강도정보를 포함하는 드론 평면위치 연산신호를 기설정주기마다 시설물측 무선통신부를 통해 무선전 송한다. 이후, 드론의 드론측 제어부는 드론측 무선통신부를 통해 시설물영역별 스캐너들로부터 기 설정주기마다 수신되는 드론 평명위치 연산신호들에 포함된 정보 중 신호수신강도정보들 중에서 가장 큰 값을 갖는 3개의 신호수신강도정보 및 3개의 신호수신강도정보와 함께 저장된 시설물구획 설치좌표정보를 추출하고, 추출된 3개의 시설물구획 설치좌표정보를 토대로 3개의 신호수신강도정보를 삼각측량방식으로 계측하여 드론이 정지비행 중인 해당 검사수행 시설물구획(A21,A22,A23,A24)의 평면좌표를 나타내는 드론위치특정 평면좌표정보 를 기설정 주기마다 생성하여, 무인 감시용 시설물(A2)을 이루는 검사수행 시설물구획(A21,A22,A23,A24) 중 드 론위치특정 평면좌표정보를 토대로 자신이 위치하는 검사수행 시설물구획(A21,A22,A23,A24)을 인식한다. 이후, 무인시설물 위치특정부재의 시설물측 제어부는 드론제어장치로부터 시설물 위치안내 요청 신호가 유선전송되면, 검사수행 시설물구획(A21,A22,A23,A24)의 표면 하부에 설치되되, 드론이 안전하게 이동가능한 최하 수직높이에 설치되는 레이저 발광부로 배터리부에 충전된 전력을 인가하여, 레이저 발광부에서, 레이저광을 조사하도록 제어한다. 이후 드론의 드론측 제어부는 드론위치특정 평면좌표정보를 토대로, 자신이 위치하는 검사수행 시설 물구획(A21,A22,A23,A24)의 표면이 보이는 방향으로 위치한 상태에서 수직하강 하면서 레이저 수광부로 레 이저광이 수광되면, 정지비행(호버링)을 수행하고, 드론측 정보저장부에 저장된 무인 감시용 시설물(A2)을 이루는 각 검사수행 시설물구획(A21,A22,A23,A24)의 표면 하부에 설치된 레이저 발광부의 수직높이를 나타 내는 구획별 발광부 수직위치좌표를 참조하여 자신이 위치하는 검사수행 시설물구획(A21,A22,A23,A24)의 구획별 발광부 수직위치좌표에 의해 현재 수직높이를 인지한 상태에서, 자신의 승강속도에 따라 승강 수직높이를 연산 하여 승강 수직위치좌표를 기설정주기마다 연산함으로써, 드론위치특정 평면좌표정보와 승강 수직위치좌표를 토 대로 자신의 공간위치를 나타내는 드론 공간위치 좌표정보를 생성한다. 한편, 무인시설물 위치특정부재의 시설물측 제어부는 드론제어장치로부터 시설물 위치안내 요청 신호가 유선전송되면, 검사수행 시설물구획(A21,A22,A23,A24)의 표면에 설치된 조도센서로 배터리부 에 충전된 전력을 인가하여, 조도센서로부터 생성되는 검사수행 시설물구획(A21,A22,A23,A24)의 밝기인 조 도감지신호를 기설정 주기마다 입력받고, 그 입력되는 조도감지신호를 기설정 주기마다 시설물측 무선통신부 를 통해 무선전송한다. 드론의 드론측 제어부는 드론 공간위치 좌표정보를 토대로, 드론측 정보저장부에 저장된 무인 감시용 시설물(A2)을 이루는 각 검사수행 시설물구획(A21,A22,A23,A24)의 표면에 설치된 조도센서의 위치 를 나타내는 좌표인 구획별 조도센서 설치좌표를 참조하여, 자신이 위치하는 해당 검사수행 시설물구획 (A21,A22,A23,A24)에 설치된 조도센서 쪽으로 이동한다. 드론의 드론측 제어부는 드론측 정보저장부에 저장된 시설물별 손상 리스트정보 중에서 시설물 을 이루는 각 검사수행 시설물구획(A21,A22,A23,A24)에 존재하는 종류별로 구분되는 손상인 종류별 손상 및 해 당 손상 종류에 최적화된 조명밝기를 나타내는 손상유형별 조명밝기값을 참조한 상태에서, LED조명부의 밝 기를 최저 밝기에서 최고 밝기로 조명밝기값을 단계적으로 상승시키되, 기설정주기마다 무선전송되는 조도감지 신호의 값이 해당 검사수행 시설물구획(A21,A22,A23,A24)에 존재하는 종류별 손상에 대한 손상유형별 조명밝기 값에 도달할 때까지 상승시킴으로써, 해당 검사수행 시설물구획(A21,A22,A23,A24)을 최적의 조명밝기를 유지한 상태에서 무인시설물 영상정보가 생성되도록 제공하여 준다. 또한, 드론의 드론측 제어부는 드론측 정보저장부에 저장된 시설물별 손상 리스트정보 중에서 해당 종류별 손상면적의 크기에 따라 점등되는 LED램프의 개수를 나타내는 손상면적별 조명 점등위치를 토대로, LED조명부를 이루는 중앙측 LED조명, 좌측 LED조명 및 우측 LED조명 중에서 선택점등함으 로써, 해당 검사수행 시설물구획(A21,A22,A23,A24)을 최적의 조명 조사 면적을 유지한 상태에서 무인시설물 영 상정보가 생성되도록 제공하여 준다. 이처럼, 통신 음영지역에 위치하는 드론의 드론측 제어부는 무인시설물 영상정보를 생성하는데 있어 서, 요구되는 최적의 촬영조건으로 설정한 상태에서, 드론 공간위치 좌표정보를 토대로 무인 감시용 시설물(A 2)을 이루는 개개의 검사수행 시설물구획(A21,A22,A23,A24) 중 자신이 위치하는 검사수행 시설물구획(A21,A22,A23,A24)을 인식한 상태에서, 드론측 정보저장부에 저장된 인적기반 시설물별 공간이동경로정보 를 토대로, 자신이 위치하는 검사수행 시설물구획(A21,A22,A23,A24)부터 마지막 검사수행 시설물구획 (A21,A22,A23,A24)까지 기지정된 공간이동경로로 각 검사수행 시설물구획(A21,A22,A23,A24)을 카메라를 통해 촬영하여 통신 음영지역에서 생성되는 무인시설물 영상정보를 드론측 정보저장부에 저장관리되도록 제어함으로써, 통신 음영지역에서도 자율적으로 무인시설물 영상정보를 생성하고, 생성되는 무인시설물 영상정 보를 드론측 정보저장부에 저장하며, 마지막 검사수행 시설물구획(A21,A22,A23,A24)까지 무인시설물 영상 정보의 생성을 완료한 후 드론제어장치로 복귀한다. 이후, 시설물 관리자는 복귀한 드론을 드론제어장치와 유선 또는 무선으로 연결하여, 드론으로 부터 통신 음영지역에서 촬영된 무인시설물 영상정보를 전송받아 운영측 정보저장부에 저장하되, 통신 음 영지역에 진입하기 전에 촬영되어 저장된 해당 무인시설물 영상정보와 연결하여 저장되도록 요청하면, 드론제어 장치의 운영측 제어부는 통신 음영지역에 진입하기 전에 촬영되어 저장된 해당 무인시설물 영상정보 와 연결한 후 운영측 정보저장부에 저장관리되도록 제어한다. 또한, 시설물 관리자가 저장관리되는 무인시설물 영상정보를 토대로 시설물 안전검사를 수행하고자 촬영된 무인 시설물 영상정보의 재생을 요청하면, 전자야장모듈은 운영측 정보저장부에 저장된 해당 무인시설물 영상정보를 시설물 영상출력화면의 실시간 영상출력부를 통해 출력재생하고, 시설물 영상출력화면을 통해 출력 되는 무인시설물 영상정보 중 손상영역(DZ)이 존재하는 해당 검사수행 시설물구획(A21,A22,A23,A24)에서 시설물 관리자가 해당 손상영역(DZ)에서 확장 가능하다고 예측하는 인적 확장예측영역을 정보입력부를 조작하여 표시하 면, 이를 무인시설물 영상정보에 취합저장한다. 이후, 드론제어장치의 전자야장모듈은 인적 확장예측영역이 취합저장된 무인시설물 영상정보를 운영 측 무선통신부를 통해 시설물 관리서버로 무선전송한다. 시설물 관리서버는 시설물 관리엔진을 운영하여, 인적 확장예측영역이 취합저장된 무인시설물 영상정 보를 시설물별 시설물 영상정보 DB에 누적 저장관리되도록 제어함으로써, 손상예측경로 추적엔진에서, 인적 확장예측영역이 취합저장된 무인시설물 영상정보를 토대로, 무인시설물 손상리스트정 보, 인공지능기반 시설물별 공간이동경로정보 및 인적기반 시설물별 공간이동경로정보를 가공생성할 수 있게 안 내하여 준다. 이상의 설명에서 본 발명은 특정의 실시 예와 관련하여 도시 및 설명하였지만, 청구범위에 의해 나타난 발명의"}
{"patent_id": "10-2023-0139139", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "사상 및 영역으로부터 벗어나지 않는 한도 내에서 다양한 개조 및 변화가 가능하다는 것을 이 기술분야에서 통 상의 지식을 가진 자라면 누구나 쉽게 알 수 있을 것이다."}
{"patent_id": "10-2023-0139139", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 유인 감시용 시설물 및 무인 감시용 시설물 중 유인 감시용 시설물의 상태평가를 수행하는 본 발명의 실 측연산이 적용된 시설물 상태평가 시스템을 나타낸 블록구성도. 도 2 및 도 3은 유인 감시용 시설물 및 무인 감시용 시설물 중 유인 감시용 시설물의 상태평가를 수행하는 본 발명의 실측연산이 적용된 시설물 상태평가 시스템에 구비되는 유인 감시용 시설물 및 고소작업장비를 나타낸 외관 상태의 도면. 도 4는 유인 감시용 시설물 및 무인 감시용 시설물 중 유인 감시용 시설물의 상태평가를 수행하는 본 발명의 실 측연산이 적용된 시설물 상태평가 시스템에 구비되는 유인 감시용 시설물 및 고소작업장비를 나타낸 블록구성도. 도 5는 유인 감시용 시설물 및 무인 감시용 시설물 중 유인 감시용 시설물의 상태평가를 수행하는 본 발명의 실 측연산이 적용된 시설물 상태평가 시스템에 구비되는 레이저 포인터를 나타낸 사시도. 도 6은 유인 감시용 시설물 및 무인 감시용 시설물 중 유인 감시용 시설물의 상태평가를 수행하는 본 발명의 실 측연산이 적용된 시설물 상태평가 시스템에 구비되는 레이저 포인터의 블록구성도. 도 7은 유인 감시용 시설물 및 무인 감시용 시설물 중 유인 감시용 시설물의 상태평가를 수행하는 본 발명의 실 측연산이 적용된 시설물 상태평가 시스템에 구비되는 시설물 관리자단말의 블록구성도. 도 8 내지 도 12는 유인 감시용 시설물 및 무인 감시용 시설물 중 무인 감시용 시설물의 상태평가를 수행하는 본 발명의 실측연산이 적용된 시설물 상태평가 시스템을 나타낸 블록구성도. 도 13은 유인 감시용 시설물 및 무인 감시용 시설물 중 유인 감시용 시설물의 상태평가를 수행하는 본 발명의 실측연산이 적용된 시설물 상태평가 시스템을 이루는 구성 중 드론의 외관을 나타낸 도면. 도 14 및 도 15는 유인 감시용 시설물 및 무인 감시용 시설물 중 무인 감시용 시설물의 상태평가를 수행하는 본 발명의 실측연산이 적용된 시설물 상태평가 시스템에 구비되는 무인 감시용 시설물의 외관을 나타낸 도면."}
