{"patent_id": "10-2022-7000578", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0098336", "출원번호": "10-2022-7000578", "발명의 명칭": "자동학습 기반 시계열 데이터 예측 및 제어 방법 및 장치", "출원인": "주식회사 인이지", "발명자": "김송환"}}
{"patent_id": "10-2022-7000578", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "복수의 시계열 데이터 예측 모델들 각각을 해당 모델 별 조건에 따라 학습하는 단계;상기 학습된 시계열 데이터 예측 모델들 중에서, 미리 정해진 조건을 만족하는 하나 이상의 최적 모델을 결정하는 단계; 및상기 하나 이상의 최적 모델을 조합하여 최종 모델을 생성하는 단계를 포함하고,상기 복수의 시계열 데이터 예측 모델들은통계 기반의 예측 모델 및 딥러닝 기반의 예측 모델 중 적어도 하나를 포함하는 자동학습 기반 시계열 데이터예측, 제어 및 설명 방법."}
{"patent_id": "10-2022-7000578", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,시계열 데이터 예측을 위한 목표 변수 데이터를 수신하는 단계; 및상기 목표 변수 데이터를 상기 최종 모델에 입력하여, 상기 목표 변수 데이터에 대응하는 목표 변수 예측 데이터를 출력하는 단계를 더 포함하는, 자동학습 기반 시계열 데이터 예측, 제어 및 설명 방법."}
{"patent_id": "10-2022-7000578", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 목표 변수 예측 데이터의 변화 방향을 결정하는 제어 변수 데이터를 수신하는 단계; 및상기 제어 변수 데이터를 상기 최종 모델에 입력하여, 상기 제어 변수 데이터에 대응하는 제어 변수 예측 데이터를 출력하는 단계를 더 포함하는, 자동학습 기반 시계열 데이터 예측, 제어 및 설명 방법."}
{"patent_id": "10-2022-7000578", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 목표 변수 예측 데이터 및 상기 제어 변수 예측 데이터에 기초하여, 상기 시계열 데이터 예측의 결과 및제어 방법을 제공하는 단계를 더 포함하는, 자동학습 기반 시계열 데이터 예측, 제어 및 설명 방법."}
{"patent_id": "10-2022-7000578", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 목표 변수 예측 데이터 및 상기 제어 변수 예측 데이터 사이의 상관관계에 기초하여, 상기 제어 변수 데이터를 조정하는 단계를 더 포함하는, 자동학습 기반 시계열 데이터 예측, 제어 및 설명 방법."}
{"patent_id": "10-2022-7000578", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 제어 변수 데이터를 조정하는 단계는공개특허 10-2022-0098336-3-상기 목표 변수 예측 데이터 및 상기 제어 변수 예측 데이터에 기초하여 결정되는 보상함수에 따라 강화학습 모델을 학습하는 단계를 포함하는, 자동학습 기반 시계열 데이터 예측, 제어 및 설명 방법."}
{"patent_id": "10-2022-7000578", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제3항에 있어서,상기 제어 변수 예측 데이터를 출력하는 단계는상기 제어 변수 데이터의 이동 방향을 결정하는 단계; 및상기 제어 변수 데이터의 최적 탐색 시간을 결정하는 단계를 포함하는, 자동학습 기반 시계열 데이터 예측, 제어 및 설명 방법."}
{"patent_id": "10-2022-7000578", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 목표 변수 예측 데이터를 출력하는 단계는상기 제어 변수 데이터의 상기 이동 방향 및 상기 최적 탐색 시간에 기초하여, 상기 목표 변수 예측 데이터를출력하는 단계를 포함하는, 자동학습 기반 시계열 데이터 예측, 제어 및 설명 방법."}
{"patent_id": "10-2022-7000578", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 학습하는 단계는복수의 시계열 데이터 예측 모델들 각각을 상기 해당 모델 별 조건에 따라 미리 정해진 횟수만큼 학습하는 단계를 포함하는, 자동학습 기반 시계열 데이터 예측, 제어 및 설명 방법."}
{"patent_id": "10-2022-7000578", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 최종 모델의 예측 성능을 평가하는 단계; 및상기 최종 모델의 예측 성능이 미리 정해진 임계값 이하로 떨어지는 경우, 상기 최종 모델을 업데이트하는 단계를 더 포함하는, 자동학습 기반 시계열 데이터 예측, 제어 및 설명 방법."}
{"patent_id": "10-2022-7000578", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,미리 정해진 주기에 따라 상기 최종 모델을 업데이트하는 단계를 더 포함하는, 자동학습 기반 시계열 데이터 예측, 제어 및 설명 방법."}
{"patent_id": "10-2022-7000578", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "하드웨어와 결합되어 제1항의 방법을 실행시키기 위하여 매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2022-7000578", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "복수의 시계열 데이터 예측 모델들 각각을 해당 모델 별 조건에 따라 학습하고, 상기 학습된 시계열 데이터 예측 모델들 중에서, 미리 정해진 조건을 만족하는 하나 이상의 최적 모델을 결정하고, 상기 하나 이상의 최적 모델을 조합하여 최종 모델을 생성하는 프로세서공개특허 10-2022-0098336-4-를 포함하고,상기 복수의 시계열 데이터 예측 모델들은통계 기반의 예측 모델 및 딥러닝 기반의 예측 모델 중 적어도 하나를 포함하는 자동학습 기반 시계열 데이터예측, 제어 및 설명 장치."}
{"patent_id": "10-2022-7000578", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 프로세서는시계열 데이터 예측을 위한 목표 변수 데이터를 수신하고, 상기 목표 변수 데이터를 상기 최종 모델에입력하여, 상기 목표 변수 데이터에 대응하는 목표 변수 예측 데이터를 출력하는, 자동학습 기반 시계열 데이터예측, 제어 및 설명 장치."}
{"patent_id": "10-2022-7000578", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 프로세서는상기 목표 변수 예측 데이터의 변화 방향을 결정하는 제어 변수 데이터를 수신하고, 상기 제어 변수 데이터를상기 최종 모델에 입력하여, 상기 제어 변수 데이터에 대응하는 제어 변수 예측 데이터를 출력하는, 자동학습기반 시계열 데이터 예측,제어 및 설명 장치."}
{"patent_id": "10-2022-7000578", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "자동학습 기반 시계열 데이터 예측 및 제어 방법 및 장치가 개시된다. 일 실시예에 따른 자동학습 기반 시계열 데이터 예측 및 제어 방법은 복수의 시계열 데이터 예측 모델들 각각을 해당 모델 별 조건에 따라 학습하는 단계, 학습된 시계열 데이터 예측 모델들 중에서, 미리 정해진 조건을 만족하는 하나 이상의 최적 모델을 결정하 는 단계 및 하나 이상의 최적 모델을 조합하여 최종 모델을 생성하는 단계를 포함하고, 복수의 시계열 데이터 예 측 모델들은 통계 기반의 예측 모델 및 딥러닝 기반의 예측 모델 중 적어도 하나를 포함한다. 공개특허10-2022-0098336 CPC특허분류 G06N 3/08 (2013.01)명 세 서 청구범위 청구항 1 복수의 시계열 데이터 예측 모델들 각각을 해당 모델 별 조건에 따라 학습하는 단계; 상기 학습된 시계열 데이터 예측 모델들 중에서, 미리 정해진 조건을 만족하는 하나 이상의 최적 모델을 결정하 는 단계; 및 상기 하나 이상의 최적 모델을 조합하여 최종 모델을 생성하는 단계 를 포함하고, 상기 복수의 시계열 데이터 예측 모델들은 통계 기반의 예측 모델 및 딥러닝 기반의 예측 모델 중 적어도 하나를 포함하는 자동학습 기반 시계열 데이터 예측, 제어 및 설명 방법. 청구항 2 제1항에 있어서, 시계열 데이터 예측을 위한 목표 변수 데이터를 수신하는 단계; 및 상기 목표 변수 데이터를 상기 최종 모델에 입력하여, 상기 목표 변수 데이터에 대응하는 목표 변수 예측 데이 터를 출력하는 단계 를 더 포함하는, 자동학습 기반 시계열 데이터 예측, 제어 및 설명 방법. 청구항 3 제2항에 있어서, 상기 목표 변수 예측 데이터의 변화 방향을 결정하는 제어 변수 데이터를 수신하는 단계; 및 상기 제어 변수 데이터를 상기 최종 모델에 입력하여, 상기 제어 변수 데이터에 대응하는 제어 변수 예측 데이 터를 출력하는 단계 를 더 포함하는, 자동학습 기반 시계열 데이터 예측, 제어 및 설명 방법. 청구항 4 제3항에 있어서, 상기 목표 변수 예측 데이터 및 상기 제어 변수 예측 데이터에 기초하여, 상기 시계열 데이터 예측의 결과 및 제어 방법을 제공하는 단계 를 더 포함하는, 자동학습 기반 시계열 데이터 예측, 제어 및 설명 방법. 청구항 5 제3항에 있어서, 상기 목표 변수 예측 데이터 및 상기 제어 변수 예측 데이터 사이의 상관관계에 기초하여, 상기 제어 변수 데이 터를 조정하는 단계 를 더 포함하는, 자동학습 기반 시계열 데이터 예측, 제어 및 설명 방법. 청구항 6 제5항에 있어서, 상기 제어 변수 데이터를 조정하는 단계는상기 목표 변수 예측 데이터 및 상기 제어 변수 예측 데이터에 기초하여 결정되는 보상함수에 따라 강화학습 모 델을 학습하는 단계 를 포함하는, 자동학습 기반 시계열 데이터 예측, 제어 및 설명 방법. 청구항 7 제3항에 있어서, 상기 제어 변수 예측 데이터를 출력하는 단계는 상기 제어 변수 데이터의 이동 방향을 결정하는 단계; 및 상기 제어 변수 데이터의 최적 탐색 시간을 결정하는 단계 를 포함하는, 자동학습 기반 시계열 데이터 예측, 제어 및 설명 방법. 청구항 8 제7항에 있어서, 상기 목표 변수 예측 데이터를 출력하는 단계는 상기 제어 변수 데이터의 상기 이동 방향 및 상기 최적 탐색 시간에 기초하여, 상기 목표 변수 예측 데이터를 출력하는 단계 를 포함하는, 자동학습 기반 시계열 데이터 예측, 제어 및 설명 방법. 청구항 9 제1항에 있어서, 상기 학습하는 단계는 복수의 시계열 데이터 예측 모델들 각각을 상기 해당 모델 별 조건에 따라 미리 정해진 횟수만큼 학습하는 단계 를 포함하는, 자동학습 기반 시계열 데이터 예측, 제어 및 설명 방법. 청구항 10 제1항에 있어서, 상기 최종 모델의 예측 성능을 평가하는 단계; 및 상기 최종 모델의 예측 성능이 미리 정해진 임계값 이하로 떨어지는 경우, 상기 최종 모델을 업데이트하는 단계 를 더 포함하는, 자동학습 기반 시계열 데이터 예측, 제어 및 설명 방법. 청구항 11 제1항에 있어서, 미리 정해진 주기에 따라 상기 최종 모델을 업데이트하는 단계 를 더 포함하는, 자동학습 기반 시계열 데이터 예측, 제어 및 설명 방법. 청구항 12 하드웨어와 결합되어 제1항의 방법을 실행시키기 위하여 매체에 저장된 컴퓨터 프로그램. 청구항 13 복수의 시계열 데이터 예측 모델들 각각을 해당 모델 별 조건에 따라 학습하고, 상기 학습된 시계열 데이터 예 측 모델들 중에서, 미리 정해진 조건을 만족하는 하나 이상의 최적 모델을 결정하고, 상기 하나 이상의 최적 모 델을 조합하여 최종 모델을 생성하는 프로세서를 포함하고, 상기 복수의 시계열 데이터 예측 모델들은 통계 기반의 예측 모델 및 딥러닝 기반의 예측 모델 중 적어도 하나를 포함하는 자동학습 기반 시계열 데이터 예측, 제어 및 설명 장치. 청구항 14 제13항에 있어서, 상기 프로세서는 시계열 데이터 예측을 위한 목표 변수 데이터를 수신하고, 상기 목표 변수 데이터를 상기 최종 모델에 입력하여, 상기 목표 변수 데이터에 대응하는 목표 변수 예측 데이터를 출력하는, 자동학습 기반 시계열 데이터 예측, 제어 및 설명 장치. 청구항 15 제14항에 있어서, 상기 프로세서는 상기 목표 변수 예측 데이터의 변화 방향을 결정하는 제어 변수 데이터를 수신하고, 상기 제어 변수 데이터를 상기 최종 모델에 입력하여, 상기 제어 변수 데이터에 대응하는 제어 변수 예측 데이터를 출력하는, 자동학습 기반 시계열 데이터 예측,제어 및 설명 장치. 발명의 설명"}
{"patent_id": "10-2022-7000578", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "아래 실시예들은 자동학습 기반 시계열 데이터 예측 및 제어 방법 및 장치에 관한 것으로, 구체적으로는 적절한 양의 학습 시계열 데이터 만으로, 미래를 정확한 예측할 수 있는 자동학습 인공지능 학습 및 검증 기술에 관한 것이다."}
{"patent_id": "10-2022-7000578", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "금융, 제조 등의 분야에서 사람은 시계열, 순차적 데이터의 변화를 인식하여 그에 맞는 판단을 해야 하는 경우 가 많다. 예를 들어, 증권회사의 전문 투자자는 환율, 금리 등 시장 가치의 변화를 모니터링하며, 투자 시점 및 금액을 예측하고, 공장 설비의 조작자는 온도, 압력, 유량 정보를 살펴보고 설비의 상황을 예측하여 최적 제 어를 수행한다. 그러나, 주식이나 환율 등 시계열 데이터의 분석은 복합적인 요소가 관여하기 때문에 어떤 요 소가 영향을 주는지 정확히 찾아내기는 어렵다. 최근 인공지능 기술의 발전은 예측에 있어서 전통적인 통계적 분석에 비하여 뛰어난 예측 성능을 보이고 있다. 그러나, 기존의 인공지능 모델은 데이터에 기반하여 학습된 모델이 시간에 따른 재학습이 부족하여 시간이 지나 면 그 정합성이 떨어지는 문제가 있다. 또한, 기존의 인공지능 모델은 이상 데이터의 진단에만 초점을 맞추고 있어서, 최적화된 설비 제어 및 투자 기법을 자동으로 학습 및 제공하는데 적합하지 않다."}
{"patent_id": "10-2022-7000578", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "실시예들은 기계학습 모델에 기반한 학습과 예측 뿐만 아니라, 딥러닝 모델을 자동 학습하여 최적 모델을 선택 하고자 한다. 실시예들은 목표 변수를 최적으로 제어하기 위한 자동 학습기능을 제공하고자 한다. 실시예들은 딥러닝 모델 학습 및 시계열 딥러닝 모델에 대한 설명 기능을 제공하고자 한다. 본 발명의 기술적 과제는 이상에서 언급한 것들로 제한되지 않으며, 언급되지 않은 또 다른 기술적 과제는 아래 의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-7000578", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따른 자동학습 기반 시계열 데이터 예측 및 제어 방법은 복수의 시계열 데이터 예측 모델들 각각을 해당 모델 별 조건에 따라 학습하는 단계; 상기 학습된 시계열 데이터 예측 모델들 중에서, 미리 정해진 조건을 만족하는 하나 이상의 최적 모델을 결정하는 단계; 및 상기 하나 이상의 최적 모델을 조합하여 최종 모델을 생 성하는 단계를 포함하고, 상기 복수의 시계열 데이터 예측 모델들은 통계 기반의 예측 모델 및 딥러닝 기반의 예측 모델 중 적어도 하나를 포함한다. 일 실시예에 따른 자동학습 기반 시계열 데이터 예측 및 제어 방법은 시계열 데이터 예측을 위한 목표 변수 데 이터를 수신하는 단계; 및 상기 목표 변수 데이터를 상기 최종 모델에 입력하여, 상기 목표 변수 데이터에 대응 하는 목표 변수 예측 데이터를 출력하는 단계를 더 포함할 수 있다. 일 실시예에 따른 자동학습 기반 시계열 데이터 예측 및 제어 방법은 상기 목표 변수 예측 데이터의 변화 방향 을 결정하는 제어 변수 데이터를 수신하는 단계; 및 상기 제어 변수 데이터를 상기 최종 모델에 입력하여, 상기 제어 변수 데이터에 대응하는 제어 변수 예측 데이터를 출력하는 단계를 더 포함할 수 있다. 일 실시예에 따른 자동학습 기반 시계열 데이터 예측 및 제어 방법은 상기 목표 변수 예측 데이터 및 상기 제어 변수 예측 데이터에 기초하여, 상기 시계열 데이터 예측의 결과 및 제어 방법을 제공하는 단계를 더 포함할 수 있다. 일 실시예에 따른 자동학습 기반 시계열 데이터 예측 및 제어 방법은 상기 목표 변수 예측 데이터 및 상기 제어 변수 예측 데이터 사이의 상관관계에 기초하여, 상기 제어 변수 데이터를 조정하는 단계를 더 포함할 수 있다. 상기 제어 변수 데이터를 조정하는 단계는 상기 목표 변수 예측 데이터 및 상기 제어 변수 예측 데이터에 기초 하여 결정되는 보상함수에 따라 강화학습 모델을 학습하는 단계를 포함할 수 있다. 상기 제어 변수 예측 데이터를 출력하는 단계는 상기 제어 변수 데이터의 이동 방향을 결정하는 단계; 및 상기 제어 변수 데이터의 최적 탐색 시간을 결정하는 단계를 포함할 수 있다. 상기 목표 변수 예측 데이터를 출력하는 단계는 상기 제어 변수 데이터의 상기 이동 방향 및 상기 최적 탐색 시 간에 기초하여, 상기 목표 변수 예측 데이터를 출력하는 단계를 포함할 수 있다. 상기 학습하는 단계는 복수의 시계열 데이터 예측 모델들 각각을 상기 해당 모델 별 조건에 따라 미리 정해진 횟수만큼 학습하는 단계를 포함할 수 있다. 일 실시예에 따른 자동학습 기반 시계열 데이터 예측 및 제어 방법은 상기 최종 모델의 예측 성능을 평가하는 단계; 및 상기 최종 모델의 예측 성능이 미리 정해진 임계값 이하로 떨어지는 경우, 상기 최종 모델을 업데이트 하는 단계를 더 포함할 수 있다. 일 실시예에 따른 자동학습 기반 시계열 데이터 예측 및 제어 방법은 미리 정해진 주기에 따라 상기 최종 모델 을 업데이트하는 단계를 더 포함할 수 있다. 일 실시예에 따른 자동학습 기반 시계열 데이터 예측 및 제어 장치는 복수의 시계열 데이터 예측 모델들 각각을 해당 모델 별 조건에 따라 학습하고, 상기 학습된 시계열 데이터 예측 모델들 중에서, 미리 정해진 조건을 만족 하는 하나 이상의 최적 모델을 결정하고, 상기 하나 이상의 최적 모델을 조합하여 최종 모델을 생성하는 프로세 서를 포함하고, 상기 복수의 시계열 데이터 예측 모델들은 통계 기반의 예측 모델 및 딥러닝 기반의 예측 모델 중 적어도 하나를 포함한다. 상기 프로세서는 시계열 데이터 예측을 위한 목표 변수 데이터를 수신하고, 상기 목표 변수 데이터를 상기 최종 모델에 입력하여, 상기 목표 변수 데이터에 대응하는 목표 변수 예측 데이터를 출력할 수 있다. 상기 프로세서는 상기 목표 변수 예측 데이터의 변화 방향을 결정하는 제어 변수 데이터를 수신하고, 상기 제어 변수 데이터를 상기 최종 모델에 입력하여, 상기 제어 변수 데이터에 대응하는 제어 변수 예측 데이터를 출력할 수 있다. 상기 프로세서는 상기 목표 변수 예측 데이터 및 상기 제어 변수 예측 데이터에 기초하여, 상기 시계열 데이터 예측의 결과 및 제어 방법을 제공할 수 있다. 상기 프로세서는 상기 목표 변수 예측 데이터 및 상기 제어 변수 예측 데이터 사이의 상관관계에 기초하여, 상 기 제어 변수 데이터를 조정할 수 있다. 상기 프로세서는 상기 목표 변수 예측 데이터 및 상기 제어 변수 예측 데이터에 기초하여 결정되는 보상함수에 따라 강화학습 모델을 학습할 수 있다. 상기 프로세서는 복수의 시계열 데이터 예측 모델들 각각을 상기 해당 모델 별 조건에 따라 미리 정해진 횟수만 큼 학습할 수 있다. 상기 프로세서는 상기 최종 모델의 예측 성능을 평가하고, 상기 최종 모델의 예측 성능이 미리 정해진 임계값 이하로 떨어지는 경우 상기 최종 모델을 업데이트할 수 있다. 상기 프로세서는 미리 정해진 주기에 따라 상기 최종 모델을 업데이트할 수 있다."}
{"patent_id": "10-2022-7000578", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "실시예들은 기계학습 모델에 기반한 학습과 예측 뿐만 아니라, 딥러닝 모델을 자동 학습하여 최적 모델을 선택 할 수 있다. 실시예들은 목표 변수를 최적으로 제어하기 위한 자동 학습기능을 제공할 수 있다. 실시예들은 딥러닝 모델 학습 및 시계열 딥러닝 모델에 대한 설명 기능을 제공할 수 있다."}
{"patent_id": "10-2022-7000578", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 청구범위의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-7000578", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 개시되어 있는 특정한 구조적 또는 기능적 설명들은 단지 기술적 개념에 따른 실시예들을 설명하 기 위한 목적으로 예시된 것으로서, 실시예들은 다양한 다른 형태로 실시될 수 있으며 본 명세서에 설명된 실시 예들에 한정되지 않는다. 제1 또는 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 이런 용어들은 하나의 구성요소 를 다른 구성요소로부터 구별하는 목적으로만 이해되어야 한다. 예를 들어 제1 구성요소는 제2 구성요소로 명명 될 수 있고, 유사하게 제2 구성요소는 제1 구성요소로도 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 구성요소들 간의 관계를 설명하는 표현들, 예를 들어 \"~간의에\"와 \"바로~간의에\" 또는 \"~에 이웃하는\"과 \"~에 직접 이웃하는\" 등 도 마찬가지로 해석되어야 한다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 설시된 특징, 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함 으로 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들 을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 해당 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가진다. 일반적으로 사용되 는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 갖는 것으로 해석되어야 하며, 본 명세서에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 실시예들은 퍼스널 컴퓨터, 랩톱 컴퓨터, 태블릿 컴퓨터, 스마트 폰, 텔레비전, 스마트 가전 기기, 지능형 자동 차, 키오스크, 웨어러블 장치 등 다양한 형태의 제품으로 구현될 수 있다. 이하, 실시예들을 첨부된 도면을 참 조하여 상세하게 설명한다. 각 도면에 제시된 동일한 참조 부호는 동일한 부재를 나타낸다. 도 1은 일 실시예에 따른 자동학습 기반 시계열 데이터 예측 및 제어 방법을 설명하기 위한 도면이다. 주식이나 환율 등 시계열 데이터의 분석은 복합적인 요소가 관여하기 때문에 어떤 요소가 영향을 주는지 정확히 찾아내기는 어렵다. 최근 인공지능 기술의 발전은 예측에 있어서 전통적인 통계적 분석에 비하여 뛰어난 예측 성능을 보이고 있다. 구체적으로, 딥러닝 기술은 이미지 및 신호 빅데이터에 나타나는 다양한 사용자의 행동 패턴을 사람에 버금가도록 정확하게 인지할 수 있다. 딥러닝 기술에 기반한 인공지능 모델은 사람에 버금가는 인지기능으로 개인화 사용자의 패턴을 인식하여 사람보다 더 정확한 예측을 하는 것이 가능할 수 있다. 그러나 정확한 학습을 위해, 수많은 인공지능(예를 들어, 기계학습 및 딥러닝) 모델과 정확도를 비교하는 것이 필요하 다. 일 실시예에 따른 자동학습 기반 시계열 데이터 예측 및 제어 장치(이하, 제어 및 예측 장치로 지칭한다) 는 다양한 인공지능 기술의 장점을 조합한 통합적인 학습(Federated Learning) 기반 예측, 자동제어 및 설명 서 비스를 제공할 수 있다. 도 1을 참조하면, 일 실시예에 따른 제어 및 예측 장치는 입력 시계열 데이터를 수신하여 입력 시계 열 데이터에 대응하는 예측 시계열 데이터를 출력할 수 있다. 나아가, 제어 및 예측 장치는 시 계열 예측 결과, 해당 예측에 관한 이유 및 최적 제어 제안 중 적어도 하나를 포함하는 예측 설명을 예측 시계열 데이터와 함께 출력할 수 있다. 예를 들어, 제어 및 예측 장치는 \"앞으로 데이터가 선형적으로 감소할 것으로 보입니다.\"라는 시계열 데이 터 예측 결과와, \"이를 적정수준으로 조정하기 위해서는 입력 A를 X%만큼 낮추는 것을 추천합니다.\"라는 최적 제어 제안을 포함하는 예측 설명을 예측 시계열 데이터와 함께 출력할 수 있다. 도 2는 일 실시예에 따른 학습 장치와 예측 장치 사이의 관계를 설명하기 위한 도면이다. 도 2를 참조하면, 일 실시예에 따른 학습 장치는 뉴럴 네트워크를 생성하거나, 뉴럴 네트워크를 훈련 (train)(또는 학습(learn))하거나, 뉴럴 네트워크를 재훈련(retrain)하는 기능들과 같은 다양한 프로세싱 기능 들을 갖는 컴퓨팅 디바이스에 해당된다. 예를 들어, 학습 장치는 PC(personal computer), 서버 디바이스, 모바일 디바이스 등의 다양한 종류의 디바이스들로 구현될 수 있다. 학습 장치는 주어진 초기 뉴럴 네트워크를 반복적으로 훈련(학습)시킴으로써, 훈련된 뉴럴 네트워크 를 생성할 수 있다. 훈련된 뉴럴 네트워크를 생성하는 것은 뉴럴 네트워크 파라미터를 결정하는 것을 의 미할 수 있다. 여기서, 파라미터들은 예를 들어 뉴럴 네트워크의 입/출력 액티베이션들, 웨이트들, 바이어스들 등 뉴럴 네트워크에 입/출력되는 다양한 종류의 데이터를 포함할 수 있다. 뉴럴 네트워크의 반복적인 훈련이 진행됨에 따라, 뉴럴 네트워크의 파라미터들은 주어진 입력에 대해 보다 정확한 출력을 연산하기 위해 조정될 (tuned) 수 있다. 학습 장치는 훈련된 뉴럴 네트워크를 예측 장치에 전달할 수 있다. 예측 장치는 모바일 디바이스, 임베디드(embedded) 디바이스 등에 포함될 수 있다. 예측 장치는 뉴럴 네트워크의 구동을 위한 전용 하드웨어일 수 있다. 예측 장치는 훈련된 뉴럴 네트워크를 그대로 구동하거나, 훈련된 뉴럴 네트워크가 가공(예를 들 어, 양자화)된 뉴럴 네트워크를 구동할 수 있다. 가공된 뉴럴 네트워크를 구동하는 예측 장치 는, 생성 모델 학습 장치와는 별도의 독립적인 디바이스에서 구현될 수 있다. 하지만, 이에 제한되지 않 고, 예측 장치는 학습 장치와 동일한 디바이스 내에도 구현될 수 있다. 이하에서, 예측 장치 및 학습 장치를 모두 포함하는 디바이스를 인공지능 장치로 지칭한다. 도 3은 일 실시예에 따른 자동학습 기반 시계열 데이터 예측 및 제어 방법을 설명하기 위한 도면이다. 도 3을 참조하면, 단계들(310 내지 330)은 도 2를 참조하여 전술한 학습 장치에 의해 수행될 수 있다. 일 실시 예에 따른 학습 장치는 하나 또는 그 이상의 하드웨어 모듈, 하나 또는 그 이상의 소프트웨어 모듈, 또는 이들 의 다양한 조합에 의하여 구현될 수 있다. 나아가, 도 3의 동작은 도시된 순서 및 방식으로 수행될 수 있지만, 도 3에 도시된 실시예의 사상 및 범위를 벗어나지 않으면서 일부 동작의 순서가 변경되거나 일부 동작이 생략될 수 있다. 도 3에 도시된 다수의 동작은 병렬로 또는 동시에 수행될 수 있다. 단계에서, 학습 장치는 복수의 시계열 데이터 예측 모델들 각각을 해당 모델 별 조건에 따라 학습한다. 학습 장치는 각 모델들을 각 모델별로 다른 조건으로 미리 정해진 횟수(예를 들어, 3번)만큼 학습할 수 있다. 단계에서, 학습 장치는 학습된 시계열 데이터 학습 모델들 중에서, 미리 정해진 조건을 만족하는 하나 이 상의 최적 모델을 결정한다. 예를 들어, 학습 장치는 복수의 시계열 데이터 예측 모델들 중에서, 예측 성능이 좋고 모델 변화에 예측성능이 크게 변하지 않는 상위 3개의 모델을 최적 모델로 결정할 수 있다. 단계에서, 학습 장치는 하나 이상의 최적 모델을 조합하여 최종 모델을 생성한다. 단계들(310 내지 330)은 주어진 예측 성능이 떨어지거나 학습 이후 특정 주기가 지나면 자동으로 반복될 수 있 다. 예를 들어, 학습 장치는 최종 모델의 예측 성능을 평가하고, 최종 모델의 예측 성능이 미리 정해진 임계값 이하로 떨어지는 경우, 단계들(310 내지 330)을 반복하여 최종 모델을 갱신할 수 있다. 또는, 학습 장치는 미 리 정해진 주기에 따라 최종 모델을 업데이트할 수도 있다. 도 4는 일 실시예에 따른 학습 방법을 설명하기 위한 도면이다. 도 4를 참조하면, 일 실시예에 따른 학습 장치는 복수의 시계열 데이터 예측 모델들 각각을 해당 모델 별 조건 에 따라 학습한다. 일 실시예에 따른 복수의 시계열 데이터 예측 모델들은 통계 기반의 예측 모델 및 딥러닝 기반의 예측 모델 중 적어도 하나를 포함할 수 있다. 예를 들어, 통계 기반의 예측 모델은 LASSO, ARIMA, XGBoost 등을 포함할 수 있고, 딥러닝 기반의 예측 모델은 FCN/CNN, LSTM, LSTM-CNN, STGCN, DARNN, DSANet 등을 포함할 수 있다. 그 러나, 전술한 복수의 시계열 데이터 예측 모델들은 단지 기술적 개념에 따른 실시예들을 설명하기 위한 목적으 로 예시된 것으로서, 복수의 시계열 데이터 예측 모델들은 다양한 다른 모델들을 포함할 수 있으며 본 명세서에 설명된 예시들에 한정되지 않는다. 학습 장치는 복수의 시계열 데이터 예측 모델들 각각을 3회 학습할 수 있고, 그 중 최적 모델을 결정할 수 있다. 예를 들어, 학습 장치는 XGBoost 모델 중 2번째로 학습된 모델인 M2XGB를 제1 최적 모델로, LSTM-CNN 모 델 중 3번째로 학습된 모델인 M3LSTM-CNN를 제2 최적 모델로, DARNN 모델 중 1번째로 학습된 모델인 M1DARNN를 제3 최적 모델로 결정할 수 있다. 나아가, 학습 장치는 M2XGB, M3LSTM-CNN, M1DARNN를 조합하여 최종 모델(예를 들어, ModelMIX)을 생성할 수 있다. 최 종 모델이 생성되면, 예측 장치는 최적으로 학습되어 저장된 최종 모델을 이용하여, 재학습 없이 입력된 데이터 에 대한 예측값을 실시간으로 제공할 수 있다. 시계열 데이터를 예측 및 제어하는 상세한 방법은 아래에서 도 5a 내지 도 5b를 참조하여 설명된다. 도 5a는 일 실시예에 따른 시계열 데이터를 예측 및 제어하는 방법을 설명하기 위한 도면이다. 도 5a를 참조하면, 일 실시예에 따른 예측 장치는 학습 장치로부터 최종 모델을 전달받을 수 있다. 다만, 전술 한 바와 같이 예측 장치는 학습 장치와 동일한 디바이스 내에 구현될 수 있다. 예측 장치는 시계열 데이터 예측을 위한 목표 변수 데이터를 수신할 수 있다. 나아가, 예측 장치는 목표 변수 데이터를 최종 모델에 입력하여, 목표 변수 데이터에 대응하는 목표 변수 예측 데이터를 출력할 수 있다. 목표 변수 데이터는 예측의 대상이 되는 입력 시계열 데이터이고, 예측 목표 변수 데이터는 목표 변수 데이터에 대응 하는 예측 데이터를 의미할 수 있다. 목표 변수 데이터는 예를 들어, 시간에 따른 공정 수율 데이터, 투자 수 익률 데이터일 수 있다. 예측 장치는 목표 변수 예측 데이터의 변화 방향을 결정하는 제어 변수 데이터를 수신할 수 있다. 나아가, 예 측 장치는 제어 변수 데이터를 최종 모델에 입력하여, 제어 변수 데이터에 대응하는 제어 변수 예측 데이터를 출력할 수 있다. 제어 변수 데이터는 목표 변수 예측 데이터의 변화 방향을 결정하는 데이터로, 예를 들어, 목 표 데이터가 투자 수익율 데이터인 경우 제어 변수 데이터는 투자 수익율에 영향을 미칠 수 있는 국제 유가 데이터, 환율 데이터 등일 수 있다. 예측 장치는 목표 변수 예측 데이터 및 제어 변수 예측 데이터에 기초하여, 시계열 데이터 예측의 결과 및 제어 방법을 제공할 수 있다. 예측 장치는 목표 변수 예측 데이터 및 제어 변수 예측 데이터 사이의 상관관계에 기 초하여, 제어 변수 데이터를 조정할 수 있다. 일례로, 예측 장치는 목표 변수 예측 데이터 및 제어 변수 예측 데이터에 기초하여 결정되는 보상함수에 따라 강화학습 모델을 학습할 수 있다. 예를 들어, 예측 장치는 최적 예측모델에 기반하여 제어 변수를 조정하고, 이를 공정 수율 및 생산량 향상, 투 자 수익률 증가, 안정성 증가와 같은 목표 변수 데이터의 변화 방향을 정하고, 이를 최적화할 수 있는 제어 변 수 데이터를 강화학습을 통해 학습할 수 있다. 나아가, 예측 장치는 최적화된 제어변수의 조정 방향에 대해서 사용자에게 제공할 수 있다. 아래 도 5b을 참조하여, 일 실시예에 따른 가이드 방법에 대하여 보다 상세히 설 명한다. 도 5b를 참조하면, 일 실시예에 따른 예측 장치는 제어 변수(예를 들어, 공정 파라미터 또는 공정 독립변수)의 최적값 탐색 방향과 최적값 탐색 시간을 사용자에게 가이드할 수 있다. 즉, 최적화 함수의 변수들은 최적화 대 상 파라미터 Y, 공정 파라미터(x1,x2,..,xn) 및 최적값 탐색 시간(또는, 횟수)일 수 있다. 일 실시예에 따른 예측 장치는 최종 모델 뿐만 아니라 블랙박스 모델을 더 포함할 수 있다. 일 실시예에 따른 블랙박스 모델은 독립변수들에 대응하는 결과값을 출력하는 모델일 수 있다. 일 실시예에 따른 최종 모델은 결 과값을 예측할 때 사용될 수 있고, 일 실시예에 따른 블랙박스 모델은 최종 모델에서 예측한 최적값 탐색 결과 에 기초하여 최적 탐색 시간 및 최적값을 결정할 때 사용될 수 있다. 보다 구체적으로, 일 실시예에 따른 예측 장치는 공정 최적값을 탐색하기 위해서는 공정 독립변수들의 원점(예 를 들어, 초기 x)으로 부터의 이동 방향(예를 들어, 증가 또는 감소)을 선택해야할 수 있다. 예를 들어, 일 실 시예에 따른 예측 장치는 최종 모델(예를 들어, 설명 가능 모델)이 학습한 독립변수들과 종속변수(y)와의 상관 관계(예를 들어, 기울기)에 따라 이동방향을 결정할 수 있다.예를 들어, 일 실시예에 따른 예측 장치는 원점에 서 임의의 방향으로 공정 독립변수들을 1회 탐색(xt = xt-1+dx)시킨 후 설명 가능 모델의 응답(yt=f(xt))이 개선 (yt>yt-1)되면 해당 탐색값을 저장하고 다음 최적값 탐색을 진행할 수 있고, 개선되지 않으면 해당 탐색값을 기각 하고 독립변수를 직전 위치로(xt-1) 복귀시킬 수 있다. 일 실시예에 따른 예측 장치는 미리 설정된 탐색 종료 시간에 도달하면 저장된 최적값 탐색 결과(xt)를 블랙박스 모델에 입력할 수 있다. 일 실시예에 따른 예측 장치는 블랙박스 모델의 응답이 최적(argmax f(x))인 탐색 시 간(횟수)을 찾아서 해당 시간을 최적 탐색시간으로 결정하고, 최적 탐색시간의 최적값 탐색결과를 가이드(최적 x)로 결정할 수 있다. 따라서, 정확한 공정 가이드 및 이에 대한 설명을 제공하는 것이 가능한 시스템이다. 도 6은 일 실시예에 따른 인공지능 장치의 블록도를 도시한 도면이다. 도 6을 참조하면, 일 실시예에 따른 인공지능 장치는 프로세서를 포함한다. 인공지능 장치는 통신 인터페이스 및 메모리를 더 포함할 수 있다. 프로세서, 메모리 및 통신 인터페이스는 통 신 버스를 통해 서로 통신할 수 있다. 프로세서는 복수의 시계열 데이터 예측 모델들 각각을 해당 모델 별 조건에 따라 학습하고, 상기 학습된 시계열 데이터 예측 모델들 중에서, 미리 정해진 조건을 만족하는 하나 이상의 최적 모델을 결정하고, 상기 하 나 이상의 최적 모델을 조합하여 최종 모델을 생성한다. 메모리는 상술한 프로세서에서의 처리 과정에서 생성되는 다양한 정보들을 저장할 수 있다. 이 밖에 도, 메모리는 각종 데이터와 프로그램 등을 저장할 수 있다. 메모리는 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 메모리는 하드 디스크 등과 같은 대용량 저장 매체를 구비하여 각종 데이터를 저장할 수 있다. 이 밖에도, 프로세서는 도 1 내지 도 5를 통해 전술한 적어도 하나의 방법 또는 적어도 하나의 방법에 대 응되는 알고리즘을 수행할 수 있다. 프로세서는 프로그램을 실행하고, 인공지능 장치를 제어할 수 있다. 프로세서에 의하여 실행되는 프로그램 코드는 메모리에 저장될 수 있다. 인공지능 장치(60 0)는 입출력 장치(미도시)를 통하여 외부 장치(예를 들어, 퍼스널 컴퓨터 또는 네트워크)에 연결되고, 데이터를 교환할 수 있다.이상에서 설명된 실시예들은 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨 어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치, 방법 및 구성요소는, 예를 들 어, 프로세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마 이크로컴퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령(instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이상의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터 를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로"}
{"patent_id": "10-2022-7000578", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "설명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소 (processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치 는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서 (parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치, 또는 전송되는 신호 파(signal wave)에 영구적으로, 또는 일시적으로 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매 체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등 을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판 독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다."}
{"patent_id": "10-2022-7000578", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상과 같이 실시예들이 비록 한정된 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가진 자라면 상기를 기초로 다양한 기술적 수정 및 변형을 적용할 수 있다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다.도면 도면1 도면2 도면3 도면4 도면5a 도면5b 도면6"}
{"patent_id": "10-2022-7000578", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 자동학습 기반 시계열 데이터 예측 및 제어 방법을 설명하기 위한 도면이다. 도 2는 일 실시예에 따른 학습 장치와 예측 장치 사이의 관계를 설명하기 위한 도면이다. 도 3은 일 실시예에 따른 자동학습 기반 시계열 데이터 예측 및 제어 방법을 설명하기 위한 도면이다. 도 4는 일 실시예에 따른 학습 방법을 설명하기 위한 도면이다. 도 5a 내지 도 5b는 일 실시예에 따른 시계열 데이터를 예측 및 제어하는 방법을 설명하기 위한 도면이다. 도 6은 일 실시예에 따른 인공지능 장치의 블록도를 도시한 도면이다."}
