{"patent_id": "10-2019-0121061", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0038791", "출원번호": "10-2019-0121061", "발명의 명칭": "고령 운전자를 위한 후방 경보 장치 및 방법", "출원인": "한국자동차연구원", "발명자": "박현배"}}
{"patent_id": "10-2019-0121061", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "차량의 후방에서 접근 주행중인 후방차량의 주행 상태 정보 또는 후방 추돌 경보 정보를 감지하는 감지부;상기 후방차량의 주행 상태 정보 또는 후방 추돌 경보 정보에 기초하여 후방 추돌 경보 신호를 출력하고, 상기후방 추돌 경보 신호 출력에 따른 운전자의 상황별 반응정보를 학습하며, 상기 학습된 상황별 반응정보에 기초하여 상기 운전자의 상황별 후방 추돌 경보 신호의 출력 시점을 설정하는 제어부; 및상기 제어부의 제어에 따라 후방 추돌 경보 신호를 출력하는 출력부를 포함하는 고령 운전자를 위한 후방 경보 장치."}
{"patent_id": "10-2019-0121061", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 제어부는, 상기 운전자를 인식하는 운전자 인식부;상기 인식된 운전자별로 상기 상황별 반응정보를 분류하고, 상기 후방차량의 주행 상태 정보 또는 후방 추돌 경보 정보에 기초하여 후방 추돌 경보 신호를 출력하며, 상기 후방 추돌 경보 신호 출력에 따른 운전자의 상황별반응정보를 학습하는 학습부; 및상기 학습된 상황별 반응정보에 기초하여 상기 운전자의 상황별 후방 추돌 경보 신호의 출력 시점을 설정하는경보 신호 출력 시점 설정부를 포함하는 것을 특징으로 하는 고령 운전자를 위한 후방 경보 장치."}
{"patent_id": "10-2019-0121061", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 제어부는,실시간으로 감지된 후방차량의 주행 상태 정보 또는 후방 추돌 경보 정보가 수신되면, 상기 경보 신호 출력 시점 설정부로부터 해당 상황에 대응하는 후방 추돌 경보 신호의 출력 시점을 획득하고, 상기 획득된 후방 추돌경보 신호의 출력 시점에 후방 추돌 경보 신호를 출력되게 하는 경보 신호 출력 제어부를 더 포함하는 것을 특징으로 하는 고령 운전자를 위한 후방 경보 장치."}
{"patent_id": "10-2019-0121061", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 경보 신호 출력 시점 설정부는, 상기 학습된 상황별 반응정보에 기초하여 상황별 후방 추돌 경보 신호의 출력 방법을 다르게 설정하는 것을 특징으로 하는 고령 운전자를 위한 후방 경보 장치."}
{"patent_id": "10-2019-0121061", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 공개특허 10-2021-0038791-3-상기 반응정보는 가속도 페달, 제동 페달 및 조향휠 중 적어도 하나 이상의 조작 정보인 것을 특징으로 하는 고령 운전자를 위한 후방 경보 장치."}
{"patent_id": "10-2019-0121061", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제어부가 차량을 운전하는 운전자를 인식하는 단계; 및상기 제어부가 상기 운전자가 차량을 운전하는 일정 기간동안 누적된 후방 추돌 경보 신호 출력에 따른 운전자의 상황별 반응정보를 학습하고, 상기 학습된 상황별 반응정보에 기초하여 상기 운전자의 상황별 후방 추돌 경보 신호의 출력 시점을 설정하는 단계;를 포함하는 고령 운전자를 위한 후방 경보 방법."}
{"patent_id": "10-2019-0121061", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 실시간으로 감지된 후방차량의 주행 상태 정보 또는 후방 추돌 경보 정보가 수신되면, 상기 제어부가 해당 상황에 설정된 후방 추돌 경보 신호의 출력 시점을 획득하고, 상기 획득된 후방 추돌 경보 신호의 출력 시점에 후방추돌 경보 신호를 출력하는 단계를 더 포함하는 것을 특징으로 하는 고령 운전자를 위한 후방 경보 방법."}
{"patent_id": "10-2019-0121061", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서, 상기 운전자의 상황별 후방 추돌 경보 신호의 출력 시점을 설정하는 단계에서, 상기 제어부는 상기 학습된 상황별 반응정보에 기초하여 상황별 후방 추돌 경보 신호의 출력 방법을 다르게 설정하는 것을 특징으로 하는 고령 운전자를 위한 후방 경보 방법."}
{"patent_id": "10-2019-0121061", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서, 상기 반응정보는 가속도 페달, 제동 페달 및 조향휠 중 적어도 하나 이상의 조작 정보인 것을 특징으로 하는 고령 운전자를 위한 후방 경보 방법."}
{"patent_id": "10-2019-0121061", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "고령 운전자를 위한 후방 경보 장치 및 방법이 개시된다.본 발명의 일 측면에 따른 고령 운전자를 위한 후방 경 보 장치는, 차량의 후방에서 접근 주행중인 후방차량의 주행 상태 정보 또는 후방 추돌 경보 정보를 감지하는 감 지부, 상기 후방차량의 주행 상태 정보 또는 후방 추돌 경보 정보에 기초하여 후방 추돌 경보 신호를 출력하고, 상기 후방 추돌 경보 신호 출력에 따른 운전자의 상황별 반응정보를 학습하며, 상기 학습된 상황별 반응정보에 기초하여 상기 운전자의 상황별 후방 추돌 경보 신호의 출력 시점을 설정하는 제어부, 및 상기 제어부의 제어에 따라 후방 추돌 경보 신호를 출력하는 출력부를 포함한다."}
{"patent_id": "10-2019-0121061", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 고령 운전자를 위한 후방 경보 장치 및 방법에 관한 것으로서, 보다 상세하게는 운전자의 경보(警報) 신호에 대한 반응을 고려하여, 운전자에 따라 적응적으로 경보 신호 출력 시점을 제어하는 고령 운전자를 위한 후방 경보 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2019-0121061", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 고령 운전자는 근력, 시력, 청력을 비롯한 신체적 능력과 단기 기억, 공간 지각과 같은 인지적 능 력이 일반 운전자에 비하여 떨어지는 특징을 가지고 있다. 특히, 고령 운전자는 노인성 난청으로 인하여 급격한 청력 소실이 발생하여 소리를 잘 듣지 못하는 경우가 많다. 이러한 고령 운전자의 청력 소실은 고령 운전자는 차량 운전에 제약이 따르게 마련이다. 또한, 고령 운전자는 표지판, 신호등을 판단하는 시력과 인지능력이 저하 되고 각종 돌발 상황에 대처하는 능력이 떨어질 수밖에 없다. 통계에 따르면 고령(65세 이상) 운전자의 돌발상황 반응시간은 청장년층에 비해 20~30% 늦는 것으로 조사되고 있다. 한편, 고령화 사회로 접어들면서 고령 운전자의 교통사고 점유율이 매년 늘고 있다. 이에 글로벌 완성차업계는 고령 운전자를 위한 옵션이나 ADAS(advanced driver assistance system) 등의 연구개발을 확대하여 반응행동이 제한되는 고령 운전자를 위해 차량에 전자제어브레이크시스템(EBS), 전방충돌경고시스템(FCW) 등을 적용하는 추 세이다. 특히, 자동차의 지능화가 더욱 높은 수준으로 진행됨에 따라, 운전자의 운전을 보조하는 ADAS의 장착이 증가하고 있는 점을 감안할 때, 고령 운전자의 경고음 반응 특성에 관한 연구의 필요성이 더욱 증대되고 있다. ADAS는 전방 충돌 상황이 발생할 경우 경고를 하는 ACC(adaptive cruise control)나 차선을 이탈한 상황이 발생 할 경우에 경고를 하는 LDWS(lane departure warning system) 등이 있으며, 주로 경고음을 통하여 운전자에게 위험 정보를 제공하고 있다. 하지만, ACC나 LDWS와 같은 첨단 안전 시스템의 경고음은 설계를 할 때 고령 운전자의 청력 소실 결과를 고려하 지 않고 설계를 하며, 그 결과, 교통사고가 발생할 수 있는 후방 충돌과 같은 위험 상황에서 고령 운전자는 경 고음을 듣지 못하고 적절한 반응을 못하는 경우가 발생할 수 있다. 이에, 고령 운전자의 청력역치와 경고음에 대한 반응 시간 등을 고려하여, 적절한 시점에 후방추돌에 대한 경보 를 알릴 수 있는 기술 개발이 요구되고 있다. 본 발명과 관련된 선행기술로는 대한민국 등록특허공보 제1262555호(발명의 명칭 : 오경보 방지 기능을 가지는 추돌 경보 장치 및 그 방법)가 있다."}
{"patent_id": "10-2019-0121061", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점들을 개선하기 위하여 안출된 것으로, 본 발명의 목적은 운전자의 경보(警報) 신 호에 대한 반응을 고려하여, 운전자에 따라 적응적으로 경보 신호 출력 시점을 제어하는 고령 운전자를 위한 후 방 경보 장치 및 방법을 제공하는 것이다. 본 발명이 해결하고자 하는 과제는 이상에서 언급한 과제(들)로 제한되지 않으며, 언급되지 않은 또 다른 과제 (들)은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0121061", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 측면에 따른 고령 운전자를 위한 후방 경보 장치는, 차량의 후방에서 접근 주행중인 후방차량의 주행 상태 정보 또는 후방 추돌 경보 정보를 감지하는 감지부, 상기 후방차량의 주행 상태 정보 또는 후방 추돌 경보 정보에 기초하여 후방 추돌 경보 신호를 출력하고, 상기 후방 추돌 경보 신호 출력에 따른 운전자의 상황 별 반응정보를 학습하며, 상기 학습된 상황별 반응정보에 기초하여 상기 운전자의 상황별 후방 추돌 경보 신호 의 출력 시점을 설정하는 제어부, 및 상기 제어부의 제어에 따라 후방 추돌 경보 신호를 출력하는 출력부를 포 함한다. 본 발명에서 상기 제어부는, 상기 운전자를 인식하는 운전자 인식부, 상기 인식된 운전자별로 상기 상황별 반응 정보를 분류하고, 상기 후방차량의 주행 상태 정보 또는 후방 추돌 경보 정보에 기초하여 후방 추돌 경보 신호 를 출력하며, 상기 후방 추돌 경보 신호 출력에 따른 운전자의 상황별 반응정보를 학습하는 학습부, 상기 학습 된 상황별 반응정보에 기초하여 상기 운전자의 상황별 후방 추돌 경보 신호의 출력 시점을 설정하는 경보 신호 출력 시점 설정부를 포함할 수 있다. 본 발명에서 상기 제어부는, 실시간으로 감지된 후방차량의 주행 상태 정보 또는 후방 추돌 경보 정보가 수신되 면, 상기 경보 신호 출력 시점 설정부로부터 해당 상황에 대응하는 후방 추돌 경보 신호의 출력 시점을 획득하 고, 상기 획득된 후방 추돌 경보 신호의 출력 시점에 후방 추돌 경보 신호를 출력되게 하는 경보 신호 출력 제 어부를 더 포함할 수 있다. 본 발명에서 상기 경보 신호 출력 시점 설정부는, 상기 학습된 상황별 반응정보에 기초하여 상황별 후방 추돌 경보 신호의 출력 방법을 다르게 설정할 수 있다. 본 발명에서 상기 반응정보는 가속도 페달, 제동 페달 및 조향휠 중 적어도 하나 이상의 조작 정보일 수 있다. 본 발명의 일 측면에 따른 고령 운전자를 위한 후방 경보 방법은, 제어부가 차량을 운전하는 운전자를 인식하는 단계, 상기 제어부가 상기 운전자가 차량을 운전하는 일정 기간동안 누적된 후방 추돌 경보 신호 출력에 따른 운전자의 상황별 반응정보를 학습하고, 상기 학습된 상황별 반응정보에 기초하여 상기 운전자의 상황별 후방 추 돌 경보 신호의 출력 시점을 설정하는 단계를 포함한다. 본 발명에서, 고령 운전자를 위한 후방 경보 방법은, 실시간으로 감지된 후방차량의 주행 상태 정보 또는 후방 추돌 경보 정보가 수신되면, 상기 제어부가 해당 상황에 설정된 후방 추돌 경보 신호의 출력 시점을 획득하고, 상기 획득된 후방 추돌 경보 신호의 출력 시점에 후방 추돌 경보 신호를 출력하는 단계를 더 포함할 수 있다. 본 발명의 상기 운전자의 상황별 후방 추돌 경보 신호의 출력 시점을 설정하는 단계에서, 상기 제어부는 상기 학습된 상황별 반응정보에 기초하여 상황별 후방 추돌 경보 신호의 출력 방법을 다르게 설정할 수 있다. 본 발명에서 상기 반응정보는 가속도 페달, 제동 페달 및 조향휠 중 적어도 하나 이상의 조작 정보일 수 있다."}
{"patent_id": "10-2019-0121061", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 인지/반응 능력(청각, 시각, 운동 신경 등)이 떨어지는 고령 운전자의 인지/반응 능력을 학 습하여 사전에 경보를 알려줌으로써 돌발행위 등을 통해 발생할 수 있는 1,2차 사고를 방지할 수 있다."}
{"patent_id": "10-2019-0121061", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "한편, 본 발명의 효과는 이상에서 언급한 효과들로 제한되지 않으며, 이하에서 설명할 내용으로부터 통상의 기 술자에게 자명한 범위 내에서 다양한 효과들이 포함될 수 있다."}
{"patent_id": "10-2019-0121061", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면들을 참조하여 본 발명의 일 실시예에 따른 고령 운전자를 위한 후방 경보 장치 및 방법을 설 명한다. 이 과정에서 도면에 도시된 선들의 두께나 구성요소의 크기 등은 설명의 명료성과 편의상 과장되게 도 시되어 있을 수 있다. 또한, 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례에 따라 달라질 수 있다. 그러므로 이러한 용어들에 대한 정의는 본 명세서 전반에 걸친 내용을 토대로 내 려져야 할 것이다. 또한, 본 명세서에서 설명된 구현은, 예컨대, 방법 또는 프로세스, 장치, 소프트웨어 프로그램, 데이터 스트림 또는 신호로 구현될 수 있다. 단일 형태의 구현의 맥락에서만 논의(예컨대, 방법으로서만 논의)되었더라도, 논 의된 특징의 구현은 또한 다른 형태(예컨대, 장치 또는 프로그램)로도 구현될 수 있다. 장치는 적절한 하드웨어, 소프트웨어 및 펌웨어 등으로 구현될 수 있다. 방법은, 예컨대, 컴퓨터, 마이크로프로세서, 집적 회 로 또는 프로그래밍가능한 로직 디바이스 등을 포함하는 프로세싱 디바이스를 일반적으로 지칭하는 프로세서 등 과 같은 장치에서 구현될 수 있다. 프로세서는 또한 최종-사용자 사이에 정보의 통신을 용이하게 하는 컴퓨터, 셀 폰, 휴대용/개인용 정보 단말기(personal digital assistant: \"PDA\") 및 다른 디바이스 등과 같은 통신 디 바이스를 포함한다. 도 1은 본 발명의 일 실시예에 따른 고령 운전자를 위한 후방 경보 장치의 동작을 설명하기 위한 예시도이다. 도 1을 참조하면, 일반적으로 후방 경보 장치는 운전자의 인지/반응 능력에 무관하게 설정된 후방 추돌 경보 알 림 지점(a)에서 후방 추돌 경보 신호를 출력한다. 그러나 인지/반응 능력(청각, 시각, 운동 신경 등)이 떨어지 는 고령 운전자에게 a 지점에서 후방 추돌 경고음을 발생시키면, 후방 추돌에 대한 위험 상황에서 고령운전자가 경고음을 듣지 못하고 적절한 반응을 못 하는 경우가 있다. 따라서, 고령 운전자의 청력역치와 경고음에 대한 반응 시간 등을 고려하여, 적절한 시점에 고령 운전자에 적합한 경고음을 발생시킬 필요가 있다. 이에, 본 발명에 따른 후방 경보 장치는 인지/반응 능력(청각, 시각, 운동 신경 등)이 떨어지는 고령 운전자의 경고음에 대한 반응을 학습하고, 그 학습 결과에 기초하여 해당 고령 운전자에게 적합한 후방 추돌 경보 알림 지점(b)을 선택하며, 선택된 후방 추돌 경보 알림 지점(b)에서 후방 추돌에 대한 위험 상황을 사전에 알릴 수 있다. 이처럼 후방 경보 장치는 자차량 및 후방차량의 주행 상태 정보를 수집하여 운전자에게 경보를 전달함으 로써, 돌발행위 등을 통해 발생할 수 있는 사고를 방지할 수 있는 장치일 수 있다. 이때, 주행 상태 정보는 차 량의 후방 사각지대(BSD; Blind Spot Detection Zone)을 감시하는 센서, 후방 차선 변경 지원(LCA; Lane Change Assist Zone)을 감시하는 센서, 후방 추돌 지역(RPC; Rear Pre Crash Zone)을 감시하는 센서 등을 통해 수집될 수 있다. 또는 주행 상태 정보는 네비게이션 또는 차량 내의 V2X 통신 장치, GPS 모듈과 같이 차량 외부 의 장치로부터 수신되는 정보를 포함할 수 있다. 즉, 주행 상태 정보는 차량 자체적으로 생성하는 정보 또는 차 량 외부에서 생성되어 전달되는 정보를 모두 포함하는 의미로 해석될 수 있다. 이러한 후방 경보 장치에 대한 상세한 설명은 도 2를 참조하기로 한다. 도 2는 본 발명의 일 실시예에 따른 고령 운전자를 위한 후방 경보 장치를 개략적으로 나타낸 블록도, 도 3은 도 2에 도시된 제어부의 기능을 세부적으로 나타낸 블록도이다. 도 2를 참조하면, 본 발명의 일 실시예에 따른 고령 운전자를 위한 후방 경보 장치는 통신부, 감지부 , 출력부 및 제어부를 포함한다. 통신부는 차량에 장착된 GPS, 가속도 센서 등을 포함하는 각종 센서 또는 차선이탈 방지 및 제어 장치 (LDWS & LKAS; Lane Departure Warning system and Lane Keeping Assist System), 스마트 크루즈 컨트롤(SCC; Smart Cruise Control), 주차 지원 시스템(SPAS; Smart Parking Assistant System) 등을 포함하는 주행 지원 시스템으로부터 감지된 정보를 감지부로 송신할 수 있다. 이때, 통신부는 인터넷을 비롯한 ISDN(Integrated Services Digital Network), ADSL(Asymmetric Digital Subscriber Line), LAN(Local Area Network), Ethernet, CAN(Controller Area Network), TCP/IP 기반 통신망, 광통신망, CDMA, WCDMA 등의 이동 통신망을 포함하는 무선 통신망, 지그비(Zigbee), 블루투스 (Bluetooth) 등의 근거리 통신망, CAN 통신, V2X 통 신 등으로 구성될 수 있다. 감지부는 차량의 후방에서 접근 주행중인 후방차량의 주행 상태 정보를 감지한다. 여기서, 후방차량의 주 행 상태 정보는 후방차량의 속도 및 거리 등을 포함할 수 있다. 구체적으로, 감지부는 차량의 후방 영역에 대한 주행 환경을 감지하는 기능을 수행하는 것으로, 카메라 및 레이다 센서모듈을 포함하고, 초음파 센서모듈, 적외선 센서모듈 중 적어도 하나 이상을 더 포함할 수 있으나 이에 한정하지 않을 수 있다. 또한, 감지부 는 리어뷰(rear view) 카메라와 같은 카메라 장치를 차량의 좌우측 사이드 미러(side mirror)에 장착함으로써, 차량의 후방 영역을 촬영할 수 있고, 어라운드 뷰 모니터링 시스템(AVM;Around View Monitoring System)의 카 메라로부터 후방차량의 주행 상태 정보를 감지할 수 있다. 또한, 감지부는 자차량의 주행 상태 정보를 감지하는 기능도 수행하는 것으로, 자차량의 주행 상태 정보는 자차량의 주행 속도, 주행 방향 및 위치 정보 등을 포함할 수 있으며, 이는 통신부를 통해 차량에 장착된 GPS, 가속도 센서 또는 차선이탈 방지 및 제어 장치(LDWS & LKAS; Lane Departure Warning system and Lane Keeping Assist System), 스마트 크루즈 컨트롤(SCC; Smart Cruise Control), 주차 지원 시스템(SPAS; Smart Parking Assistant System) 등을 포함하는 주행 지원 시스템으로부터 수신될 수 있다. 또한, 감지부는 차량을 운전하는 운전자를 식별하는 기능을 수행하는 것으로, 차량 내에 장착되어 있는 지 문 센서, 얼굴인식 센서, 홍채인식 센서 등과 같은 생체정보 인식 장치를 통하여 운전자 식별정보를 감지할 수 있다. 즉, 감지부는 차량에 장착된 각종 센서를 포함할 수 있고, 또는 통신부를 통해 각종 센서 및 주행 지원 시스템으로부터 감지된 정보를 수신할 수 있다. 또한, 감지부는 후방차량으로부터 후방 추돌 경보 정보를 수신할 수 있다. 이때, 후방 추돌 경보 정보는 후방차량이 전방차량(자차량)을 추돌할 가능성이 있음을 알리는 정보로, 차량 내의 V2X 통신 장치 등을 통해 후 방차량으로부터 수신된 정보일 수 있다. 출력부는 제어부의 제어에 따라 후방 추돌 경보 신호를 출력한다. 이때, 출력부는 음성 모듈, 진동 모듈, 영상 모듈 중 적어도 하나 이상의 장치로 구현되어 경보 신호를 출력할 수 있다. 예를 들어, 사고 위험을 경고하도록 경고 알람을 출력하는 스피커, 차량의 계기판에 설치되어 점등 또는 점멸되는 경고등, 차량 의 전면 유리에 경고 영상이나 문자를 표시하는 헤드 업 디스플레이(Head-Up Display) 장치, 자차량과 타차량을 화면상에 표시하는 네이게이션 등의 기능을 탑재한 디스플레이 장치 및 차량의 스티어링휠(steering wheel)이나시트(seat), 가속 페달에 설치되어 진동을 발생하는 햅틱 모듈 등이 될 수 있다. 제어부는 감지부로부터 전달받은 자차량 및 후방차량의 주행 상태 정보 또는 후방 추돌 경보 정보에 기초하여 후방 추돌 경보 신호를 출력하고, 후방 추돌 경보 신호 출력에 따른 운전자의 상황별 반응정보를 학습 하며, 학습된 상황별 반응정보에 기초하여 운전자의 상황별 후방 추돌 경보 신호의 출력 시점을 설정한다. 여기 서, 후방 추돌 경보 신호는 운전자에게 후방차량 추돌에 대한 위험상황을 인지시키기 위한 사전 경고일 수 있다. 운전자의 반응정보는 운전자가 차량을 가속하거나 제동하거나 차량의 진행방향을 변경하는 것으로, 가속, 제동, 진행방향 변경 중 적어도 두 가지가 동시에 이루어질 수 있다. 즉, 운전자 반응정보는 가속과 진행방향 변경이 동시에 이루어지거나 제동과 진행방향 변경이 동시에 이루어질 수 있다. 이러한 제어부는 도 3에 도시된 바와 같이, 운전자 인식부, 학습부, 경보 신호 출력 시점 설정 부 및 경보 신호 출력 제어부를 포함한다. 운전자 인식부는 현재 차량을 운전하는 운전자를 인식한다. 이때, 운전자 인식부는 다양한 방법으로 차량의 운전자를 인식할 수 있다. 예컨대, 운전자 인식부는 감지부를 통해 수신된 운전자 식별정보를 이용하여 운전자를 인식하거나 등 록할 수 있다. 또한, 운전자 인식부는 운전자가 소유한 차량용 스마트키 또는 포브키(FOB key), 차량용 리 모콘에 따라 운전자를 인식하거나, 운전자별 차량 시트 설정에 따라 운전자를 인식할 수 있다. 학습부는 운전자 인식부에서 인식된 운전자별로 상황별 반응정보를 분류하고, 자차량 및 후방차량의 주행 상태 정보 또는 후방 추돌 경보 정보에 기초하여 후방 추돌 경보 신호를 출력하고, 후방 추돌 경보 신호 출력에 따른 운전자의 상황별 반응정보를 학습한다. 이때, 학습부는 기설정된 프로그램에 의하여 동작하는 하나 이상의 마이크로프로세서 또는 마이크로프로세서를 포함하는 하드웨어로써, 운전자의 상황별 반응정보에 따라 후방 경보 장치의 동작을 수행하기 위한 일련의 명령으로 형성될 수 있다. 이하, 학습부의 동작에 대해 구체적으로 설명하기로 한다. 먼저, 학습부가 주행 상태 정보를 이용하여 운전자의 상황별 반응정보를 학습하는 방법에 대해 설명하기로 한다. 이 경우, 학습부는 운전자가 차량을 운전하는 일정 기간동안 누적된 후방 추돌 경보 신호 출력에 따 른 운전자의 반응정보를 학습한다. 즉, 학습부는 주행 상태 정보를 이용하여 자차량과 후방차량의 거리를 산출하고, 산출된 거리가 후방 추돌 경보 신호의 출력 시점인 경우 후방 추돌 경보 신호를 출력하며, 후방 추돌 경보 신호 출력에 따른 운전자의 반응정보를 획득할 수 있다. 이때, 운전자의 반응정보는 차량에 장착된 방향지 시등 조작이나 페달 작동 감지센서, 멀티기능 조작 감지센서 등의 누적된 동작 정보일 수 있다. 즉, 운전자의 반응정보는 운전자가 가속도 페달, 제동 페달 및 조향휠 중 적어도 하나 이상의 조작 여부일 수 있다. 따라서, 학습부는 CAN 통신을 통해 운전자의 반응정보를 획득할 수 있다. 그런 후, 학습부는 후방 추돌 경보 신호 출력에 따른 운전자의 반응정보를 학습할 수 있다. 다음으로, 학습부가 후방 추돌 경보 정보를 이용하여 운전자의 상황별 반응정보를 학습하는 방법에 대해 설명하기로 한다. 이 경우, 학습부는 후방 추돌 경보 정보 수신 시, 후방 추돌 경보 신호를 출력하고, 후 방 추돌 경보 신호 출력에 따른 운전자의 상황별 반응정보를 학습한다. 예를 들어, 후방차량이 빠른 속도로 주 행하여, 전방에 있는 자차량과 추돌 가능성이 있는 경우, 후방차량은 V2X를 이용하여 후방 추돌 경보 정보를 자 차량에 전달하고, 급정차를 할 수 있다. 그러면, 자차량은 후방 차량과 추돌 가능성이 있다는 후방 추돌 경보 신호를 출력할 수 있다. 이때, 자차량의 운전자는 후방차량의 급정차로 후방 추돌 경보 신호를 인지하지 못하거 나 핸들을 꺽어 옆차량과 충돌하는 등의 반응이 있을 수 있다. 이에, 학습부는 누적된 후방 추돌 경보 신 호 출력에 따른 운전자의 반응정보를 학습하고, 학습된 상황별 반응정보를 이용하여 운전자에게 가장 적합한 상 황별 후방 추돌 경보 신호의 출력 시점을 선택할 수 있다. 학습부의 학습은 딥러닝 등의 인공지능 기술에 의해 수행될 수 있다. 경보 신호 출력 시점 설정부는 학습부에서 학습된 상황별 반응정보에 기초하여 운전자의 상황별 후방 추돌 경보 신호의 출력 시점을 설정한다. 즉, 경보 신호 출력 시점 설정부는 학습된 상황별 반응정보를 이 용하여 운전자에게 가장 적합한 상황별 후방 추돌 경보 신호의 출력 시점을 선택할 수 있다. 예를 들어, 후방차량 추돌 발생이 예상되어 후방차량이 a지점에 위치할 때, 후방 추돌 경보 신호를 출력한 결과, 운전자가 핸들을 꺽는 반응을 수행하였다고 가정하자. 이러한 운전자의 반응으로 좌측 차량과 충돌이 발 생하였다면, a지점은 후방 추돌 경보 신호의 출력 시점으로 적절하지 않다는 것을 알 수 있다. 이에, 경보 신호출력 시점 설정부는 a지점보다 자차량과 거리가 더 먼 b지점을 후방 추돌 경보 신호 출력 시점으로 설정할 수 있다. 또한, 경보 신호 출력 시점 설정부는 학습부에서 학습된 상황별 반응정보에 기초하여 상황별 후방 추 돌 경보 신호의 출력 방법을 다르게 설정할 수 있다. 예를 들어, 상황별 반응정보가 적절한 반응인 경우 해당 출력 시점에 후방 추돌 경보 신호가 출력되도록 하고, 적절한 반응이 아닌 경우 해당 상황에 설정된 출력 시점 을 늘리거나 줄일 수 있으며, 소리, 음성, 영상 등의 알림 방식을 변경할 수 있다. 경보 신호 출력 제어부는 실시간으로 감지된 후방차량의 주행 상태 정보 또는 후방 추돌 경보 정보가 수신 되면, 경보 신호 출력 시점 설정부로부터 해당 상황에 대응하는 후방 추돌 경보 신호의 출력 시점을 획득 하고, 획득된 후방 추돌 경보 신호의 출력 시점에 후방 추돌 경보 신호가 출력되도록 제어한다. 한편, 운전자 인식부, 학습부, 경보 신호 출력 시점 설정부 및 경보 신호 출력 제어부는 컴퓨팅 장치상에서 프로그램을 실행하기 위해 필요한 프로세서 등에 의해 각각 구현될 수 있다. 이처럼 운전자 인식부, 학습부, 경보 신호 출력 시점 설정부 및 경보 신호 출력 제어부는 물리적으로 독 립된 각각의 구성에 의해 구현될 수도 있고, 하나의 프로세서 내에서 기능적으로 구분되는 형태로 구현될 수도 있다. 제어부는 후방 경보 장치의 동작을 제어하는 구성으로, 적어도 하나의 연산 장치를 포함할 수 있는데, 여기서 상기 연산 장치는 범용적인 중앙연산장치(CPU), 특정 목적에 적합하게 구현된 프로그래머블 디 바이스 소자(CPLD, FPGA), 주문형 반도체 연산장치(ASIC) 또는 마이크로 컨트롤러 칩일 수 있다. 상기와 같이 구성된 후방 경보 장치는 후방차량의 주행 상태 정보 또는 후방 추돌 경보에 기초하여 후방 추돌 경보 신호를 출력하고, 후방 추돌 경보 신호 출력에 따른 운전자의 상황별 반응을 학습하며, 학습된 상황 별 반응정보에 기초하여 운전자의 상황별 후방 추돌 경보 신호의 출력 시점을 변경할 수 있다. 이처럼, 후방 경 보 장치는 운전자의 상황적 대응을 학습하여 운전자의 인지능력을 학습할 수 있고, 학습된 정보를 기반으 로 경보 신호를 사전에 발생시킴으로써, 돌발행위 등을 통해 발생할 수 있는 1,2차 사고를 방지할 수 있다. 도 4는 본 발명의 일 실시예에 따른 고령 운전자를 위한 후방 추돌 경보 방법을 설명하기 위한 흐름도이다. 도 4를 참조하면, 후방 경보 장치는 차량을 운전하는 운전자를 인식하고(S410), 운전자가 차량을 운전하는 일정 기간동안 누적된 후방 추돌 경보 신호 출력에 따른 운전자의 상황별 반응을 학습한다(S420). 즉, 후방 경 보 장치는 후방차량의 주행 상태 정보 및 후방 추돌 경보 정보 중 적어도 하나에 기초하여 후방 추돌 경보 신호를 출력하고, 후방 추돌 경보 신호 출력에 따른 운전자의 상황별 반응을 학습한다. 그런 후, 후방 경보 장 치는 학습된 상황별 반응정보에 기초하여 운전자의 상황별 후방 추돌 경보 신호의 출력 시점을 설정할 수 있다. 예를 들어, 상황별 반응정보가 적절한 반응인 경우 해당 출력 시점을 그대로 유지하고, 적절한 반응이 아 닌 경우 해당 상황에 설정된 출력 시점을 늘리거나 줄일 수 있으며, 소리, 음성, 영상 등의 알림 방식을 변경할 수 있다. 단계 S420의 수행 후, 후방 경보 장치는 차량의 실시간 주행 상태 정보 및 후방차량의 주행 상태 정보를 수신하고(S430), 수신된 주행 상태 정보로 경보 상황이 발생했는지를 판단한다(S440), 이때, 후방 경보 장치 는 자차량과 후방차량 간의 거리를 산출하고, 산출된 거리에 기초하여 추돌 가능 여부를 판단할 수 있다. 또한, 후방 경보 장치는 자차량의 속도, 후방차량의 속도, 자차량의 가/감속도, 후방차량의 가/감속도, 자 차량과 후방차량 사이의 거리를 기초로 자차량과 후방차량의 추돌 가능 여부를 판단할 수도 있다. 단계 S440의 판단결과, 경보 상황이 발생한 것으로 판단되면, 후방 경보 장치는 해당 상황에 대응하는 경 보 신호 출력 시점에 후방 추돌 경보 신호를 출력한다(S450). 상술한 바와 같이, 본 발명의 일 실시예에 따른 고령 운전자를 위한 후방 경보 장치 및 방법은, 인지/반응 능력 (청각, 시각, 운동 신경 등)이 떨어지는 고령 운전자의 인지/반응 능력을 학습하여 사전에 경보를 알려줌으로써 돌발행위 등을 통해 발생할 수 있는 1, 2차 사고를 방지할 수 있다. 본 발명은 도면에 도시된 실시예를 참고로 하여 설명되었으나, 이는 예시적인 것에 불과하며, 당해 기술이 속하 는 분야에서 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점을 이해할것이다. 따라서 본 발명의 진정한 기술적 보호범위는 아래의 특허청구범위에 의해서 정하여져야 할 것이다."}
{"patent_id": "10-2019-0121061", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 고령 운전자를 위한 후방 경보 장치의 동작을 설명하기 위한 예시도이다. 도 2는 본 발명의 일 실시예에 따른 고령 운전자를 위한 후방 경보 장치를 개략적으로 나타낸 블록도이다. 도 3은 도 2에 도시된 제어부의 기능을 세부적으로 나타낸 블록도이다. 도 4는 본 발명의 일 실시예에 따른 고령 운전자를 위한 후방 추돌 경보 방법을 설명하기 위한 흐름도이다."}
