{"patent_id": "10-2023-0005834", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0113996", "출원번호": "10-2023-0005834", "발명의 명칭": "정밀 관수를 위한 토양 환경 분석 시스템", "출원인": "주식회사 메디플랜츠", "발명자": "천병일"}}
{"patent_id": "10-2023-0005834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "정밀 관수를 위한 토양 환경 분석을 수행하는 제어 서버의 동작 방법에 있어서,복수의 센서 노드가 설치된 위치 정보 및 깊이 정보에 기초하여 상기 복수의 센서 노드 각각으로부터 토양 내수분 관련 정보를 센싱하는 단계;상기 복수의 센서 노드 각각으로부터 측정된 상기 토양 내 수분 관련 센싱 정보에 기초하여 토양 특성 정보를결정하는 단계; 및상기 결정된 토양 특성 정보에 기초하여 수분과 양액을 공급하는 적어도 하나의 관수장치, 상기 복수의 센서 노드 및 작물 위치를 제어하는 단계;를 포함하는, 제어서버의 동작 방법."}
{"patent_id": "10-2023-0005834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 토양 내 수분 관련 정보는 토양 내 모든 공극이 물로 채워진 상태에 기초하여 메트릭 퍼텐싱에 의해 토양내 공극에 남아있는 물을 지칭하는 포장 용수량 및 토양 성질에 기초하여 물을 배출하는 값을 지칭하는 탈수 값을 포함하는, 제어서버의 동작 방법."}
{"patent_id": "10-2023-0005834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 포장 용수량 및 상기 탈수 값에 기초하여 상기 토양 특성 정보가 결정되되, 상기 토양 특성 정보는 토양의종류 및 토양의 혼합비 정보이고,상기 복수 개의 센서 노드를 통해 센싱되는 상기 포장 용수량 및 상기 탈수 값에 기초하여 도출되는 상기 토양의 종류 및 상기 토양의 혼합비 정보가 데이터베이스에 저장되고,상기 복수 개의 센서 노드를 통해 센싱되지 않은 상기 토양의 종류 및 상기 토양의 혼합비 정보는 딥러닝에 기초하여 결정되는, 제어서버의 동작 방법."}
{"patent_id": "10-2023-0005834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 제어서버는 상기 토양 특성 정보를 통해 상기 적어도 하나의 관수장치 각각의 위치가 상기 작물 위치에 기초하여 적합한 위치인지 여부를 확인하여 상기 적어도 하나의 관수장치 각각의 위치를 결정하고,상기 토양 특성 정보를 통해 상기 복수 개의 센서 노드 각각의 위치가 적합한지 여부를 확인하여 상기 복수 개의 센서 노드 각각의 위치를 결정하는, 제어서버의 동작 방법."}
{"patent_id": "10-2023-0005834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2 항에 있어서,상기 탈수 값은 물의 이동 방향에 따라 축 방향 값 및 횡 방향 값에 기초하여 결정되는 벡터 값이고, 상기 벡터공개특허 10-2024-0113996-3-값에 기초하여 상기 토양 특성 정보를 도출하되, 상기 벡터 값은 토양 내 수분 잔여 시간 정보와 연계되고,상기 제어서버는 상기 탈수 값을 통해 상기 적어도 하나의 관수장치 각각의 위치가 상기 작물 위치에 기초하여적합한 위치인지 여부를 확인하여 상기 적어도 하나의 관수장치 각각의 위치를 결정하고,상기 탈수 값에 기초하여 상기 복수 개의 센서 노드 각각의 위치가 적합한지 여부를 확인하여 상기 복수 개의센서 노드 각각의 위치를 결정하는, 제어서버의 동작 방법."}
{"patent_id": "10-2023-0005834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5 항에 있어서,상기 탈수 값은 상기 적어도 하나의 관수장치 각각에 기초하여 센싱되되,상기 제어서버는 상기 적어도 하나의 관수장치 각각으로 포화 급수를 제공하고,상기 포화 급수에 기초하여 상기 탈수 값에 대한 물의 이동 변화 지도를 기 설정된 시간 간격에 따라 생성하고,상기 적어도 하나의 관수장치 각각에 대해 생성된 상기 물의 이동 변화 지도에 기초하여 상기 수분 및 양액 공급에 대한 공백 영역을 확인하고,상기 공백 영역을 최소화되도록 관수장치의 수와 위치를 결정하고, 상기 작물 위치는 상기 공백 영역 이외의 영역으로 결정되는, 제어서버의 동작 방법."}
{"patent_id": "10-2023-0005834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6 항에 있어서,상기 제어서버는 인공지능 학습모델을 구비하고, 상기 적어도 하나의 관수장치 각각에 대해 생성된 상기 물의이동 변화 지도를 통해 상기 인공지능 학습모델을 학습하고,상기 학습된 인공지능 학습모델을 통해 상기 수분 및 상기 양액 공급을 제어하는, 제어서버의 동작 방법."}
{"patent_id": "10-2023-0005834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,상기 제어서버는 상기 복수 개의 센서 노드를 통해 포장 용수량 및 탈수 값을 센싱하여 상기 토양 특성 정보를데이터베이스에 저장하되, 상기 토양 특성 정보는 토양의 종류 및 토양의 혼합비 정보이고, 상기 복수 개의 센서 노드를 통해 센싱되지 않은 상기 토양 특성 정보는 딥러닝에 기초하여 결정되고,상기 제어서버는 상기 토양 특성 정보에 기초하여 상기 적어도 하나의 관수장치 각각의 위치가 상기 작물 위치에 따라 적합한 위치인지 여부를 확인하여 상기 적어도 하나의 관수장치 각각의 위치를 결정하고,상기 토양 특성 정보에 기초하여 상기 복수 개의 센서 노드 각각의 위치가 적합한지 여부를 확인하여 상기 복수개의 센서 노드 각각의 위치를 결정하되,상기 복수 개의 센서 노드를 통해 센싱되는 상기 탈수 값은 물의 이동 방향에 따라 축 방향 값 및 횡 방향 값에기초하여 결정되는 벡터 값이고, 상기 탈수 값은 상기 적어도 하나의 관수장치 각각에 기초하여 센싱되되,상기 제어서버는 상기 적어도 하나의 관수장치 각각으로 포화 급수를 제공하고,상기 포화급수에 기초하여 상기 탈수 값에 대한 물의 이동 변화 지도를 기 설정된 시간 간격에 따라 생성하고,상기 적어도 하나의 관수장치 각각에 대해 생성된 상기 물의 이동 변화 지도에 기초하여 상기 수분 및 양액 공급에 대한 공백 영역을 확인하고,상기 공백 영역을 최소화되도록 관수장치의 수와 위치를 결정하고, 상기 작물 위치를 상기 공백 영역 이외의 영공개특허 10-2024-0113996-4-역으로 결정하는, 제어서버의 동작 방법."}
{"patent_id": "10-2023-0005834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "하드웨어와 결합되어 제 1항 내지 제8항 중 어느 한 항에 따른 정밀 관수를 위한 토양 환경을 분석하도록 컴퓨터로 판독 가능한 매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2023-0005834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "정밀 관수를 위한 토양 환경 분석을 수행하는 제어 서버에 있어서,노지 스마트 팜에서 메쉬 형태로 설치되고, 상기 노지 스마트 팜 내의 농작물 관련 정보를 센싱하는 복수의 센서 노드;상기 복수의 센서 노드에서 획득되는 센싱 값에 기초하여 토양 분석을 수행하는 제어부; 및상기 분석된 토양의 특성에 기초하여 원수 및 양액을 공급하는 관수장치;를 포함하는 상기 제어 서버로써,상기 복수의 센서 노드가 설치된 위치 정보 및 깊이 정보에 기초하여 상기 복수의 센서 노드 각각으로부터 토양내 수분 관련 정보를 센싱하고,상기 복수의 센서 노드 각각으로부터 측정된 상기 토양 내 수분 관련 센싱 정보에 기초하여 토양 특성 정보를결정하고, 및상기 결정된 토양 특성 정보에 기초하여 수분과 양액을 공급하는 적어도 하나의 상기 관수장치, 상기 복수의 센서 노드 및 작물 위치를 제어하는, 제어서버."}
{"patent_id": "10-2023-0005834", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 명세서의 일 실시예에 따라, 정밀 관수를 위한 토양 환경 분석을 수행하는 제어 서버의 동작 방법에 있어서, 복수의 센서 노드가 설치된 위치 정보 및 깊이 정보에 기초하여 복수의 센서 노드 각각으로부터 토양 내 수분 관 련 정보를 센싱하는 단계, 복수의 센서 노드 각각으로부터 측정된 토양 내 수분 관련 센싱 정보에 기초하여 토양 특성 정보를 결정하는 단계 및 결정된 토양 특성 정보에 기초하여 수분과 양액을 공급하는 적어도 하나의 관수장 치, 복수의 센서 노드 및 작물 위치를 제어하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0005834", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "실시예들은 정밀 관수를 위한 토양 환경 분석 시스템에 대한 것이다. 보다 상세하게는, 노지(露地) 스마트 팜 (smart farm)에서 복수의 센서 노드를 통해 토양을 센싱하고, 이에 기초하여 토양 환경을 분석하는 시스템에 대 한 것이다."}
{"patent_id": "10-2023-0005834", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "스마트 팜(smart farm)이란, 비닐하우스, 축사 등 기존의 농사 기술에 정보통신기술(Information Communication Technology)을 접목하여 원격 및 자동으로 작물 또는 가축의 생육환경을 적절하게 유지, 관리할 수 있는 농장에 관련된 기술을 지칭한다. 스마트 팜을 이용함으로써, 작물의 생육 정보와 환경 정보에 대한 데 이터를 기반으로 최적의 생육 환경을 조성하여 농산물의 생산성과 품질을 제고할 수 있다. 이때, 정보통신기술 을 접목하여 스마트 팜을 관리하기 위해서는, 사용자가 스마트 팜의 데이터에 접근하여 필요한 내용을 열람할 수 있는 플랫폼(platform)이 필요할 수 있다. 또한, 스마트 팜은 넓은 영역에서 작물들을 관리하기 때문에 이를 효율적으로 관리하기 위한 방법이 필요할 수 있다. 또한, 넓은 영역에 위치하는 작물들에는 원수 공급을 효율적 으로 수행하는 방법이 필요성이 있다. 하기에서는 스마트 팜에 기초하여 복수의 센서 노드를 통해 토양을 센싱 하고, 토양 환경을 분석하는 분석 시스템에 대해 서술한다. 선행기술문헌 특허문헌(특허문헌 0001) 한국특허등록 제 10-2019-0057220 A호"}
{"patent_id": "10-2023-0005834", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 명세서는 정밀 관수를 위한 토양 환경 분석 시스템에 대한 것이다. 본 명세서는 노지 스마트 팜에서 복수의 센서에 기초하여 토양을 분석하는 방법 및 장치에 대한 것이다. 본 명세서는 토양이 물을 배출하는 성질에 기초하여 관수를 정밀하게 제어하는 방법 및 장치에 대한 것이다. 본 명세서는 포장 용수량 및 탈수 값에 기초한 데이터베이스를 구축하여 관수를 제어하는 방법 및 장치에 대한 것이다. 본 명세서는 토양 내 수분 변화에 대한 표본 정보에 기초하여 토양 내 복수의 센서 위치를 인지하고, 인지된 복 수 개의 센서에 기초하여 토양을 분석하는 방법 및 장치에 대한 것이다. 본 명세서는 주변 환경 정보에 기초하여 토양 내 수분 변화를 감지하여 토양을 분석하는 방법 및 장치에 대한 것이다. 본 명세서의 해결하고자 하는 과제는 상술한 바에 한정되지 아니하고, 하기에서 설명하는 발명의 실시예들에 의 해 도출될 수 있는 다양한 사항들로 확장될 수 있다."}
{"patent_id": "10-2023-0005834", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 명세서의 일 실시예에 따라, 정밀 관수를 위한 토양 환경 분석을 수행하는 제어 서버의 동작 방법에 있어서, 복수의 센서 노드가 설치된 위치 정보 및 깊이 정보에 기초하여 복수의 센서 노드 각각으로부터 토양 내 수분 관련 정보를 센싱하는 단계, 복수의 센서 노드 각각으로부터 측정된 토양 내 수분 관련 센싱 정보에 기초하여 토양 특성 정보를 결정하는 단계 및 결정된 토양 특성 정보에 기초하여 수분과 양액을 공급하는 적어도 하나의 관수장치, 복수의 센서 노드 및 작물 위치를 제어하는 단계를 포함할 수 있다. 본 명세서의 일 실시예에 따라, 정밀 관수를 위한 토양 환경 분석을 수행하는 제어 서버에 있어서, 노지 스마트 팜에서 메쉬 형태로 설치되고, 노지 스마트 팜 내의 농작물 관련 정보를 센싱하는 복수의 센서 노드, 복수의 센 서 노드에서 획득되는 센싱 값에 기초하여 토양 분석을 수행하는 제어부 및 분석된 토양의 특성에 기초하여 원 수 및 양액을 공급하는 관수장치를 포함하는 제어 서버로써, 복수의 센서 노드가 설치된 위치 정보 및 깊이 정 보에 기초하여 복수의 센서 노드 각각으로부터 토양 내 수분 관련 정보를 센싱하고, 복수의 센서 노드 각각으로 부터 측정된 토양 내 수분 관련 센싱 정보에 기초하여 토양 특성 정보를 결정하고, 및 결정된 토양 특성 정보에 기초하여 수분과 양액을 공급하는 적어도 하나의 관수장치, 복수의 센서 노드 및 작물 위치를 제어할 수 있다. 또한, 본 명세서의 일 실시예에 따라, 토양 내 수분 관련 정보는 토양 내 모든 공극이 물로 채워진 상태에 기초 하여 메트릭 퍼텐싱에 의해 토양 내 공극에 남아있는 물을 지칭하는 포장 용수량 및 토양 성질에 기초하여 물을 배출하는 값을 지칭하는 탈수 값을 포함할 수 있다. 또한, 본 명세서의 일 실시예에 따라, 포장 용수량 및 탈수 값에 기초하여 토양 특성 정보가 결정되되, 토양 특 성 정보는 토양의 종류 및 토양의 혼합비 정보이고, 복수 개의 센서 노드를 통해 센싱되는 포장 용수량 및 탈수 값에 기초하여 도출되는 토양의 종류 및 토양의 혼합비 정보가 데이터베이스에 저장되고, 복수 개의 센서 노드 를 통해 센싱되지 않은 토양의 종류 및 토양의 혼합비 정보는 딥러닝에 기초하여 결정될 수 있다. 또한, 본 명세서의 일 실시예에 따라, 제어서버는 토양 특성 정보를 통해 적어도 하나의 관수장치 각각의 위치 가 작물 위치에 기초하여 적합한 위치인지 여부를 확인하여 적어도 하나의 관수장치 각각의 위치를 결정하고, 토양 특성 정보를 통해 복수 개의 센서 노드 각각의 위치가 적합한지 여부를 확인하여 복수 개의 센서 노드 각 각의 위치를 결정할 수 있다. 또한, 본 명세서의 일 실시예에 따라, 탈수 값은 물의 이동 방향에 따라 축 방향 값 및 횡 방향 값에 기초하여 결정되는 벡터 값이고, 벡터 값에 기초하여 토양 특성 정보를 도출하되, 벡터 값은 토양 내 수분 잔여 시간 정보와 연계되고, 제어서버는 탈수 값을 통해 적어도 하나의 관수장치 각각의 위치가 작물 위치에 기초하여 적합 한 위치인지 여부를 확인하여 적어도 하나의 관수장치 각각의 위치를 결정하고, 탈수 값에 기초하여 복수 개의 센서 노드 각각의 위치가 적합한지 여부를 확인하여 복수 개의 센서 노드 각각의 위치를 결정할 수 있다. 또한, 본 명세서의 일 실시예에 따라, 탈수 값은 적어도 하나의 관수장치 각각에 기초하여 센싱되되, 제어서버 는 적어도 하나의 관수장치 각각으로 포화 급수를 제공하고, 포화 급수에 기초하여 탈수 값에 대한 물의 이동 변화 지도를 기 설정된 시간 간격에 따라 생성하고, 적어도 하나의 관수장치 각각에 대해 생성된 물의 이동 변 화 지도에 기초하여 수분 및 양액 공급에 대한 공백 영역을 확인하고, 공백 영역을 최소화되도록 관수장치의 수 와 위치를 결정하고, 작물 위치는 공백 영역 이외의 영역으로 결정될 수 있다. 또한, 본 명세서의 일 실시예에 따라, 제어서버는 인공지능 학습모델을 구비하고, 적어도 하나의 관수장치 각각 에 대해 생성된 물의 이동 변화 지도를 통해 인공지능 학습모델을 학습하고, 학습된 인공지능 학습모델을 통해 수분 및 양액 공급을 제어할 수 있다. 또한, 본 명세서의 일 실시예에 따라, 제어서버는 복수 개의 센서 노드를 통해 포장 용수량 및 탈수 값을 센싱 하여 토양 특성 정보를 데이터베이스에 저장하되, 토양 특성 정보는 토양의 종류 및 토양의 혼합비 정보이고, 복수 개의 센서 노드를 통해 센싱되지 않은 토양 특성 정보는 딥러닝에 기초하여 결정되고, 제어서버는 토양 특 성 정보에 기초하여 적어도 하나의 관수장치 각각의 위치가 작물 위치에 따라 적합한 위치인지 여부를 확인하여 적어도 하나의 관수장치 각각의 위치를 결정하고, 토양 특성 정보에 기초하여 복수 개의 센서 노드 각각의 위치 가 적합한지 여부를 확인하여 복수 개의 센서 노드 각각의 위치를 결정하되, 복수 개의 센서 노드를 통해 센싱 되는 탈수 값은 물의 이동 방향에 따라 축 방향 값 및 횡 방향 값에 기초하여 결정되는 벡터 값이고, 탈수 값은 적어도 하나의 관수장치 각각에 기초하여 센싱되되, 제어서버는 적어도 하나의 관수장치 각각으로 포화 급수를 제공하고, 포화급수에 기초하여 탈수 값에 대한 물의 이동 변화 지도를 기 설정된 시간 간격에 따라 생성하고, 적어도 하나의 관수장치 각각에 대해 생성된 물의 이동 변화 지도에 기초하여 수분 및 양액 공급에 대한 공백 영역을 확인하고, 공백 영역을 최소화되도록 관수장치의 수와 위치를 결정하고, 작물 위치를 공백 영역 이외의 영역으로 결정할 수 있다."}
{"patent_id": "10-2023-0005834", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 명세서는 정밀 관수를 위한 토양 환경 분석 시스템을 제공할 수 있다. 본 명세서는 노지 스마트 팜에서 복수의 센서에 기초하여 토양을 분석하는 방법을 제공할 수 있다. 본 명세서는 토양이 물을 배출하는 성질에 기초하여 관수를 정밀하게 제어하는 방법을 제공할 수 있다. 본 명세서는 포장 용수량 및 탈수 값에 기초한 데이터베이스를 구축하여 관수를 제어하는 방법을 제공할 수 있 다. 본 명세서의 해결하고자 하는 과제는 상술한 바에 한정되지 아니하고, 하기에서 설명하는 발명의 실시예들에 의 해 도출될 수 있는 다양한 사항들로 확장될 수 있다."}
{"patent_id": "10-2023-0005834", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서의 실시예를 설명함에 있어서 공지 구성 또는 기능에 대한 구체적인 설명이 본 명세서의 실시예의 요 지를 흐릴 수 있다고 판단되는 경우에는 그에 대한 상세한 설명은 생략한다. 그리고, 도면에서 본 명세서의 실 시예에 대한 설명과 관계없는 부분은 생략하였으며, 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본 명세서의 실시예에 있어서, 어떤 구성요소가 다른 구성요소와 \"연결\", \"결합\" 또는 \"접속\"되어 있다고 할 때, 이는 직접적인 연결관계뿐만 아니라, 그 중간에 또 다른 구성요소가 존재하는 간접적인 연결관계도 포함할 수 있다. 또한 어떤 구성요소가 다른 구성요소를 \"포함한다\" 또는 \"가진다\"고 할 때, 이는 특별히 반대되는 기 재가 없는 한 다른 구성요소를 배제하는 것이 아니라 또 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 본 명세서의 실시예에 있어서, 제1, 제2 등의 용어는 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으 로만 사용되며, 특별히 언급되지 않는 한 구성요소들 간의 순서 또는 중요도 등을 한정하지 않는다. 따라서, 본 명세서의 실시예의 범위 내에서 실시예에서의 제1 구성요소는 다른 실시예에서 제2 구성요소라고 칭할 수도 있고, 마찬가지로 실시예에서의 제2 구성요소를 다른 실시예에서 제1 구성요소라고 칭할 수도 있다. 본 명세서의 실시예에 있어서, 서로 구별되는 구성요소들은 각각의 특징을 명확하게 설명하기 위함이며, 구성요 소들이 반드시 분리되는 것을 의미하지는 않는다. 즉, 복수의 구성요소가 통합되어 하나의 하드웨어 또는 소프 트웨어 단위로 이루어질 수도 있고, 하나의 구성요소가 분산되어 복수의 하드웨어 또는 소프트웨어 단위로 이루 어질 수도 있다. 따라서, 별도로 언급하지 않더라도 이와 같이 통합된 또는 분산된 실시예도 본 명세서의 실시 예의 범위에 포함된다. 본 명세서에서 네트워크는 유무선 네트워크를 모두 포함하는 개념일 수 있다. 이때, 네트워크는 디바이스와 시 스템 및 디바이스 상호 간의 데이터 교환이 수행될 수 있는 통신망을 의미할 수 있으며, 특정 네트워크로 한정 되는 것은 아니다. 본 명세서에 기술된 실시예는 전적으로 하드웨어이거나, 부분적으로 하드웨어이고 부분적으로 소프트웨어이거나, 또는 전적으로 소프트웨어인 측면을 가질 수 있다. 본 명세서에서 \"부(unit)\", \"장치\" 또는 \"시스템\" 등은 하드웨어, 하드웨어와 소프트웨어의 조합, 또는 소프트웨어 등 컴퓨터 관련 엔티티(entity)를 지 칭한다. 예를 들어, 본 명세서에서 부, 모듈, 장치 또는 시스템 등은 실행중인 프로세스, 프로세서, 객체 (object), 실행 파일(executable), 실행 스레드(thread of execution), 프로그램(program), 및/또는 컴퓨터 (computer)일 수 있으나, 이에 제한되는 것은 아니다. 예를 들어, 컴퓨터에서 실행중인 애플리케이션 (application) 및 컴퓨터의 양쪽이 모두 본 명세서의 부, 모듈, 장치 또는 시스템 등에 해당할 수 있다. 또한, 본 명세서에서 디바이스는 스마트폰, 태블릿 PC, 웨어러블 디바이스 및 HMD(Head Mounted Display)와 같 이 모바일 디바이스뿐만 아니라, PC나 디스플레이 기능을 구비한 가전처럼 고정된 디바이스일 수 있다. 또한, 일 예로, 디바이스는 차량 내 클러스터 또는 IoT (Internet of Things) 디바이스일 수 있다. 즉, 본 명세서에서 디바이스는 어플리케이션 동작이 가능한 기기들을 지칭할 수 있으며, 특정 타입으로 한정되지 않는다. 하기에서 는 설명의 편의를 위해 어플리케이션이 동작하는 기기를 디바이스로 지칭한다. 본 명세서에 있어서 네트워크의 통신 방식은 제한되지 않으며, 각 구성요소간 연결이 동일한 네트워크 방식으로 연결되지 않을 수도 있다. 네트워크는, 통신망(일례로, 이동통신망, 유선 인터넷, 무선 인터넷, 방송망, 위성망 등)을 활용하는 통신 방식뿐만 아니라 기기들 간의 근거리 무선 통신 역시 포함될 수 있다. 예를 들어, 네트워 크는, 객체와 객체가 네트워킹 할 수 있는 모든 통신 방법을 포함할 수 있으며, 유선 통신, 무선 통신, 3G, 4G, 5G, 혹은 그 이외의 방법으로 제한되지 않는다. 예를 들어, 유선 및/또는 네트워크는 LAN(Local Area Network), MAN(Metropolitan Area Network), GSM(Global System for Mobile Network), EDGE(Enhanced Data GSM Environment), HSDPA(High Speed Downlink Packet Access), W-CDMA(Wideband Code Division Multiple Access), CDMA(Code Division Multiple Access), TDMA(Time Division Multiple Access), 블루투스 (Bluetooth), 지그비(Zigbee), 와이-파이(Wi-Fi), VoIP(Voice over Internet Protocol), LTE Advanced, IEEE802.16m, WirelessMAN-Advanced, HSPA+, 3GPP Long Term Evolution (LTE), Mobile WiMAX (IEEE 802.16e), UMB (formerly EV-DO Rev. C), Flash-OFDM, iBurst and MBWA (IEEE 802.20) systems, HIPERMAN, Beam- Division Multiple Access (BDMA), Wi-MAX(World Interoperability for Microwave Access) 및 초음파 활용 통 신으로 이루어진 군으로부터 선택되는 하나 이상의 통신 방법에 의한 통신 네트워크를 지칭할 수 있으나, 이에 한정되는 것은 아니다. 다양한 실시예에서 설명하는 구성요소들이 반드시 필수적인 구성요소들은 의미하는 것은 아니며, 일부는 선택적 인 구성요소일 수 있다. 따라서, 실시예에서 설명하는 구성요소들의 부분집합으로 구성되는 실시예도 본 명세서 의 실시예의 범위에 포함된다. 또한, 다양한 실시예에서 설명하는 구성요소들에 추가적으로 다른 구성요소를 포 함하는 실시예도 본 명세서의 실시예의 범위에 포함된다. 이하에서, 도면을 참조하여 본 명세서의 실시예들에 대하여 상세히 살펴본다. 도 1은 일 실시예에 따른 노지(露地)용 스마트 팜(smart farm) 제어 시스템의 블록도이다. 도 1을 참조하면, 본 실시예에 따른 노지용 스마트 팜 제어 시스템은 정보통신기술(Information Communication Technology) 기반의 제어가 가능하도록 스마트 팜의 각 지역(1, 2)에 위치하는 하나 이상의 장치 들과 통신을 수행하도록 구성된다. 도면의 각 지역(1, 2)은 서로 동일 또는 상이한 사용자(예컨대, 농장 관리자)에 의해 운용되는 스마트 팜의 단 위 구역에 해당한다. 각 지역(1, 2)에는 농장 환경에 대한 센서 데이터를 획득하기 위한 하나 이상의 센서 노드 (sensor node) 장치(11-15, 21-25)와, 이들로부터 센서 데이터를 획득함으로써 각 지역(1, 2)별 관제를 가능하게 하는 지역별 게이트웨이(gateway) 장치(10, 20)가 위치할 수 있다. 또한 일 실시예에서, 각 지역(1, 2)에는 원격 제어되며 자동화된 방식으로 원수 공급, 양액 공급 등 관수를 수행하기 위한 관수장치(19, 29)가 더 위치 할 수 있다. 또한, 노지용 스마트 팜 제어 시스템은 수집된 스마트 팜의 정보를 사용자에게 제공하기 위하여 하나 이상의 사용자 장치와 통신을 수행할 수 있다. 사용자 장치는 노지용 스마트 팜 제어 시스템을 이용하여 스마 트 팜의 하나 이상의 지역(1, 2)의 농사를 원격으로 관리하고자 하는 사용자가 사용하는 장치를 지칭한다. 도면 에서 사용자 장치는 노트북 컴퓨터 및 스마트폰(smartphone)의 형태로 도시되었으나, 이는 단지 예시를 위한 것으로서, 사용자 장치는 이동 통신 단말기, 개인용 컴퓨터(personal computer), PDA(personal digital assistant), 태블릿(tablet), IPTV(Internet Protocol Television) 등을 위한 셋톱박스(set-top box) 등 임의 의 컴퓨팅 장치의 형태로 구현될 수 있다. 또한 일 실시예에서, 노지용 스마트 팜 제어 시스템은 농작물의 생육에 영향을 미치는 환경 정보(예컨대, 날 씨, 온도, 습도 데이터 등) 등의 획득을 위하여 하나 또는 복수의 외부 서버와 통신을 수행할 수도 있다. 예 를 들어, 외부 서버는 기상청 웹 서비스 서버일 수 있으나, 이에 한정되는 것은 아니다. 또한, 도면에 도시 된 사용자 장치와 외부 서버의 개수는 단지 예시적인 것으로서, 노지용 스마트 팜 제어 시스템과 관련 하여 동작하는 장치나 서버의 실제 개수를 한정하는 것이 아니라는 점이 통상의 기술자에게 용이하게 이해될 것 이다. 일 실시예에서, 노지용 스마트 팜 제어 시스템은 데이터베이스(database; DB) 서버, 분석 서버 및 웹 서비스 서버를 포함한다. 본 명세서에 기재된 장치들은 전적으로 하드웨어이거나, 또는 부분적으로 하드웨어이고 부분적으로 소프트웨어 인 측면을 가질 수 있다. 예컨대, 노지용 스마트 팜 제어 시스템 및 이와 통신하는 각각의 시스템, 장치, 서 버 및 이에 포함된 각 모듈(module) 또는 부(unit)는, 특정 형식 및 내용의 데이터를 전자통신 방식으로 주고받 기 위한 장치 및 이에 관련된 소프트웨어를 통칭할 수 있다. 본 명세서에서 \"부\", \"모듈\", \"서버\", \"시스템\", \"플랫폼\", \"장치\" 또는 \"단말\" 등의 용어는 하드웨어 및 해당 하드웨어에 의해 구동되는 소프트웨어의 조합을 지칭하는 것으로 의도된다. 예를 들어, 여기서 하드웨어는 CPU 또는 다른 프로세서(processor)를 포함하는 데이 터 처리 기기일 수 있다. 또한, 하드웨어에 의해 구동되는 소프트웨어는 실행중인 프로세스, 객체(object), 실 행파일(executable), 실행 스레드(thread of execution), 프로그램(program) 등을 지칭할 수 있다. 또한, 본 명세서에서 노지용 스마트 팜 제어 시스템을 구성하는 각각의 서버(31-33) 또는 부(unit)는 반드시 물리적으로 구분되는 별개의 구성요소를 지칭하는 것으로 의도되지 않는다. 즉, 도 1에서 노지용 스마트 팜 제 어 시스템의 각 서버(31-33)는 서로 구분되는 별개의 블록으로 도시되었으나, 이는 노지용 스마트 팜 제어 시스템을 이에 의해 실행되는 동작에 의해 기능적으로 구분한 것이다. 실시예에 따라서는 전술한 각 서버 중 일부 또는 전부가 동일한 하나의 장치 내에 집적화될 수 있으며, 또는 하나 이상의 서버가 다른 서버와 물리적 으로 구분되는 별개의 장치로 구현될 수도 있다. 예컨대, 노지용 스마트 팜 제어 시스템의 각 서버는 분산 컴퓨팅 환경 하에서 서로 통신 가능하게 연결된 컴포넌트들일 수도 있다. DB 서버는 스마트 팜의 각 지역(1, 2)별 게이트웨이 장치(10, 20)로부터 해당 지역에 위치하는 센서 노드 장치(11-15, 21-25)들의 센서 데이터를 수신하도록 구성된다. 일 실시예에서, DB 서버는 센서 데이터를 메 시징 기반의 통신 프로토콜을 이용한 구독(subscriber) 방식으로 시계열 DB에 수집할 수 있으며, 사용자 장치 로부터 수신된 제어 데이터도 상기 통신 프로토콜을 이용한 발행(publish) 방식으로 게이트웨이 장치(10, 20)에 전송할 수 있다. 예를 들어, DB 서버는 MQTT(Message Queue Telemetry Transport) 프로토콜에 기반하여 동작할 수 있으며, 이에 대해서는 도 2a 및 2b를 참조하여 후술한다. 분석 서버는, DB 서버에 저장된 센서 데이터를 사용자가 확인하기 위한 분석 정보로 가공하여 웹 서비 스 서버에 제공하는 역할을 한다. 이때 분석 정보는, 센서 데이터를 토대로 사용자가 스마트 팜의 생육 환 경을 확인할 수 있는 임의의 형태의 정보일 수 있으며, 예컨대, 분석 정보는 센서 데이터를 사용자가 확인하기 쉬운 형태로 단순 가공한 것일 수도 있고, 또는 센서 데이터를 토대로 한 수치 연산 등에 의하여 2차적으로 얻 어지는 데이터를 포함하는 것일 수도 있다. 일 실시예에서, 분석 서버는 데이터 수집부 및 모델링 생성부를 포함한다. 또한 일 실시예에서, 분석 서버는 오류 탐지부를 더 포함한다. 나아가 일 실시예에서, 분석 서버는 전략 생성부를더 포함한다. 웹 서비스 서버, 사용자가 사용자 장치를 이용하여 노지용 스마트 팜 제어 시스템에 접속함으로써 센 서 데이터를 기반으로 한 분석 정보를 확인할 수 있고, 필요에 따라 스마트 팜의 관수장치(19, 29) 등을 제어하 기 위한 제어 데이터를 입력할 수 있는 사용자 인터페이스를 제공한다. 즉, 웹 서비스 서버는 사용자 장치 상에서 실행되는 웹 브라우저(web browser)에 의해 접속 가능한 웹 페이지를 제공하는 서버이거나, 또는 사 용자 장치 상에서 실행되는 애플리케이션(또는, 앱)과 통신하는 애플리케이션 서비스 서버일 수 있다. 관수장치(19, 29)는 노지용 스마트 팜 제어 시스템과 통신하면서 원격으로 동작의 제어가 가능하도록 구성된 다. 또한, 관수장치(19, 29)는 노지용 스마트 팜 제어 시스템에 기초하여 사용자 장치와 연동될 수 있으 며, 이에 대해서는 후술한다. 또한, 관수장치(19, 29)에는 게이트웨이 장치(10, 20)와의 통신이 가능한 블루투 스 모듈 등 통신 모듈과, 통신 모듈을 통해 수신된 제어 데이터에 의해 전자적으로 제어가 가능한 하나 또는 복 수 개의 밸브(미도시) 등이 포함될 수 있다. 도 2a는 일 실시예에 따른 노지용 스마트 팜 제어 시스템에서 스마트 팜과 서버 사이의 통신을 설명하기 위한 개념도이다. 도 2a를 참조하면, 스마트 팜의 각 지역에 위치하는 게이트웨이 장치는 노지에 설치된 센서 노드 장치 와 통신하면서 센서 데이터를 수집하는 역할을 한다. 또한, 게이트웨이 장치는 사용자에 의해 입력된 제어 데이터를 관수장치에 전송함으로써 농지로 물 공급 등을 제어할 수도 있다. 이상의 동작을 위하여, 게이트 웨이 장치는 블루투스(Bluetooth) 방식으로 센서 노드 장치 및 관수장치와 통신 가능하게 연결될 수 있으나, 이에 한정되는 것은 아니며, 게이트웨이 장치는 와이-파이(Wi-Fi) 등 다른 상이한 근거리 통신 망을 통하여 센서 노드 장치 및 관수장치에 연결될 수도 있다. 게이트웨이 장치가 수집한 센서 데이터는 DB 서버로 전송된다. 이때, 게이트웨이 장치와 DB 서버 사이의 통신은 전술한 근거리 통신망, 또는 GSM(Global System for Mobile Network), EDGE(Enhanced Data GSM Environment), HSDPA(High Speed Downlink Packet Access), W-CDMA(Wideband Code Division Multiple Access), CDMA(Code Division Multiple Access), TDMA(Time Division Multiple Access), LTE(Long Term Evolution)와 같은 원거리 통신망을 통하여 이루어질 수 있다. 일 실시예에서, DB 서버는 MQTT와 같은 발행 및 구독 방식의 메시징(messaging) 프로토콜을 이용하여 게이 트웨이 장치와 통신할 수 있다. 또한, DB 서버에 저장된 정보는 사용자가 확인하기 위한 분석 정보로 가공되어 HTTP(Hypertext Transfer Protocol) 등 통상의 인터넷 상의 통신 프로토콜을 이용하여 웹 서비스 서버 로 전송될 수 있다. 사용자는 사용자 장치를 이용하여 웹 서비스 서버에 접속함으로써 노지용 스마트 팜 제어 시스템이 제공하는 정보들을 확인할 수 있다. 또한, 일 예로, 사용자 장치도 상술한 프로토콜에 기초하여 게이트웨이 장치를 통해 센서 노드 장치 및 관수장치와 통신을 수행할 수 있으며, 이에 대해서는 후술한다. 도 2b는 일 실시예에 따른 노지용 스마트 팜 제어 시스템에서 스마트 팜의 게이트웨이 장치와 사용자 장치 사이 의 데이터 송수신을 설명하기 위한 개념도이다. 도 2b에서 영역은 게이트웨이 장치가 위치하는 지역의 근거리 통신망 영역을 나타내며, 영역은 노지용 스마트 팜 제어 시스템에 해당하는 서버 영역을 나타낸다. 도 2b를 참조하면, 게이트웨이 장치로부터 송신되는 센서 데이터는 DB 서버의 MQTT 브로커(broker)가 처리하는 MQTT 프로토콜 기반의 메시지의 형태를 가질 수 있다. 이때 각 메시지에는 해당하는 토픽(topic)이 지 정될 수 있으며, DB 서버의 구독부(subscriber)는 특정 토픽을 구독하는 방식으로 해당 토픽이 지정된 메 시지들을 수집하며, 수집된 메시지는 DB 서버의 시계열 DB에 저장된다. 즉, 구독부는 구독하는 토픽 에 관련된 메시지가 MQTT 브로커로부터 전달될 때마다 이를 시계열적으로 정리된 데이터의 형태로 시계열 DB에 저장한다. 일 실시예에서 시계열 DB는 인플럭스 DB(influx DB)일 수 있으나, 이에 한정되는 것 은 아니다. 노지용 스마트 팜 제어 시스템의 웹 서비스 서버는 시계열 DB에 저장된 정보를 인터페이스(interface)부를 통해 사용자 장치에서 확인 가능한 분석 정보로 변환할 수 있다. 예를 들어, 인터페이스부는 그라파나 (grafana) 등의 시각화 도구를 이용한 것일 수 있으나, 이에 한정되는 것은 아니다. 한편, 사용자는 사용자 장치를 통해 분석 정보를 확인하고 필요 시 제어 입력을 노지용 스마트 팜 제어 시스 템에 입력할 수 있다. 사용자의 제어 입력은 전술한 센서 데이터의 전달 과정의 역순을 거쳐 특정 토픽을 가진 MQTT 프로토콜 기반의 메시지의 형태로 MQTT 브로커에 의해 처리되며, 발행부(publisher)에 의하여 게이트 웨이 장치에 전송될 수 있다. 게이트웨이 장치는 MQTT 프로토콜 기반의 메시지 형태를 갖는 제어 데이 터를 수신하고 이를 스마트 팜의 관수장치 등에 전송할 수 있다. 도 3은 일 실시예에 따른 노지용 스마트 팜 제어 시스템과 통신하는 센서 노드 장치의 사시도이다. 도 3을 참조하면, 본 실시예에 따른 센서 노드 장치는 각종 센서 등이 수용되는 몸체부(100, 101)와, 몸체 부(100, 101)의 표면에 구비되는 태양광 충전 패널을 포함한다. 몸체부(100, 101)의 각 부분은 노지 설치 가 가능하도록 방수 및 방진이 가능한 재질과 구조를 가질 수 있다. 또한, 몸체부(100, 101)는 센서 노드 장치 가 노지에 설치되었을 때 토양 위에 위치하는 표면부와, 표면부로부터 연장되어 토양 내부에 삽 입되기 위한 연장부로 구분될 수 있다. 표면부 내에는 게이트웨이 장치와의 통신을 위한 통신 모듈 및 태양광 충전 패널의 동작을 위한 태양광 충전 모듈 등이 수용될 수 있으며, 연장부 내에는 토양 내부의 상태 측정을 위한 하나 이상의 센서 등이 수용될 수 있다. 일 실시예에서, 연장부는 토양 내의 서로 상이한 깊이에 위치한 복수 개의 층(201-203)에 걸쳐 연장되도록 토양 내로 삽입될 수 있다. 이때 각 층(201-203)은 농작물의 생육에 있어서 해당 층의 환경 조건이 의미를 가지 는 층들을 의미한다. 예를 들어, 제1 층은 토양 표면으로부터 깊이 15 cm까지, 제2 층은 표면으로부 터 깊이 15 내지 25 cm까지, 제3 층은 토양 표면으로부터 깊이 25 내지 50 cm까지의 구간을 지칭하는 것일 수 있으나, 이에 한정되는 것은 아니다. 이때, 연장부 내에 위치하는 하나 이상의 센서는 연장부가 지나는 각 층(201-203)에 관련된 센서 데 이터를 별도로 수집하도록 구성될 수 있다. 예를 들어, 토양 내부의 각 층(201-203)에 관련된 온도 및/또는 습 도 등을 각각 독립적으로 측정함으로써, 농작물의 생육에 영향을 미치는 환경 조건을 구체적이고 입체적으로 파 악할 수 있다. 이때 연장부 내의 각 센서의 배치 위치는 노지에서 재배하고자 하는 육종 작물의 뿌리 깊이 에 따라 적절하게 결정될 수 있으며, 연장부 내의 센서 위치를 변경하는 것에 의하여 다양한 육종 작물에 대응하여 센서 노드 장치를 사용하는 것이 가능하다. 도 4는 도 3에 도시된 센서 노드 장치의 개략적인 블록도이다. 도 4를 참조하면, 센서 노드 장치는 통신 모듈, 태양광 충전 모듈 및 센서 모듈을 포함할 수 있다. 일 실시예에서, 센서 노드 장치는 GPS(Global Positioning System) 모듈을 더 포함할 수 있 다. 또한 일 실시예에서, 센서 노드 장치는 저장 모듈을 더 포함할 수 있다. 통신 모듈는 센서 노드 장치가 해당 지역을 관제하는 게이트웨이 장치에 센서 데이터를 전송할 수 있도록 하는 장치로서, 예컨대, 블루투스 모듈로 구성될 수 있으나, 이에 한정되는 것은 아니다. 태양광 충전 모듈은 센서 노드 장치의 표면에 설치된 태양광 충전 패널(102; 도 3)을 동작시키고 이에 의해 충전된 전력을 센서 노드 장치의 다른 부분에 전원으로서 공급하는 역할을 한다. 센서 모듈은 온습도 센서, 기압 센서 등 농장물의 생육에 연관된 환경 정보를 센서 데이터로서 획득하기 위한 하나 이상의 종류의 센서를 포함한다. 예를 들어, 온습도 센서는 토양 내로 삽입되고 기압 센서는 토양 표면에 위치하도록 센서 노드 장치의 몸체 내에 각 센서가 배치될 수 있으나, 이에 한정 되는 것은 아니다. GPS 모듈 및 센서 모듈의 가속도 센서는, 센서 노드 장치의 설치 위치와 상태를 센서 데이 터로 획득함으로써, 노지용 스마트 팜 제어 시스템이 작물에 대한 모델링을 수행함에 있어서 오류 데이터를 특 정하여 제외할 수 있게 하는 기능을 한다. 또한, 센서 노드 장치는 카메라 모듈(미도시) 및 그 밖의 모듈에 기초하여 농작물 이미지 및 주변 이미 정보를 획득할 수 있다. 일 예로, 센서 노드 장치는 획득한 이미지 정보를 더 활용하여 스마트 팜(1, 2) 내에서 농작물의 위치를 확인할 수 있으며, 이에 대해서는 후술한다. 저장 모듈은, 농작물의 생육 환경과 관련하여 달성하고자 하는 특정 조건 또는 이를 벗어나서는 안되는 임 계 조건 등에 대한 정보를 저장하는 역할을 한다. 센서 모듈에 의해 획득한 센서 데이터가 전술한 특정 또 는 임계 조건을 벗어나는 경우, 센서 노드 장치는 통상의 센서 데이터 전송과 별개로 조건의 이탈에 관련된 정보를 통신 모듈을 통해 노지용 스마트 팜 제어 시스템에 전송할 수 있다. 이는 노지용 스마트 팜 제어 시스템 측에서 다량의 센서 데이터에 대한 분석이 이루어지거나 또는 사용자가 직접 분석 정보를 확인하는 것을 기다리지 않고, 특정 센서 노드 장치에서 획득된 센서 데이터가 사전에 설정된 조건을 벗어나는 것을 사용자에게 즉각적으로 통지하기 위한 것이다. 그러나 이는 예시적인 것으로서, 다른 실시예에서는 센서 노드 장치 자체는 데이터를 획득할 뿐 획득한 데 이터에 대한 처리는 서버 측에서만 이루어지며, 이 경우 저장 모듈은 생략될 수도 있다. 스마트 팜 내에서 복수의 센서 노드에 기초하여 농작물을 관리할 수 있다. 일 예로, 하기에서는 상술한 바에 기 초하여 스마트 팜 내에서 복수의 센서 노드(11~15) 및 관수장치에 기초하여 농작물의 위치를 파악하고, 원수 및 양액을 공급하는 방법에 대해 서술한다. 일 예로, 복수의 센서 노드(11~15) 및 관수장치는 스마트 팜 내 의 게이트웨이 장치 및 노지용 스마트 팜 제어 시스템에 기초하여 사용자 장치와 상술한 프로토콜을 통해 연동될 수 있다. 이때, 사용자 장치는 컴퓨팅 장치일 수 있다. 일 예로, 컴퓨팅 장치는 메모리, 프로세 서, 통신 모듈 및 송수신부 중 적어도 어느 하나 이상을 포함할 수 있다. 일 예로, 메모리는 비-일시적인 컴퓨 터 판독 가능한 기록매체로서, RAM(random access memory), ROM(read only memory), 디스크 드라이브, SSD(solid state drive), 플래시 메모리(flash memory) 등과 같은 비소멸성 대용량 저장 장치(permanent mass storage device)를 포함할 수 있다. 여기서 ROM, SSD, 플래시 메모리, 디스크 드라이브 등과 같은 비소멸성 대 용량 저장 장치는 메모리와는 구분되는 별도의 영구 저장 장치로서 상술한 장치에 포함될 수도 있다. 또한, 메 모리에는 운영체제와 적어도 하나의 프로그램 코드(일례로 사용자 디바이스 등에 설치되어 구동되는 브라우저나 특정 서비스의 제공을 위해 사용자 디바이스 등에 설치된 어플리케이션 등을 위한 코드)가 저장될 수 있다. 이 러한 소프트웨어 구성요소들은 메모리와는 별도의 컴퓨터에서 판독 가능한 기록매체로부터 로딩될 수 있다. 이 러한 별도의 컴퓨터에서 판독 가능한 기록매체는 플로피 드라이브, 디스크, 테이프, DVD/CD-ROM 드라이브, 메모 리 카드 등의 컴퓨터에서 판독 가능한 기록매체를 포함할 수 있다. 다른 실시예에서 소프트웨어 구성요소들은 컴퓨터에서 판독 가능한 기록매체가 아닌 통신 모듈을 통해 메모리에 로딩될 수도 있다. 예를 들어, 적어도 하나의 프로그램은 개발자들 또는 어플리케이션의 설치 파일을 배포하는 파일 배포 시스템(일례로, 상술한 서버)이 네트워크를 통해 제공하는 파일들에 의해 설치되는 컴퓨터 프로그램 (일례로 상술한 어플리케이션)에 기반하여 메모리에 로딩될 수 있다. 프로세서는 기본적인 산술, 로직 및 입출력 연산을 수행함으로써, 컴퓨터 프로그램의 명령을 처리하도록 구성될 수 있다. 명령은 메모리 또는 통신 모듈에 의해 프로세서로 제공될 수 있다. 예를 들어 프로세서는 메모리와 같은 기록 장치에 저장된 프로그램 코드에 따라 수신되는 명령을 실행하도록 구성될 수 있다. 통신 모듈은 네트워크를 통해 사용자 장치 또는 서버와 통신하기 위한 기능을 제공할 수 있다. 또한, 송수신부는 외부 입력/출력장치(미도시)와의 인터페이스를 위한 수단일 수 있다. 예를 들어, 외부 입력장 치는 키보드, 마우스, 마이크로폰, 카메라 등의 장치를, 그리고 외부 출력 장치는 디스플레이, 스피커, 햅틱 피 드백 디바이스(haptic feedback device) 등과 같은 장치를 포함할 수 있다. 다른 예로 송수신부는 터치스크린과 같이 입력과 출력을 위한 기능이 하나로 통합된 장치와의 인터페이스를 위한 수단일 수도 있다. 상술한 바에 기초하여 사용자 장치와 연동되는 관수를 제어하는 방법을 제공할 수 있다. 일 예로, 도 5a 및 도 5b는 일 실시예에 따른 노지용 스마트 팜에서 관수장치를 통해 원수 및 양액을 공급하는 방법을 나타낸 도면 이다. 도 5a 및 도 5b를 참조하면, 복수의 센서 노드(11~15)로부터 노지 스마트 팜 관련 정보를 획득할 수 있다. 여기서, 복수의 센서 노드(11~15)들은 각각의 센서를 포함하는 개별 장치로 구성될 수 있으며, 상술한 도 3및 도 4와 같을 수 있다. 또한, 센서 노드는 관수장치의 관수부와 일체로 구성될 수 있다. 즉, 관수장치 에도 센서 노드가 구비될 수 있으며, 이를 통해 스마트 팜 내의 농작물 관련 정보를 획득할 수 있다. 또 한, 복수의 센서 노드(11~14) 및 관수장치는 사용자 장치와 연동될 수 있으며, 이를 통해 스마트 팜 관 리자는 스마트 팜 관리 효율을 향상시킬 수 있다. 구체적인 일 예로, 도 5a 및 도 5b를 참조하면, 복수의 센서 노드(11~15)들은 스마트 팜 내에서 메쉬 형태로 설치될 수 있다. 여기서, 일 예로, 복수의 센서 노드들(11~15) 수는 스마트 팜의 크기에 따라 상이할 수 있 다. 또한, 복수의 센서 노드들(11~15)은 온/오프될 수 있으며, 사용자 장치에 의해 온/오프가 제어될 수 있 다. 다만, 특정 실시예로 한정되지 않는다. 또한, 복수의 센서 노드들(11~15)는 스마트 팜 내의 특정 위치로 써 메쉬형태로 고정된 위치에 설치될 수 있다. 또 다른 일 예로, 복수의 센서 노드들(11~15)은 이동성을 가진 노드일 수 있으며, 스마트 팜 관리자에 의해 스마트 팜 내에서 이동될 수 있다. 이때, 복수의 센서 노드 들(11~15)은 스마트 팜 내에서 농작물 관련 정보 및 스마트 팜 관련 정보를 획득할 수 있다. 일 예로, 복 수의 센서 노드들(11~15)은 온도, 습도, 기압, PH 변화 및 그 밖의 토양 정보를 센싱할 수 있다. 또한, 일 예로, 복수의 센서 노드들(11~15)은 GPS를 구비하고, 복수의 센서 노드들(11~15) 각각의 위치 정보를 알 수 있다. 또한, 일 예로, 복수의 센서 노드들(11~15)은 카메라를 구비하고, 이미지 정보를 획득할 수 있으며, 특정 형태의 정보로 한정되지 않는다. 여기서, 복수의 센서 노드들(11~15)은 메쉬 형태로 구성될 수 있으며, 복수의 센서 노드들(11~15) 각각에서 센싱된 센싱 값을 획득할 수 있다. 노지용 스마트 팜 제어 시스템 또는 사용자 장치는 복수의 센서 노드들(11~15) 각각에서 센싱된 센싱 값을 통해 농작물(51~54)의 위치 및 농작물 관련 정보를 인지할 수 있다. 이에 대해서는 후술한다. 또한, 일 예로, 복수의 센서 노드들(11~15)은 GPS 모듈을 구 비하고 있으며, 이는 농작물(51~54)의 위치를 인지하는데 사용될 수 있다. 여기서, 관수장치는 복수의 센서 노드들(11~15)로부터 추정된 농작물(51~54)의 위치에 기초하여 원수를 공급할 수 있다. 이때, 관수장치는 도 5a에서처럼 스마트 팜의 중앙 위치에 고정되고, 360도 회전을 통해 원수를 토출하는 장치일 수 있다. 일 예로, 관수장치는 원수가 공급되는 방향, 원수 토출 범위, 원수 토출 각도 및 원수량 중 적어도 어느 하나 이상을 제어할 수 있으며, 상술한 노지용 스마트 팜 제어 시스템 또는 사용자 장치에 기초하여 제어될 수 있다. 또한, 일 예로, 관수장치에서 원수가 토출되는 위치는 변동될 수 있으며, 농작물(51~54) 주변에 원수가 토 출될 수 있도록 위치가 제어될 수 있다. 또는, 도 5b에서처럼 관수장치는 원수뿐만 아니라 양액이 공급되는 방향, 양액 토출 범위, 양액 토출 각도 및 양액량 중 적어도 어느 하나 이상을 제어할 수 있다. 즉, 관수장치 는 원수 및 양액이 토출되는 범위, 방향, 각도, 공급량 및 그 밖의 정보들을 농작물(51~54)의 위치 및 농작 물 관련 정보에 기초하여 제어할 수 있으며, 이를 통해 스마트 팜 내에서 농작물(51~54)이 위치한 영역으로 원수 및 양액을 효율적으로 공급할 수 있다. 구체적인 일 예로, 상술한 바와 같이 스마트 팜의 각 지역(1, 2)에 일정한 간격을 두고 작물 주변에 복수 개의 센서 노드들(11~15)들이 설치될 수 있다. 다만, 복수 개의 센서 노드들(11~15)은 스마트 팜 각 지역(1, 2)에 설 치되는 것으로 한정되지 않고, 노지에 일정한 간격을 두고 설치될 수 있으며, 특정 실시예로 한정되지 않는다. 여기서, 복수 개의 센서 노드들(11~15)은 토양 관련 정보를 센싱할 수 있다. 일 예로, 복수 개의 센서 노드들 (11~15)들은 토양 관련 정보에 기초하여 센싱 값을 수신하고, 수신된 센싱 값에 기초하여 토양 분석을 수행할 수 있다. 이때, 노지용 스마트 팜 제어 시스템은 분석 결과에 기초하여 토양에 수분 및 양액 공급량 중 적어 도 어느 하나를 제어할 수 있으며, 이는 상술한 바와 같다. 하기에서는 복수 개의 센서 노드들(11~15)들에 기초하여 토양 내의 수분량을 측정하고, 이를 분석하여 주변 토 양의 특성을 결정하는 방법에 대해 서술한다. 이때, 결정된 토양의 특성을 기초로 작물에 원수 및 양액 공급이 결정될 수 있다. 다만, 일 예로, 복수 개의 센서 노드들(11~15)은 토양 분석을 위해 수분량뿐만 아니라 토양 관 련 다른 정보들을 더 센싱할 수 있다. 일 예로, 토양 분석은 토양 내의 영양분 정보, 오염물질 정보, 유기물 정 보 및 금속 물질 정보 등 다른 정보들을 더 고려하여 수행될 수 있다. 또 다른 일 예로, 토양 분석은 산도(PH), 염류 농도, 유기물 농도 및 그 밖의 금속 물질 농도를 고려하여 수행될 수 있으며, 특정 실시예로 한정되지 않 는다. 이때, 구체적인 일 예로, 도 6을 참조하면, 복수 개의 센서 노드들(11~15)에 기초하여 측정된 센싱 값으로 수분 량에 기초하여 토양 분석을 수행할 수 있다. 일 예로, 노지용 스마트 팜 제어 시스템에 기초하여 관수장치 를 통해 특정 시간 구간에서 급수가 수행될 수 있다. 이때, 급수 후에 토양 내의 수분량은 급격하게 증가하고, 배수가 되면서 토양 내의 수분량이 감소할 수 있다. 이때, 수분은 최대한 풍부하게 과량 제공되며, 복수 개의 센서 노드들(11~15)은 과량 제공된 물이 토양내에서 어떻게 변화하는지를 측정하고 이를 기초로 토양 의 특성을 분석할 수 있다. 일 예로, 토양의 특성은 지하수 여부, 지하수 정도, 토질 및 토양의 종류(사토, 식 토 등의 비율)) 중 적어도 어느 하나의 정보를 포함할 수 있다. 보다 상세하게는, 노지용 스마트 팜 제어 시스 템은 특정 시간 구간에서 토양 내의 수분량의 감소 기울기(621, 622, 623, 624)에 기초하여 토양 분석 을 수행할 수 있다. 이때, 수분량의 감소 기울기는 짧은 시간 구간에 기초하여 도출되는 기울기(621, 622, 623, 624)일 수 있으며, 점차적으로 감소할 수 있다. 노지용 스마트 팜 제어 시스템은 최고점에서 기울기가 소정 값 이하로 낮아지는 지점까지의 기울기 변화를 측정할 수 있으며, 소정 값 이하로 낮아지는 지점을 포장 용수량 지점으로 인지할 수 있다. 이때, 일 예로, 도 7을 참조하면, 상술한 기울기 변화에 기초하여 토양의 종류를 인지할 수 있다. 보다 상세하 게는, 도 7은 토양의 종류 별 토양 수분함량 그래프일 수 있다. 도 7을 참조하면, 최대수분용량은 토양 내 모든 공극이 물로 채워진 상태일 수 있다. 즉, 물 포화토양일 수 있다. 또한, 포장 용수량은 메트릭 퍼텐싱에 의해 토양 내 공극에 남아있는 물/중력수를 의미할 수 있다. 즉, 도 6에서 급수 후에 물이 빠지면서 기울기가 소정값 이하로 된 지점은 토양이 포장 용수량에 기초하여 수분을 흡수하고 나머지 수분은 배출한 지점을 의미할 수 있다. 또한, 위조점은 식물이 수분 부족으로 시들어지는 지점의 수분함량을 의미할 수 있다. 또한, 유효수분은 포장 용수량과 위조점 사이의 토양 수분으로 식물이 이용할 수 있는 물을 의미할 수 있으며, 이용하기 쉬운 유 효수분 및 서서히 이용되는 유효수분으로 구분될 수 있다. 이때, 일 예로, 도 7을 참조하면, 토양의 종류에 따라 유효수분 및 위조점 사이의 유효 수분량이 상이할 수 있 다. 구체적인 일 예로, 사토나 사양토의 경우에는 포장 용수량과 위조점 사이의 간격이 작을 수 있으며, 유효수분이 적으므로 작물에 적합하지 않을 수 있다. 반면, 미사질 양토의 경우, 포장 용수량과 위조점 사이의 간격이 클 수 있으므로 오랜시간 급수가 없더라도 작물이 시들지 않을 수 있으며, 이를 통해 작물 관리가 용이할 수 있다. 또한, 식양토, 식토에서는 포장 용수량과 위조점 사이 간격이 다시 줄어들 수 있다. 즉, 각 토양의 종류마다 포장 용수량 및 위조점 사이 간격이 상이할 수 있다. 따라서, 노지용 스마트 팜 제어 시스 템은 센싱 값과 도 7의 그래프 및 그 밖의 정보에 기초하여 토양의 비중을 인지할 수 있다. 다만, 일 예로, 도 7의 그래프 외의 다른 정보에 기초하여 토양 비중이 인지될 수 있다. 또 다른 일 예로, 토양의 수분량 변화 는 토양의 종류뿐만 아니라 토양에 포함된 다른 성분들에 기초하여 상이하게 변경될 수 있으므로 센싱 값은 토 양의 다른 정보를 더 고려하여 토양 비중을 인지할 수 있다. 구체적인 일 예로, 복수 개의 센서 노드들(11~15) 은 수분량뿐만 아니라 토양의 다양한 성분을 센싱할 수 있으며, 센싱된 정보에 기초하여 수분량 변화에 기초한 토양 종류별 그래프를 생성할 수 있다. 이때, 일 예로, 노지용 스마트 팜 제어 시스템은 복수 개의 센서 노 드들(11~15)로부터 센싱된 센싱 값에 기초하여 인공지능을 통해 딥러닝을 수행할 수 있다. 이때, 복수 개의 센 서 노드들(11~15)로부터 센싱된 값 및 그 밖의 외부 정보에 기초하여 딥러닝을 수행하는 학습모델이 구축될 수 있으며, 특정 실시예로 한정되지 않는다. 이때, 복수 개의 센서 노드들(11~15)로부터 센싱된 값은 인공지능 딥 러닝에 기초하여 토양 종류 분석을 위한 그래프 및 그 밖의 정보들이 생성되어 센싱된 값이 적용될 수 있으며, 이를 통해 토양 종류 및 토양 정보들이 도출될 수 있다. 즉, 노지용 스마트 팜 제어 시스템은 복수 개의 센 서 노드들(11~15)로부터 센싱된 센싱 값을 통해 토양 분석을 수행할 수 있으며, 토양 분석 정보에 기초하여 작 물 관리를 수행할 수 있다. 이때, 일 예로, 도 8a를 참조하면, 토양 분석에 기초하여 복수 개의 센서 노드들(11~15)은 작물에 의한 수분 변 화량을 지속적으로 센싱할 수 있다. 이때, 복수 개의 센서 노드들(11~15)은 일정 구간별로 수분량을 센싱할 수 있으며, 이를 통해 추가적으로 토양 분석을 수행할 수 있다. 구체적인 일 예로, 도 8a에서 A구간(811-1, 811- 2)는 관수장치에 의해 급수가 수행되는 구간일 수 있다. 여기서, 급수에 의해 토양의 수분량이 증가할 수 있으며, 급수는 명확한 토양분석을 위해 포화용수량 이상으로 수행될 수 있다. 이때, B구간는 수분량이 포 화 용수량보다 높아 급격한 배수가 수행되는 구간일 수 있다. 또한, C 구간(813-1, 813-2, 813-3, 813-4)은 낮 동안 식물의 증산 작용으로 토양 수분이 감소하는 구간이고, D 구간(814-1, 814-2, 814-3)은 밤 동안 식물의 증 산 작용 중단으로 자연적으로 토양 수분이 감소하는 구간일 수 있다. 여기서, 노지용 스마트 팜 제어 시스템 은 복수 개의 센서 노드들(11~15)을 통해 센싱된 센싱 값에 기초하여 수분 변화량을 감지하고, 관수장치(4 0)를 통해 공급하는 수분량을 제어할 수 있다. 또한, 일 예로, 노지용 스마트 팜 제어 시스템은 복수 개의 센서 노드들(11~15)로부터 측정되는 센싱 정보 및 외부 정보를 더 고려하여 관수장치를 통해 공급하는 수분 량을 제어할 수 있다. 구체적인 일 예로, 도 8b를 참조하면, (a) 그래프의 온도보다 (b) 그래프의 온도가 증가 할 수 있다. 이때, 일 예로, (a) 그래프는 노지용 스마트 팜 제어 시스템이 복수 개의 센서 노드들(11~15)을 통해 센싱한 센싱 값에 기초하여 생성한 수분량 변화 그래프일 수 있다. 또한, 일 예로, (a) 그래프는 인공지능 에 기초하여 생성된 수분량 변화 그래프일 수 있다. 이때, (a) 그래프보다 (b) 그래프의 온도가 증가하는 경우, 작물의 증산 작용이 증가할 수 있으며, 증산량 증가로 인해 동일한 양의 급수 시 물 부족 현상이 발생할 수 있 다. 따라서, 노지용 스마트 팜 제어 시스템은 온도 정보를 활용하여 급수량을 증가시킬 수 있다. 또한, 일 예로, 노지용 스마트 팜 제어 시스템은 복수 개의 센서 노드들(11~15)을 통해 지속적으로 센싱을 수행할 수 있으며, 획득한 센싱 값에 기초하여 수분 변화량이 기 설정된 그래프와 상이한지 여부를 감지할 수 있다. 이때, 노지용 스마트 팜 제어 시스템은 복수 개의 센서 노드들(11~15)을 통해 센싱한 센싱 값에 기초하여 획득한 수분 변화량 그래프와 기 설정된 그래프의 위상 차가 스레스홀드 값 이상이면 관수장치를 제어하여 급수량 을 조절할 수 있으며, 이에 대해서는 후술한다. 또 다른 일 예로, 스마트 팜 지역(1, 2) 또는 노지에서 작물의 위치를 고려하여 복수 개의 센서 노드들(11~15) 이 위치할 필요성이 있다. 일 예로, 작물 뿌리의 정확한 물 흡수량을 파악하기 위해서는 센서 노드가 뿌리 옆부 분에 적정한 깊이와 거리로 위치해야 할 필요성이 있다. 따라서, 스마트 팜 지역(1,2) 또는 노지에서 작물의 위 치를 고려하여 복수 개의 센서 노드들(11~15)의 위치가 조정될 필요성이 있다. 이때, 일 예로, 노지용 스마트 팜 제어 시스템은 센서 노드를 통해 센싱한 수분변화에 기초하여 센서 노드의 위치가 적정한지 판단할 수 있다. 이때, 노지용 스마트 팜 제어 시스템은 센서 노드의 위치가 적정하지 않은 경우, 센서 노드 위치 보정을 위한 알람을 사용자 단말에게 제공할 수 있다. 또한, 일 예로, 노지용 스마트 팜 제어 시스템은 자체적으 로 센서 노드를 보정함으로써 센서 노드가 작물과 적정의 위치 및 깊이로 위치하도록 할 수 있다. 보다 구체적인 일 예로, 노지용 스마트 팜 제어 시스템은 센서 노드의 위치를 초기 설정시 제어할 수 있다. 일 예로, 노지용 스마트 팜 제어 시스템은 인공지능 및 그 밖의 외부 데이터에 기초하여 상술한 바와 같이 작물에 대한 수분 변화량 그래프 정보를 기 저장할 수 있다. 여기서, 작물에 대한 수분 변화량 그래프는 작물의 종류나 토양에 포함된 영양분, 유기물, 금속 물질 및 그 밖의 토양 관련 정보에 기초하여 상이할 수 있으며, 이 는 상술한 바와 같다. 이때, 노지용 스마트 팜 제어 시스템은 센서 노드를 작물의 위치 및 깊이를 고려하여 설치할 수 있다. 일 예로, 노지용 스마트 팜 제어 시스템은 복수 개의 센서 노드들(11~15)이 스마트 팜(1,2) 또는 노지에 설치됨을 인식할 수 있다. 그 후, 노지용 스마트 팜 제어 시스템은 복수 개의 센서 노드들 (11~15)로부터 센싱된 센싱 값을 획득하고, 이에 기초하여 수분변화량 그래프를 획득할 수 있다. 이때, 복수 개 의 센서 노드들(11~15)은 토양 관련 정보를 더 센싱할 수 있으며, 이를 노지용 스마트 팜 제어 시스템으로 전달할 수 있다. 또한, 노지용 스마트 팜 제어 시스템은 온도 정보, 작물 종류 정보 및 그 밖의 정보를 더 획득할 수 있으며, 복수 개의 센서 노드들(11~15)로부터 획득한 토양 관련 정보 및 외부 정보들에 기초하여 기 준 수분변화량 그래프 정보를 결정할 수 있다. 그 후, 노지용 스마트 팜 제어 시스템은 복수 개의 센서 노드 들(11~15) 각각으로부터 획득한 센싱 값 정보에 기초하여 수분변화량 그래프를 생성하고, 이를 기준 수분변화량 그래프 정보와 비교할 수 있다. 이때, 노지용 스마트 팜 제어 시스템은 기분 수분변화량 그래프와 복수 개의 센서 노드들(11~15) 각각으로부터 획득한 센싱 값 정보에 기초하여 수분변화량 그래프를 비교하여 센서 노드가 작물 주변에 위치하는지 여부 및 적정 위치를 확인하고, 이에 대한 정보를 사용자 단말에게 알림으로 제공할 수 있다. 또한, 일 예로, 노지용 스마트 팜 제어 시스템은 자체적으로 복수 개의 센서 노드들(11~15)의 위치 를 보정할 수 있다. 일 예로, 복수 개의 센서 노드들(11~15) 각각은 노지용 스마트 팜 제어 시스템에 의해 제어되는 이동수단을 구비할 수 있으며, 노지용 스마트 팜 제어 시스템은 이를 제어하여 복수 개의 센서 노 드들(11~15)의 위치를 보정할 수 있다. 여기서, 일 예로, 노지용 스마트 팜 제어 시스템은 상술한 수분 변화량 그래프 정보 비교를 위해 기 설정된 시간 구간을 설정할 수 있다. 일 예로, 기 설정된 시간 구간이 짧을수록 정확도가 떨어질 수 있으므로, 기 설정 된 시간 구간은 스레스홀드 값 이상일 수 있다. 또 다른 일 예로, 수분 변화량 그래프 비교를 위해서는 급수가 수행될 필요성이 있으며, 노지용 스마트 팜 제어 시스템은 급수에 따라 기 설정된 시간 구간을 설정할 수 있 다. 구체적인 일 예로, 노지용 스마트 팜 제어 시스템은 초기 설정시 급수 횟수 및 급수에 따른 기 설정된 시간 구간을 측정하고, 이를 통해 복수 개의 센서 노드들(11~15) 각각으로부터 센싱 값을 획득하여 수분변화량 그래프를 생성할 수 있다. 그 후, 급수 횟수에 따라 복수 개의 수분변화량 그래프를 생성하고, 이를 기준 수분 변화량 그래프와 비교함으로써 노지용 스마트 팜 제어 시스템은 복수 개의 센서 노드들(11~15)이 작물과 적 정한 위치 및 깊이에 위치하였는지 여부를 확인할 수 있다. 이때, 노지용 스마트 팜 제어 시스템은 개별 센 서 노드별로 적정 위치 여부를 확인하고, 개별 센서 노드별로 위치를 조정할 수 있다. 또 다른 일 예로, 스마트 팜 제어 시스템은 실시간으로 복수 개의 센서 노드들(11~15)을 통해 획득한 수분변화량 정보에 기초하여 복 수 개의 센서 노드들(11~15)의 위치를 조절할 수 있다. 일 예로, 스마트팜(1,2) 및 노지에서 작물의 위치는 기 설정될 수 있으나, 작물이 성장하면서 작물 뿌리가 성장하는 방향이 다를 수 있다. 따라서, 노지용 스마트 팜 제어 시스템은 실시간 또는 일정 주기에 기초하여 복수 개의 센서 노드들(11~15)을 통해 수분변화량 정보를 획득하고, 이를 기준 수분변화량 정보와 비교하여 복수 개의 센서 노드들(11~15)이 적정 위치에 존재하는지 여 부를 판단할 수 있다. 이를 통해, 노지용 스마트 팜 제어 시스템은 효율적으로 복수 개의 센서 노드들 (11~15)을 운용할 수 있다. 구체적인 일 예로, 도 9a를 비교하면 (a)의 제 1 시간 구간은 수분 변화량에 대한 기준 그래프일 수 있다. 이때, 일 예로, 수분 변화량에 대한 기준 그래프는 작물 종류나, 온도 및 그 밖의 토양 관련 정보를 고려하여 개별적으로 상이하게 설정될 수 있으며, 이는 상술한 바와 같다. 여기서, (b)의 제 2 시간 구간의 수분 변 화량에 대한 그래프는 기준 그래프에 대응되는 수분 변화량 그래프일 수 있다. 따라서, 제 2 시간 구간의 수분 변화량 그래프는 기준 수분 변화량 그래프인 제 1 시간 구간의 그래프와 유사한 형태로 생성됨이 예 상될 수 있다. 이때, 일 예로, 제 2 시간 구간은 제 1 시간 구간과 상이한 형태로 수분 변화량 그래 프가 생성될 수 있으며, 이를 통해 노지용 스마트 팜 제어 시스템은 센서 노드가 적정 위치에 위치하지 않음 을 인지할 수 있다. 이때, 일 예로, 노지용 스마트 팜 제어 시스템은 기준 그래프와 측정 그래프가 기 설정 된 값 이상으로 차이가 발생하지는 여부를 확인할 수 있으며, 기 설정된 값 이상 차이가 발생하면 센서 노드가적정 위치에 위치하지 않는 것으로 판단할 수 있다. 구체적인 일 예로, 도 9a에서 제 1 시간 구간과 제 2 시간 구간의 유사도는 소정 값 이하일 수 있으 며, 이는 센서 노드가 적정 위치에 위치하지 않는 것으로 판단될 수 있다. 일 예로, 센서 노드는 통상적으로 지 면으로부터 30센치에 센서가 위치하는 것이 이상적일 수 있다. 다만, 이는 하나의 일 예일 뿐, 작물의 종류나 토양 관련 정보에 기초하여 상이할 수 있다. 또한, 일 예로, 작물 뿌리의 위치나 지면 기울기 및 그 밖의 요소 에 기초하여 단순 30센치로 설치하는 것이 적절하지 않을 수 있다. 상술한 점을 고려하여, 노지용 스마트 팜 제어 시스템은 제 1 시간 구간과 제 2 시간 구간의 유사 도가 소정 값 이하인지 여부를 확인하여 센서 노드가 적정 위치에 위치하는지 여부를 판단하고, 적정 위치에 위 치하지 않으면 센서 노드를 이동시킬 수 있다. 여기서, 일 예로, 노지용 스마트 팜 제어 시스템은 센서 노드 가 이동된 후 급수에 기초하여 제 3 시간 구간(미도시)에 대한 수분 변화량 그래프를 획득할 수 있다. 즉, 노지 용 스마트 팜 제어 시스템은 센서 노드를 이동시킨 후 새롭게 수분 변화량 그래프를 획득할 수 있다. 이때, 일 예로, 노지용 스마트 팜 제어 시스템은 제 3 시간 구간에 대한 수분 변화량 그래프와 기준 그래프인 제 1 시간 구간의 수분 변화량 그래프를 비교하여 센서 노드가 적정 위치인지 여부를 확인할 수 있다. 여기서, 제 3 시간 구간에 기초한 수분 변화량 그래프에 기초하여서도 센서 노드가 적정 위치가 아닌 경우, 노지용 스마 트 팜 제어 시스템은 제 1 시간 구간의 기준 그래프 및 제 2 시간 구간의 수분 변화량 그래프를 제 3 시간 구간(미도시)의 수분 변화량 그래프를 비교할 수 있다. 즉, 노지용 스마트 팜 제어 시스템은 기준 수분 변화량 그래프와 이동 전에 측정한 수분 변화량 그래프에 기초하여 센서 노드가 적정 위치에 위치하는지 여부를 확인할 수 있다. 또한, 노지용 스마트 팜 제어 시스템은 상술한 정보에 기초하여 센서 노드가 적정 위치에 위치하기 위해 이동해야 하는 방향 및 깊이를 확인할 수 있다. 즉, 기준 수분 변화량 그래프 및 이동에 기초한 수분 변화량 그래프에 기초하여 적정 위치를 확인할 수 있다. 구체적인 일 예로, 노지용 스마트 팜 제어 시스템은 인공지능에 기초하여 상술한 정보를 입력으로 제공하고, 센서 노드의 적정 위치로써 이동 방향 및 깊이 정보를 출력으로 획득할 수 있으며, 이를 통해 센서 노드의 위치를 결정할 수 있다. 또한, 일 예로, 기준 수분 변화량 그래프와 측정된 수분 변화량 그래프의 유사도는 소정 값 이하일 수 있으며, 소정 값 이하이면 센서 노드가 적정 위치에 위치하는 것으로 판단할 수 있다. 여기서, 소정 값은 수분 변화량 그래프가 환경에 따라 다르게 측정됨을 고려한 값일 수 있으며, 이는 센서 노드의 센싱 값과의 위상차를 기초로 결정할 수 있다. 일 예로 측정된 수분 변화량 그래프는 기준 수분 변화량 그래프와 대응되는 시간 구간으로 측 정될 수 있으며, 각각의 지점에서 위상 차를 확인하고, 이를 통해 소정 값을 산출할 수 있다. 일 예로, 각 지점 별 위상 차 값을 합산하고, 합산된 값에 기초하여 소정 값이 산출될 수 있으나, 특정 형태로 한정되는 것은 아 닐 수 있다. 또 다른 일 예로, 도 9b를 참조하면, 노지용 스마트 팜 제어 시스템은 센서 노드의 적정 깊이를 확인하기 위 해 수분 변화량 그래프에 대한 위상 차 정보를 확인할 수 있다. 일 예로, 노지용 스마트 팜 제어 시스템은 땅속 및 대기와 온도의 위상 차이로 센서 노드의 적정 깊이를 판단하는 알고리즘을 구비하고, 이에 기초하여 적 정 깊이를 인지할 수 있다. 일 예로, 대기 온도는 2시 내지 4시에 최고 온도를 기록할 수 있으나, 땅속 센서 노 드는 설치 깊이에 따라 온도에 위상 차가 발생할 수 있다. 보다 상세하게는, 도 9b에서 제 1 센서에 의한 그래 프와 제 2 센서에 의한 그래프를 비교하면 제 2 센서가 더 깊이 설치되어 있고, 온도 그래프의 위상 차가 발생할 수 있다. 즉, 센서 노드가 설치된 깊이는 대기 온도 및 땅속 깊이에 따른 온도의 위상차에 따라 상 이할 수 있으므로 노지용 스마트 팜 제어 시스템은 상술한 위상 차 정보에 기초하여 센서 노드의 적정 깊이 를 판단하는 알고리즘을 통해 센서 노드의 적정 깊이를 결정할 수 있다. 또 다른 일 예로, 노지용 스마트 팜 제어 시스템은 센서 노드로부터 측정된 센싱 값에 대한 보정을 수행할 수 있으며, 이는 온도 정보 및 그 밖의 주변 정보나 토양 관련 정보에 기초하여 수행될 수 있다. 일 예로, 노지 용 스마트 팜 제어 시스템은 환경 요인을 반영해서 실질적인 뿌리의 수분 흡수량을 확인하기 위해 센싱 값에 대한 보정을 수행할 수 있다. 구체적인 일 예로, 노지용 스마트 팜 제어 시스템은 기준위치에 설치된 센서 노드의 데이터 값과 대상 센서 노드의 데이터 값의 차이(disparity)를 기초로 환경용인 정보를 결정할 수 있다. 이때, 환경용인 정보는 센서 노드의 깊이 문제 정보, 작물의 거리 문제 정보, 센서 노드의 기울기 정보 및 해당 토양의 특성 정보 중 적어도 어느 하나를 포함할 수 있으며, 상술한 실시예로 한정되지 않는다. 이때, 노지용 스마트 팜 제어 시스템은 환경용인 정보를 결정하고, 결정된 환경용인 별 보정 값을 데이터베이스에서 가져 오거나 딥러닝을 통해 생성할 수 있으며, 이를 통해 측정된 센싱 값을 보정할 수 있다. 일 예로, 노지용 스마트 팜 제어 시스템은 보정 값에 기초하여 깊이가 상이하게 적용된 센서 노드의 센싱 값 을 기준 깊이로 설치된 센서 노드들의 값들과 비교할 수 있으며, 이를 반영하여 다른 특성을 비교할 수 있다. 또한, 일 예로, 노지용 스마트 팜 제어 시스템은 관수장치에 의한 급수량뿐만 아니라 지하수 유입 수량 을 추정하여 토양의 특성을 결정할 수 있다. 일 예로, 토양의 위치에 기초하여 지하수가 유입되는 양이 상이할 수 있으며, 이를 반영하여 관수장치를 통해 급수가 필요할 수 있다. 구체적인 일 에로, 제 1 지점과 제 2 지점에서 동일한 급수를 수행한 후, 수분 변화량을 비교할 수 있다. 이때, 일 예로, 제 1 지점 및 제 2 지점에 서 수분 변화량은 상술한 환경용인 정보에 기초하여 보정 값을 도출하고, 도출된 보정 값을 반영하여 동일한 기 준을 바탕으로 수분 변화량이 측정될 수 있다. 이때, 일 예로, 한 곳은 토양의 수분량이 적절히 줄어드나 다른 한 곳은 토양의 수분량이 줄어든 양이 극히 적은 경우, 두 위치의 온도를 비교해서 지하수가 올라온 것으로 추 정할 수 있다. 즉, 노지용 스마트 팜 제어 시스템은 특정 지점에서 수분이 비 또는 관수장치로부터 유입 되었는지 또는 지하수를 통해 유입되었는지 여부를 확인할 수 있다. 또한, 일 예로, 노지용 스마트 팜 제어 시스템은 수분의 공급 형태 및 땅 속 온도 변화에 기초하여 지하수 유입 여부를 인지할 수 있다. 일 예로, 수분이 관수나 비 등으로 공급이 일어나면 수분의 증가율이 급격하며 땅 속의 온도 변화도 급격할 수 있다. 반면, 수분이 땅속의 웅덩이나 지하수를 통해 유입되는 경우, 화분의 저면관 수 같이 아래서 올라올 수 있으며, 수분 이동이 느리고 온도 변화가 적을 수 있다. 일 예로, 복수 개의 지점에 서 관수 후 일정한 시간이 지난 후 센서 노드의 수분 변화량이 적은 경우라면 작물의 증산량이 부족한 것으로 인지될 수 있다. 다만, 특정 지점에서 수분 변화량이 적고 주변 센서노드보다 토양 온도 변화가 적다면 지하수 유입에 기초하여 온도 특성 및 수분 특성이 상이할 수 있다. 일 예로, 상술한 바와 같이 환경용인 정보로써 복 수의 지점에 따라 보정 값을 반영하면 지하수 유입에 따라 수분 변화 및 온도 변화가 발생하는지 여부를 인지할 수 있으며, 노지용 스마트 팜 제어 시스템은 이를 인지하여 지하수 유입 여부를 확인할 수 있다. 그 후, 노 지용 스마트 팜 제어 시스템은 지하수 유입 지점 정보에 기초하여 관수장치로 공급되는 수분량을 조절할 수 있으며, 이를 통해 효율적인 수분 공급이 수행될 수 있다. 또한, 일 예로, 상술한 동작들은 노지용 스마트 팜 제어 시스템의 인공지능 학습모델을 통해 수행될 수 있다. 일 예로, 인공지능 학습모델은 작물 정보, 온도 정보 및 그 밖의 외부 정보에 기초하여 수분 변 화량 또는 온도 변화량에 대한 정보를 기 저장할 수 있다. 또한, 그 밖의 센싱 가능한 정보에 대한 정보를 기 저장할 수 있으며, 상술한 실시예로 한정되지 않는다. 이때, 노지용 스마트 팜 제어 시스템은 복수 개의 센 서 노드들(11~15) 각각으로부터 센싱 값을 획득하고, 이를 인공지능 학습모델의 입력으로 제공할 수 있다. 그 후, 노지용 스마트 팜 제어 시스템은 토양분석 및 센서 노드의 위치/깊이 정보 분석을 수행할 수 있다. 또한, 상술한 바와 같이 지하수 유입 여부를 확인할 수 있으며, 이는 상술한 바와 같다. 그 후, 노지용 스마트 팜 제어 시스템은 인공지능 학습모델을 통해 분석된 결과 정보를 통해 공급하는 수분 및 양액 을 제어할 수 있으며, 이에 대한 정보는 인공지능 학습모델(1010로 다시 피드백되어 정확도를 높일 수 있 으며, 상술한 실시예로 한정되지 않는다. 도 11은 일 실시예에 따른 토양 내 수분변화를 기초로 제어서버가 토양을 분석하는 방법을 나타낸 도면이다. 도 11을 참조하면, 제어서버는 복수의 센서 노드가 설치된 위치 정보 및 깊이 정보에 기초하여 복수의 센서 노 드 각각으로부터 센싱 값을 획득할 수 있다.(S1110) 이때, 센싱 값은 토양 내 수분량일 수 있다. 그 후, 제어서 버는 복수의 센서 노드 각각으로부터 측정된 토양 내 수분량에 기초하여 토양 분석을 수행할 수 있다.(S1120) 이를 통해, 제어서버는 토양 특성을 결정할 수 있으며, 결정된 토양 특성에 기초하여 수분 및 양액 공급량을 제 어할 수 있다.(S1130) 이때, 일 예로, 제어서버는 노지 스마트 팜에서 메쉬 형태로 설치되고, 노지 스마트 팜 내의 농작물 관련 정보를 센싱하는 복수의 센서 노드, 복수의 센서 노드에서 획득되는 센싱 값에 기초하여 토양 분석을 수행하는 제어부 및 분석된 토양의 특성에 기초하여 원수 및 양액을 공급하는 관수장치를 포함할 수 있 으며, 이는 상술한 바와 같다. 여기서, 복수의 센서 노드 중 제 1 센서 노드에 기초하여 상기 토양 내 수분량을 측정하는 경우, 제어 서버는 제 1 센서 노드의 위치 정보 및 깊이 정보에 기초하여 포화 용수량 이상의 급수를 수행하고, 급수에 기초하여 기 설정된 시간 구간에서 변동되는 수분량을 측정하여 수분량 변동 그래프 정보를 획득할 수 있다. 그 후, 제어 서버는 수분량 변동 그래프 정보는 기준 수분량 변동 그래프 정보와 비교함으로써 토양 분석을 수행할 수 있다. 여기서, 기준 수분량 변동 그래프 정보는 상기 토양 특성에 기초하여 기-생성되는 정보일 수 있으며, 이는 상술 한 바와 같다. 또한, 일 예로, 수분량 변동 그래프 정보와 기준 수분량 변동 그래프 정보가 비교되는 경우, 토양의 영양분 정 보, 유기물 정보, 금속 물질 정보, 오염물질 정보, 온도 정보, 제1 센서 노드의 위치 정보 및 제1 센서 노드의깊이 정보 중 적어도 어느 하나 이상을 반영할 수 있다. 즉, 제어서버는 기준 수분량 변동 그래프와 관련하여 주변 환경 정보를 더 반영할 수 있으며, 이를 통해 비교를 수행할 수 있다. 또 다른 일 예로, 제어서버는 인공 지능 학습모델을 구비하고, 인공지능 학습모델에 기초하여 수분량 변동 그래프 정보와 기준 수분량 변동 그래프 정보를 비교할 수 있으며, 이는 상술한 바와 같다. 또한, 제어서버는 상기 복수 개의 센서 노드 각각의 위치가 작물 위치 정보에 기초하여 적합한 위치인지 여부를 복수 개의 센서 노드 각각이 센싱하는 토양 내 수분량에 기초하여 확인할 수 있다. 여기서, 복수 개의 센서 노 드 각각의 위치가 적합한 위치가 아닌 경우, 제어서버는 사용자 단말로 알림을 제공하거나 복수 개의 센서 노드 각각을 제어하여 복수 개의 센서 노드 각각의 위치를 이동시킬 수 있으며, 이는 상술한 바와 같다. 이때, 일 예 로, 복수 개의 센서 노드 중 제1 센서 노드의 위치가 적합한지 여부를 확인하는 경우, 제1 센서 노드로부터 수 분 변화량 정보 및 토양 관련 정보를 획득하고, 토양 관련 정보에 기초하여 기준 수분 변화량 정보를 획득하고, 제1 센서 노드로부터 획득한 수분 변화량 정보와 기준 수분 변화량 정보를 비교하여, 제1 센서 노드의 위치가 적합한지 여부를 확인할 수 있다. 이때, 제어서버는 제1 센서 노드의 깊이가 적합한지 여부도 확인할 수 있으며, 깊이가 적합한지 여부는 제1 센서 노드로부터 수분 변화량 정보와 온도 정보를 더 고려하여 결정될 수 있다. 일 예로, 온도 정보는 대기 온도 정보 및 땅 속 깊이에 기초한 온도 정보일 수 있으며, 이를 통해 깊이 정보를 획득할 수 있다. 또한, 일 예로, 제어서버는 복수의 센서 노드 각각으로부터 측정된 토양 내 수분량에 기초하여 지하수 유입 여 부 정보를 확인할 수 있다. 일 예로, 제어서버가 지하수 유입 여부 정보를 확인하는 경우, 제어서버는 환경용인 정보에 기초하여 복수 개의 센서 노드 지점에 대한 수분량 변화 정보를 측정하고, 환경용인 정보에 기초한 보정 값을 적용하여 복수 개의 센서 노드 지점에 대한 수분량 변화 정보를 비교하여 지하수 유입 여부 정보를 확인할 수 있으며, 이는 상술한 바와 같다. 도 12 및 도 13은 일 실시예에 따라 토양 내 탈수 값을 나타낸 도면이다. 일 예로, 포장 용수량은 토양에 물을 충분히 주어도 토양의 종류에 따라서 수분 함량이 더 오르지 않는 임계점을 의미할 수 있으며, 이는 상술한 바 와 같다. 여기서, 포장 용수량 이상의 급수를 하면 토양의 수분 함량이 더 오르지는 않고, 나머지는 중력수로서 토양과 분리되어 아래 또는 옆으로 번질 수 있다. 토양이 물을 배출하는 성질은 탈수 값일 수 있다. 일 예로, 물은 아래 또는 옆으로 번질 수 있으므로 탈수 값은 횡 방향과 축 방향에 기초한 벡터 값일 수 있다. 노지용 스마트 팜 제어 시스템은 상술한 바와 같이 충분한 급수를 통해서 포장 용수량을 파악하여 토양의 종 류 및 혼합비를 추정할 수 있다. 그 후, 노지용 스마트 팜 제어 시스템은 각 토양의 종류 및 혼합비에 따른 탈수 값을 측정하고, 해당 값을 데이터베이스에 저장할 수 있다. 일 예로, 측정하지 않은 종류 및 혼합비는 딥 러닝을 통해 추정될 수 있으며, 이와 관련해서는 후술한다. 노지용 스마트 팜 제어 시스템은 복수 개의 센서 노드들(11~15)을 통해 포장 용수량 및 탈수 값을 센싱할 수 있으며, 이를 데이터베이스에 저장할 수 있다. 구체적인 일 예로, 도 12를 참조하면, 사질 토양은 축 방 향 배출이 강할 수 있으며, 횡 방향 배출이 적을 수 있다. 이때, 사질 토양에 대한 탈수 값은 축 방향으 로 y축으로 물이 이동하는 이동 속도 값과 횡 방향인 x축으로 물이 이동하는 이동 속도 값의 벡터 값으로 구성될 수 있다. 또한, 도 13을 참조하면, 점토질 토양은 사질 토양에 비해 횡 방향 배출이 강할 수 있다. 이때, 점토질 토양에 대한 탈수 값은 축 방향으로 y축으로 물이 이동하는 이동 속도 값과 횡 방 향인 x축으로 물이 이동하는 이동 속도 값의 벡터 값으로 구성될 수 있다. 즉, 토양의 성질에 기초하여 탈수 값이 벡터 값으로 센싱될 수 있으며 노지용 스마트 팜 제어 시스템은 해당 정보를 포장 용수량과 함께 저장할 수 있다. 이때, 일 예로, 상술한 벡터 값은 물 배출 시간 정보와 결합되어 데이터베이스에 저장될 수 있 다. 구체적으로, 도 12의 사질 토양은 도 13의 점토질 토양보다 축 방향 배출이 강하며, 벡터 값이 축 방향과 가까울 수 있다. 여기서, 축 방향 배출이 강하기 때문에 물이 토양에 남아 있는 시간이 짧을 수 있다. 반면, 횡 방향 배출이 강한 점토질 토양은 벡터 값이 횡방향에 가까울 수 있으며, 물이 토양에 남아 있는 시간이 길 수 있다. 상술한 점을 고려하여, 노지용 스마트 팜 제어 시스템은 탈수 값과 연계하여 토양에 물 이 남아있는 시간 정보를 데이터베이스에 저장할 수 있으며, 이를 통해 토양 환경을 분석하여 정밀 관수를 수행 할 수 있다. 즉, 노지용 스마트 팜 제어 시스템은 복수 개의 센서 노드들(11~15)을 통해 센싱한 정보로서 포 장 용수량 및 탈수 값 정보를 획득하고, 이에 기초하여 깊이별 토양의 종류 및 혼합비를 파악하여 해당 위치마 다 토양을 분석하여 해당 정보를 통해 관수를 제어할 수 있다. 토양의 성질에 따라서 물의 횡 방향 이동이 큰 토질이 존재할 수 있으며, 이는 상술한 바와 같다. 일 예로, 노 지용 스마트 팜 제어 시스템은 상술한 정보를 고려하여 센서 노드의 위치를 보정하거나 급수 위치를 보정할 수 있다. 구체적으로, 하나의 관수장치에 의해 급수된 물에 대한 시간별 횡 방향 및 축 방향 물의 이동 변 화 지도를 생성하고, 해당 지도 정보와 작물의 뿌리 위치를 기초로 작물을 심는 위치를 제안하거나, 급수기의 위치 및 간격을 조정할 수 있다. 도 14a 내지 도 14c는 일 실시예에 따라 급수를 통해 토양 내에서 물의 이동을 나타낸 도면이다. 구체적으로, 도 14a를 참조하면, 하나의 관수장치에 의해 급수된 물에 대한 시간별 횡 방향 및 축 방향 물의 이동 변화 지도가 생성될 수 있다. 도14b를 참조하면, 물의 이동 변화 지도는 기 설정된 시간 간격을 기준으로 설정될 수 있으며 기 설정된 시간 간격은 노지용 스마트 팜 제어 시스템에 의해 제어되거나 변경될 수 있다. 일 예로, 도 14b에서 t1 시간의 물의 이동 변화 지도가 생성되고, 그 후 기 설정된 시간 간격 후인 t2 시간의 물의 이동 변화 지도가 생성된 후 다시 기 설정된 시간 간격 후인 t3 시간의 물의 이동 변화 지도가 생 성될 수 있다. 여기서, 시간 간격 및 물의 이동 변화 지도 생성 방법은 노지용 스마트 팜 제어 시스템에 의 해 제어될 수 있으며, 특정 실시예로 한정되지 않는다. 그 후, 도 14c를 참조하면, 하나의 관수장치에 대한 물의 이동 변화 지도에 따라 작물을 심는 위치를 조절 할 수 있다. 구체적인 일 예로, 도 14c에서 물의 이동 변화 지도에 의해 t3 시간 내에 물이 공급되는 위치 (1440, 1450)에 작물의 뿌리가 존재할 수 있으면 작물의 성장이 원활할 수 있다. 반면, t3 시간 내에도 물이 공 급되지 않는 위치에 작물의 뿌리가 존재하면 작물의 성장이 원활하지 않을 수 있다. 상술한 점을 고려하 여 노지용 스마트 팜 제어 시스템은 하나의 관수장치를 기준으로 물의 이동 변화 지도를 센싱을 통해 생 성하여 작물의 위치를 결정할 수 있다. 또한, 일 예로, 복수 개의 센서 노드들(11~15)의 위치는 상술한 물의 이 동 변화 지도를 센싱하도록 하는 위치로 조정될 수 있다. 일 예로, 복수 개의 센서 노드들(11~15)은 탈수 값의 횡 방향 이동을 고려하여 관수를 기준으로 각 방향으로 기 설정된 거리만큼 떨어진 곳에 위치할 수 있으며, 각각의 위치에서 물의 이동 방향을 센싱하여 물의 이동 변화 지도를 생성할 수 있다. 도 15a 내지 도 15c는 일 실시예에 따라 급수를 통해 토양 내에서 물의 이동을 나타낸 도면이다. 도 15a를 참조 하면, 도 14a와 상이한 물의 이동 변화 지도가 생성될 수 있다. 보다 상세하게는, 도 15a의 관수장치 주변 의 토양은 도 14a의 관수 주변의 토양과 상이할 수 있으며, 토양 환경에 따라 물의 이동 변화 지도가 상이한 형 태로 구성될 수 있다. 즉, 물의 이동 변화 지도를 통해 하나의 관수장치 주변의 토양 환경을 분석할 수 있 으며, 해당 정보를 고려하여 수분 및 양액 공급을 제어할 수 있다. 일 예로, 도15b를 참조하면, 물의 이동 변화 지도는 기 설정된 시간 간격을 기준으로 설정될 수 있으며 기 설정 된 시간 간격은 노지용 스마트 팜 제어 시스템에 의해 제어되거나 변경될 수 있다. 도 15b에서 t1 시간의 물 의 이동 변화 지도가 생성되고, 그 후 기 설정된 시간 간격 후인 t2 시간의 물의 이동 변화 지도가 생성된 후 다시 기 설정된 시간 간격 후인 t3 시간의 물의 이동 변화 지도가 생성될 수 있다. 여기서, 시 간 간격 및 물의 이동 변화 지도 생성 방법은 노지용 스마트 팜 제어 시스템에 의해 제어될 수 있으며, 해당 물의 이동 변화 지도는 도 14b와 상이할 수 있다. 그 후, 도 15c를 참조하면, 하나의 관수에 대한 물의 이 동 변화 지도에 따라 작물을 심는 위치를 조절할 수 있다. 구체적인 일 예로, 도 14c에서 물의 이동 변화 지도 에 의해 t3 시간 내에 물이 공급되는 위치(1440, 1450)에 대한 깊이와 도 15c에서 물의 이동 변화 지도에 의해 t3 시간 내에 물이 공급되는 위치(1540, 1550)이 상이할 수 있다. 상술한 점을 고려하여 노지용 스마트 팜 제어 시스템은 해당 관수장치 내에 작물의 위치 및 토양 환경을 고려하여 작물의 종류를 결정할 수 있다. 또 한, 노지용 스마트 팜 제어 시스템은 상술한 점을 고려하여 수분 및 양액 공급을 제어할 수 있다. 일 예로, t3 시간 내에도 물이 공급되지 않는 위치에 작물의 뿌리가 존재하면 작물의 성장이 원활하지 않으며, 해 당 위치의 작물에 수분 및 양액이 많이 공급되도록 관수장치를 제어하여 작물 성장을 도울 수 있으며, 특정 실시예로 한정되지 않는다. 또한, 일 예로, 복수 개의 센서 노드들(11~15)의 위치는 상술한 물의 이동 변화 지 도를 센싱하도록 하는 위치로 조정될 수 있다. 일 예로, 복수 개의 센서 노드들(11~15)은 탈수 값의 횡 방향 이 동을 고려하여 관수를 기준으로 각 방향으로 기 설정된 거리만큼 떨어진 곳에 위치할 수 있으며, 각각의 위 치에서 물의 이동 방향을 센싱하여 물의 이동 변화 지도를 생성할 수 있다. 도 16a 및 도 16b는 일 실시예에 따라 물의 이동 경과에 기초하여 관수를 제어하는 방법을 나타낸 도면이다. 노 지용 스마트 팜 제어 시스템은 하나의 관수장치를 기준으로 물의 이동 변화 지도를 생성할 수 있으며, 이에 기초하여 작물의 위치를 제어하거나 관수장치를 제어하여 작물의 원활한 성장을 도울 수 있으며, 이는 상술한 바와 같다. 일 예로, 도 16a 및 도 16b를 참조하면, 관수장치의 위치 및 관수장치를 통해 공급되는 수분과 양액은 물의 이동 변화 지도를 고려하여 상이하게 결정될 수 있다. 구체적으로, 도 16a의 관수장치의 위치를 고려 하면 물의 이동 변화 지도에서 물 공급이 원활하지 않은 영역이 존재할 수 있다. 여기서, 노지용 스마트 팜 제어 시스템은 해당 영역을 작물들 간의 경계로 설정하거나 해당 영역에서는 작물을 재배하지 않도록 할 수 있다. 또 다른 일 예로, 노지용 스마트 팜 제어 시스템은 전체 재배 면적을 고려하여 전체 영역에서 작물 재배를 수행하도록 관수장치의 배치를 제어할 수 있다. 구체적으로, 도 16b를 참조하면, 관수장치들의 간격은 물의 이동 변화 지도에 기초하여 공백 영역이 최소화되는 위치로 선정될 수 있다. 즉, 관수장치 의 수 및 위치는 물의 이동 변화 지도를 기반으로 작물들이 물을 원활하게 공급 받을 수 있도록 공백 영역 을 최소화하도록 배치될 수 있다. 이를 통해, 노지용 스마트 팜 제어 시스템은 전체 작물들의 원활한 재배를 수행할 수 있다. 도 17은 일 실시예에 따라, 인공지능(artificial intelligence, AI)에 기초하여 토양을 분석하고, 수분 및 양액 을 공급하는 관수를 제어하는 방법을 나타낸 도면이다. 일 예로, 노지용 스마트 팜 제어 시스템은 상술한 물의 이동 변화 지도(또는 탈수 값 그래프, 1710)를 인공 지능 학습모델의 입력으로 제공하여 학습을 수행할 수 있다. 일 예로, 인공지능 학습모델은 토양과 관련된 탈수 값으로 벡터 값에 대한 정보를 기 저장할 수 있다. 여기서, 입력으로 제공되는 탈수 값 그래프에 기초하여 해당 관수 주변의 토양 성질 및 환경을 분석할 수 있다. 그 후, 노지용 스마트 팜 제어 시스템은 인공지능 학습모델을 통해 분석된 결과 정보를 통해 공급하는 수분 및 양액을 제어할 수 있으며, 이에 대한 정보는 인공지능 학습모델로 다시 피드백되어 정확도를 높일 수 있으며, 상술한 실시예로 한정 되지 않는다. 도 18은 일 실시예에 따라 정밀 관수를 위한 토양 환경 분석을 수행하는 방법을 나타낸 순서도이다. 복수의 센 서 노드가 설치된 위치 정보 및 깊이 정보에 기초하여 복수의 센서 노드 각각으로부터 토양 내 수분 관련 정보 를 센싱할 수 있다.(S1810) 그 후, 제어서버는 복수의 센서 노드 각각으로부터 측정된 토양 내 수분 관련 센싱 정보에 기초하여 토양 특성 정보를 결정할 수 있다.(S1820) 그 후, 제어서버는 결정된 토양 특성 정보에 기초하 여 수분과 양액을 공급하는 적어도 하나의 관수장치, 복수의 센서 노드 및 작물 위치를 제어할 수 있다.(S1830) 여기서, 정밀 관수를 위한 토양 환경 분석을 수행하는 제어 서버는 노지 스마트 팜에서 메쉬 형태로 설치되고, 노지 스마트 팜 내의 농작물 관련 정보를 센싱하는 복수의 센서 노드를 포함할 수 있다. 또한, 제어서버는 복수 의 센서 노드에서 획득되는 센싱 값에 기초하여 토양 분석을 수행하는 제어부 및 분석된 토양의 특성에 기초하 여 원수 및 양액을 공급하는 관수장치도 포함할 수 있다. 이때, 일 예로, 토양 내 수분 관련 정보는 토양 내 모든 공극이 물로 채워진 상태에 기초하여 메트릭 퍼텐싱에 의해 토양 내 공극에 남아있는 물을 지칭하는 포장 용수량 및 토양 성질에 기초하여 물을 배출하는 값을 지칭하 는 탈수 값을 포함할 수 있다. 여기서, 토양 특성 정보는 포장 용수량 및 탈수 값에 따라 결정될 수 있다. 즉, 복수 개의 센서 노드를 통해 센싱된 포장 용수량 및 탈수 값을 통해 토양 특성 정보로서 토양의 종류 및 토양의 혼합비 정보가 도출될 수 있다. 일 예로, 복수 개의 센서 노드를 통해 센싱되는 포장 용수량 및 탈수 값에 기초 하여 도출되는 토양의 종류 및 토양의 혼합비 정보는 데이터베이스에 저장될 수 있다. 또한, 일 예로, 복수 개 의 센서 노드를 통해 센싱되지 않은 토양의 종류 및 토양의 혼합비 정보는 딥러닝에 기초하여 결정될 수 있다. 이를 통해 데이터베이스는 포장 용수량 및 탈수 값에 따른 토양의 종류 및 토양의 혼합비 정보를 저장하여 구축 할 수 있으며, 이후 센싱되는 데이터와 비교할 수 있다. 또한, 일 예로, 제어서버는 토양 특성 정보를 통해 적어도 하나의 관수장치 각각의 위치가 작물 위치에 기초하 여 적합한 위치인지 여부를 확인하여 적어도 하나의 관수장치 각각의 위치를 결정할 수 있다. 또한, 제어서버는 토양 특성 정보를 통해 복수 개의 센서 노드 각각의 위치가 적합한지 여부를 확인하여 복수 개의 센서 노드 각 각의 위치를 결정할 수 있다. 여기서, 일 예로, 탈수 값은 물의 이동 방향에 따라 축 방향 값 및 횡 방향 값에 기초하여 결정되는 벡터 값일 수 있다. 토양 특성 정보는 상술한 벡터 값에 기초하여 도출될 수 있으며, 벡터 값은 토양 내 수분 잔여 시간 정보와 연계될 수 있다. 제어서버는 탈수 값을 통해 적어도 하나의 관수장치 각각 의 위치가 작물 위치에 기초하여 적합한 위치인지 여부를 확인하여 적어도 하나의 관수장치 각각의 위치를 결정 할 수 있다. 또한, 제어서버는 탈수 값에 기초하여 복수 개의 센서 노드 각각의 위치가 적합한지 여부를 확인하 여 복수 개의 센서 노드 각각의 위치를 결정할 수 있다. 또한, 탈수 값은 적어도 하나의 관수장치 각각에서 센 싱될 수 있다. 제어서버는 적어도 하나의 관수장치 각각으로 포화 급수를 제공하고, 포화 급수에 기초하여 탈수 값에 대한 물의 이동 변화 지도를 기 설정된 시간 간격에 따라 생성할 수 있다. 여기서, 적어도 하나의 관수장 치 각각에 대해 생성된 물의 이동 변화 지도에 기초하여 수분 및 양액 공급에 대한 공백 영역을 확인하고, 공백 영역을 최소화되도록 관수장치의 수와 위치를 결정할 수 있다. 또한, 일 예로, 작물 위치는 공백 영역 이외의영역으로 결정될 수 있으며, 이는 상술한 바와 같다. 또한, 일 예로, 제어서버는 인공지능 학습모델을 구비하고, 적어도 하나의 관수장치 각각에 대해 생성된 물의 이동 변화 지도를 통해 인공지능 학습모델을 학습 할 수 있다. 그 후, 복수의 센서 노드를 통해 센싱되는 데이터가 학습된 인공지능 학습모델의 입력으로 제공되 고, 수분 및 양액 공급이 출력 정보로 제공되어 제어될 수 있다. 이상에서 설명한 실시예들은 적어도 부분적으로 컴퓨터 프로그램으로 구현되고 컴퓨터로 읽을 수 있는 기록매체 에 기록될 수 있다. 실시예들을 구현하기 위한 프로그램이 기록되고 컴퓨터가 읽을 수 있는 기록매체는 컴퓨터 에 의하여 읽힐 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 기록매체 의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 광 데이터 저장장치 등이 있다. 또한 컴퓨터가 읽을 수 있는 기록매 체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산 방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실 행될 수도 있다. 또한, 본 실시예를 구현하기 위한 기능적인 프로그램, 코드 및 코드 세그먼트(segment)들은 본 실시예가 속하는 기술 분야의 통상의 기술자에 의해 용이하게 이해될 수 있을 것이다. 이상에서 살펴본 본 명세서는 도면에 도시된 실시예들을 참고로 하여 설명하였으나 이는 예시적인 것에 불과하 며 당해 분야에서 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 실시예의 변형이 가능하다는 점을 이해 할 것이다. 그러나, 이와 같은 변형은 본 명세서의 기술적 보호범위 내에 있다고 보아야 한다. 따라서, 본 명세 서의 진정한 기술적 보호범위는 첨부된 청구범위의 기술적 사상에 의해서 다른 구현들, 다른 실시예들 및 특허 청구범위와 균등한 것들도 포함하도록 정해져야 할 것이다."}
{"patent_id": "10-2023-0005834", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 노지(露地) 스마트 팜(smart farm) 제어 시스템의 블록도이다. 도 2a는 일 실시예에 따른 노지용 스마트 팜 제어 시스템에서 스마트 팜과 서버 사이의 통신을 설명하기 위한 개념도이다. 도 2b는 일 실시예에 따른 노지용 스마트 팜 제어 시스템에서 스마트 팜의 게이트웨이(gateway) 장치와 사용자 장치 사이의 데이터 송수신을 설명하기 위한 개념도이다. 도 3은 일 실시예에 따른 노지용 스마트 팜 제어 시스템과 통신하는 센서 노드(sensor node) 장치의 사시도이다. 도 4는 도 3에 도시된 센서 노드 장치의 개략적인 블록도이다.도 5a는 일 실시예에 따른 노지용 스마트 팜에서 관수장치를 통해 원수 및 양액을 공급하는 방법을 나타낸 도면 이다. 도 5b는 일 실시예에 따른 노지용 스마트 팜에서 관수장치를 통해 원수 및 양액을 공급하는 방법을 나타낸 도면 이다. 도 6은 일 실시예에 따른 수분 변화를 감지하는 방법을 나타낸 도면이다. 도 7은 일 실시예에 따른 토양별 유효수분을 나타낸 도면이다. 도 8a는 일 실시예에 따른 각 구간별 수분 변화를 나타낸 도면이다. 도 8b는 일 실시예에 따른 주변 환경 정보에 기초하여 각 구간별 수분 변화를 나타낸 도면이다. 도 9a는 일 실시예에 따른 기준 데이터에 기초하여 센서 노드로부터 측정된 정보를 확인하는 방법을 나타낸 도 면이다. 도 9b는 일 실시예에 따른 기준 데이터와 센싱 값의 위상차에 기초하여 센서 노드가 적절하게 설치되었는지 여 부를 확인하는 방법을 나타낸 도면이다. 도 10은 일 실시예에 따른 인공지능(artificial intelligence, AI)에 기초하여 센싱 노드 값을 확인하는 방법을 나타낸 도면이다. 도 11은 일 실시예에 따른 토양 내 수분변화를 기초로 토양을 분석하는 방법을 나타낸 도면이다. 도 12는 일 실시예에 따라 토양 내 탈수 값을 나타낸 도면이다. 도 13은 일 실시예에 따라 토양 내 탈수 값을 나타낸 도면이다. 도 14a는 일 실시예에 따라 급수를 통해 토양 내에서 물의 이동을 나타낸 도면이다. 도 14b는 일 실시예에 따라 급수를 통해 토양 내에서 시간별 물의 이동 경과를 나타낸 도면이다. 도 14c는 일 실시예에 따라 물의 이동 경과에 기초하여 작물 위치를 결정하는 방법을 나타낸 도면이다. 도 15a는 일 실시예에 따라 급수를 통해 토양 내에서 물의 이동을 나타낸 도면이다. 도 15b는 일 실시예에 따라 급수를 통해 토양 내에서 시간별 물의 이동 경과를 나타낸 도면이다. 도 15c는 일 실시예에 따라 물의 이동 경과에 기초하여 작물 위치를 결정하는 방법을 나타낸 도면이다. 도 16a는 일 실시예에 따라 물의 이동 경과에 기초하여 관수를 제어하는 방법을 나타낸 도면이다. 도 16b는 일 실시예에 따라 물의 이동 경과에 기초하여 관수를 제어하는 방법을 나타낸 도면이다. 도 17은 일 실시예에 따라, 인공지능(artificial intelligence, AI)에 기초하여 토양을 분석하고, 수분 및 양액 을 공급하는 관수를 제어하는 방법을 나타낸 도면이다. 도 18은 일 실시예에 따라 정밀 관수를 위한 토양 환경 분석을 수행하는 방법을 나타낸 순서도이다."}
