{"patent_id": "10-2022-0157172", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0075310", "출원번호": "10-2022-0157172", "발명의 명칭": "대화형 AI 학습방식을 통한 생활활동 인식 장치", "출원인": "주식회사 케이아이씨텍", "발명자": "박채민"}}
{"patent_id": "10-2022-0157172", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "댁내의 복수의 센서로부터 수신한 센서데이터를 생활공간별로 분류하는 센서데이터 분류부;상기 생활공간별로 분류한 센서데이터의 조합으로부터 사용자의 실제 생활활동을 감지하여 생활활동 입력데이터를 생성하는 입력데이터 생성부; 및상기 생성한 생활활동 입력데이터를 상기 감지한 생활활동에 대한 생활공간에 해당하는 학습모델에 입력하여 상기 사용자의 생활활동을 인식하는 생활활동 인식부;를 포함하며,상기 학습모델은, 상기 사용자의 선택에 따라 상기 생활활동 입력데이터에 생활활동 레이블을 레이블링함으로써구성된 학습데이터를 학습하여 생성된 것을 특징으로 하는 대화형 AI 학습방식을 통한 생활활동 인식 장치."}
{"patent_id": "10-2022-0157172", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 입력데이터 생성부는,상기 생활공간별로 각각 분류한 센서데이터의 조합에서, 적어도 하나 이상의 센서데이터가 변하는 이벤트의 발생을 모니터링함으로써 상기 사용자의 실제 생활활동을 감지하며,상기 이벤트가 발생한 센서데이터의 조합을 상기 생활활동 입력데이터로 생성하는 것을 특징으로 하는 대화형AI 학습방식을 통한 생활활동 인식 장치."}
{"patent_id": "10-2022-0157172", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 생활활동 인식 장치는,상기 생활활동 입력데이터에 해당하는 생활공간에 대한 적어도 하나 이상의 생활활동 레이블을 사용자에게 제공하여 생활활동 레이블의 선택을 요청하는 레이블 요청부;상기 생활활동 입력데이터에 상기 사용자가 선택한 생활활동 레이블을 레이블링함으로써 학습데이터로 구성하는레이블링부; 및상기 구성한 학습데이터를 학습하여 사용자의 생활활동을 인식하기 위한 학습모델을 생성하는 학습모델 생성부;를 더 포함하며,상기 학습모델은, 생활공간별로 구성되는 학습데이터를 각각 학습하여 상기 생활공간별로 각각 생성되며,상기 학습은, 소정의 시간기간 동안 수행되거나, 상기 학습데이터를 구성하는 상기 생활활동 레이블을 레이블링한 생활활동 입력데이터가 소정의 개수를 초과할 때까지 수행되는 것을 특징으로 하는 대화형 AI 학습방식을 통한 생활활동 인식 장치."}
{"patent_id": "10-2022-0157172", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 사용자의 생활활동을 인식하는 것은,상기 학습과 동시에 수행되거나, 혹은 상기 학습이 완전히 종료된 후 수행되는 것을 특징으로 하는 대화형 AI학습방식을 통한 생활활동 인식 장치."}
{"patent_id": "10-2022-0157172", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2024-0075310-3-청구항 1에 있어서,상기 생활활동 인식부는,상기 생성한 생활활동 입력데이터에 해당하는 생활공간의 학습모델에 해당 생활활동 입력데이터를 입력하여, 해당 학습모델의 출력결과 중 확률이 제일 높은 생활활동을 선택함으로써 상기 사용자의 생활활동을 인식하는 것을 특징으로 하는 대화형 AI 학습방식을 통한 생활활동 인식 장치."}
{"patent_id": "10-2022-0157172", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "에 있어서,상기 생활활동 인식 단계는,상기 생성한 생활활동 입력데이터에 해당하는 생활공간의 학습모델에 해당 생활활동 입력데이터를 입력하여, 해당 학습모델의 출력결과 중 확률이 제일 높은 생활활동을 선택함으로써 상기 사용자의 생활활동을 인식하는 것을 특징으로 하는 대화형 AI 학습방식을 통한 생활활동 인식 방법."}
{"patent_id": "10-2022-0157172", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서,상기 입력데이터 생성 단계는,상기 생활공간별로 각각 분류한 센서데이터의 조합에서, 적어도 하나 이상의 센서데이터가 변하는 이벤트의 발생을 모니터링함으로써 상기 사용자의 실제 생활활동을 감지하며,상기 이벤트가 발생한 센서데이터의 조합을 상기 생활활동 입력데이터로 생성하는 것을 특징으로 하는 대화형AI 학습방식을 통한 생활활동 인식 방법."}
{"patent_id": "10-2022-0157172", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에 있어서,상기 생활활동 인식 방법은,상기 생활활동 입력데이터에 해당하는 생활공간에 대한 적어도 하나 이상의 생활활동 레이블을 사용자에게 제공하여 생활활동 레이블의 선택을 요청하는 레이블 요청 단계;상기 생활활동 입력데이터에 상기 사용자가 선택한 생활활동 레이블을 레이블링함으로써 학습데이터로 구성하는레이블링 단계; 및상기 구성한 학습데이터를 학습하여 사용자의 생활활동을 인식하기 위한 학습모델을 생성하는 학습모델 생성 단계;를 더 포함하며,상기 학습모델은, 생활공간별로 구성되는 학습데이터를 각각 학습하여 상기 생활공간별로 각각 생성되며,상기 학습은, 소정의 시간기간 동안 수행되거나, 상기 학습데이터를 구성하는 상기 생활활동 레이블을 레이블링한 생활활동 입력데이터가 소정의 개수를 초과할 때까지 수행되는 것을 특징으로 하는 대화형 AI 학습방식을 통한 생활활동 인식 방법."}
{"patent_id": "10-2022-0157172", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 6에 있어서,상기 사용자의 생활활동을 인식하는 것은,상기 학습과 동시에 수행되거나, 혹은 상기 학습이 완전히 종료된 후 수행되는 것을 특징으로 하는 대화형 AI학습방식을 통한 생활활동 인식 방법.공개특허 10-2024-0075310-4-청구항 10"}
{"patent_id": "10-2022-0157172", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 대화형 AI 학습방식을 통한 생활활동 인식 장치에 관한 것으로, 사용자와의 대화(인터랙션)를 통해 센 서데이터의 조합에 생활활동 레이블을 레이블링하여 학습데이터를 구성하고, 상기 구성한 학습데이터를 통해 사 용자의 생활활동을 학습함으로써, 댁내 생활환경이나 사용자의 습관 혹은 습성에 따라 사용자의 실제 생활활동을 정확하게 인식할 수 있도록 하는 생활활동 인식 장치에 관한 것이다."}
{"patent_id": "10-2022-0157172", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 대화형 AI 학습방식을 통한 생활활동 인식 장치에 관한 것으로, 더욱 상세하게는 사용자와의 대화(인 터랙션)를 통해 센서데이터의 조합에 생활활동 레이블을 레이블링하여 학습데이터를 구성하고, 상기 구성한 학 습데이터를 통해 사용자의 생활활동을 학습함으로써, 댁내 생활환경이나 사용자의 습관 혹은 습성에 따라 사용 자의 실제 생활활동을 정확하게 인식할 수 있도록 하는 생활활동 인식 장치에 관한 것이다."}
{"patent_id": "10-2022-0157172", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "댁내 사용자의 생활활동을 인식하는 것은 사용자의 생활활동에 대한 특정 서비스를 제공하거나 독거인(노인)이 나 환자의 위험 신호를 모니터링하는 것과 같이 다양한 분야에 적용될 수 있다. 예를 들어, 사용자가 아침에 기상한 것을 인식하여 필요한 뉴스를 제공하거나, 음식을 조리할 때 실내를 환기시 키는 것과 같이 다양한 서비스를 제공할 수 있을 것이다. 또 다른 예로써, 독거인이나 환자의 특성 생활활동(예: 샤워)을 인식한 후, 소정의 시간동안 또 다른 생활활동 이 인식되지 않으면 위험 상황으로 판단하여 즉각적인 조치(예: 119신고 등)를 취할 수 있을 것이다. 사용자의 생활활동을 인식하는 것은 다양한 센서를 통해 수집한 센서데이터를 딥러닝과 같은 인공지능 학습방법 을 통해 생성한 학습모델을 이용하는 것을 생각해볼 수 있다. 그러나 댁내별(즉, 집집마다)로 센서의 종류와 위치, 댁내의 생활공간 구성 등을 포함하는 생활환경이 천차만별 이며, 사용자별로 생활활동에 대한 습관이나 습성 등이 상이하기 때문에 동일한 학습모델을 적용하면 정확하게 사용자의 생활활동을 인식하는 것이 어렵다. 따라서 집집마다 초기 학습방법이 필요하다. 즉, 사용자의 생활활동의 인식을 위한 학습을 수행하기 위해선 집집마다 개별적으로 학습을 수행하여야만 사용 자의 생활환경이나 습성 혹은 습관에 적응하여 정확하게 사용자의 생활활동을 인식할 수 있는 것이다. 이에 따라 본 발명에서는 댁내에서 생활하는 사용자와의 인터랙션(대화)을 통해 적어도 하나 이상의 센서데이터 의 조합에 대한 생활활동 레이블을 부여하여 학습데이터를 생성하고, 상기 생성한 학습데이터를 지도학습방식으 로 학습하여 실제 센서 측정결과에 따라 사용자의 생활활동을 정확하게 인식할 수 있도록 하는 방안을 제안하고 자 한다. 즉, 본 발명은 적어도 하나 이상의 특정 센서데이터의 조합에 대한 생활활동 레이블을 사용자와의 대화를 통해 설정하여 학습데이터를 구성함으로써 사용자의 생활환경과 습관이나 습성에 따른 생활활동을 정확하게 인식할 수 있도록 하는 것이다."}
{"patent_id": "10-2022-0157172", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "다음으로 본 발명의 기술분야에 존재하는 선행기술에 대하여 간단하게 설명하고, 이어서 본 발명이 상기 선행 기술에 비해서 차별적으로 이루고자 하는 기술적 사항에 대해서 기술하고자 한다. 먼저 한국등록특허 제0972795호(2022.05.09.)는 일상생활활동 분류 장치 및 일상생활활동 분류 방법에 관한 것으로, 사용자의 손에 장착한 RFID 리더기를 통해 움직임 대상물에 장착한 RFID 태그 정보를 획득하고, 사용자에 부착된 가속도 센서를 통해 가속도 정보를 획득하여 사용자에 대한 상하운동, 좌우운동, 전후운동 또는 회전운 동을 포함하여 움직임 대상물에 대한 일상 생활활동을 분류하는 일상 생활활동 분류 장치 및 일상생활활동 분류 방법에 관한 것이다.즉, 한국등록특허 제0972795호는 RFID 리더기를 항상 손에 장착하고 있어야 하는 문제점이 있으며, 학습을 통해 생성한 학습모델을 이용하여 사용자의 일상생활을 인식하는 것이 아니다. 반면에 본 발명은 사용자와의 인터랙션을 통해 사용자의 댁내에서의 생활활동 인식을 위한 학습데이터를 생성하 고, 상기 생성한 학습데이터를 학습함으로써 사용자의 생활활동을 정확하게 인식할 수 있도록 하는 것으로, 한 국등록특허 제0972795호는 이러한 본 발명의 기술적 특징을 기재하거나 시사 혹은 그 어떠한 암시도 없다. 또한 한국등록특허 제2397311호(2022.08.09.)는 와이파이 송수신기 간의 채널상태정보를 이용한 실내 재실자의 일상생활활동 인식 방법에 관한 것으로, 실내 공간의 소정 위치에 각각 설치된 WiFi 송신기와 WiFi 수신기 간 에 통신되는 채널 상태 정보(CSI, channel state information) 신호를 수집하여 고주파 노이즈를 제거하고 사람 의 행동에 관한 파형을 추출함으로써 실내 공간 내에 있는 재실자의 현재 행동 상태를 파악하는 와이파이 송수 신기 간의 채널상태정보를 이용한 실내 재실자의 일상생활활동 인식 방법에 관한 것이다. 즉, 한국등록특허 제2397311호는 단순히 WiFi 채널상태정보 신호에 따라 사용자의 부재, 걷기, 넘어짐 등을 인 식하는 것일 뿐, 요리, 수면, 기상, 용변 등의 실제 생활활동을 인식하는 것이 아니며, 본 발명에서 제안하고 있는 사용자와의 대화를 통해 학습데이터를 생성하는 것이 아니고, 학습데이터를 학습하여 생성한 학습모델을 통해 사용자의 실제 생활활동을 인식하는 방법 또한 전혀 기재하고 있지 않아 한국등록특허 제2397311호와 본 발명은 그 기술적 구성, 목적 및 효과에 있어서 현저한 차이점이 있다."}
{"patent_id": "10-2022-0157172", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위해 창작된 것으로서, 학습모델을 통해 댁내에서 생활하는 사용자의 생활활동을 정확하게 인식할 수 있도록 하는 대화형 AI 학습방식을 통한 생활활동 인식 장치를 제공하는 것을 그 목적으로 한다. 또한 본 발명은 사용자와의 대화(인터랙션)를 통해 학습모델을 생성하기 위한 학습데이터를 구성하는 장치를 제 공하는 것을 그 목적으로 한다. 또한 본 발명은 생활환경에 구비되는 복수의 센서를 통해 수집되는 센서데이터의 변화를 모니터링하고 있으면서, 적어도 하나 이상의 센서데이터가 변하는 이벤트의 발생을 감지함으로써 실제 사용자의 생활활동을 감지하여 해당 센서데이터의 조합으로 생활활동 입력데이터를 생성하고, 상기 생활활동 입력데이터에 대한 생활 활동 레이블을 사용자로 하여금 선택하도록 함으로써 상기 생활활동 입력데이터에 생활활동 레이블을 레이블링 하여 학습데이터로 구성하는 장치를 제공하는 것을 그 목적으로 한다. 또한 본 발명은 사용자와의 대화를 통해 생성한 학습데이터를 학습하여 학습모델을 생성함으로써 사용자가 위치 하는 댁내의 환경, 사용자의 습관이나 습성에 따라 정확하게 사용자의 생활활동을 인식하는 장치를 제공하는 것 을 그 목적으로 한다."}
{"patent_id": "10-2022-0157172", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 대화형 AI 학습방식을 통한 생활활동 인식 장치는, 댁내의 복수의 센서로부터 수신 한 센서데이터를 상기 댁내의 생활공간별로 분류하는 센서데이터 분류부, 상기 생활공간별로 분류한 센서데이터 의 조합으로부터 사용자의 실제 생활활동을 감지하여 생활활동 입력데이터를 생성하는 입력데이터 생성부 및 상 기 생성한 생활활동 입력데이터를 상기 감지한 생활활동에 대한 생활공간에 해당하는 학습모델에 입력하여 상기 사용자의 생활활동을 인식하는 생활활동 인식부를 포함하며, 상기 학습모델은, 상기 사용자의 선택에 따라 상기 생활활동 입력데이터에 생활활동 레이블을 레이블링함으로써 구성된 학습데이터를 학습하여 생성된 것을 특징으 로 한다. 또한 상기 입력데이터 생성부는, 상기 생활공간별로 각각 분류한 센서데이터의 조합에서, 적어도 하나 이상의 센서데이터가 변하는 이벤트의 발생을 모니터링함으로써 상기 사용자의 실제 생활활동을 감지하며, 상기 이벤트 가 발생한 센서데이터의 조합을 상기 생활활동 입력데이터로 생성하는 것을 특징으로 한다. 또한 상기 생활활동 인식 장치는, 상기 생활활동 입력데이터에 해당하는 생활공간에 대한 적어도 하나 이상의 생활활동 레이블을 사용자에게 제공하여 생활활동 레이블의 선택을 요청하는 레이블 요청부, 상기 생활활동 입 력데이터에 상기 사용자가 선택한 생활활동 레이블을 레이블링함으로써 학습데이터로 구성하는 레이블링부 및상기 구성한 학습데이터를 학습하여 사용자의 생활활동을 인식하기 위한 학습모델을 생성하는 학습모델 생성부 를 더 포함하며, 상기 학습모델은, 생활공간별로 구성되는 학습데이터를 각각 학습하여 상기 생활공간별로 각각 생성되며, 상기 학습은, 소정의 시간기간 동안 수행되거나, 상기 학습데이터를 구성하는 상기 생활활동 레이블 을 레이블링한 생활활동 입력데이터가 소정의 개수를 초과할 때까지 수행되는 것을 특징으로 한다. 또한 상기 사용자의 생활활동을 인식하는 것은, 상기 학습과 동시에 수행되거나, 혹은 상기 학습이 완전히 종료 된 후 수행되는 것을 특징으로 한다. 또한 상기 생활활동 인식부는, 상기 생성한 생활활동 입력데이터에 해당하는 생활공간의 학습모델에 해당 생활 활동 입력데이터를 입력하여, 해당 학습모델의 출력결과 중 확률이 제일 높은 생활활동을 선택함으로써 상기 사 용자의 생활활동을 인식하는 것을 특징으로 한다. 아울러 본 발명의 일 실시예에 따른 대화형 AI 학습방식을 통한 생활활동 인식 방법은, 댁내의 복수의 센서로부 터 수신한 센서데이터를 상기 댁내의 생활공간별로 분류하는 센서데이터 분류 단계, 상기 생활공간별로 분류한 센서데이터의 조합으로부터 사용자의 실제 생활활동을 감지하여 생활활동 입력데이터를 생성하는 입력데이터 생 성 단계 및 상기 생성한 생활활동 입력데이터를 상기 감지한 생활활동에 대한 생활공간에 해당하는 학습모델에 입력하여 상기 사용자의 생활활동을 인식하는 생활활동 인식 단계를 포함하는 것을 특징으로 한다. 또한 상기 입력데이터 생성 단계는, 상기 생활공간별로 각각 분류한 센서데이터의 조합에서, 적어도 하나 이상 의 센서데이터가 변하는 이벤트의 발생을 모니터링함으로써 상기 사용자의 실제 생활활동을 감지하며, 상기 이 벤트가 발생한 센서데이터의 조합을 상기 생활활동 입력데이터로 생성하는 것을 특징으로 한다. 또한 상기 생활활동 인식 방법은, 상기 생활활동 입력데이터에 해당하는 생활공간에 대한 적어도 하나 이상의 생활활동 레이블을 사용자에게 제공하여 생활활동 레이블의 선택을 요청하는 레이블 요청 단계, 상기 생활활동 입력데이터에 상기 사용자가 선택한 생활활동 레이블을 레이블링함으로써 학습데이터로 구성하는 레이블링 단계 및 상기 구성한 학습데이터를 학습하여 사용자의 생활활동을 인식하기 위한 학습모델을 생성하는 학습모델 생성 단계를 더 포함하는 것을 특징으로 한다. 또한 상기 생활활동 인식 단계는, 상기 생성한 생활활동 입력데이터에 해당하는 생활공간의 학습모델에 해당 생 활활동 입력데이터를 입력하여, 해당 학습모델의 출력결과 중 확률이 제일 높은 생활활동을 선택함으로써 상기 사용자의 생활활동을 인식하는 것을 특징으로 한다."}
{"patent_id": "10-2022-0157172", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이와 같이 구성된 본 발명은 사용자와의 대화를 통해 생성한 학습데이터를 학습하여 학습모델을 생성함으로써 사용자가 생활하는 댁내에 대한 환경, 사용자의 습관이나 습성에 따라 사용자의 생활활동을 정밀하게 인식할 수 있는 효과가 있다. 또한 사용자의 생활활동을 인식하여 인식한 생활활동에 따른 적합한 다양한 서비스를 제공할 수 있도록 함으로 써 삶의 질을 향상시킬 수 있도록 하는 효과가 있다."}
{"patent_id": "10-2022-0157172", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 다양한 실시예를 상세히 설명하기로 한다. 본 발명의 명세서 또는 출 원에 개시되어 있는 일 실시예들에 대해서 특정한 구조적 내지 기능적 설명들은 단지 본 발명에 따른 실시예를 설명하기 위한 목적으로 예시된 것으로, 다르게 정의 되어 있지 않는 한, 기술적이거나 과학적인 용어를 포함해"}
{"patent_id": "10-2022-0157172", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "서 본 명세서에서 사용되는 모든 용어들은 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에 의해 일반 적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어 들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 명세서에서 명백 하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 아니한다. 도 1은 본 발명의 일 실시예에 따른 대화형 AI 학습방식을 통한 생활활동 인식 장치를 설명하기 위해 나타낸 도 면이다. 도 1에 도시한 바와 같이, 본 발명의 일 실시예에 따른 AI 학습방식을 통한 생활활동 인식 장치(이하 생활 활동 인식 장치라 칭함)는 복수의 센서로부터 수신한 센서데이터로부터 실제 사용자의 생활활동을 감지하여 생 활활동 입력데이터를 생성하고, 상기 생성한 생활활동 입력데이터를 학습모델에 입력하여 사용자의 생활활동을 인식하고, 상기 인식한 생활활동에 대한 다양한 서비스를 제공하도록 구성된다. 상기 생활활동 인식 장치는 댁내에 구비되어 사용자의 생활활동을 인식하도록 구성될 수 있다. 홈 네트워 크의 일부나 월 박스(wall box) 형태로 구성될 수 있으며, 댁내에 구비되는 복수의 센서로부터 센서데이터를 수 신하여 상기 수신한 센서데이터의 조합을 생활활동 입력데이터로 학습모델에 입력하여 사용자의 생활활동을 인 식한다. 다만 본 발명은 이에 한정하지 않으며 클라우드 서버와 같은 형태로 구성될 수도 있다. 클라우드 서버 와 같은 행태로 구성되는 경우, 생활활동 인식 장치는 홈 네트워크를 통해 센서데이터를 수신하도록 구성 된다. 상기 센서는 거실, 주방, 화장실(욕실), 창고, 베란다, 방, 옷 방 등과 같이 댁내의 다양한 생활공간에 적어도 하나 이상으로 각각 구비되어 상호 목적에 따른 센서데이터를 생활활동 인식 장치로 전송하도록 구성된다. 상기 센서는 움직임 감지센서, 가전제품(예: 가스레인지, 보일러, TV, 청소기, 세탁기 등)이나 각종 생활 기구 (보일러, 수도, 변기, 도어 등)의 동작을 감지하기 위한 동작 감지센서 등을 포함하여 구성된다. 예를 들어, 화장실(욕실)에는 움직임 감지센서, 변기 물내림 감지센서, 샤워기 사용 감지센서(즉, 샤워기를 통 한 물사용 감지센서), 세면대 사용 감지센서(즉, 세면대를 통한 물사용 감지센서)가 구비될 수 있다. 또 다른 예로써, 거실에는 움직임 감지센서, TV 동작 감지센서, 청소기 등에 구비되는 청소기 동작 감지센서, 쇼파에 구비되는 압전센서 등과 같은 다양한 센서가 구비될 수 있으며, 주방의 경우에는 각종 요리기구(가스레 인지, 오븐 등등)에 대한 동작 감지센서, 가스밸브나 환기구 동작 감지센서 등과 같은 다양한 센서들이 구비될 수 있고, 방에는 움직임 감지센서, 침대에 구비되는 압전센서, 각종 전자기기(TV)의 동작을 감지하기 위한 감지 센서들이 구비될 수 있다. 즉, 댁내에 구비되는 센서는 생활공간에 따라 다양하게 구비될 수 있다. 상기 학습모델은 사용자의 생활활동을 인식하기 위해서 구성한 학습데이터를 학습하여 생성된다. 상기 학습데이터는 사용자의 생활활동을 학습하기 위해서 구성되는 것으로, 생활활동 레이블이 각각 레이블링된 적어도 하나 이상의 생활활동 입력데이터(즉, 센서데이터의 조합)로 구성된다. 이때, 생활활동 인식 장치 는 사전에 미리 구축된 학습데이터를 학습하는 것이 아니라, 사용자와의 대화를 통해 학습데이터를 구성한다. 즉, 생활활동 인식 장치는 사용자와의 대화를 통해 센서데이터의 조합에 대한 생활활동 레이블을 선택하도 록 하여 적어도 하나 이상의 각 센서데이터의 조합에 생활활동 레이블을 레이블링함으로써 학습데이터를 구성하 는 것이다. 이를 통해 댁내의 생활환경이나 사용자의 습관 혹은 습성이 반영된 학습데이터를 구성할 수 있으며, 학습을 통해서 상기 생활공간의 환경이나 사용자의 습관 혹은 습성에 따라 매우 정확하게 사용자의 생활활동을 인식할 수 있다. 한편, 학습데이터를 구성하는 것은 도 2를 참조하여 상세히 설명하도록 하며, 학습데이터를 학습하여 학습모델 을 생성하는 것은 도 4를 참조하여 상세히 설명하도록 한다. 또한 생활활동 인식 장치는 사용자의 생활활동을 인식한 경우, 인식한 생활활동에 따른 다양한 서비스를 제공할 수 있다. 예를 들어, 기상(생활활동)시, 사용자에게 뉴스를 제공하거나 음식 조리시, 환풍구를 동작시키거나 외출시, 불 필요한 전자기기나 전자제품 혹은 조명을 오프(off)시키거나 청소시, 환기를 시키라는 알람을 제공하는 것과 같 이 다양한 서비스를 제공할 수 있다. 즉, 본 발명의 생활활동 인식 장치는 사용자의 생활활동을 인식하여 생활활동에 적합한 다양한 서비스를 제공할 수 있도록 하는 것이다. 도 2는 본 발명의 일 실시예에 따른 학습데이터를 구성하는 방법을 설명하기 위해 나타낸 도면이다. 도 2에 도시한 바와 같이, 본 발명의 일 실시예에 따른 생활활동 인식 장치는 사용자의 댁내에 구비되는 경우, 학습모델을 생성하기 위한 학습데이터를 구성한다. 상기 학습데이터를 구성하기 위해서, 생활활동 인식 장치는 댁내에 구비되는 복수의 센서로부터 센서데이 터를 수집한다. 상기 센서는 거실, 주방, 베란다 등과 같이 다양한 생활공간에 적어도 하나 이상으로 각각 구비된다. 또한 상기 센서는 전자제품이나 전자기기, 조명 등을 포함하여 다양한 기기(혹은 기구)에도 구비될 수 있음은 상술한 바와 같다. 한편, 생활활동은 생활공간별로 서로 상이할 수 있으므로 생활공간별로 생활활동을 인식하는 것이 인식결과에 대한 정확도를 높일 수 있다. 따라서 본 발명의 생활활동 인식 장치는 수집한 센서데이터를 거실, 부장, 베란다 등과 같은 생활공간별로 분류한다. 이때, 각 센서들은 위치정보와 센서데이터를 생활활동 인식 장치로 전송하도록 구성될 수 있다. 상기 생활활동 인식 장치는 각 센서들의 위치정보에 따라 센서데이터를 생활공간별로 분류한다. 즉, 각 생 활공간에서 전송되는 센서데이터의 조합이 생활공간별로 분류되는 것이다. 예를 들어, 화장실에 구비되는 센서가 움직임 감지센서, 변기 물내림 감지센서, 샤워기 사용 감지센서, 세면대 사용 감지센서라고 하면, 해당 각 센서의 센서데이터의 조합이 화장실(생활공간)로 분류된다. 또한 생활활동 인식 장치는 각 생활공간별로 센서데이터의 변화를 모니터링하고 있으면서, 적어도 하나 이 상의 센서데이터가 변하는 이벤트가 발생하면, 해당 센서데이터의 조합을 생활활동 입력데이터로 생성하고, 해 당 이벤트에 대한 생활활동 레이블을 선택하도록 사용자에게 요청한다. 상기 이벤트가 발생한 센서데이터의 조합으로 생성한 생활활동 입력데이터는 특정 생활활동에 대한 관계가 형성 된 것이 아니기 때문에 학습에 이용되기 위해서는 생활활동 레이블이 레이블링되어야 한다. 이때, 생활활동 인식 장치는 각 생활공간별로 생활활동 레이블을 저장하여 관리하고 있으면서, 센서데이터 의 변화 이벤트가 발생한 센서데이터의 조합(즉, 생활활동 입력데이터)에 해당하는 생활공간에 대한 생활활동 레이블을 사용자 단말로 제공하여 생활활동 레이블을 선택하도록 요청한다. 상기 생활활동 레이블은 생활공간별로 사전에 미리 적어도 하나 이상으로 생성되어 있다. 여기서 생활활동 인식 장치는 사용자로 제공한 생활활동 레이블 이외에 새로운 생활활동 레이블을 입력할 수 있도록 하는 기능도 제공한다. 즉, 사용자 입장에서 생활활동 인식 장치에서 제공받은 생활활동 레이블 에서 현재 자신의 생활활동에 대한 레이블이 없는 경우, 해당 생활활동에 대한 레이블을 새롭게 입력할 수 있다. 예를 들어, 생활활동 인식 장치는 화장실에 대해서 저장한 생활활동 레이블이 목욕(샤워), 용변, 세면이라 고 가정하고, 화장실로 분류한 센서데이터의 조합에서 적어도 하나 이상의 센서데이터가 변하는 이벤트의 발생 (예: 변기 물내림 감지센서의 센서데이터)을 모니터링함으로써, 실제 사용자의 생활활동을 감지하여 해당 센서 데이터의 조합을 생활활동 입력데이터로 구성한 경우, 화장실에서 사용자의 생활활동이 감지되었음을 알리고 목 욕, 용변, 세면에 대한 레이블을 제공하여 선택하도록 하는 것이다. 이때, 사용자가 화장실 청소를 하고 있었다 면 화장실 청소라는 새로운 생활활동 레이블을 입력할 수 있다. 즉, 생활활동 인식 장치는 사용자와 대화를 통해 생활활동 입력데이터에 대한 생활활동 레이블을 사용자가 설정(지정)할 수 있도록 함으로써, 해당 이벤트에 따라 생성한 생활활동 입력데이터에 사용자의 습관이나 습성이 반영될 수 있도록 한다. 또한 생활활동 인식 장치는 사용자가 생활활동 레이블을 선택하면, 해당 생활활동 입력데이터에 생활활동 레이블을 레이블링하여 학습데이터로 구성한다. 예를 들어, 도 2에 도시한 것과 같이, 화장실로 분류한 센서데이터의 조합을 구성하는 움직임 감지센서의 센서 데이터가 1(즉, 움직임 감지 1, 움직임 미감지 0)이고, 변기 물내림 감지센서의 센서데이터가 1(즉, 물내림 감 지 1, 물내림 미감지 0)이며, 샤워기 및 세면대 사용 감지센서의 센서데이터가 각각 0(즉, 사용 감지 1, 사용 미감지 0)이며, 사용자가 선택한 레이블이 용변이면 상기 센서데이터들의 조합으로 생성한 생활활동 입력데이터 에 생활활동 레이블인 용변을 레이블링하여 학습데이터를 구성하는 것이다. 즉, 학습데이터는 생활활동 레이블이 각각 레이블링된 센서데이터의 조합으로 각각 생성한 생활활동 입력데이터 로 구성되며, 상기 학습모델을 위한 학습은 일정 시간기간(예: 1주일) 동안 수행되거나, 생활활동 레이블이 레 이블링된 생활활동 입력데이터가 일정 개수를 초과할 때 까지 수행된다. 이때, 학습데이터도 댁내의 생활공간별 로 각각 구성된다. 또한 생활활동 인식 장치는 생활공간별로 구성한 학습데이터를 각각 학습하여 생활공간별로 사용자의 생활 활동을 인식하기 위한 학습모델을 각각 생성한다. 즉, 도 1 및 도 2를 참조하여 설명한 것과 같이, 생활활동 입력데이터는 기본적으로 학습모델에 입력하기 위해 서 생성되는 것이며, 학습을 위한 학습데이터는 사용자와 대화를 통해 선택한 생활활동 레이블을 상기 생활활동 입력데이터에 레이블링한 것이다. 도 3은 본 발명의 일 실시예에 따른 학습데이터를 구성하는 절차를 나타낸 흐름도이다. 도 3에 도시한 바와 같이, 본 발명의 일 실시예에 따른 학습데이터를 구성하는 절차는 댁내에 생활활동 인식 장 치가 설치되는 경우에 우선적으로 수행된다. 이를 위해서, 생활활동 인식 장치는 복수의 센서로부터 센서데이터를 수신하는 센서데이터 수신 단계를 수 행한다(S110). 각 상기 센서는 감지결과를 포함하는 센서데이터와 위치정보를 생활활동 인식 장치로 실시 간 전송하도록 구성된다. 다음으로 생활활동 인식 장치는 센서로부터 수신한 위치정보에 따라 각 센서데이터를 댁내의 생활공간별로 분류하는 센서데이터 분류 단계를 수행한다(S120). 상기 분류는 센서데이터와 같이 수신되는 센서의 위치정보를 이용하여 수행된다. 다음으로 생활활동 인식 장치는 생활공간별로 분류한 센서데이터의 조합을 통해 사용자의 실제 생활활동을 감지하여 생활활동 입력데이터를 생성하는 입력데이터 생성 단계를 수행한다(S130). 상기 실제 생활활동을 감지하는 것은 생활공간별로 분류한 센서데이터의 조합에 대해서 적어도 하나 이상의 센 서데이터가 변하는 이벤트의 발생을 모니터링함으로써 수행되며, 상기 생활활동 입력데이터는 상기 이벤트가 발 생한 센서데이터의 조합으로 생성된다. 상기 이벤트의 발생을 모니터링하는 것은 이전 센서데이터의 조합과 비 교하여 적어도 하나 이상의 센서데이터가 변한 것을 검출함으로써 수행된다. 다음으로 생활활동 인식 장치는 생활활동 입력데이터가 생성되면(S130), 사용자의 실제 생활활동을 감지한 생활공간(즉, 상기 이벤트가 발생한 생활공간)에 대한 적어도 하나 이상의 생활활동 레이블을 사용자 단말로 제 공하여 해당 이벤트에 대한 생활활동 레이블의 선택을 요청하여 선택결과를 수신하는 레이블 요청 단계를 수행 한다(S150). 이때, 사용자는 현재 자신이 행하는 생활활동에 대해서 생활활동 레이블이 없는 경우에는 생활활동 레이블을 입 력할 수 도 있음은 상술한 바와 같다. 다음으로 생활활동 인식 장치는 생활활동 입력데이터에 사용자가 선택(혹은 입력)한 생활활동 레이블을 레 이블링하여 학습데이터로 구성하는 레이블링 단계를 수행한다(S160). 즉, 상기 생활활동 인식 장치는 사용자와의 대화를 통해 특정 센서데이터의 조합(이벤트가 발생되어 생성 한 생활활동 입력데이터)에 대한 생활활동 레이블을 레이블링함으로서 댁내의 생활환경뿐만 아니라 사용자의 습 관이나 습성을 반영한 학습데이터를 구성하는 것이다. 다음으로 생활활동 인식 장치는 학습데이터의 구성이 완료되면(S170), 각 생활공간별로 구성된 학습데이터 를 각각 학습하여 사용자의 생활활동을 인식하기 위한 학습모델을 생활공간별로 생성하는 학습모델 생성 단계를 수행한다(S180). 한편, 학습모델은 각 생활공간별로 생성되는 것이 바람직하다. 다만 본 발명에서는 이에 한정하지 않으며, 전체 센서데이터에 대해서 생활활동 레이블을 레이블링하여 구성한 학습데이터를 학습하여 전체적인 생활공간에서의 생활활동을 인식하도록 구성될 수 있다. 도 4는 본 발명의 일 실시예에 따른 학습모델을 생성하기 위한 학습네트워크와 학습모델을 생성하는 과정을 설 명하기 위해 나타낸 도면이다. 도 4에 도시한 바와 같이, 본 발명의 일 실시예에 따른 생활활동 인식 장치는 사용자와의 대화를 통해 댁 내의 생활공간별로 생성한 학습데이터를 학습하여 사용자의 생활활동을 인식하기 위한 학습모델을 생성한다. 본 발명의 학습네트워크는 학습데이터를 구성하는 생활활동 레이블이 레이블링된 생활활동 입력데이터의 센서데 이터가 각각 입력되는 복수의 입력노드를 포함하는 입력레이어, 복수의 히든노드를 포함하는 적어도 하나 이상 의 히든레이어 및 적어도 하나 이상의 출력노드를 포함하는 출력레이어를 포함하여 구성된다. 상기 학습데이터를 구성하는 생활활동 레이블이 레이블링된 생활활동 입력데이터의 각 센서데이터는 입력될 입 력노드가 미리 정해진다. 즉, 특정 센서데이터는 첫번째 입력노드, 또 센서데이터는 두번째 입력노드로 입력되 도록 설정된다. 예를 들어, 화장실로 분류된 학습데이터의 생활활동 입력데이터가 움직임 감지센서, 변기 물내림 감지센서, 샤 워기 사용 감지센서에 대한 각 센서데이터의 조합으로 구성된다면, 움직임 감지센서의 센서데이터는 첫번째 입 력노드로, 변기물 내림 감지센서 및 샤워기 사용 감지센서의 센서데이터는 두번째 입력노드 및 세번째 입력노드 로 각각 입력되도록 설정된다. 또한 입력레이어는 센서가 추가되는 것을 대비여 입력노드와 생활활동 입력데이터의 센서데이터 수를 확장하기 위한 여분의 입력노드를 포함하여 구성될 수 있다. 상기 입력레이어, 히든레이어 및 출력레이어는 특정 가중치를 가지는 링크(link)를 통해 각각 연결된다. 상기 생활활동 인식 장치는 입력레이어를 통해 입력되는 생활활동 입력데이터의 결과(즉, 생활활동 레이블)를 알고 있으므로, 백프로퍼게이션(back propagation)을 통해 링크의 가중치를 조정해가면서 출력레이어 의 오차를 줄일 수 있도록 한다. 상기 학습이 종료되면 해당 학습네트워크가 생활활동을 인식하기 위한 학습모 델이 된다. 상기 생활활동 인식 장치는 학습이 종료된 후, 실제 복수의 센서로부터 센서데이터가 수신되면, 댁내의 생 활공간별로 센서데이터를 분류하여 실제 사용자의 생활활동을 감지하여 생활활동 입력데이터를 생성하고, 상기 생활활동 입력데이터에 해당하는 생활공간에 대해서 생성한 학습모델에 입력함으로써 사용자의 생활활동을 인식 한다. 상기 생활활동 입력데이터가 학습모델에 입력될 때, 학습할 때와 동일하게 학습모델의 입력노드에 해당하는 센 서데이터가 각각 입력된다. 또한 생활활동 인식 장치는 인식한 결과를 사용자에게 제공하여 사용자로부터 인식한 결과에 대한 피드백 을 수신하여, 이를 반영하여 학습모델을 업데이트할 수도 있다. 즉, 학습모델은 이벤트가 발생(즉, 사용자의 실제 생활활동을 감지)된 센서데이터의 조합으로 생성한 생활활동 입력데이터를 입력으로 하며, 상기 입력에 대한 적어도 하나 이상의 생활활동 레이블에 따른 확률을 각각 출력 하도록 구성된다. 도 5는 본 발명의 일 실시예에 따른 학습모델을 이용하여 생활활동을 인식하는 과정을 설명하기 위해 나타낸 도 면이다. 도 5에 도시한 바와 같이, 본 발명의 일 실시예에 따른 생활활동 인식 장치는 학습모델을 생성한 후, 사용 자의 생활활동을 인식한다. 이를 위해서, 우선 생활활동 인식 장치는 댁내에 구비되는 복수의 센서로부터 센서데이터를 각각 수신한다. 각 상기 센서는 센서데이터 이외에 위치정보를 더 전송함은 상술한 바와 같다.또한 생활활동 인식 장치는 수신한 복수의 센서데이터를 댁내의 생활공간별로 분류한다. 상기 생활활동 인식 장치는 댁내의 생활공간에 대한 맵을 가지고 있으면서, 각 센서의 위치정보를 기반으 로 댁내의 생활공간별로 각 센서데이터를 분류한다. 즉 생활공간별로 분류한 결과는 센서데이터의 조합으로 구 성된다. 이후, 생활활동 인식 장치는 생활공간별로 분류한 센서데이터의 조합에서 적어도 하나 이상의 센서데이터 가 변화는 이벤트를 모니터링함으로써 실제 사용자의 생활활동을 감지하여 해당 센서데이터의 조합을 생활활동 입력데이터로 생성한다. 또한 생활활동 인식 장치는 생활활동 입력데이터는 해당하는 생활공간에 대해서 생성한 학습모델에 적용하 여 사용자의 생활활동을 인식한다. 상기 생활활동 입력데이터를 학습모델에 적용하는 것은 도 3을 참조하여 설명하였으므로 여기서는 생략하도록 한다. 또한 생활활동 인식 장치는 사용자의 생활활동을 인식한 결과에 따른 서비스를 제공하도록 구성될 수 있다. 도 6은 본 발명의 일 실시예에 따른 대화형 AI 학습방식을 통한 생활활동 인식 장치의 구성을 나타낸 블록도이 다. 도 6에 도시한 바와 같이, 본 발명의 일 실시예에 따른 생활활동 인식 장치는 센서데이터 수신부, 센 서데이터 분류부, 입력데이터 생성부, 학습데이터 구성부, 학습모델 생성부 및 생활활동 인식부를 포함하여 구성된다. 상기 센서데이터 수신부는 사용자가 생활하는 댁내에 구비되는 복수의 센서로부터 각 센서의 위치정보와 센서데이터를 수신한다. 상기 센서데이터 분류부는 위치정보를 이용하여, 센서데이터를 댁내의 생활공간별로 분류한다. 상기 입력데이터 생성부는 생활공간별로 분류한 센서데이터의 조합에서, 적어도 하나 이상의 센서데이터가 변하는 이벤트를 모니터링하여 실제 사용자의 생활활동을 감지하여 생활활동 입력데이터를 생성한다. 상기 생활활동 입력데이터는 상기 이벤트가 발생한 센서데이터의 조합으로 생성된다. 상기 센서데이터 수신부, 센서데이터 분류부 및 입력데이터 생성부는 생활활동 인식 장치 가 사용자의 댁내에 구비되어 학습모델을 생성하거나, 생성한 학습모델을 통해 사용자의 생활활동을 인식하는 경우에도 동일한 기능을 수행한다. 상기 학습데이터 구성부는 실제 사용자의 생활활동을 인식하기 전에 학습모델을 생성하기 위한 학습데이터 를 구성하기 위한 것으로, 레이블 요청부 및 레이블링부를 포함하여 구성된다. 상기 레이블 요청부는 입력데이터 생성부를 통해 모니터링한 결과, 생활공간별로 분류한 센서데이터 의 조합에서 적어도 하나 이상의 센서데이터가 변하는 이벤트가 발생되어 해당 센서데이터의 조합으로 생활활동 입력데이터를 생성한 경우에 해당 이벤트가 발생한 생활공간(즉, 입력데이터에 해당하는 생활공간)에 대한 적어 도 하나 이상의 생활활동 레이블을 사용자에게 제공하여 선택하도록 요청하는 기능을 수행한다. 이때, 레이블 요청부는 생활활동 레이블을 선택하기 위한 사용자 인터페이스를 제공하여 생활활동 레이블 을 선택할 수 있도록 한다. 한편, 레이블 요청부는 제공한 생활활동 레이블 이외에, 새로운 생활활동 레이블을 사용자가 입력할 수 있 도록 하는 기능을 지원할 수 있다. 상기 레이블링부는 사용자가 생활활동 레이블을 선택(혹은 입력)한 경우, 해당 생활활동 입력데이터에 상 기 선택한 생활활동 레이블을 레이블링함으로써 학습데이터를 구성한다. 상기 학습데이터를 구성하는 것은 도 2를 참조하여 상세히 설명하였으므로 여기서는 생략하도록 한다. 상기 학습모델 생성부는 학습데이터를 생활공간별로 각각 학습하여 사용자의 생활활동을 인식하기 위한 학 습모델을 생활공간별로 생성한다.상기 학습모델을 생성하는 것은 도 2 및 도 3을 참조하여 설명하였으므로 더 이상의 상세한 설명은 생략하도록 한다. 상기 생활활동 인식부는 학습모델을 생성한 이후에 수행되는 것으로, 학습모델을 생성한 이후, 입력데이터 생성부에서 생성한 생활활동 입력데이터를 해당하는 학습모델에 입력하여 상기 생활공간에서 사용자의 생 활활동을 인식한다. 한편, 도 2 내지 도 5에는 사용자의 생활활동을 인식하는 것은 학습모델에 대한 학습이 최종적으로 종료된 후에 수행되는 것으로 기재되어 있다. 그러나 본 발명에서는 이에 한정하지 않으며 사용자의 생활활동을 인식하는 것 을 학습과 동시 수행될 수 있다. 학습과 생활활동 인식을 동시에 수행하는 경우, 생활활동 인식 장치는 생활활동 입력데이터를 생성하면 사 용자에게 생활활동 레이블의 선택 요청을 수행하고, 생활활동 레이블을 선택하면 해당 생활활동 입력데이터에 생활활동 레이블을 레이블링하여 학습데이터로 구성함으로서 학습을 수행하도록 구성된다. 반대로 생활활동 레 이블을 선택하지 않으면 생활활동 입력데이터를 학습모델에 입력하여 사용자의 생활활동을 인식하게 된다. 이때, 학습모델에 대한 학습결과는 하직 고도화되어 있지 않기 때문에 인식한 결과를 사용자에게 제공하여 생활 활동 레이블에 대한 피드백을 받아 해당 생활활동 입력데이터에 생활활동 레이블을 레이블링하여 학습에 반영할 수 있도록 한다. 도 7은 본 발명의 일 실시예에 따른 사용자의 생활활동을 인식하는 절차를 나타낸 호름도이다. 도 7에 도시한 바와 같이, 본 발명의 일 실시예에 따른 사용자의 생활활동을 인식하는 절차는 우선, 생활활동 인식 장치는 복수의 센서데이터를 수신하는 센서데이터 수신 단계(S210) 및 수신한 센서데이터를 댁내의 생활공간별로 분류하는 센서데이터 분류 단계를 수행한다(S220). 다음으로 생활활동 인식 장치는 학습모델의 입력을 위한 생활활동 입력데이터를 생성하는 입력데이터 생성 단계를 수행한다. 상기 입력데이터 구성 단계는 우선, 생활공간별로 분류한 센서데이터의 조합에 대한 이벤트를 모니터링하여 사 용자의 실제 생활활동을 감지하는 단계(S230) 및 이벤트가 발생된 경우(S240), 해당 이벤트가 발생된 센서데이 터의 조합으로 생활활동 입력데이터를 생성하는 단계(S250)를 포함하여 구성된다. 한편 상기 센서데이터는 수신하는 것과, 상기 센서데이터를 생활공간별로 분류하는 것 및 생활활동 입력데이터 를 생성하는 것은 도 3에서 설명한 센서데이터를 수신하는 것, 센서데이터를 생활공간별로 분류하는 것 및 생활 활동 입력데이터를 생성하는 것과 동일하므로 상세한 설명은 생략한다. 다음으로 생활활동 인식 장치는 생활활동 입력데이터에 해당하는 학습모델에 입력하여 사용자의 생활활동 을 인식하는 생활활동 인식 단계를 수행한다(S260). 도 7에는 사용자의 생활활동을 인식하는 것을 각 단계에 따라 순차적으로 도시하였으나, 실시간으로 수행됨은 자명하다. 또한 생활활동 인식 장치는 인식한 생활활동에 따라 미리 준비된 다양한 서비스를 사용자에게 제공하는 단 계를 더 포함할 수 있다. 이처럼, 본 발명은 댁내의 생활환경과 생활공간의 구성, 사용자의 습관이나 습성을 반영한 학습데이터를 구성 하여 생활활동 인식을 위한 학습모델을 생성함으로써 실제 센서데이터에 따라 사용자의 생활활동을 정확하게 인 식할 수 있는 효과가 있다. 또한 상기에서는 본 발명에 따른 바람직한 실시예를 위주로 상술하였으나 본 발명의 기술적 사상은 이에 한정되 는 것은 아니며 본 발명의 각 구성요소는 동일한 목적 및 효과의 달성을 위하여 본 발명의 범위 내에서 변경 또 는 수정될 수 있을 것이다. 아울러 이상에서는 본 발명의 바람직한 실시예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시"}
{"patent_id": "10-2022-0157172", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "예에 한정되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야 에서 통상의 지식을 가진 자에 의해 다양한 변형 실시가 가능한 것은 물론이고, 이러한 변형 실시들은 본 발명 의 기술적 사상이나 전망으로부터 개별적으로 이해되어서는 안 될 것이다.부호의 설명 100: 대화형 AI 학습방식을 통한 생활활동 인식 장치 110: 센서데이터 수신부 120: 센서데이터 분류부 130: 생활활동 입력데이터 생성부 140: 학습데이터 구성부 141: 레이블 요청부 142: 레이블링부 150: 학습모델 생성부 160: 생활활동 인식부"}
{"patent_id": "10-2022-0157172", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 대화형 AI 학습방식을 통한 생활활동 인식 장치를 설명하기 위해 나타낸 도 면이다. 도 2는 본 발명의 일 실시예에 따른 학습데이터를 구성하는 방법을 설명하기 위해 나타낸 도면이다. 도 3은 본 발명의 일 실시예에 따른 학습데이터를 구성하는 절차를 나타낸 흐름도이다. 도 4는 본 발명의 일 실시예에 따른 학습모델을 생성하기 위한 학습네트워크와 학습모델을 생성하는 과정을 설 명하기 위해 나타낸 도면이다. 도 5는 본 발명의 일 실시예에 따른 학습모델을 이용하여 생활활동을 인식하는 과정을 설명하기 위해 나타낸 도 면이다. 도 6은 본 발명의 일 실시예에 따른 대화형 AI 학습방식을 통한 생활활동 인식 장치의 구성을 나타낸 블록도이 다. 도 7은 본 발명의 일 실시예에 따른 사용자의 생활활동을 인식하는 절차를 나타낸 흐름도이다."}
