{"patent_id": "10-2022-0046905", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0094936", "출원번호": "10-2022-0046905", "발명의 명칭": "근무행동 데이터를 활용한 행동주의 대안신용평가 모델 및 그 제공 방법", "출원인": "(주)위솝", "발명자": "김규한"}}
{"patent_id": "10-2022-0046905", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨터 시스템에 의해 수행되는 근무행동 데이터를 활용한 행동주의 대안신용평가 모델의 제공 방법에 있어서, 사용자의 급여 정보를 포함한 근무행동 데이터를 수집하는 단계; 수집된 상기 근무행동 데이터를 이용하여 군집화를 수행하고, 군집화된 집단 별 대안신용평가 항목의 속성을 도출하는 단계; 상기 대안신용평가 항목의 속성을 기반으로 평가를 위한 각 지표의 상관관계를 분석함에 따라 각 지표 별 대안신용평가 모델을 제공하는 단계; 및 각 지표의 상기 대안신용평가 모델을 이용하여 대안신용평가 스코링을 제공하는 단계를 포함하는, 대안신용평가 모델의 제공 방법."}
{"patent_id": "10-2022-0046905", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 근무행동 데이터를 수집하는 단계는, 근태정보 및 급여명세서 발급정보를 포함한 근무현황 데이터를 수집하는 단계; 및 업무수행정보 또는 체크리스트정보를 포함한 근무행동 데이터를 수집하는 단계를 포함하는, 대안신용평가 모델의 제공 방법."}
{"patent_id": "10-2022-0046905", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 대안신용평가 항목의 속성을 도출하는 단계는, 군집화된 데이터로 부족한 표본 데이터를 보완하고 상관관계를 분석한 후, 상기 표본 데이터의 값을 기준으로상기 대안신용평가 항목의 속성을 분석하는 것을 특징으로 하는, 대안신용평가 모델의 제공 방법."}
{"patent_id": "10-2022-0046905", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 대안신용평가 항목의 속성을 도출하는 단계는, 급여정보, 추정소득, 지각률, 지각빈도, 조기 출근율, 체크리스트 누락수 중 적어도 어느 하나 이상의 상기 대안신용평가 항목의 속성을 도출하는 것을 특징으로 하는, 대안신용평가 모델의 제공 방법."}
{"patent_id": "10-2022-0046905", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 대안신용평가 모델을 제공하는 단계는, 상기 대안신용평가 항목의 속성을 기반으로 성실성, 책임감, 전문성, 자기관리, 시간관리, 적극성 중 적어도 어느 하나 이상의 정성적 대안 평가를 위한 각 지표 별 대안신용평가 모델을 제공하는 것을 특징으로 하는, 대안신용평가 모델의 제공 방법.공개특허 10-2023-0094936-2-청구항 6 제1항에 있어서,상기 대안신용평가 모델을 제공하는 단계는, 인공지능(AI) 기반으로 학습 및 검증을 통해 데이터를 분석 및 도출하는 상기 대안신용평가 모델을 제공하는 것을 특징으로 하는, 대안신용평가 모델의 제공 방법."}
{"patent_id": "10-2022-0046905", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 대안신용평가 스코링을 제공하는 단계는, 근태정보, 급여명세서 발급정보 기반 추정소득을 파악하는 단계; 및 행동패턴 기반 정성적 대안평가를 진행하는 단계를 포함하고, 기설정된 기준에 따라 상기 대안신용평가 스코링을 통해 최종 스코어를 산정하는 것을 특징으로 하는, 대안신용평가 모델의 제공 방법."}
{"patent_id": "10-2022-0046905", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 대안신용평가 스코링을 제공하는 단계는, 상기 사용자의 마이데이터 정보를 활용하여 카드소비패턴, 공과금 납부 및 기타 성정적 성향 파악 중 적어도 어느 하나 이상을 통해 미래 추정 소득 및 추정 소비를 파악하는 단계를 더 포함하고, 기설정된 기준에 따라 상기 대안신용평가 스코링을 통해 최종 스코어를 산정하는 것을 특징으로 하는, 대안신용평가 모델의 제공 방법."}
{"patent_id": "10-2022-0046905", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 대안신용평가 스코링을 통한 최종 스코어에 따라 초단기 소액 개인 대출(Micro Personal Loan, MPL) 서비스를 제공하는 단계를 더 포함하는, 대안신용평가 모델의 제공 방법."}
{"patent_id": "10-2022-0046905", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 초단기 소액 개인 대출(Micro Personal Loan, MPL) 서비스를 제공하는 단계는, 상기 최종 스코어에 따른 기설정된 기준에 따라 최대 1개월 만기 상품으로 상기 초단기 소액 개인 대출(MPL) 서비스를 제공하고, 상기 초단기 소액 개인 대출(MPL) 서비스의 선 결제 후 대출 정상상환이 확인되면 결제 취소를 진행하는 방식으로 대출 서비스를 제공하는 것을 특징으로 하는, 대안신용평가 모델의 제공 방법."}
{"patent_id": "10-2022-0046905", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "근무행동 데이터를 활용한 행동주의 대안신용평가 모델에 있어서, 사용자의 급여 정보를 포함한 근무행동 데이터를 수집하는 근무행동 데이터 수집부; 공개특허 10-2023-0094936-3-수집된 상기 근무행동 데이터를 이용하여 군집화를 수행하고, 군집화된 집단 별 대안신용평가 항목의 속성을 도출하는 군집화부; 상기 대안신용평가 항목의 속성을 기반으로 평가를 위한 각 지표의 상관관계를 분석함에 따라 각 지표 별 대안신용평가 모델을 제공하는 예측 모델부; 및 각 지표의 상기 대안신용평가 모델을 이용하여 대안신용평가 스코링을 제공하는 스코링 제공부를 포함하는, 대안신용평가 모델."}
{"patent_id": "10-2022-0046905", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 스코링 제공부는, 근태정보, 급여명세서 발급정보 기반 추정소득을 파악하고, 행동패턴 기반 정성적 대안평가를 진행하며, 기설정된 기준에 따라 상기 대안신용평가 스코링을 통해 최종 스코어를 산정하는 것을 특징으로 하는, 대안신용평가 모델."}
{"patent_id": "10-2022-0046905", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 스코링 제공부는, 상기 사용자의 마이데이터 정보를 활용하여 카드소비패턴, 공과금 납부 및 기타 성정적 성향 파악 중 적어도 어느 하나 이상을 통해 미래 추정 소득 및 추정 소비를 파악하며, 기설정된 기준에 따라 상기 대안신용평가 스코링을 통해 최종 스코어를 산정하는 것을 특징으로 하는, 대안신용평가 모델."}
{"patent_id": "10-2022-0046905", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서, 상기 대안신용평가 스코링을 통한 최종 스코어에 따라 초단기 소액 개인 대출(Micro Personal Loan, MPL) 서비스를 제공하는 서비스 제공부를 더 포함하는, 대안신용평가 모델."}
{"patent_id": "10-2022-0046905", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서, 상기 서비스 제공부는, 상기 최종 스코어에 따른 기설정된 기준에 따라 최대 1개월 만기 상품으로 상기 초단기 소액 개인 대출(MPL) 서비스를 제공하고, 상기 초단기 소액 개인 대출(MPL) 서비스의 선 결제 후 대출 정상상환이 확인되면 결제 취소를 진행하는 방식으로 대출 서비스를 제공하는 것을 특징으로 하는, 대안신용평가 모델."}
{"patent_id": "10-2022-0046905", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "근무행동 데이터를 활용한 행동주의 대안신용평가 모델 및 그 제공 방법이 제시된다. 일 실시예에 따른 컴퓨터 시스템에 의해 수행되는 근무행동 데이터를 활용한 행동주의 대안신용평가 모델의 제공 방법은, 사용자의 급여 정보를 포함한 근무행동 데이터를 수집하는 단계; 수집된 상기 근무행동 데이터를 이용하여 군집화를 수행하고, 군집화된 집단 별 대안신용평가 항목의 속성을 도출하는 단계; 상기 대안신용평가 항목의 속성을 기반으로 평가 를 위한 각 지표의 상관관계를 분석함에 따라 각 지표 별 대안신용평가 모델을 제공하는 단계; 및 각 지표의 상 기 대안신용평가 모델을 이용하여 대안신용평가 스코링을 제공하는 단계를 포함하여 이루어질 수 있다."}
{"patent_id": "10-2022-0046905", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "아래의 실시예들은 근무행동 데이터를 활용한 행동주의 대안신용평가(Alternative Credit Scoring System, ACSS) 모델 및 그 제공 방법에 관한 것으로, 더욱 상세하게는 직원관리 시스템을 통해 수집된 급여정보 및 기타 대안평가 항목 기반으로 구축된 대안신용평가 모델 및 그 제공 방법에 관한 것이다."}
{"patent_id": "10-2022-0046905", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "신파일러(Thin Filer)는‘서류가 얇은 사람’이라는 뜻으로 대출, 신용카드 사용 내역 등 금융 거래가 거의 없 는‘금융 이력 부족자’를 의미한다. 주로 사회 초년생과 대학생, 주부, 노인 등 금융 소외자들이 해당된다. 신파일러의 주요 발생 원인은 소득증빙 방법이 없으며, 아르바이트의 경우 4대보험료를 줄이기 위해 프리랜서 혹은 현금으로 임금을 지급하기 떄문에 건강보험료를 기준으로 한 추정소득의 파악이 불가능하다. 또한, 월간 소비의 예측이 어려우며, 청년의 경우 신용카드 미발급 등으로 생활소비 금액의 파악이 어렵다. 이에 따라 신파일러의 상환능력을 판단할 자료가 부족하여 강제적으로 신용등급이 하락하며, 돈을 갚을 능력과 의지가 있음에도 금융이력 부족으로 고금리, 대부업을 이용하고 있다. 국내 신용양극화의 시장실패 상황에서 금융정보 기반의 신용도 평가를 대체할 대안신용평가에 대한 중요성이 대 두되고 있다. 대안신용평가를 통해 신파일러의 문제점을 해결하고자 국내외에서 다양한 대안신용평가가 개발 중에 있다. 하지만 대안평가항목이 대출과의 인과관계를 명확히 입증하지 못하는 문제점이 존재하며, 이에 따 라 기존 신용평가의 핵심요소인 소득, 소비를 추정할 수 있는 항목이 필수적이며, 검증빈도를 높여 대안신용평 가의 주기적인 수정보완을 진행해야 한다. 한국등록특허 10-2368010호는 이러한 운동 생활정보에 기초한 인공지능 기반의 대안적 신용평가정보 제공 방법 및 시스템에 관한 기술을 기재하고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 10-2368010호"}
{"patent_id": "10-2022-0046905", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "실시예들은 근무행동 데이터를 활용한 행동주의 대안신용평가 모델 및 그 제공 방법에 관하여 기술하며, 보다 구체적으로 근무행동 데이터(출퇴근, 누적급여, 급여명세서 발급이력, 업무수행정보, 체크리스트정보 등)를 기 반으로 구축된 대안신용평가 모델에 관한 기술을 제공한다. 실시예들은 근무행동 데이터를 대안신용평가 모델에 입력하여 대안신용평가 스코링을 제공하며, 최종 스코어를 기반으로 초단기 소액 개인 대출을 가능하게 하는 근무행동 데이터를 활용한 행동주의 대안신용평가 모델 및 그 제공 방법을 제공하는데 있다."}
{"patent_id": "10-2022-0046905", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따른 컴퓨터 시스템에 의해 수행되는 근무행동 데이터를 활용한 행동주의 대안신용평가 모델의 제 공 방법은, 사용자의 급여 정보를 포함한 근무행동 데이터를 수집하는 단계; 수집된 상기 근무행동 데이터를 이 용하여 군집화를 수행하고, 군집화된 집단 별 대안신용평가 항목의 속성을 도출하는 단계; 상기 대안신용평가 항목의 속성을 기반으로 평가를 위한 각 지표의 상관관계를 분석함에 따라 각 지표 별 대안신용평가 모델을 제 공하는 단계; 및 각 지표의 상기 대안신용평가 모델을 이용하여 대안신용평가 스코링을 제공하는 단계를 포함하 여 이루어질 수 있다. 상기 근무행동 데이터를 수집하는 단계는, 근태정보 및 급여명세서 발급정보를 포함한 근무현황 데이터를 수집 하는 단계; 및 업무수행정보 또는 체크리스트정보를 포함한 근무행동 데이터를 수집하는 단계를 포함할 수 있다. 상기 대안신용평가 항목의 속성을 도출하는 단계는, 군집화된 데이터로 부족한 표본 데이터를 보완하고 상관관 계를 분석한 후, 상기 표본 데이터의 값을 기준으로 상기 대안신용평가 항목의 속성을 분석할 수 있다. 상기 대안신용평가 항목의 속성을 도출하는 단계는, 급여정보, 추정소득, 지각률, 지각빈도, 조기 출근율, 체크 리스트 누락수 중 적어도 어느 하나 이상의 상기 대안신용평가 항목의 속성을 도출할 수 있다. 상기 대안신용평가 모델을 제공하는 단계는, 상기 대안신용평가 항목의 속성을 기반으로 성실성, 책임감, 전문 성, 자기관리, 시간관리, 적극성 중 적어도 어느 하나 이상의 정성적 대안 평가를 위한 각 지표 별 대안신용평가 모델을 제공할 수 있다. 상기 대안신용평가 모델을 제공하는 단계는, 인공지능(AI) 기반으로 학습 및 검증을 통해 데이터를 분석 및 도 출하는 상기 대안신용평가 모델을 제공할 수 있다. 상기 대안신용평가 스코링을 제공하는 단계는, 근태정보, 급여명세서 발급정보 기반 추정소득을 파악하는 단계; 및 행동패턴 기반 정성적 대안평가를 진행하는 단계를 포함하고, 기설정된 기준에 따라 상기 대안신용평가 스코 링을 통해 최종 스코어를 산정할 수 있다. 상기 대안신용평가 스코링을 제공하는 단계는, 상기 사용자의 마이데이터 정보를 활용하여 카드소비패턴, 공과 금 납부 및 기타 성정적 성향 파악 중 적어도 어느 하나 이상을 통해 미래 추정 소득 및 추정 소비를 파악하는 단계를 더 포함하고, 기설정된 기준에 따라 상기 대안신용평가 스코링을 통해 최종 스코어를 산정할 수 있다. 상기 대안신용평가 스코링을 통한 최종 스코어에 따라 초단기 소액 개인 대출(Micro Personal Loan, MPL) 서비 스를 제공하는 단계를 더 포함할 수 있다. 상기 초단기 소액 개인 대출(Micro Personal Loan, MPL) 서비스를 제공하는 단계는, 상기 최종 스코어에 따른 기설정된 기준에 따라 최대 1개월 만기 상품으로 상기 초단기 소액 개인 대출(MPL) 서비스를 제공하고, 상기 초 단기 소액 개인 대출(MPL) 서비스의 선 결제 후 대출 정상상환이 확인되면 결제 취소를 진행하는 방식으로 대출 서비스를 제공할 수 있다. 다른 실시예에 따른 근무행동 데이터를 활용한 행동주의 대안신용평가 모델은, 사용자의 급여 정보를 포함한 근 무행동 데이터를 수집하는 근무행동 데이터 수집부; 수집된 상기 근무행동 데이터를 이용하여 군집화를 수행하 고, 군집화된 집단 별 대안신용평가 항목의 속성을 도출하는 군집화부; 상기 대안신용평가 항목의 속성을 기반 으로 평가를 위한 각 지표의 상관관계를 분석함에 따라 각 지표 별 대안신용평가 모델을 제공하는 예측 모델부; 및 각 지표의 상기 대안신용평가 모델을 이용하여 대안신용평가 스코링을 제공하는 스코링 제공부를 포함하여 이루어질 수 있다. 상기 스코링 제공부는, 근태정보, 급여명세서 발급정보 기반 추정소득을 파악하고, 행동패턴 기반 정성적 대안 평가를 진행하며, 기설정된 기준에 따라 상기 대안신용평가 스코링을 통해 최종 스코어를 산정할 수 있다. 상기 스코링 제공부는, 상기 사용자의 마이데이터 정보를 활용하여 카드소비패턴, 공과금 납부 및 기타 성정적 성향 파악 중 적어도 어느 하나 이상을 통해 미래 추정 소득 및 추정 소비를 파악하며, 기설정된 기준에 따라 상기 대안신용평가 스코링을 통해 최종 스코어를 산정할 수 있다. 상기 대안신용평가 스코링을 통한 최종 스코어에 따라 초단기 소액 개인 대출(Micro Personal Loan, MPL) 서비 스를 제공하는 서비스 제공부를 더 포함할 수 있다. 상기 서비스 제공부는, 상기 최종 스코어에 따른 기설정된 기준에 따라 최대 1개월 만기 상품으로 상기 초단기 소액 개인 대출(MPL) 서비스를 제공하고, 상기 초단기 소액 개인 대출(MPL) 서비스의 선 결제 후 대출 정상상환 이 확인되면 결제 취소를 진행하는 방식으로 대출 서비스를 제공할 수 있다."}
{"patent_id": "10-2022-0046905", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "실시예들에 따르면 근무행동 데이터를 대안신용평가 모델에 입력하여 대안신용평가 스코링을 제공하며, 최종 스 코어를 기반으로 초단기 소액 개인 대출을 가능하게 하는 근무행동 데이터를 활용한 행동주의 대안신용평가 모 델 및 그 제공 방법을 제공할 수 있다."}
{"patent_id": "10-2022-0046905", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 실시예들을 설명한다. 그러나, 기술되는 실시예들은 여러 가지 다른 형태로 변 형될 수 있으며, 본 발명의 범위가 이하 설명되는 실시예들에 의하여 한정되는 것은 아니다. 또한, 여러 실시"}
{"patent_id": "10-2022-0046905", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "예들은 당해 기술분야에서 평균적인 지식을 가진 자에게 본 발명을 더욱 완전하게 설명하기 위해서 제공되는 것 이다. 도면에서 요소들의 형상 및 크기 등은 보다 명확한 설명을 위해 과장될 수 있다. 신파일러, 특히 청년 신파일러의 경우 소득 및 소비 정보가 부족하여 대부업이나 고금리를 이용하고 있다. 본 실시예들은 금융거래 기록이 부족한 신파일러에 대해 다양한 일상 활동을 주요지표로 책정한 신용등급을 부여하 여, 기존에 은행권 대출불가, 고금리 등의 문제점을 해결하고자 한다. 다양한 대안신용평가(Alternative Credit Scoring System, ACSS)가 생겨나고 있지만 대출과의 인과관계가 명확 하지 않아 신뢰성이 낮은 실정이다. 여기서, 대안신용평가는 기존에 금융정보(상환, 연체이력 등)을 통해서 신 용점수를 평가하는 방식과는 다르게, 대안신용평가란 비금융정보(통신, 전기, 가스 요금 납부 이력, 온라인 구 매 정보, 포인트 적립 정보, 소셜네트워크 서비스(SNS) 정보, 이메일, 모바일 데이터 등)를 활용하여 신용점수 를 평가하는 방식이다. 대안신용평가의 신뢰성을 높이기 위해서는 기존 신용평가의 핵심요소인 소득, 소비와 인과관계가 높은 항목들로 구성되어야 하며, 만기기간을 짧게 잡아 검증주기(검증빈도)를 높여야 한다. 한편, 대안신용평가는 KCB, NICE 등의 신용평가사(CB)의 금융정보 이외의 대안정보를 활용하여 신용등급 책정 및 상환 능력 예측이 가능하여야 한다. 대안정보의 핵심은 기존 CB사의 주요지표인 소득수준, 소비수준, 소득지속가능 여부(재직증명 등) 등과의 유가적 연관성이 있어야 한다. 실시예들은 직원관리 시스템을 통해 수집된 급여정보 및 기타 대안평가 항목을 기반으로 인공 지능(Artificial Intelligence, AI) 기반 대안신용평가 모델을 제공한다. 보다 구체적으로, 시스템을 통해 수집된 근무행동 데 이터를 활용하여 소득, 재직정보 등의 금융정보와 유사성(실효성) 높은 정보를 추정할 수 있고, 행동패턴, 성향 데이터를 결합한 AI 분석으로 정성적 대안신용평가 스코링(Scoring)이 가능하며, 마이데이터의 비금융정보(카드 소비패턴 등)를 활용한 대안신용평가 신뢰도 정교화 AI 시스템을 적용할 수 있다. 이에 따라 금융사각지대에 놓여있는 청년층 등 신파일러의 안정적인 대출환경을 조성할 수 있다. 도 1은 일 실시예에 있어서 컴퓨터 시스템의 내부 구성의 일례를 설명하기 위한 블록도이다. 예를 들어, 본 발 명의 실시예들에 따른 행동주의 대안신용평가 모델이 도 1의 컴퓨터 시스템을 통해 구현될 수 있다. 도 1 에 도시한 바와 같이, 컴퓨터 시스템은 행동주의 대안신용평가 모델을 실행하기 위한 구성요소로서 프로세 서, 메모리, 영구 저장 장치, 버스, 입출력 인터페이스 및 네트워크 인터페이스(16 0)를 포함할 수 있다. 프로세서는 명령어들의 임의의 시퀀스를 처리할 수 있는 임의의 장치를 포함하거나 그의 일부일 수 있다. 프로세서는 예를 들어 컴퓨터 프로세서, 이동 장치 또는 다른 전자 장치 내의 프로세서 및/또는 디지털 프 로세서를 포함할 수 있다. 프로세서는 예를 들어, 서버 컴퓨팅 디바이스, 서버 컴퓨터, 일련의 서버 컴퓨 터들, 서버 팜, 클라우드 컴퓨터, 콘텐츠 플랫폼, 이동 컴퓨팅 장치, 스마트폰, 태블릿, 셋톱 박스, 미디어 플 레이어 등에 포함될 수 있다. 프로세서는 버스를 통해 메모리에 접속될 수 있다. 메모리는 컴퓨터 시스템에 의해 사용되거나 그에 의해 출력되는 정보를 저장하기 위한 휘발성 메모리, 영구, 가상 또는 기타 메모리를 포함할 수 있다. 메모리는 예를 들어 랜덤 액세스 메모리(Random Access Memory, RAM) 및/또는 동적 RAM(Dynamic RAM, DRAM)을 포함할 수 있다. 메모리는 컴퓨터 시스템 의 상태 정보와 같은 임의의 정보를 저장하는 데 사용될 수 있다. 메모리는 예를 들어 행동주의 대 안신용평가 모델을 위한 명령어들을 포함하는 컴퓨터 시스템의 명령어들을 저장하는 데에도 사용될 수 있 다. 컴퓨터 시스템은 필요에 따라 또는 적절한 경우에 하나 이상의 프로세서를 포함할 수 있다.버스는 컴퓨터 시스템의 다양한 컴포넌트들 사이의 상호작용을 가능하게 하는 통신 기반 구조를 포함 할 수 있다. 버스는 예를 들어 컴퓨터 시스템의 컴포넌트들 사이에, 예를 들어 프로세서와 메 모리 사이에 데이터를 운반할 수 있다. 버스는 컴퓨터 시스템의 컴포넌트들 간의 무선 및/또는 유선 통신 매체를 포함할 수 있으며, 병렬, 직렬 또는 다른 토폴로지 배열들을 포함할 수 있다. 영구 저장 장치는 (예를 들어, 메모리에 비해) 소정의 연장된 기간 동안 데이터를 저장하기 위해 컴 퓨터 시스템에 의해 사용되는 바와 같은 메모리 또는 다른 영구 저장 장치와 같은 컴포넌트들을 포함할 수 있다. 영구 저장 장치는 컴퓨터 시스템 내의 프로세서에 의해 사용되는 바와 같은 비휘발성 메 인 메모리를 포함할 수 있다. 영구 저장 장치는 예를 들어 플래시 메모리, 하드 디스크, 광 디스크 또는 다른 컴퓨터 판독 가능 매체를 포함할 수 있다. 입출력 인터페이스는 키보드, 마우스, 음성 명령 입력, 디스플레이 또는 다른 입력 또는 출력 장치에 대한 인터페이스들을 포함할 수 있다. 구성 명령들 및/또는 행동주의 대안신용평가 모델을 위한 데이터가 입출력 인 터페이스를 통해 수신될 수 있다. 네트워크 인터페이스는 근거리 네트워크 또는 인터넷과 같은 네트워크들에 대한 하나 이상의 인터페이스를 포함할 수 있다. 네트워크 인터페이스는 유선 또는 무선 접속들에 대한 인터페이스들을 포함할 수 있다. 구성 명령들 및/또는 행동주의 대안신용평가 모델을 위한 데이터는 네트워크 인터페이스를 통해 수신될 수 있다. 또한, 다른 실시예들에서 컴퓨터 시스템은 도 1의 구성요소들보다 더 많은 구성요소들을 포함할 수도 있다. 도 2는 일 실시예에 따른 컴퓨터 시스템의 프로세서가 포함할 수 있는 구성요소를 나타내는 블록도이고, 도 3은 일 실시예에 따른 컴퓨터 시스템이 수행할 수 있는 행동주의 대안신용평가 모델의 제공 방법을 나타내는 흐름도 이다. 도 2에 도시된 바와 같이, 프로세서는 근무행동 데이터 수집부, 군집화부, 예측 모델부 및 스코링 제공부를 포함할 수 있다. 실시예에 따라 프로세서는 서비스 제공부를 더 포함할 수 있 다. 여기서 프로세서는 행동주의 대안신용평가 모델로 언급될 수 있다. 이러한 프로세서의 구성요 소들은 적어도 하나의 프로그램 코드에 의해 제공되는 제어 명령에 따라 프로세서에 의해 수행되는 서로 다른 기능들(different functions)의 표현들일 수 있다. 예를 들어, 프로세서가 사용자의 급여 정보를 포 함한 근무행동 데이터를 수집하도록 컴퓨터 시스템을 제어하기 위해 동작하는 기능적 표현으로서 근무행동 데이터 수집부가 사용될 수 있다. 프로세서 및 프로세서의 구성요소들은 도 3의 행동주의 대안 신용평가 모델의 제공 방법이 포함하는 단계들(S310 내지 S340)을 수행할 수 있다. 예를 들어, 프로세서 및 프로세서의 구성요소들은 메모리가 포함하는 운영체제의 코드와 상술한 적어도 하나의 프로그램 코드에 따른 명령(instruction)을 실행하도록 구현될 수 있다. 여기서 적어도 하나의 프로그램 코드는 상기 행 동주의 대안신용평가 모델의 제공 방법을 처리하기 위해 구현된 프로그램의 코드에 대응될 수 있다. 행동주의 대안신용평가 모델의 제공 방법은 도시된 순서대로 발생하지 않을 수 있으며, 단계들 중 일부가 생략 되거나 추가의 과정이 더 포함될 수 있다. 단계(S310)에서, 근무행동 데이터 수집부는 사용자의 급여 정보를 포함한 근무행동 데이터를 수집할 수 있 다. 보다 구체적으로, 근무행동 데이터 수집부는 근태정보 및 급여명세서 발급정보를 포함한 근무현황 데 이터를 수집할 수 있고, 업무수행정보 또는 체크리스트정보를 포함한 근무행동 데이터를 수집할 수 있다. 단계(S320)에서, 군집화부는 수집된 근무행동 데이터를 이용하여 군집화를 수행하고, 군집화된 집단 별 대 안신용평가 항목의 속성을 도출할 수 있다. 또한, 군집화부는 군집화된 데이터로 부족한 표본 데이터를 보완하고 상관관계를 분석한 후, 표본 데이터의 값을 기준으로 대안신용평가 항목의 속성을 분석할 수 있다. 예를 들어 군집화부는 급여정보, 추정소득, 지각률, 지각빈도, 조기 출근율, 체크리스트 누락수 중 적어도 어느 하나 이상의 대안신용평가 항목의 속성을 도출할 수 있다. 대안신용평가 항목은 주기적으로 추가하거나 검증하여 대출상환능력과 인과관계가 있는 항목에 대해서는 가중치를 부여할 수 있다. 이 때, 인공지능(AI) 기 반 데이터 군집화 분석(Data Clustering Analysis) 등의 데이터 분석 기법이 사용될 수 있다. 단계(S330)에서, 예측 모델부는 대안신용평가 항목의 속성을 기반으로 평가를 위한 각 지표의 상관관계를 분석함에 따라 각 지표 별 대안신용평가 모델을 제공할 수 있다. 예를 들어, 예측 모델부는 대안신용평가 항목의 속성을 기반으로 성실성, 책임감, 전문성, 자기관리, 시간관리, 적극성 중 적어도 어느 하나 이상의 정 성적 대안 평가를 위한 각 지표 별 대안신용평가 모델을 제공할 수 있다. 여기서, 예측 모델부는 인공지 능(AI) 기반으로 학습 및 검증을 통해 데이터를 분석 및 도출하는 대안신용평가 모델을 제공할 수 있으며, 예컨 대 대안신용평가 모델은 K-means 클러스터링, MLP(Multilayer Perceptron) 기반으로 구성될 수 있다. 단계(S340)에서, 스코링 제공부는 각 지표의 대안신용평가 모델을 이용하여 대안신용평가 스코링을 제공할 수 있다. 예를 들어, 스코링 제공부는 근태정보, 급여명세서 발급정보 기반 추정소득을 파악한 후, 행동 패턴 기반 정성적 대안평가를 진행할 수 있고, 기설정된 기준에 따라 대안신용평가 스코링을 통해 최종 스코어 를 산정할 수 있다. 또한, 스코링 제공부는 사용자의 마이데이터 정보를 활용하여 카드소비패턴, 공과금 납부 및 기타 성정적 성향 파악 중 적어도 어느 하나 이상을 통해 미래 추정 소득 및 추정 소비를 파악할 수 있 으며, 기설정된 기준에 따라 대안신용평가 스코링을 통해 최종 스코어를 산정할 수 있다. 이 때, 우/불량 분류 를 위한 분류(Classification) 알고리즘(Artificial Neural Network, ANN) 및/또는 신용점수 예측을 위한 회귀 (Regression) 알고리즘(Artificial Neural Network, ANN)이 사용될 수 있다. 단계(S350)에서, 서비스 제공부는 대안신용평가 스코링을 통한 최종 스코어에 따라 초단기 소액 개인 대출 (Micro Personal Loan, MPL) 서비스를 제공할 수 있다. 예컨대, 서비스 제공부는 최종 스코어에 따른 기 설정된 기준에 따라 최대 1개월 만기 상품으로 초단기 소액 개인 대출(MPL) 서비스를 제공할 수 있다. 이 때, 서비스 제공부는 초단기 소액 개인 대출(MPL) 서비스의 선 결제 후 대출 정상상환이 확인되면 결제 취소를 진행하는 방식으로 대출 서비스를 제공할 수 있다. 이와 같이, 실시예들에 따르면 대안신용평가 모델에 근무행동 데이터를 입력하여 대안신용평가 스코링을 제공하 며, 최종 스코어를 기반으로 초단기 소액 개인 대출을 가능하게 한다. 실시예들에 따르면 신파일러에게 대안신용평가 정보를 제공하여, 고금리의 문제점(신용양극화) 해결할 수 있고, 금융권, 대출소비자간에 발생하는 간접적 손실(부도율 손실, 고금리 손실 등)을 절감하며, 나아가 금융권 비시 장권 대상이었던 신파일러의 시장 편입을 통해 수익 창출 효과를 낼 수 있다. 아래에서 근무행동 데이터를 활용한 행동주의 대안신용평가 모델 및 그 제공 방법을 보다 구체적으로 설명한다. 일 실시예에 따른 행동주의 대안신용평가 모델의 근무행동 데이터 수집부는 사용자의 급여 정보를 포함한 근무행동 데이터를 수집할 수 있다. 이 때, 근무행동 데이터 수집부는 직접 사용자의 근무행동 데이터를 수집할 수 있다. 또한, 근무행동 데이터 수집부는 보다 정확하고 효율적인 데이터 수집을 위해 컴퓨터 시 스템 기반 직원관리 시스템으로부터 사용자의 근무행동 데이터를 전달 받음으로써 근무행동 데이터를 수집할 수 있다. 예를 들어, 사업장이 직원관리 시스템에 가입되어 있는 경우 사용자의 근무행동 데이터를 전달 받을 수 있다. 이 때, 사업장 및/또는 사용자의 동의 여부에 따라 사용자의 근무행동 데이터를 전달 받을 수 있다. 아래와 같이, 행동주의 대안신용평가 모델의 근무행동 데이터 수집부는 직접 사용자의 근무행동 데이터를 수집하거나 직원관리 시스템으로부터 사용자의 근무행동 데이터를 전달 받을 수 있다. 일 실시예에 따르면 근무행동 데이터 수집부는 직원관리(근태관리, 자동급여계산, 급여명세서 발급 등) 부 분과 업무관리(체크리스트, 업무일지, 체크리스트, 유통기한관리, 조기경보 시스템 등) 부분의 서비스 제공을 통해 사용자의 근무현황 데이터 및 근무행동 데이터를 지속적으로 수집할 수 있다. 예컨대, 소상공인과 프랜차 이즈가 체계적인 직원관리 시스템을 사용할 수 있도록 All-in-one HR 솔루션이 제공되며, 이러한 서비스를 이용 하여 사용자의 근무현황 데이터 및 근무행동 데이터를 지속적으로 수집할 수 있다. 이러한 All-in-one HR 솔루션 등의 직원관리 시스템은 대안신용평가 모델을 구축하기 위해 기존 신용평가의 핵 심요소인 소득, 소비와 인과관계가 높은 항목을 추정할 수 있는 데이터를 보유할 수 있다. 특히, 수집되는 급 여정보 및 급여명세서 발송을 통해 신뢰성 높은 소득정보를 수집할 수 있다. 또한, 기본항목을 활용한 파생항 목(3일 연속 지각, 10영업일 내 10분전 출근율(%) 등)으로 근무행동 기반 대안신용평가 항목을 구상할 수 있다. 일 실시예에 따르면 행동주의 대안신용평가 모델은 소득, 재직정보 추정 데이터를 획득할 수 있다. 현재 신용평가사에서도 파악하지 못하는 정보는 비정규직(프리랜서, 알바생 등)의 소득 증빙이다. 금융권 대출 시 필수적으로 제출하는 서류는 4대보험 가입여부, 재직증명서이며, 그 이유는 추정소득 확인 및 실제 소득여부를 파악하고 계속 근무가능여부를 확인하기 위한 것이다. 일 실시예에 따르면 근무기록을 기반으로 실시간 누 적된 급여정보 파악이 가능하며, 실제 급여를 지급했을 때 발급하는 급여명세서 서비스를 통해 정확한 소득정보 파악이 가능하여 신뢰성이 높다. 예를 들어, 사용자의 근무현황 데이터 및 근무행동 데이터를 수집하는 서비스를 통해 수집되는 자동급여계산, 급여(임금)명세서를 통해 4대보험 미가입자에 대해 추정소득을 판단하고, 근무 사업장 정보 및 출퇴근 기록을 통해 실시간 근무 여부, 즉 재직증명을 확인할 수 있으며, 출퇴근기록, 입사일 및 퇴사일 데이터를 기반으로 근 무기간을 파악할 수 있다. 또한, 일 실시예에 따르면 행동주의 대안신용평가 모델은 근무행동에 기반한 대안신용평가 항목을 통해 행동심 리학 기반 데이터를 획득할 수 있다. 과거 행동패턴을 기반으로 한 미래소득 및 소비에 대한 예측 항목을 설정할 수 있다. 정성적인 부분(성실성, 도전성, 자기관리, 시간관리, 적극성 등)에 대한 판단으로, 미래의 소득증감 및 소비증감, 성장가능성을 예측할 수 있다. 이 때, 항목을 주기적으로 추가하거나 검증하여 대출상환능력과 인과관계가 있는 항목에 대해서는 가 중치를 부여할 수 있다. 예를 들어, 지각율, 3일 연속 지각횟수, 조기 출근율, 출퇴근 미체크 등의 항목을 통해 출퇴근정보를 확인하여 성실성, 자기관리, 적극성 등을 판단할 수 있고, 업무일지 누락율, 업무일자 작성글 수, 댓글 반응 수 등을 통 해 적극성, 성실성에 대한 척도를 판단할 수 있으며, 체크리스트 누락율 등을 통해 루틴한 업무(체크리스트) 누 락을 한 경우 업무의 집중도(성실성)을 판단할 수 있다. 도 4는 일 실시예에 따른 대안신용평가 모델의 구축 예시를 설명하기 위한 도면이다. 직원 근무행동 데이터(출퇴근, 누적급여, 급여명세서 발급이력, 업무수행정보, 체크리스트정보 등)를 기반으로 대안신용평가 모델을 구축할 수 있다. 이 때, 직원관리 시스템을 통해 직원 근무행동 데이터를 수집할 수 있다. 예컨대, 3일 연속 지각, 10 영업일 내 10분전 출근율(%), 체크리스트 누락율 등의 정보를 수집 또는 파 악할 수 있다. 보다 구체적으로, 도 4를 참조하면, 직원관리 시스템을 통해 수집된 데이터를 기반으로 군집화하고 군집 별 속성을 도출할 수 있다. 이 때, 수집된 데이터는 근태정보, 성별, 나이, 급여, 업력, 자택지, 근 무지 등의 정보일 수 있다. 그리고 군집화된 데이터로 부족한 표본 데이터를 보완하고, 상관관계를 분석 할 수 있으며, 데이터 표본 값을 기준으로 대안신용평가 항목의 속성을 분석할 수 있다. 각 지표의 상관관계를 분석하여 각 지표 별 최적화된 대안신용평가 모델을 구축할 수 있고, 구축된 대안신용평가 모델을 통 한 대안신용평가 스코링을 제공할 수 있다. 즉, 대안신용평가 모델을 통해 각 지표의 예측 데이터를 도출할 수 있다. 여기서, 대안신용평가 모델은 인공 지능(AI) 기반으로 구축될 수 있다. 대안신용평가 모델은 테이블 형 데이터(Tabular Data)에 대한 학습 및 처리 기능을 통해 정형화되어 있는 테이블형 데이터를 기반으로 분류 및/또는 예측할 수 있다. 또한, 학습이 완료된 인공지능 기반 대안신용평가 모델의 데이터 입출력을 통해 결과값을 확인하고 검증할 수 있으며, 실제 서비스와 연동을 통해 운영 및 검증 가능하다. 도 5는 일 실시예에 따른 대안신용평가 모델 스코링 구조의 예시를 나타내는 도면이다. 도 5를 참조하면, 일 실시예에 따르면 근태기록 및 급여명세서를 기반으로 추정소득을 분류(1차 분류 진행)할 수 있다. 기존 신용평가사(CB)는 추정소득 수집 방법으로 4대보험 건강보험료 납부 이력을 기준으로 추정소득을 파악하였 다. 4대보험 미가입자의 경우 신용카드 사용내역을 바탕으로 연체가 없을 경우 추정소득을 파악하였다. 상기 추정소득 대상자의 사각지대로는 4대보험 미가입, 현금 급여소득, 프리랜서 급여계약, 신용카드 미가입자로 추 정소득을 파악할 수 없어 대안신용평가의 핵심요인을 제시할 수 없었다. 또한, 기존의 대안신용평가의 경우에 는 다양한 항목과 추정소득과의 인과관계 증명이 어려워 신뢰도가 낮다. 일 실시예에 따른 대안신용평가는 근태기록 기반 누적급여, 급여명세서 발급정보를 활용하여 신뢰도 높은 추정 소득을 제시한다. 즉, 전략적 정보를 활용하여 1차 실효성 분류를 진행하며, 수집정보 기반으로 대안신용평가의 핵심요소인 소득 및 재직 기준으로 분류를 진행하여 신뢰성이 높다. 또한, 일 실시예에 따르면 행동패턴 기반 정성적 대안평가를 진행할 수 있다. 보다 구체적으로, 내부 전략적 데이터를 기반으로 한 평가항목(지각율, 지각빈도, 조기 출근율, 체크리스트 누락수 등)을 기반으로 정성적 평 가를 진행(성싱설, 자기관리, 적극성, 책임감 등)할 수 있다. 또한, 마이데이터 정보를 활용하여 카드소비패턴, 공과금 납부 및 기타 성정적 성향 파악으로 미래 추정소득 및 추정소비를 파악할 수 있다. 도 6은 일 실시예에 따른 신파일러 대상 초단기 소액 개인 대출(MPL) 서비스의 예시를 설명하기 위한 도면이다. 도 6을 참조하면, 일 실시예에 따르면 신파일러 대상 초단기 소액 개인 대출(Micro Personal Loan, MPL) 서비스 를 제공할 수 있다. AI를 통해 구축된 대안신용평가를 활용하여 신파일러 대상의 초단기 소액 개인 대출(MPL) 서비스를 제공할 수 있다. 예를 들어 최소 2주 근무 후 추정소득을 기반으로 소액대출을 진행하며, 대출 기간은 최대 30일 정도로 설정할 수 있다. 이와 같이, 초단기 소액 개인 대출(MPL) 서비스를 제공하는 경우, 급여일 도래주기의 1개월 만기 상품 등으로 만기리스크가 낮으며, 1개월 주기로 상환율 파악이 가능하여 검증주기가 짧고, 대안신용평가에 대한 수정 및 보 완이 빠르다. 또한, 선구매 후 결제 형태의 대출변형모델을 제공함으로써, 서비스 선 결제 후 대출 정상상환이 확인되면 결제 취소를 진행하여, 미상환 리스크 헷지를 마련할 수 있다. 즉, 미상환 시 결제 유지를 통해 미상 환리스크를 경감시킬 수 있다. 이 때 신용평가사(CB) 신용등급은 변동되지 않는다. 도 7은 일 실시예에 따른 근무행동 데이터를 활용한 행동주의 대안신용평가 모델을 이용한 시각화 시스템의 예 시를 나타내는 도면이다. 도 7을 참조하면, 근무행동 데이터를 활용한 행동주의 대안신용평가 모델을 이용한 시각화 시스템을 제공할 수 있으며, 웹 또는 앱(애플리케이션)을 이용하여 서비스를 제공할 수 있다. 예를 들어 근무행동 데이터를 활용한 행동주의 대안신용평가 모델을 이용한 시각화 시스템을 제공하는 서버가 제공될 수 있으며, 사용자는 서버가 제 공하는 웹 페이지에 접속하거나 서버로부터 사용자 단말에 애플리케이션 등을 다운로드 받아 설치함으로써 시각 화 시스템을 이용할 수 있다. 이러한 근무행동 데이터를 활용한 행동주의 대안신용평가 모델을 이용한 시각화 시스템을 통해 사용자의 기본 정보, 근태정보, 정성적 평가 정보, 소비 정보 등의 정보를 시각화하여 나타낼 수 있다. 실시예들에 따르면 근무행동 데이터를 기반으로 대안신용평가 모델을 제공할 수 있다. 실질적으로 금융권에서 대안신용평가를 적극적으로 활용하기 위해서는 소득, 소비에 대한 합리적 추정이 가능한 데이터를 활용하여 구 축을 하여야 한다. 실시예들에 따르면 직원관리 시스템을 제공함에 따라 신뢰성 있는 추정소득 파악이 가능하 며, 추가 데이터를 활용하여 행동주의 기반의 대안평가가 가능하다. 즉, 현재 근무데이터를 기반으로 신뢰성 있는 대안신용평가 모형을 구축할 수 있다. 또한, AI를 통해 다양한 데이터 조합의 유기적 연관성을 검증하여 최적의 평가모형을 제공할 수 있다. 예컨대, 수집하는 데이터의 칼럼은 약 350개이며, 대안신용평가를 위해 파생 가능한 칼럼(3일 연속 지각, 10영업일 내 10분전 출근율(%) 등)과 외부에서 수집되는 데이터를 합치게 되면 무수히 많은 칼럼들이 존재하게 된다. 이러 한 칼럼들의 최적의 조합 및 구조를 구축하기 위해서는 AI의 학습을 통한 검증이 필수적이다. 인적 리소스를 투입한 단순 조합의 평가내용으로 대출을 실행하기에는 막대한 리스크가 존재하기 때문에 AI를 활용한다면 검증 이 반드시 필요하다. 이상과 같이, 실시예들에 따르면 기존 신용평가사(CB), 국내 대안신용평가에서 추정소득을 파악할 수 없던 대상 자(청년 신파일러, 4대보험 미가입자, 현금 급여소득자, 신용카드 미발급자 등)의 추정소득을 당사 데이터를 기 반으로 파악이 가능하여, 신파일러의 핵심적인 문제점 해결할 수 있다. 이상에서 설명된 장치는 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치 및 구성요소는, 예를 들어, 프로 세서, 컨트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크로컴 퓨터, FPA(field programmable array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령 (instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이상 의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설"}
{"patent_id": "10-2022-0046905", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소 (processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치 는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 컨트롤러를 포함할 수 있다. 또한, 병렬 프로세서 (parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치에 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터 는 하나 이상의 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등 을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판 독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다."}
{"patent_id": "10-2022-0046905", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다. 도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7"}
{"patent_id": "10-2022-0046905", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 있어서 컴퓨터 시스템의 내부 구성의 일례를 설명하기 위한 블록도이다. 도 2는 일 실시예에 따른 컴퓨터 시스템의 프로세서가 포함할 수 있는 구성요소를 나타내는 블록도이다. 도 3은 일 실시예에 따른 컴퓨터 시스템이 수행할 수 있는 행동주의 대안신용평가 모델의 제공 방법을 나타내는 흐름도이다. 도 4는 일 실시예에 따른 대안신용평가 모델의 구축 예시를 설명하기 위한 도면이다.도 5는 일 실시예에 따른 대안신용평가 모델 스코링 구조의 예시를 나타내는 도면이다. 도 6은 일 실시예에 따른 신파일러 대상 초단기 소액 개인 대출(MPL) 서비스의 예시를 설명하기 위한 도면이다. 도 7은 일 실시예에 따른 근무행동 데이터를 활용한 행동주의 대안신용평가 모델을 이용한 시각화 시스템의 예 시를 나타내는 도면이다."}
