{"patent_id": "10-2021-0139656", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0055822", "출원번호": "10-2021-0139656", "발명의 명칭": "데이터셋 생성 장치 및 방법", "출원인": "한국전자통신연구원", "발명자": "김현진"}}
{"patent_id": "10-2021-0139656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "하나 이상의 프로세서; 및상기 하나 이상의 프로세서에 의해 실행되는 적어도 하나 이상의 프로그램을 저장하는 실행메모리를 포함하고,상기 적어도 하나 이상의 프로그램은수집된 데이터를 필터 메소드(Filter Method) 기법을 이용하여 수치형 특징 데이터와 범주형 특징 데이터로 분류하고,분산 분석 기법과 카이제곱 기법을 이용하여 상기 수치형 특징 데이터와 상기 범주형 특징 데이터의 상관도 분석을 수행하고,상기 상관도 분석을 통해 산출된 상관도 점수를 이용하여 지도학습용 데이터셋와 비지도학습용 데이터셋을 생성하는 것을 특징으로 하는 데이터셋 생성 장치."}
{"patent_id": "10-2021-0139656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 적어도 하나 이상의 프로그램은상기 필터 메소드 기법을 이용하여 기정의된 특징 기준에 따라서 특징의 중요도 순위를 책정하고, 상기 특징의중요도 순위에 기반하여 데이터 특징 간의 상관관계를 측정하여 상기 수치형 특징 데이터와 상기 범주형 특징데이터를 분류하는 것을 특징으로 하는 데이터셋 생성 장치."}
{"patent_id": "10-2021-0139656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 적어도 하나 이상의 프로그램은상기 수치형 특징 데이터를 Min-Max Scaling 기법을 통해 정규화를 수행하고, 상기 범주형 특징 데이터를 One-hot Encoding 기법을 통해 수치적 값으로 변환하는 것을 특징으로 하는 데이터셋 생성 장치."}
{"patent_id": "10-2021-0139656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 적어도 하나 이상의 프로그램은상기 분산 분석 기법으로 산출된 상관도 점수가 높을수록, 카이제곱 기법으로 산출된 상관도 점수가 낮을수록상기 지도학습용 데이터셋에 해당하는 데이터로 판단하는 것을 특징으로 하는 데이터셋 생성 장치."}
{"patent_id": "10-2021-0139656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서,상기 적어도 하나 이상의 프로그램은상기 분산 분석 기법으로 산출된 상관도 점수가 낮을수록, 카이제곱 기법으로 산출된 상관도 점수가 높을수록상기 비지도학습용 데이터셋에 해당하는 데이터로 판단하는 것을 특징으로 하는 데이터셋 생성 장치."}
{"patent_id": "10-2021-0139656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "데이터셋 생성 장치의 데이터셋 생성 방법에 있어서,공개특허 10-2023-0055822-3-수집된 데이터를 필터 메소드(Filter Method) 기법을 이용하여 수치형 특징 데이터와 범주형 특징 데이터로 분류하는 단계;분산 분석 기법과 카이제곱 기법을 이용하여 상기 수치형 특징 데이터와 상기 범주형 특징 데이터의 상관도 분석을 수행하는 단계; 및상기 상관도 분석을 통해 산출된 상관도 점수를 이용하여 지도학습용 데이터셋와 비지도학습용 데이터셋을 생성하는 단계를 포함하는 것을 특징으로 하는 데이터셋 생성 방법."}
{"patent_id": "10-2021-0139656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서,상기 분류하는 단계는상기 필터 메소드 기법을 이용하여 기정의된 특징 기준에 따라서 특징의 중요도 순위를 책정하고, 상기 특징의중요도 순위에 기반하여 데이터 특징 간의 상관관계를 측정하여 상기 수치형 특징 데이터와 상기 범주형 특징데이터를 분류하는 것을 특징으로 하는 데이터셋 생성 장치."}
{"patent_id": "10-2021-0139656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에 있어서,상기 상관도 분석을 수행하는 단계는상기 수치형 특징 데이터를 Min-Max Scaling 기법을 통해 정규화를 수행하고, 상기 범주형 특징 데이터를 One-hot Encoding 기법을 통해 수치적 값으로 변환하는 것을 특징으로 하는 데이터셋 생성 방법."}
{"patent_id": "10-2021-0139656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8에 있어서,상기 상관도 분석을 수행하는 단계는상기 분산 분석 기법으로 산출된 상관도 점수가 높을수록, 카이제곱 기법으로 산출된 상관도 점수가 낮을수록상기 지도학습용 데이터셋에 해당하는 데이터로 판단하는 것을 특징으로 하는 데이터셋 생성 방법."}
{"patent_id": "10-2021-0139656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 9에 있어서,상기 상관도 분석을 수행하는 단계는상기 분산 분석 기법으로 산출된 상관도 점수가 낮을수록, 카이제곱 기법으로 산출된 상관도 점수가 높을수록상기 비지도학습용 데이터셋에 해당하는 데이터로 판단하는 것을 특징으로 하는 데이터셋 생성 방법."}
{"patent_id": "10-2021-0139656", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "데이터셋 생성 장치 및 방법이 개시된다. 본 발명의 일실시예에 따른 데이터셋 생성 장치는 하나 이상의 프로세 서; 및 상기 하나 이상의 프로세서에 의해 실행되는 적어도 하나 이상의 프로그램을 저장하는 실행메모리를 포함 하고, 상기 적어도 하나 이상의 프로그램은 수집된 데이터를 필터 메소드(Filter Method) 기법을 이용하여 수치 형 특징 데이터와 범주형 특징 데이터로 분류하고, 분산 분석 기법과 카이제곱 기법을 이용하여 상기 수치형 특 징 데이터와 상기 범주형 특징 데이터의 상관도 분석을 수행하고, 상기 상관도 분석을 통해 산출된 상관도 점수 를 이용하여 지도학습용 데이터셋와 비지도학습용 데이터셋을 생성한다."}
{"patent_id": "10-2021-0139656", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 데이터셋 처리 기술에 관한 것으로, 보다 상세하게는 인공지능 학습용 데이터셋 생성 기술에 관한 것 이다."}
{"patent_id": "10-2021-0139656", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현재 사이버 공격은 기하급수적으로 증가하고 있으며, 공격에 사용되는 기법은 지능화, 고도화되면서 공격 방법 및 방식은 복잡하고 예측 불가능하게 진화하고 있다. 사이버 표적공격과 위협에 대응하기 위해 관제요원이 보안 위협을 분석/탐지하는 기존의 수동적인 분석 방법은 알려진 위협에 대해서만 보호가 가능하다. 대표적인 전통적 분석 방법에 속하는 시그니처, 룰 기반의 분석 방법 역시 이전에 확인된 공격의 탐지율에 대해서 의존적이기 때 문에 진화하는 대규모의 지능적인 신규 보안 위협에 대해서는 차단 및 선제적인 대응이 어려운 상황이다.이처럼 한정된 시간과 가용 자원으로 기하급수적으로 증가하는 방대한 양의 데이터를 정확하고, 신속하게 분석 하는 고도화된 사이버 위협 탐지를 위해서는 인공지능 및 머신러닝을 활용한 탐지 방법이 필수적이다. 최근, 사 이버 공격 탐지를 위해 이와 같이 인공지능, 머신러닝 기술을 활용하여 IT 인프라 또는 데이터 내의 주요 변화 를 분석하고 감지함으로써 공격 위협의 발생을 예측하는 지능형 보안 분야에 대한 다수의 연구들이 진행 중에 있다. 대표적으로 공격 여부가 분류된 수집 데이터를 사용하여 학습하는 지도 학습 기반의 위협 탐지 모델과 더 불어 공격 여부가 분류되지 않은 데이터에서 패턴을 파악하여 이를 기반으로 학습하는 비지도 학습 기반의 위협 탐지 모델에 대한 연구가 이루어지고 있다. 이러한 인공지능 기반의 모델의 학습 과정에서 특징 선정(Feature Selection)은 원시 데이터로부터 중요한 정보를 잃지 않으면서, 모델의 출력 데이터와 연관이 없는 불필요한 특 징들을 제외하여 오버피팅(Overfitting)을 방지할 수 있다. 그리고 학습 소요 시간 및 컴퓨팅 파워, 메모리를 감소시키고 모델의 성능을 향상시킬 수 있기 때문에, 보안 위협 탐지 분야에서도 데이터 특징 선정은 매우 중요 한 부분으로 인식된다. 한편, 한국공개특허 제 10-2020-0068050 호“인공지능 수행을 위한 학습 데이터 생성장치 및 방법”는 데이터 증강 작업의 중복을 피하고 학습을 위한 충분한 서버 자원을 확보하여 학습 성능을 향상시키는 인공지능 수행을 위한 학습 데이터 생성장치 및 방법에 관하여 개시하고 있다."}
{"patent_id": "10-2021-0139656", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 다양한 종류의 데이터셋을 이용하여 데이터 타입에 따라서 특징 간 상관도 분석을 수행하고, 상관도 점수를 기반으로 지도/비지도에 따른 인공지능 모델 학습 용 통합 데이터셋을 생성하는 것을 목적으로 한다. 또한, 본 발명은 모델 학습을 위한 데이터셋 전처리 과정에서, 시스템 및 네트워크 보안 장비에서 수집된 다수 의 데이터 셋을 단일화된 데이터 셋으로 통합하여 데이터셋 별 반복 학습에 소요되는 시간을 감소시키는 것을 목적으로 한다. 또한, 본 발명은 학습 유형 별 데이터 셋 내 특징 추출 방법을 달리하여 신경망 학습 효율을 증가시키는 것을 목적으로 한다. 또한, 본 발명은 다수의 데이터에 대하여 선별적으로 특징을 추출하여 생성한 통합 데이터셋을 기반으로 사이버 침해 위협 탐지 목적의 신경망 모델을 생성하는 것을 목적으로 한다. 또한, 본 발명은 지도/비지도 학습 기반으로 지능형 위협 분석을 위한 보안 인텔리전스를 구축할 수 있고, 향후 인공지능이 적용되는 보안 관제 솔루션 분야에 적용하는 것을 목적으로 한다."}
{"patent_id": "10-2021-0139656", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위한 본 발명의 일실시예에 따른 데이터셋 생성 장치는 하나 이상의 프로세서 및 상기 하나 이상의 프로세서에 의해 실행되는 적어도 하나 이상의 프로그램을 저장하는 실행메모리를 포함하고, 상기 적어도 하나 이상의 프로그램은 수집된 데이터를 필터 메소드(Filter Method) 기법을 이용하여 수치형 특징 데 이터와 범주형 특징 데이터로 분류하고, 분산 분석 기법과 카이제곱 기법을 이용하여 상기 수치형 특징 데이터 와 상기 범주형 특징 데이터의 상관도 분석을 수행하고, 상기 상관도 분석을 통해 산출된 상관도 점수를 이용하 여 지도학습용 데이터셋와 비지도학습용 데이터셋을 생성한다. 이 때, 상기 적어도 하나 이상의 프로그램은 상기 필터 메소드 기법을 이용하여 기정의된 특징 기준에 따라서 특징의 중요도 순위를 책정하고, 상기 특징의 중요도 순위에 기반하여 데이터 특징 간의 상관관계를 측정하여 상기 수치형 특징 데이터와 상기 범주형 특징 데이터를 분류할 수 있다. 이 때, 상기 적어도 하나 이상의 프로그램은 상기 수치형 특징 데이터를 Min-Max Scaling 기법을 통해 정규화를 수행하고, 상기 범주형 특징 데이터를 One-hot Encoding 기법을 통해 수치적 값으로 변환할 수 있다. 이 때, 상기 적어도 하나 이상의 프로그램은 상기 분산 분석 기법으로 산출된 상관도 점수가 높을수록, 카이제 곱 기법으로 산출된 상관도 점수가 낮을수록 상기 지도학습용 데이터셋에 해당하는 데이터로 판단할 수 있다. 이 때, 상기 적어도 하나 이상의 프로그램은 상기 분산 분석 기법으로 산출된 상관도 점수가 낮을수록, 카이제 곱 기법으로 산출된 상관도 점수가 높을수록 상기 비지도학습용 데이터셋에 해당하는 데이터로 판단할 수 있다.또한, 상기한 목적을 달성하기 위한 본 발명의 일실시예에 따른 데이터셋 생성 방법은 데이터셋 생성 장치의 데 이터셋 생성 방법에 있어서, 수집된 데이터를 필터 메소드(Filter Method) 기법을 이용하여 수치형 특징 데이터 와 범주형 특징 데이터로 분류하는 단계; 분산 분석 기법과 카이제곱 기법을 이용하여 상기 수치형 특징 데이터 와 상기 범주형 특징 데이터의 상관도 분석을 수행하는 단계 및 상기 상관도 분석을 통해 산출된 상관도 점수를 이용하여 지도학습용 데이터셋와 비지도학습용 데이터셋을 생성하는 단계를 포함한다. 이 때, 상기 분류하는 단계는 상기 필터 메소드 기법을 이용하여 기정의된 특징 기준에 따라서 특징의 중요도 순위를 책정하고, 상기 특징의 중요도 순위에 기반하여 데이터 특징 간의 상관관계를 측정하여 상기 수치형 특 징 데이터와 상기 범주형 특징 데이터를 분류할 수 있다. 이 때, 상기 상관도 분석을 수행하는 단계는 상기 수치형 특징 데이터를 Min-Max Scaling 기법을 통해 정규화를 수행하고, 상기 범주형 특징 데이터를 One-hot Encoding 기법을 통해 수치적 값으로 변환할 수 있다. 이 때, 상기 상관도 분석을 수행하는 단계는 상기 분산 분석 기법으로 산출된 상관도 점수가 높을수록, 카이제 곱 기법으로 산출된 상관도 점수가 낮을수록 상기 지도학습용 데이터셋에 해당하는 데이터로 판단할 수 있다. 이 때, 상기 상관도 분석을 수행하는 단계는 상기 분산 분석 기법으로 산출된 상관도 점수가 낮을수록, 카이제 곱 기법으로 산출된 상관도 점수가 높을수록 상기 비지도학습용 데이터셋에 해당하는 데이터로 판단할 수 있다."}
{"patent_id": "10-2021-0139656", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 다양한 종류의 데이터셋을 이용하여 데이터 타입에 따라서 특징 간 상관도 분석을 수행하고, 상관도 점수를 기반으로 지도/비지도에 따른 인공지능 모델 학습 용 통합 데이터셋을 생성할 수 있다. 또한, 본 발명은 모델 학습을 위한 데이터셋 전처리 과정에서, 시스템 및 네트워크 보안 장비에서 수집된 다수 의 데이터 셋을 단일화된 데이터 셋으로 통합하여 데이터셋 별 반복 학습에 소요되는 시간을 감소시킬 수 있다. 또한, 본 발명은 학습 유형 별 데이터 셋 내 특징 추출 방법을 달리하여 신경망 학습 효율을 증가시킬 수 있다. 또한, 본 발명은 다수의 데이터에 대하여 선별적으로 특징을 추출하여 생성한 통합 데이터셋을 기반으로 사이버 침해 위협 탐지 목적의 신경망 모델을 생성할 수 있다. 또한, 본 발명은 지도/비지도 학습 기반으로 지능형 위협 분석을 위한 보안 인텔리전스를 구축할 수 있고, 향후 인공지능이 적용되는 보안 관제 솔루션 분야에 적용할 수 있다."}
{"patent_id": "10-2021-0139656", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명을 첨부된 도면을 참조하여 상세히 설명하면 다음과 같다. 여기서, 반복되는 설명, 본 발명의 요지를 불 필요하게 흐릴 수 있는 공지 기능, 및 구성에 대한 상세한 설명은 생략한다. 본 발명의 실시형태는 당 업계에서 평균적인 지식을 가진 자에게 본 발명을 보다 완전하게 설명하기 위해서 제공되는 것이다. 따라서, 도면에서의 요소들의 형상 및 크기 등은 보다 명확한 설명을 위해 과장될 수 있다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다.이하, 본 발명에 따른 바람직한 실시예를 첨부된 도면을 참조하여 상세하게 설명한다. 도 1은 본 발명의 일실시예에 따른 사이버 침해 위협용 인공지능 모델의 학습용 데이터 수집 과정을 나타낸 도 면이다. 도 1을 참조하면, 사이버 침해 위협 탐지용 인공지능 모델의 학습에 사용될 네트워크 트래픽, 시스템로그 및 보 안이벤트를 수집하는 과정을 나타낸 것을 알 수 있다. 본 발명의 일실시예에 따른 데이터셋 생성 장치 및 방법은 네트워크 트래픽, 시스템로그 및 보안이벤트를 수집 하는 과정을 수행할 수 있다. 학습용 데이터는 네트워크, 시스템 로그, 보안이벤트를 포함할 수 있다. 먼저 패킷 원시데이터에서는 정해진 단위시간(5 분) 동안 수집된 패킷 데이터를 pcap 형태의 단일 파일로 저장한 후, 네트워크 플로우를 추출할 수 있다. 동시에 시스템 로그 및 보안 이벤트 원시데이터(202, 203)에서는 정해진 단위시간(5 분) 내에 발생된 데이터들 도 Aggregation하고, 시스템 사용 및 로그인 실패 정보가 포함된 로그 정보와 보안이벤트를 파싱할 수 있 다. 그리고, 각 데이터의 라인을 읽은 후, 각 라인 별 데이터의 구성값을 확인하여 해당 라인이 정상 데이 터인지 확인할 수 있다. 네트워크 플로우에서는 송신 시작 시간, 전송 시간, 프로토콜, 송신지 IP, 송신지 포트, 목적지 IP, 목적지 포 트, 상태, 플래그, 송신 서비스 타입, 수신 서비스 타입, 전체 바이트, 송신 바이트, 수신 바이트, 전체 패킷, 송신 패킷, 수신 패킷, 송신 평균 패킷 사이즈, 수신 평균 패킷 사이즈 중에 빠진 데이터가 있다면 정산 데이터 가 아닌 것으로 판단할 수 있다. 시스템 로그의 syslog 에서는 일자, 시간, 호스트 이름, 프로세스 이름, 우선 순위, 메시지 중에서 빠진 데이터 가 있거나, btmp 에서 접속자 이름, 접속 포트, 송신지 IP, 최근 접속 시간 중에 빠진 데이터가 있다면 정상 데 이터가 아닌 것으로 판단할 수 있다. 보안 이벤트의 방화벽 데이터에서는 일자, 시간, 호스트 이름, 인터페이스, 길이, 송신지 IP, 목적지 IP 중에서 빠진 데이터가 있거나 IPS 데이터에서 일자, 시간, 송신지 IP, 송신지 포트, 목적지 IP, 목적지 포트, NAT 타입, 처리, 전체 패킷 , 전체 바이트 크기 중에 빠진 데이터가 있다면 정상 데이터가 아닌 것으로 판단할 수 있다. 사용자의 확인 단계에서 상기 데이터에 대해 정상 데이터 확인이 이루어진 경우에는 본 과정을 생략할 수 있다. 상기 과정에서의 데이터가 정상 데이터인 것으로 판단되면, 각각의 데이터는 DB 에 .csv, .pkl 형태로 데이터로 저장될 수 있다. 도 2는 본 발명의 일실시예에 따른 DB 에 저장된 수집 데이터를 나타낸 도면이다. 도 2를 참조하면, 각 DB 에 저장되는 네트워크 플로우, 시스템 로그, 보안이벤트 데이터는 datenetflow.csv, date-syslog.csv, date-btmp.csv, date-fw.csv, date-ips.csv 로 저장될 수 있다. 상기의 과정을 통해 저장된 각 데이터는 데이터셋 정제 과정을 거쳐서 특징 간 상관도 분석 과정에 사용될 수 있다. 도 3은 본 발명의 일실시예에 따른 데이터 셋 생성 과정을 나타낸 도면이다. 도 3을 참조하면, 데이터의 정체 과정 및 특징 간 상관도를 분석하는 과정을 나타낸 것을 알 수 있다. 본 발명의 일실시예에 따른 데이터셋 생성 장치 및 방법은 데이터의 특징 서브셋을 생성한 다음, 필수값이 없다 고 판단되는 결측 데이터에 대해서는 대체 및 회귀 대체(Regression Imputation) 기법을 통해 동일 데이터 셋에 있는 다른 특징에서 결측치 값을 예측하여 삽입할 수 있다. 그리고 각 데이터 특징 별, 상/하위 표준편차로 기설정된 값의 예로'3'을 벗어나는 데이터는 이상치로 판단하고, 이상치를 포함하고 있는 데이터는 삭제 처리할 수 있다. 정제 처리가 완료된 데이터는 학습에 필요한 유의미한 특징을 추출하기 위해 특징을 분류하여 각 특징 별로 상관도 분석을 수행할 수 있다. 본 발명에서는 수치형, 범주형 데이터로 구성된 네트워크, 시스템 로그, 보안 이벤트 데이터를 학습 데이터로 이용하고, 보안 위협 여부인 범주형 데이터를 출력할 수 있다. 이 때, 본 발명은 데이터 내에 포함되어 있는 수치형(Numerical) 특징과 범주형(Categorical) 특징을 분류하기 위해 통계적 측정 기준에 따라 특징 중요도(Feature Importance) 순위를 계산하는 Filter Method 기반으로 특징 추출을 수행할 수 있다. Filter Method 는 특징 기준에 따라서 특징의 중요도(Feature Importance) 순위를 책정하고, 낮은순위의 특징들 은 제외(Filtering)하면서 데이터 특징 간의 상관관계를 측정할 수 있다. 본 발명에서는 인공지능 모델 생성을 위해 학습용 네트워크 트래픽과 특정 시스템로그 및 보안이벤트의 수집 방 법, 그리고 수집된 데이터를 기반으로 학습 유형 별로 특징(피처, feature)을 추출하여 데이터셋을 생성할 수 있다. 이 때, 수치형 특징은 Min-Max Scaling 기법을 통해 값을 0~1 사이의 값으로 정규화를 수행하고, 범주형 특징은 상관도 계산을 위해 값을 숫자형태인 One-hot vector 형태로 변환하는 One-hot Encoding 을 수행할 수 있다. 그리고 데이터 특징 별 상관도 분석을 위해서 수치형 입력 데이터와 수치형 출력 데이터 간에는 분산분석 (ANOVA, Analysis of Variance) 기반 상관도 분석을, 범주형 입력 데이터와 범주형 출력 데이터 간에는 카이제 곱(Chi-Squared) 기반 상관도 분석을 이용할 수 있다. [수학식 1]"}
{"patent_id": "10-2021-0139656", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "[수학식 2]"}
{"patent_id": "10-2021-0139656", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수학식 1은 수치형 특징의 데이터 특징 간 상관도를 분석하는 계산식을 나타낸 것을 알 수 있다. 수학식 1에서 Nj는 j그룹 특징의 계수, Xj는 j그룹 내 데이터의 특징, x는 특징들의 평균, k는 데이터 그룹 수 를 나타낸 것을 알 수 있다. 수학식 1의 분산분석(ANOVA, analysis of variance)을 적용하는 데이터 내 수치형 특징은 프로토콜, 상태, 프로 세스 이름, 플래그, 우선 순위, 처리, 인터페이스, NAT 타입이다. 분산분석 기반 상관도 분석은 수치 데이터의 평균 차이를 검증하는 분석 방법으로, 수치형 데이터 값과 데이터 평균 간의 차이인 편차를 제곱하여 합산한 후, 표본의 크기로 나누는 분산을 계산하여 집단 간 평균값의 차이를 계산하는 F-Test 기반으로 데이터의 상관도를 계산할 수 있다. 수학식 2는 범주형 특징의 데이터 특징 간 상관도를 분석하는 계산식을 나타낸 것을 알 수 있다. 수학식 2 에서 Oi는 특징의 관측된 빈도 값, Ei는 I 특징의 관찰 빈도에 대한 기대 값, k는 범주의 수를 나타낸 것을 알 수 있다. 카이제곱(Chi-Squared) 분석을 적용하는 데이터 내 범주형 특징은 전송 시간, 송/수신 서비스 타입, 전체 바이 트, 송/수신 바이트, 전체 패킷 수, 송/수신 패킷 수, 송/수신 평균 패킷 사이즈, 길이이다. 카이제곱 기반 상관도 분석은 범주형 데이터 내 특징의 분포의 비율이 관측 빈도의 평균치 값과 대비하여 타 특 징 분포 비율과 같은지를 계산하여 상관성 여부를 수치로 데이터의 상관도를 계산할 수 있다. 분산 분석에서 F 값이 커질수록 그룹 간 변동이 그룹 내 변동보다 커지기 때문에 편차의 크기가 커지는, 즉 특 징 간 상관도가 적어진다는 의미이다.카이제곱 분석에서는 X2 값이 커질수록 특징의 관측빈도와 관측빈도의 기대 값이 차이가 커지는, 즉 상관관계가 커진다는 의미이다. 상기와 같이 본 발명에서는 상관도 분석 기법 기반으로 통합 데이터 셋을 생성하는데 앞서서 인공지능 모델의 학습 방법이 지도학습인지, 비지도학습인지 유무에 따라서 특징을 선정하는 방법을 달리 적용할 수 있다. [수학식 3]"}
{"patent_id": "10-2021-0139656", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "수학식 3은 지도 학습으로 모델을 학습하는 경우의 상관도 점수 계산식을 나타낸 것을 알 수 있다. 지도학습은 입력데이터인 독립변수와 출력데이터인 종속변수의 관계를 토대로 학습을 진행할 수 있다. 따라서, 데이터의 특징의 종속성으로 특징 간의 상관도가 높은 특징만을 선별하여 학습하기 때문에 상관도 점수 가 높은 순서대로 특징을 선별할 수 있다. 즉, 지도 학습을 위한 데이터 상관도 점수(Correlation Score)는 수치형 특징(numerical feature)의 경우는 F 값과는 반비례하고, 범주형 특징(categorical feature)의 경우는 X2 값과 비례하여 계산될 수 있다. [수학식 4]"}
{"patent_id": "10-2021-0139656", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "수학식 4는 비지도 학습으로 모델을 학습하는 경우의 상관도 점수 계산식을 나타낸 것을 알 수 있다. 비지도학습은 지도학습과는 달리 독립변수와 종속변수의 관계없이 데이터의 특징을 추출하는데 목적이 있기 때 문에 학습과정에서 상관도의 영향을 최소화하기 위해 특징 간의 상관도 점수가 낮은 순서대로 특징 만을 선정할 수 있다. 데이터 상관도 점수(Correlation Score)도 지도학습과는 반대로 수치형 특징(numerical feature)의 경우는 F 값과는 비례하고, 범주형 특징(categorical feature)의 경우는 X2 값과 반비례하여 각 특징의 수 n 과 m 을 이 용하여 계산될 수 있다. 도 4는 본 발명의 일실시예에 따른 데이터셋 생성 장치를 나타낸 블록도이다. 도 4를 참조하면, 본 발명의 일실시예에 따른 데이터셋 생성 장치는 데이터 수집부, 수집 데이터 DB, 데이터 정제부, 데이터 특징 서브셋 생성부, 데이터 특징 타입 분류부, 상관도 분석부, 특 징 추출부, 지도학습용 데이터 DB 및 비지도학습용 데이터 DB를 포함할 수 있다. 먼저, 데이터 수집부는 데이터 특징을 추출하기 위한 원시 데이터를 수집할 수 있다. 원시 데이터는 네트워크 패킷 원시데이터, 시스템 로그 원시 데이터, 보안 이벤트 원시 데이터를 포함할 수 있 다. 이 때, 데이터 수집부는 도 1에서 설명한 데이터 수집 과정을 이용하여 데이터를 수집하고, 수집된 데이터 의 정상 여부를 검증하고, .csv, .pkl 형태의 데이터를 수집 데이터 DB에 저장할 수 있다.데이터 정제부는 데이터의 특징들을 확인하여 대체 및 회귀 대치 기법을 이용하여 결측치 처리를 수행할 수 있다. 이 때, 데이터 정제부는 상/하위 표준편차로 기설정된 값인 '3'을 벗어나는 데이터는 삭제하는 이상치 처 리를 수행하여 데이터를 정제할 수 있다. 데이터 특징 서브셋 생성부는 정제된 데이터로부터 데이터 특징 서브셋을 생성할 수 있다. 데이터 특징 타입 분류부는 데이터특징 서브셋으로부터 데이터를 수치형 특징 데이터와 범주형 특징 데이 터로 분류할 수 있다. 이 때, 데이터 특징 타입 분류부는 데이터 내에 포함되어 있는 수치형(Numerical) 특징과 범주형 (Categorical) 특징을 분류하기 위해 통계적 측정 기준에 따라 특징 중요도(Feature Importance) 순위를 계산하 는 Filter Method 기반으로 특징 추출을 수행하여 데이터를 분류할 수 있다. 상관도 분석부는 수치형 특징 데이터와 범주형 특징 데이터에 대한 상관도 분석을 수행할 수 있다. 이 때, 상관도 분석부는 분산 분석 기반 상관도 분석부 및 카이제곱 기반 상관도 분석부를 포함 할 수 있다. 이 때, 분산 분석 기반 상관도 분석부는 수치형 특징 데이터를 Min-Max 스케일링을 거쳐 분산 분석 기법을 기반으로 상관도 분석을 수행할 수 있다. 이 때, 카이제곱 기반 상관도 분석부는 범주형 특징 데이터를 One-hot Encoding을 거쳐 카이제곱 기법을 기반으로 상관도 분석을 수행할 수 있다. 이 때, 상관도 분석부는 상관도 분석에 따라 산출된 상관도 값을 이용하여 지도학습 및 비지도학습 타입에 따라서 상관도 점수를 계산할 수 있다. 이 때, 상관도 분석부는 지도학습을 위한 특징 간 상관도 분석에서는 분산 분석 F 값이 높을수록, 카이제 곱 분석 X2 값이 낮을수록 유용한 특징로 판단하는 상관도 계산식을 이용할 수 있다. 이 때, 상관도 분석부는 비지도학습을 위한 특징 간 상관도 분석에서는 분산분석 F 값이 낮을수록, 카이제 곱 분석 X2 값이 높을수록 유용한 특징으로 판단하는 상관도 계산식을 이용할 수 있다. 특징 추출부는 상관도 계산식을 이용하여 산출된 값으로부터 지도학습용 데이터셋과 비지도학습용 데이터 셋을 생성할 수 있다. 이 때, 특징 추출부는 지도 학습 데이터셋을 지도학습용 데이터 DB에 저장하고, 비지도학습용 데이터 셋을 비지도학습용 데이터 DB에 저장할 수 있다. 도 5 및 도 6은 학습 형태 별 사이버 침해 위협 탐지용 데이터셋 구조를 나타낸 도면이다. 도 5 및 도 6을 참조하면, 계산된 상관도 점수를 토대로 선정된 상위의 특징들을 지도학습과 비지도학습 형태에 따라서 각각의 지도학습용 데이터 데이터셋과 비지도학습용 데이터셋으로 저장된다. 도 7은 본 발명의 일실시예에 따른 데이터셋 생성 방법을 나타낸 동작흐름도이다. 도 7을 참조하면, 본 발명의 일실시예에 따른 데이터셋 생성 방법은 먼저 데이터를 수집할 수 있다(S510). 즉, 단계(S510)는 데이터 특징을 추출하기 위한 원시 데이터를 수집할 수 있다. 원시 데이터는 네트워크 패킷 원시데이터, 시스템 로그 원시 데이터, 보안 이벤트 원시 데이터를 포함할 수 있 다. 이 때, 단계(S510)는 도 1에서 설명한 데이터 수집 과정을 이용하여 데이터를 수집하고, 수집된 데이터의 정상 여부를 검증하고, .csv, .pkl 형태의 데이터를 수집 데이터 DB에 저장할 수 있다. 또한, 본 발명의 일실시예에 따른 데이터셋 생성 방법은 데이터를 정제할 수 있다(S520). 즉, 단계(S520)는 데이터의 특징들을 확인하여 대체 및 회귀 대치 기법을 이용하여 결측치 처리를 수행할 수 있 다.이 때, 단계(S520)는 상/하위 표준편차로 기설정된 값인 '3'을 벗어나는 데이터는 삭제하는 이상치 처리를 수행 하여 데이터를 정제할 수 있다. 또한, 본 발명의 일실시예에 따른 데이터셋 생성 방법은 데이터 특징 서브셋을 생성할 수 있다(S530). 즉, 단계(S530)는 정제된 데이터로부터 데이터 특징 서브셋을 생성할 수 있다. 이 때, 단계(S530)는 데이터 특징 서브셋으로부터 데이터를 수치형 특징 데이터와 범주형 특징 데이터로 분류할 수 있다. 또한, 본 발명의 일실시예에 따른 데이터셋 생성 방법은 데이터 상관도 분석을 수행할 수 있다(S540). 즉, 단계(S540)는 수치형 특징 데이터와 범주형 특징 데이터에 대한 상관도 분석을 수행할 수 있다. 이 때, 단계(S540)는 수치형 특징 데이터를 Min-Max 스케일링을 거쳐 분산 분석 기법을 기반으로 상관도 분석을 수행할 수 있다. 이 때, 단계(S540)는 범주형 특징 데이터를 One-hot Encoding을 거쳐 카이제곱 기법을 기반으로 상관도 분석을 수행할 수 있다. 이 때, 단계(S540)는 상관도 분석에 따라 산출된 상관도 값을 이용하여 지도학습 및 비지도학습 타입에 따라서 상관도 점수를 계산할 수 있다. 이 때, 단계(S540)는 지도학습을 위한 특징 간 상관도 분석에서는 분산 분석 F 값이 높을수록, 카이제곱 분석 X2 값이 낮을수록 유용한 특징로 판단하는 상관도 계산식을 이용할 수 있다. 이 때, 단계(S540)는 비지도학습을 위한 특징 간 상관도 분석에서는 분산분석 F 값이 낮을수록, 카이제곱 분석 X2 값이 높을수록 유용한 특징으로 판단하는 상관도 계산식을 이용할 수 있다. 또한, 본 발명의 일실시예에 따른 데이터셋 생성 방법은 데이터 특징을 추출하고 데이터 셋을 생성할 수 있다 (S550). 즉, 단계(S550)는 상기 상관도 계산식을 이용하여 산출된 값으로부터 지도학습용 데이터셋과 비지도학습용 데이 터셋을 생성할 수 있다. 이 때, 단계(S550)는 지도 학습 데이터셋을 지도학습용 데이터 DB에 저장하고, 비지도학습용 데이터 셋을 비지도학습용 데이터 DB에 저장할 수 있다. 도 8은 본 발명의 일실시예에 따른 컴퓨터 시스템을 나타낸 도면이다. 도 8을 참조하면, 본 발명의 일실시예에 따른 데이터셋 생성 장치는 컴퓨터로 읽을 수 있는 기록매체와 같은 컴 퓨터 시스템에서 구현될 수 있다. 도 8에 도시된 바와 같이, 컴퓨터 시스템은 버스를 통하여 서로 통신하는 하나 이상의 프로세서, 메모리, 사용자 인터페이스 입력 장치, 사용자 인터페 이스 출력 장치 및 스토리지를 포함할 수 있다. 또한, 컴퓨터 시스템은 네트워크에 연결되는 네트워크 인터페이스를 더 포함할 수 있다. 프로세서는 중앙 처리 장치 또는 메모리 나 스토리지에 저장된 프로세싱 인스트럭션들을 실행하는 반도체 장치일 수 있다. 메모리 및 스토리지는 다양한 형태의 휘발성 또는 비휘발성 저장 매체일 수 있다. 예를 들어, 메모리는 ROM이나 RAM을 포함할 수 있다. 본 발명의 일실시예에 따른 데이터셋 생성 장치는 하나 이상의 프로세서; 및 상기 하나 이상의 프로세서 에 의해 실행되는 적어도 하나 이상의 프로그램을 저장하는 실행메모리를 포함하고, 상기 적어도 하나 이상의 프로그램은 수집된 데이터를 필터 메소드(Filter Method) 기법을 이용하여 수치형 특징 데이터와 범주형 특징 데이터로 분류하고, 분산 분석 기법과 카이제곱 기법을 이용하여 상기 수치형 특징 데이터와 상기 범주형 특징 데이터의 상관도 분석을 수행하고, 상기 상관도 분석을 통해 산출된 상관도 점수를 이용하여 지도 학습용 데이터셋와 비지도학습용 데이터셋을 생성한다. 이 때, 상기 적어도 하나 이상의 프로그램은 상기 필터 메소드 기법을 이용하여 기정의된 특징 기준에 따라서 특징의 중요도 순위를 책정하고, 상기 특징의 중요도 순위에 기반하여 데이터 특징 간의 상관관계를 측정하여 상기 수치형 특징 데이터와 상기 범주형 특징 데이터를 분류할 수 있다.이 때, 상기 적어도 하나 이상의 프로그램은 상기 수치형 특징 데이터를 Min-Max Scaling 기법을 통해 정규화를 수행하고, 상기 범주형 특징 데이터를 One-hot Encoding 기법을 통해 수치적 값으로 변환할 수 있다. 이 때, 상기 적어도 하나 이상의 프로그램은 상기 분산 분석 기법으로 산출된 상관도 점수가 높을수록, 카이제 곱 기법으로 산출된 상관도 점수가 낮을수록 상기 지도학습용 데이터셋에 해당하는 데이터로 판단할 수 있다. 이 때, 상기 적어도 하나 이상의 프로그램은 상기 분산 분석 기법으로 산출된 상관도 점수가 낮을수록, 카이제 곱 기법으로 산출된 상관도 점수가 높을수록 상기 비지도학습용 데이터셋에 해당하는 데이터로 판단할 수 있다. 이상에서와 같이 본 발명의 일실시예에 따른 데이터셋 생성 장치 및 방법은 상기한 바와 같이 설명된 실시예들 의 구성과 방법이 한정되게 적용될 수 있는 것이 아니라, 상기 실시예들은 다양한 변형이 이루어질 수 있도록 각 실시예들의 전부 또는 일부가 선택적으로 조합되어 구성될 수도 있다."}
{"patent_id": "10-2021-0139656", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 사이버 침해 위협용 인공지능 모델의 학습용 데이터 수집 과정을 나타낸 도 면이다. 도 2는 본 발명의 일실시예에 따른 DB 에 저장된 수집 데이터를 나타낸 도면이다. 도 3은 본 발명의 일실시예에 따른 데이터 셋 생성 과정을 나타낸 도면이다. 도 4는 본 발명의 일실시예에 따른 데이터셋 생성 장치를 나타낸 블록도이다. 도 5 및 도 6은 학습 형태 별 사이버 침해 위협 탐지용 데이터셋 구조를 나타낸 도면이다. 도 7은 본 발명의 일실시예에 따른 데이터셋 생성 방법을 나타낸 동작흐름도이다. 도 8은 본 발명의 일실시예에 따른 컴퓨터 시스템을 나타낸 도면이다."}
