{"patent_id": "10-2019-0061880", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0136171", "출원번호": "10-2019-0061880", "발명의 명칭": "고객 안전을 위한 ＩｏＴ 기반의 엘리베이터 모니터링 시스템 및 모니터링 방법", "출원인": "투비씨앤씨 주식회사", "발명자": "김한기"}}
{"patent_id": "10-2019-0061880", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "통합관제센터(100u)가 관제용 DB 서버(100b)에 저장된 각 엘리베이터 ID 별 센싱정보를 분석하여 정상가동패턴을 추출하여 관제용 DB 서버(100b)에 저장하는 제 1 단계; 통합관제센터(100u)가 정상가동패턴을 구성하는 각 센싱 파라미터별로 벗어나는지에 대한 분석을 수행하는 제 2단계; 및통합관제센터(100u)가 각 센싱 파라미터별로 정상가동패턴을 벗어나는 경우, 정상가동패턴을 벗어나는 엘리베이터로 할당된 관제센터 모니터(100)로 알람을 전송하는 제 3 단계; 를 포함하는 것을 특징으로 하는 고객 안전을 위한 IoT 기반의 엘리베이터 모니터링 방법."}
{"patent_id": "10-2019-0061880", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 제 1 단계 이전에,건물통합통신모듈(500)과 CAN 통신으로 연결된 각 엘리베이터 형성된 엘리베이터 콘트롤러(600a)가 각 엘리베이터별 센서통신모듈(600)로부터 미리 설정된 주기에 따라 센싱정보를 수집하는 제 1 준비 단계; 를 더 포함하는것을 특징으로 하는 고객 안전을 위한 IoT 기반의 엘리베이터 모니터링 방법."}
{"patent_id": "10-2019-0061880", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서, 상기 제 1 준비 단계와 제 1 단계 이전 사이에,통합관제센터(100u)가 네트워크(200) 또는 IoT 통신망(300)을 통해 건물통합통신모듈(500)과 CAN 통신으로 연결된 엘리베이터 콘트롤러(600a)로부터 센싱정보를 수신하여 각 엘리베이터 ID를 메타데이터로 센싱정보를 관제용DB 서버(100b)에 저장하는 제 2 준비 단계; 를 더 포함하는 것을 특징으로 하는 고객 안전을 위한 IoT 기반의엘리베이터 모니터링 방법."}
{"patent_id": "10-2019-0061880", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서, 상기 제 3 단계 이후, 알람을 수신한 관제센터 모니터(100)가 네트워크(200) 또는 IoT 통신망(300)을 통해 알람에 해당하는 엘리베이터의 A/S 기사에 해당하는 모바일 단말(400)로 자동 통화연결 방식 또는 Push 메시지 전송 방식을 통해 A/S 정보를 전송하는 제 4 단계; 를 더 포함하는 것을 특징으로 하는 고객 안전을 위한 IoT 기반의 엘리베이터 모니터링 방법."}
{"patent_id": "10-2019-0061880", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "에 있어서, 건물통합통신모듈(500)과 CAN 통신으로 연결되어 각 엘리베이터 형성되며, 각 엘리베이터별 센서통신모듈(600)로부터 미리 설정된 주기에 따라 센싱정보를 수집하는 엘리베이터 콘트롤러(600a); 를 더 포함하는 것을 특징으로 하는 고객 안전을 위한 IoT 기반의 엘리베이터 모니터링 시스템."}
{"patent_id": "10-2019-0061880", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서, 관제용 서버(100a)가, 네트워크(200) 또는 IoT 통신망(300)을 통해 건물통합통신모듈(500)과 CAN 통신으로 연결된 엘리베이터 콘트롤러(600a)로부터 센싱정보를 수신하여 각 엘리베이터 ID를 메타데이터로 센싱정보를 관제용 DB 서버(100b)에 저장하는 것을 특징으로 하는 고객 안전을 위한 IoT 기반의 엘리베이터 모니터링 시스템."}
{"patent_id": "10-2019-0061880", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 5에 있어서, 알람을 수신한 관제센터 모니터(100)는, 네트워크(200) 또는 IoT 통신망(300)을 통해 알람에 해당하는 엘리베이터의 A/S 기사에 해당하는 모바일 단말(400)로 자동 통화연결 방식 또는 Push 메시지 전송 방식을 통해 A/S 정보를 전송하는 것을 특징으로 하는 고객안전을 위한 IoT 기반의 엘리베이터 모니터링 시스템."}
{"patent_id": "10-2019-0061880", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 고객 안전을 위한 IoT 기반의 엘리베이터 모니터링 시스템 및 모니터링 방법에 관한 것이다. 본 발명 은, 통합관제센터(100u)가 관제용 DB 서버(100b)에 저장된 각 엘리베이터 ID 별 센싱정보를 분석하여 정상가동패 턴을 추출하여 관제용 DB 서버(100b)에 저장하는 제 1 단계; 통합관제센터(100u)가 정상가동패턴을 구성하는 각 (뒷면에 계속)"}
{"patent_id": "10-2019-0061880", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 고객 안전을 위한 IoT 기반의 엘리베이터 모니터링 시스템 및 모니터링 방법에 관한 것으로, 보다 구 체적으로는, 기존 건물에 설치되어 운행중인 인승, 화물, 차량용 엘리베이터에 IoT 기반의 각종 센서를 부착하 여 엘리베이터(elevator)의 상태를 수집하고, IoT 통신망(RoLa) 또는 인터넷(internet) 통신을 통하여 수집된 상태 정보를 통합관제센터로 전송하면 통합관제센터에서는 엘리베이터의 상태가 정상작동 인지를 분석하고, 통 합관제센터가 분석한 정보로 부터 사전예방 정비 계획을 수립하고 현장 A/S 담당자에게 모바일(mobile)로 A/S를 통보하거나, 고장 발생시 즉시 A/S를 통보함으로 안전사고에 신속하게 대응할 수 있도록 하기 위한 고객 안전을 위한 IoT 기반의 엘리베이터 모니터링 시스템 및 모니터링 방법에 관한 것이다."}
{"patent_id": "10-2019-0061880", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 우리나라는 세계 3대 엘리베이터 시장으로 2016년 기준 44,000의 엘리베이터가 설치되어 있고, 노령화와 도시화에 의해 인구 밀집도가 높아짐에 따라 엘리베이터 시장이 지속적으로 증가하고 있다. 국내 엘리베이터 시장은 외국계 대형업체와 국내 중소업체들이 시장을 양분하고 있으며, 국내 설치된 대부분 엘 리베이터는 원격 모니터링이 되지 않는 제품이어서 사전 예측에 의한 예방적인 고장대응이 되지 못하고 사후 대 처하게 되어 많은 문제점을 안고 있으며, 최근 5년간 395건의 중대한 엘리베이터 안전사고가 발생하였다."}
{"patent_id": "10-2019-0061880", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "이에 따라 해당 기술분야에 있어서는 IoT 기술을 접목하여 이러한 문제점들을 해결함으로 4차 산업혁명으로 도 약하는 “예측”과 “예방”적인 측면에서 운용 가능하도록 하기 위한 기술개발이 요구되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 특허출원 출원번호 제10-1998-0043828(1998.10.20)호 \"엘리베이터의 표시제어장치 (DISPLAY CONTROL APPARATUS OF ELEVATOR FOR DISPLAYING INFORMATION THROUGH DISPLAY UNIT)\""}
{"patent_id": "10-2019-0061880", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기의 문제점을 해결하기 위한 것으로, 엘리베이터에 원격 모니터링 시스템이 최초에 엘리베이터에 형성되어 출시되고 있으나 이전의 엘리베이터에는 적용되지는 못하고 있으므로 설치된 엘리베이터에 IoT 기반의 센서(sensor)와 통신기술을 이용하여 엘리베이터의 상태를 수집-전송-저장-분석하고, 통합관제센터에서는 분석 된 정보로부터 사전 이상감지, 현장 A/S 요원에게 예방정비 통보, 고장 통보를 하도록 하기 위한 고객 안전을 위한 IoT 기반의 엘리베이터 모니터링 시스템 및 모니터링 방법을 제공하기 위한 것이다. 또한, 본 발명은 기존에 이상 감지에 따른 A/S 처리와 달리 사전에 이상을 감지하고 예방정비를 통보함으로써, 사고예방 및 A/S의 효율성을 높이도록 하기 위한 고객 안전을 위한 IoT 기반의 엘리베이터 모니터링 시스템 및 모니터링 방법을 제공하기 위한 것이다. 또한, 본 발명은 기존 엘리베이터업체들이 엘리베이터 상태를 확인하기 위해 자사의 전용장비를 이용하여 A/S 요원이 엘리베이터 제어반과 시리얼(serial) 통신으로 직접 연결하여 상태를 확인하고 이상 유무를 판단하지만 상당수 노후화된 제품은 그나마 정확하게 상태가 수집되지 않으므로, 상태 수집용 콘트롤러(MCU)를 제어반과 연 결하고, 프로토콜(protocol) 분석을 통해 엘리베이터의 상태를 수집하고, 프로토콜 분석이 불가능한 경우에는 콘트롤러에 부착된 각종 센서(온습도, 유해가스, 자이로, 정위치 등)들에 의해 지속 수집된 정보를 분석함으로 각 엘리베이터의 정상 작동 패턴(pattern)을 추출하여 정상운행 또는 고장발생 가능성 등을 예측하도록 하기 위 한 고객 안전을 위한 IoT 기반의 엘리베이터 모니터링 시스템 및 모니터링 방법을 제공하기 위한 것이다. 그러나 본 발명의 목적들은 상기에 언급된 목적으로 제한되지 않으며, 언급되지 않은 또 다른 목적들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0061880", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 목적을 달성하기 위해 본 발명의 실시예에 따른 고객 안전을 위한 IoT 기반의 엘리베이터 모니터링 방법 은, 통합관제센터(100u)가 관제용 DB 서버(100b)에 저장된 각 엘리베이터 ID 별 센싱정보를 분석하여 정상가동 패턴을 추출하여 관제용 DB 서버(100b)에 저장하는 제 1 단계; 통합관제센터(100u)가 정상가동패턴을 구성하는 각 센싱 파라미터별로 벗어나는지에 대한 분석을 수행하는 제 2 단계; 및 통합관제센터(100u)가 각 센싱 파라미 터별로 정상가동패턴을 벗어나는 경우, 정상가동패턴을 벗어나는 엘리베이터로 할당된 관제센터 모니터로 알람을 전송하는 제 3 단계; 를 포함하는 것을 특징으로 한다. 이때, 본 발명은, 상기 제 1 단계 이전에, 건물통합통신모듈과 CAN 통신으로 연결된 각 엘리베이터 형성된 엘리베이터 콘트롤러(600a)가 각 엘리베이터별 센서통신모듈로부터 미리 설정된 주기에 따라 센싱정보를 수집하는 제 1 준비 단계; 를 더 포함하는 것을 특징으로 한다. 또한, 본 발명은, 상기 제 1 준비 단계와 제 1 단계 이전 사이에, 통합관제센터(100u)가 네트워크 또는 IoT 통신망을 통해 건물통합통신모듈과 CAN 통신으로 연결된 엘리베이터 콘트롤러(600a)로부터 센싱 정보를 수신하여 각 엘리베이터 ID를 메타데이터로 센싱정보를 관제용 DB 서버(100b)에 저장하는 제 2 준비 단 계; 를 더 포함하는 것을 특징으로 한다. 또한, 본 발명은, 상기 제 3 단계 이후, 알람을 수신한 관제센터 모니터가 네트워크 또는 IoT 통신망 을 통해 알람에 해당하는 엘리베이터의 A/S 기사에 해당하는 모바일 단말로 자동 통화연결 방식 또는 Push 메시지 전송 방식을 통해 A/S 정보를 전송하는 제 4 단계; 를 더 포함하는 것을 특징으로 한다. 상기의 목적을 달성하기 위해 본 발명의 실시예에 따른 고객 안전을 위한 IoT 기반의 엘리베이터 모니터링 시스 템은, 관제용 서버(100a)에 의해 각 엘리베이터 ID 별 센싱정보를 분석에 따라 정상가동패턴이 추출되면 엘리베 이터 ID를 메타데이터로 정상가동패턴을 저장하는 관제용 DB 서버(100b); 및 정상가동패턴을 구성하는 각 센싱 파라미터별로 벗어나는지에 대한 분석을 수행하며, 각 센싱 파라미터별로 정상가동패턴을 벗어나는 경우, 정상 가동패턴을 벗어나는 엘리베이터로 할당된 관제센터 모니터로 알람을 전송하는 관제용 서버(100a); 를 포 함하는 것을 특징으로 한다.또한, 본 발명은, 건물통합통신모듈과 CAN 통신으로 연결되어 각 엘리베이터 형성되며, 각 엘리베이터별 센서통신모듈로부터 미리 설정된 주기에 따라 센싱정보를 수집하는 엘리베이터 콘트롤러(600a); 를 더 포 함하는 것을 특징으로 한다. 또한, 본 발명은, 관제용 서버(100a)가, 네트워크 또는 IoT 통신망을 통해 건물통합통신모듈과 CAN 통신으로 연결된 엘리베이터 콘트롤러(600a)로부터 센싱정보를 수신하여 각 엘리베이터 ID를 메타데이터로 센싱정보를 관제용 DB 서버(100b)에 저장하는 것을 특징으로 한다. 또한, 알람을 수신한 관제센터 모니터는, 네트워크 또는 IoT 통신망을 통해 알람에 해당하는 엘 리베이터의 A/S 기사에 해당하는 모바일 단말로 자동 통화연결 방식 또는 Push 메시지 전송 방식을 통해 A/S 정보를 전송하는 것을 특징으로 한다."}
{"patent_id": "10-2019-0061880", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따른 고객 안전을 위한 IoT 기반의 엘리베이터 모니터링 시스템 및 모니터링 방법은, 엘리 베이터에 원격 모니터링 시스템이 최초에 엘리베이터에 형성되어 출시되고 있으나 이전의 엘리베이터에는 적용 되지는 못하고 있으므로 설치된 엘리베이터에 IoT 기반의 센서(sensor)와 통신기술을 이용하여 엘리베이터의 상 태를 수집-전송-저장-분석하고, 통합관제센터에서는 분석된 정보로부터 사전 이상감지, 현장 A/S 요원에게 예방 정비 통보, 고장 통보를 할 수 있는 효과를 제공한다. 또한, 본 발명의 다른 실시예에 따른 고객 안전을 위한 IoT 기반의 엘리베이터 모니터링 시스템 및 모니터링 방 법은, 기존에 이상 감지에 따른 A/S 처리와 달리 사전에 이상을 감지하고 예방정비를 통보함으로써, 사고예방 및 A/S의 효율성을 높이도록 하기 위한 고객 안전 도모하는 효과를 제공한다. 뿐만 아니라, 본 발명의 다른 실시예에 따른 고객 안전을 위한 IoT 기반의 엘리베이터 모니터링 시스템 및 모니 터링 방법은, 기존 엘리베이터업체들이 엘리베이터 상태를 확인하기 위해 자사의 전용장비를 이용하여 A/S 요원 이 엘리베이터 제어반과 시리얼(serial) 통신으로 직접 연결하여 상태를 확인하고 이상 유무를 판단하지만 상당 수 노후화된 제품은 그나마 정확하게 상태가 수집되지 않으므로, 상태 수집용 콘트롤러(MCU)를 제어반과 연결하 고, 프로토콜(protocol) 분석을 통해 엘리베이터의 상태를 수집하고, 프로토콜 분석이 불가능한 경우에는 콘트 롤러에 부착된 각종 센서(온습도, 유해가스, 자이로, 정위치 등)들에 의해 지속 수집된 정보를 분석함으로 각 엘리베이터의 정상 작동 패턴(pattern)을 추출하여 정상운행 또는 고장발생 가능성 등을 예측하도록 하는 효과 를 제공한다."}
{"patent_id": "10-2019-0061880", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 바람직한 실시예의 상세한 설명은 첨부된 도면들을 참조하여 설명할 것이다. 하기에서 본 발명 을 설명함에 있어서, 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것이다. 본 명세서에 있어서는 어느 하나의 구성요소가 다른 구성요소로 데이터 또는 신호를 '전송'하는 경우에는 구성 요소는 다른 구성요소로 직접 상기 데이터 또는 신호를 전송할 수 있고, 적어도 하나의 또 다른 구성요소를 통 하여 데이터 또는 신호를 다른 구성요소로 전송할 수 있음을 의미한다. 도 1은 본 발명의 실시예에 따른 고객 안전을 위한 IoT 기반의 엘리베이터 모니터링 시스템을 나타내는 도면 이다. 도 1을 참조하면, 고객 안전을 위한 IoT 기반의 엘리베이터 모니터링 시스템은 통합관제센터(100u), 네트워크, IoT 통신망, 복수의 모바일 단말, 건물통합통신모듈, 사용자 건물(엘리베이터)장비(600u)를 포함할 수 있다. 통합관제센터(100u)는 복수의 관제센터 모니터, 그리고 관제용 서버(100a) 및 관제용 DB 서버(100b)를 포 함할 수 있다. 네트워크는 대용량, 장거리 음성 및 데이터 서비스가 가능한 대형 통신망의 고속 기간 망인 통신망이며, 인터넷(Internet) 또는 고속의 멀티미디어 서비스를 제공하기 위한 차세대 유선 및 무선 망일 수 있다. 네트워 크가 이동통신망일 경우 동기식 이동 통신망일 수도 있고, 비동기식 이동 통신망일 수도 있다. 비동기식 이동 통신망의 일 실시 예로서, WCDMA(Wideband Code Division Multiple Access) 방식의 통신망을 들 수 있다. 이 경우 도면에 도시되진 않았지만, 네트워크는 RNC(Radio Network Controller)을 포함할 수 있다. 한편, WCDMA망을 일 예로 들었지만, 3G LTE망, 4G망 그 밖의 5G 등 차세대 통신망, 그 밖의 IP를 기반으로 한 IP망일 수 있다. 네트워크는 통합관제센터(100u), IoT 통신망, 복수의 모바일 단말, 건물통합통신모듈 , 사용자 건물(엘리베이터) 장비(600u), 그 밖의 시스템 상호 간의 신호 및 데이터를 상호 전달하는 역할 을 한다. IoT 통신망은 네트워크와 게이트웨이(G/W)를 통해 연결되어 통합관제센터(100u) 및 건물통합통신모듈 , 그리고 모바일 단말 간의 IoT 기반의 신호 및 데이터 송수신을 수행하도록 하며, 게이트웨이(G/W) 는 프로토콜 변환기의 하나이며, 이동통신망을 통해 무선으로 접속하는 모바일 단말과 IP망을 통해 유선으 로 접속하는 통합관제센터(100u) 및 건물통합통신모듈 간의 데이터 송수신을 가능하게 한다. 게이트웨이는 왑게이트웨이(Wap Gateway)로서, 모바일 단말이 통합관제센터(100u) 및 건물통합통신모듈에 액세스 (Access)하기 위한 프로토콜 스택을 포함할 수 있다. 사용자 건물(엘리베이터) 장비(600u)는 엘리베이터에 설치되는 엘리베이터별 센서통신모듈 및 엘리베이터 콘트롤러(600a)를 포함한다. 그리고, 엘리베이터별 센서통신모듈은 온습도센서, 자이로센서, 정위치센서, 문열림센서 , 유해가스센서를 포함할 수 있다. 엘리베이터별 센서통신모듈은 엘리베이터에 설치된 각종 센서(sensor)들로 이루어지며, 수집된 센싱정보들 을 CAN(Controller Area Network) 통신으로 엘리베이터 제어반과 연결된 건물통합통신모듈에 전송하는 센 서 통신장비에 해당하여, 센싱정보의 전송은 엘리베이터 콘트롤러(600a)에 의해 수행될 수 있다. 건물통합통신모듈은 엘리베이터 제어반과 연결하여 각 엘리베이터별 센서통신모듈로부터 수집된 센싱 정보를 취합하고 각 엘리베이터 상태를 네트워크 또는 IoT 통신망으로 통합관제센터 (monitoring)(100u)에 전송한다. 통합관제센터(100u)는 복수의 관제센터 모니터, 그리고 관제용 서버(100a) 및 관제용 DB 서버(100b)를 포 함하며, 관제용 서버(100a)는 각 엘리베이터 콘트롤러(600a)로부터 전송된 센싱정보를 통신모듈(110a)을 통해 각 엘리베이터 ID 별로 관제용 DB 서버(100b)에 저장하고, 저장된 각 엘리베이터 ID 별 센싱정보를 분석하여 정 상가동패턴(pattern)이 추출되고, 정상 가동 패턴에서 벗어나는 경우 네트워크 및/또는 IoT 통신망을 거쳐 A/S정보를 모바일 단말로 전송하여 알려주도록 할 수 있다. 도 2는 본 발명의 실시예에 따른 고객 안전을 위한 IoT 기반의 엘리베이터 모니터링 시스템 중 관제용 서버 (100a)의 구성요소를 나타내는 블록도이다. 도 2를 참조하면, 관제용 서버(100a)는 통신모듈(110a), 분석모듈 (120a), 알람모듈(130a)을 포함할 수 있다. 보다 구체적으로, 통신모듈(110a)은 건물통합통신모듈과 CAN 통신으로 연결된 각 엘리베이터 형성된 엘리베이터 콘트롤러(600a)는 각 엘리베이터별 센서통신모듈로부터 미리 설정된 주기에 따라 센싱정보를 수집하면, CAN 통신으로 연결된 엘리베이터 콘트롤러(600a)로부터 센싱정 보를 수신한 건물통합통신모듈로부터 네트워크 및/또는 IoT 통신망을 통해 각 엘리베이터 ID를 메타데이터로 센싱정보를 수신하여 관제용 DB 서버(100b)에 저장한다. 보다 구체적으로, 센싱정보는 각 엘리베이터별 센서통신모듈에 포함된 온습도센서에 의해 측정된 온 습도 정보, 자이로센서에 의해 측정된 엘리베이터의 기울어진 각도 정보, 정위치센서에 의해 측정된 정위치 배열 정보, 문열림센서에 의해 측정된 정위치에서 문열림 작동 정보, 유해가스센서에 의해 측 정된 유해가스 정보를 포함할 수 있다. 여기서 정위치센서는 레이더 발광단 및 레이더 수광단, 또는 적외선 발광단 및 적외선 수광단을 구비하여 엘리베이터 외부면과 엘리베이터가 형성된 정차 위치의 벽변에 각기 발광단 및 수광단이 하나씩 형성되어 엘리베이터가 정차하는 위치에 해당하는 정위치에 대한 정보인 정위치 배열 정보를 생성할 수 있다. 문열림센서도 정위치센서와 동일한 구성인 레이더 발광단 및 레이더 수광단, 또는 적외선 발광단 및 적외선 수광단을 구비하여 엘리베이터 양문에 각기 발광단 및 수광단이 하나씩 형성되어 엘리베이터의 정위치에 서의 엘리베이터 양문의 동작 상태에 해당하는 문열림 작동 정보를 생성할 수 있다. 분석모듈(120a)은 관제용 DB 서버(100b)에 저장된 각 엘리베이터 ID 별 센싱정보를 분석하여 정상가동패턴을 추 출하여 관제용 DB 서버(100b)에 각 엘리베이터 ID를 메타데이터로 저장한다. 또한, 분석모듈(120a)은 정상가동패턴을 구성하는 각 센싱 파라미터 정보별로 벗어나는지에 대한 분석을 인공지 능 알고리즘을 통해 수행하여 벗어나는 각 센싱 파라미터 정보 및 엘리베이터 ID를 알람모듈(130a)로 전달한다. 보다 구체적으로, 분석모듈(120a)은 인공지능 알고리즘으로 머신러닝 기반으로 분석을 수행할 수 있다. 즉, 분 석모듈(120a)은 관제용 DB 서버(100b)에 각 엘리베이터 ID 별로 분산 저장된 센싱정보를 머신러닝 알고리즘을 통해 분석하고 정상가동패턴을 생성할 뿐만 아니라, 상태 관리 명령을 내릴 수 있다. 보다 구체적으로, 분석모 듈(120a)에서 사용되는 머신러닝 알고리즘은 결정 트리(DT, Decision Tree) 분류 알고리즘, 랜덤 포레스트 분류 알고리즘, SVM(Support Vector Machine) 분류 알고리즘 중 하나일 수 있다. 분석모듈(120a)은 관제용 DB 서버(100b)에 분산 저장된 센싱정보를 구성하는 각 파라미터 정보인 온습도 정보, 각도 정보, 정위치 배열 정보, 문열림 작동 정보, 유해가스 정보별로 분석하여 분석한 결과로 적어도 하나 이상 의 아날로그 전압 범위에 해당하는 특징 정보를 추출하고 추출된 특징 정보를 복수의 머신러닝 알고리즘 중 적 어도 하나 이상을 이용하여 학습하여 학습한 결과로 이상 상태 여부를 분석할 수 있다. 즉, 분석모듈(120a)은 각 파라미터 정보별 상태 여부 판단 결과의 정확도 향상을 위해 다수의 상호 보완적인 머 신러닝 알고리즘들로 구성된 앙상블 구조를 적용할 수 있다. 여기서 결정 트리 분류 알고리즘은 트리 구조로 학 습하여 결과를 도출하는 방식으로 결과 해석 및 이해가 용이하고, 데이터 처리 속도가 빠르며 탐색 트리 기반으 로 룰 도출이 가능할 수 있다. DT의 낮은 분류 정확도를 개선하기 위한 방안으로 RF를 적용할 수 있다. 랜덤 포 레스트 분류 알고리즘은 다수의 DT를 앙상블로 학습한 결과를 도축하는 방식으로, DT보다 결과 이해가 어려우나 DT보다 결과 정확도가 높을 수 있다. DT 또는 RF 학습을 통해 발생 가능한 과적합의 개선 방안으로 SVM을 적용 할 수 있다. SVM 분류 알고리즘은 서로 다른 분류에 속한 데이터를 평면 기반으로 분류하는 방식으로, 일반적으 로 높은 정확도를 갖고, 구조적으로 과적합(overfitting)에 낮은 민감도를 가질 수 있다. 또한, 분석모듈(120a)은 머신러닝 이후 정제된 데이터인 센싱정보를 구성하는 각 파라미터 정보별 이상 상태 여 부를 활용해 딥러닝 과정을 수행할 수 있다. 분석모듈(120a)에 의해 수행되는 딥러닝 방식의 일 예로, 각 파라 미터 정보별 이상 상태 여부를 분석하여 형성된 패턴 데이터별 반복 작업시 하나의 전체 프로세스에 소요되는 시간인 사이클 타임(Cycle time)과, 각 반복 작업을 구성하는 하나의 작업 시간의 최대 시간인 택트 타임(Tact time)의 감소를 최소화하는 방식으로 각 센싱정보의 공정 파라미터 정보에 대한 딥러닝 알고리즘 프로그램의 변 환 및 적용에 따라 수행될 수 있다. 본 발명의 다른 실시예로, 분석모듈(120a)은 기설치된 엘리베이터 제어반과 개발할 건물통합통신모듈이 시 리얼 통신방식으로 인터페이스 되어 있는 경우 엘리베이터의 상태를 확인하기 위한 엘리베이터 제어반과 인터페 이스 프로토콜을 분석할 수 있다. 분석모듈(120a)에 의한 분석 방식은 서비스 매뉴얼과 장비 스펙 시트를 참조 하여 시리얼통신 분석기를 연결한 후 엘리베이터가 작동중인 상태를 지속적으로 모니터링하면서 분석기로 입력 되는 정보를 분석하고, 엘리베이터의 상태와 매칭이 되는 제어값을 해석할 수 있으며, 프로토콜에 기술된 장비 인 경우는 장비별 프로토콜을 정리하여 관제용 DB 서버(100b)로 축적할 수 있다. 이후, 분석모듈(120a)은 각 엘리베이터의 상태정보를 바탕으로 분석하여 정상상태, 이상 징후가 있는 상태(엘리 베이터 이상종류별 이상파악 여부)를 일정 패턴으로 분석하여 찾아내는 방식은 상술한 머신러닝 및 딥러닝 방식 에 의할 수 있다. 알람모듈(130a)은 각 센싱 파라미터 정보별로 정상가동패턴을 벗어나 분석모듈(120a)로부터 각 센싱 파라미터 정보 및 엘리베이터 ID를 수신하는 경우, 정상가동패턴을 벗어나는 엘리베이터 ID로 할당된 관제센터 모니터 로 알람을 각 센싱 파라미터 정보 및 엘리베이터 ID를 포함하여 전송함으로써, 알람을 수신한 관제센터 모 니터에 의해 네트워크 및/또는 IoT 통신망을 통해 알람에 해당하는 엘리베이터의 A/S 기사에 해 당하는 모바일 단말로 자동 통화연결 방식 또는 Push 메시지 전송 방식을 통해 A/S 정보인 각 센싱 파라미 터 정보 및 엘리베이터 ID를 전송하도록 할 수 있다. 본 발명의 다른 실시예로, 분석모듈(120a)은 엘리베이터 ID 별로 온습도 정보, 각도 정보, 정위치 배열 정보, 정위치에서 문열림 작동 정보, 유해가스 정보를 저장 및 관리할 수 있다. 분석모듈(120a)은 통신모듈(110a)로부터 수신된 온습도 정보, 각도 정보, 정위치 배열 정보, 정위치에서 문열림 작동 정보, 유해가스 정보에 대한 시계열적인 추이변화를 각 엘리베이터 ID별로 각 엘리베이터 ID로 할당된 관 제센터 모니터로 출력하고, 관제센터 모니터로부터 오작동 이벤트 정보를 인가받는 경우, 이에 대한 이벤트 알람을 네트워크 및/또는 IoT 통신망을 통해 모바일 단말로 전송할 수 있다. 한편, 엘리베이터별 센서통신모듈은 도시되진 않았지만 엘리베이터용 CCTV가 더 포함될 수 있으며, 분석모 듈(120b)은 엘리베이터용 CCTV에서 촬영된 CCTV 영상을 토대로 각 엘리베이터 ID 별로 영상분석을 통한 시간대 의 인원수를 분석하여 엘리베이터에 대한 속도 정보를 생성할 수 있다. 분석모듈(120b)은 생성된 속도 정보를 네트워크 및/또는 IoT 통신망을 통해 건물통합통신모듈과 연결된 엘리베이터 제어반으로 전송함으로써, 각 엘리베이터에 대한 인원수에 비례하는 속도가 조절됨으로써, 엘리베이터에 대한 운용 능률을 극대화하도록 할 수 있다. 한편, 분석모듈(120b)은 속도 정보를 토대로 엘리베이터 종합현황 정보를 차트별 또는 색상별 그래프 생성하여 각 엘리베이터 ID별로 할당된 관제센터 모니터로 출력할 수 있으며, 속도 정보를 토대로 엘리베이터의 작 동상태(제어준비, 정상가동, 장비대기, 수동모드)를 시계열적인 정보로 변환하여 네트워크 및/또는 IoT 통 신망을 통해 건물통합통신모듈과 연결된 엘리베이터 제어반으로 전송함으로써, 각 엘리베이터에 대한 인원수에 비례하는 속도가 조절됨으로써, 엘리베이터에 대한 운용 능률을 극대화하도록 할 수 있다. 또한, 분석모듈(120b)은 엘리베이터의 작동상태 정보를 토대로 엘리베이터 ID별 작동 시각정보, 종료 시각정보, 엘리베이터별 알람의 발생시간, 일과의 종료시간 및 동작되는 경과시간 정보를 생성하여 네트워크 및/또는 IoT 통신망을 통해 모바일 단말로 전송하여 A/S 처리를 위한 보조 자료로 활용하도록 할 수 있다. 도 3은 본 발명의 실시예에 따른 고객 안전을 위한 IoT 기반의 엘리베이터 모니터링 방법을 나타내는 흐름도이 다. 도 3을 참조하면, 건물통합통신모듈과 CAN 통신으로 연결된 각 엘리베이터 형성된 엘리베이터 콘트롤 러(600a)는 각 엘리베이터별 센서통신모듈로부터 미리 설정된 주기에 따라 센싱정보를 수집한다(S110). 단계(S11) 이후, 통합관제센터(100u)는 네트워크 및/또는 IoT 통신망을 통해 건물통합통신모듈 과 CAN 통신으로 연결된 엘리베이터 콘트롤러(600a)로부터 센싱정보를 수신하여 각 엘리베이터 ID를 메타데이터 로 센싱정보를 관제용 DB 서버(100b)에 저장한다(S120). 단계(S120) 이후, 통합관제센터(100u)는 관제용 DB 서버(100b)에 저장된 각 엘리베이터 ID 별 센싱정보를 분석 하여 정상가동패턴을 추출하여 관제용 DB 서버(100b)에 저장한다(S130). 단계(S130) 이후, 통합관제센터(100u)는 정상가동패턴을 구성하는 각 센싱 파라미터별로 벗어나는지에 대한 분 석을 수행한다(S140). 단계(S140) 이후, 통합관제센터(100u)는 각 센싱 파라미터별로 정상가동패턴을 벗어나는 경우, 정상가동패턴을 벗어나는 엘리베이터로 할당된 관제센터 모니터로 알람을 전송한다(S150). 단계(S150) 이후, 알람을 수신한 관제센터 모니터는 네트워크 및/또는 IoT 통신망을 통해 알람 에 해당하는 엘리베이터의 A/S 기사에 해당하는 모바일 단말로 자동 통화연결 방식 또는 Push 메시지 전송 방식을 통해 A/S 정보를 전송한다(S160). 본 발명은 또한 컴퓨터로 읽을 수 있는 기록매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터가 읽을 수 있는 기록매체는 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기 록 장치를 포함한다. 컴퓨터가 읽을 수 있는 기록매체의 예로는 ROM, RAM, CD-ROM, 자기테이프, 플로피 디스크, 광 데이터 저장장치 등이 있으며, 또한 캐리어 웨이브(예를 들어, 인터넷을 통한 전송)의 형태로 구현되는 것도 포함한다. 또한 컴퓨터가 읽을 수 있는 기록매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 그리고 본 발명을 구현하기 위한 기능적인(functional) 프로그 램, 코드 및 코드 세그먼트들은 본 발명이 속하는 기술 분야의 프로그래머들에 의해 용이하게 추론될 수 있다. 이상과 같이, 본 명세서와 도면에는 본 발명의 바람직한 실시예에 대하여 개시하였으며, 비록 특정 용어들이 사 용되었으나, 이는 단지 본 발명의 기술 내용을 쉽게 설명하고 발명의 이해를 돕기 위한 일반적인 의미에서 사용 된 것이지, 본 발명의 범위를 한정하고자 하는 것은 아니다. 여기에 개시된 실시예 외에도 본 발명의 기술적 사 상에 바탕을 둔 다른 변형 예들이 실시 가능하다는 것은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 자명한 것이다."}
{"patent_id": "10-2019-0061880", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 고객 안전을 위한 IoT 기반의 엘리베이터 모니터링 시스템을 나타내는 도면 이다. 도 2는 본 발명의 실시예에 따른 고객 안전을 위한 IoT 기반의 엘리베이터 모니터링 시스템 중 관제용 서버 (100a)의 구성요소를 나타내는 블록도이다. 도 3은 본 발명의 실시예에 따른 고객 안전을 위한 IoT 기반의 엘리베이터 모니터링 방법을 나타내는 흐름도이 다."}
