{"patent_id": "10-2021-0096794", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0015539", "출원번호": "10-2021-0096794", "발명의 명칭": "맞춤형 차량 공조 제어 시스템 및 그 방법", "출원인": "한온시스템 주식회사", "발명자": "김중재"}}
{"patent_id": "10-2021-0096794", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "차량 내 위치한 센서부를 포함하며, 상기 센서부로부터 차량 내부 영역의 열화상 데이터를 측정하고, 측정한 상기 열화상 데이터를 이용하여 열화상 이미지를 생성하는 이미지 생성부(100);상기 이미지 생성부(100)로부터 상기 열화상 이미지를 전달받아, 상기 열화상 이미지에 포함되어 있는 다양한객체 관련 정보를 분석하는 이미지 분석부(200);상기 이미지 분석부(200)에서 분석한 상기 객체 관련 정보를 전달받아, 상기 객체 관련 정보 중 탑승자 관련 정보를 추출하고, 추출한 각 탑승자에 대한 열적 쾌적성 정보를 추론하는 추론부(300); 및상기 추론부(300)에서 추론한 상기 열적 쾌적성 정보를 이용하여, 기저장되어 있는 공조 제어 정보 중 매칭되는정보를 추출하여, 추출한 상기 정보로 차량 내 공조수단에 대한 동작 제어 신호를 생성하는 제어부(400);을 포함하며,상기 제어부(400)에서 생성한 상기 동작 제어 신호에 의해 차량 내 공조 수단의 동작이 제어되는 동안, 탑승자로부터 입력되는 공조 수단에 대한 조작 신호 정보를 수집하여, 인공지능 알고리즘을 이용한 학습을 수행하여,학습 결과를 이용하여, 상기 추론부(300)에서 추론한 상기 열적 쾌적성 정보를 보정하거나 또는, 상기 제어부(400)에 저장된 상기 공조 제어 정보의 업데이트를 수행하는 AI 학습부(500);를 더 포함하는, 맞춤형 공조 제어 시스템."}
{"patent_id": "10-2021-0096794", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 이미지 분석부(200)는상기 열화상 이미지를 이루고 있는 열화상 데이터를 기준으로 기설정된 객체 항목을 구분하여, 상기 열화상 이미지에 포함되어 있는 객체 관련 정보를 분석하는 열 분석부(210);를 더 포함하는, 맞춤형 공조 제어 시스템."}
{"patent_id": "10-2021-0096794", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 이미지 분석부(200)는외부로부터 차량 내부 관련 이미지들, 사람의 연령대에 따른 온도 픽셀의 분포도 정보 및 사람의 연령대에 따른온도 픽셀의 밀집도 정보 중 적어도 하나 이상을 포함하는 학습 데이터를 수집하여, 기설정된 인공지능 알고리즘을 이용하여 학습 처리를 수행하는 이미지 학습 처리부(220); 및상기 이미지 학습 처리부(220)의 학습 결과 모델을 이용하여, 상기 열화상 이미지에 포함되어 있는 상기 객체관련 정보를 분석하는 정밀 분석부(230);를 더 포함하는, 맞춤형 공조 제어 시스템."}
{"patent_id": "10-2021-0096794", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서,공개특허 10-2023-0015539-3-상기 추론부(300)는기저장되어 있는 추론 알고리즘에 현재 차량 외부 환경 관련 정보, 상기 이미지 분석부(200)에서 분석한 상기객체 관련 정보 및 사람의 연령대에 따른 신진대사량 정보를 적용하여, 각 탑승자에 대한 열적 쾌적성 정보를추론하는, 맞춤형 공조 제어 시스템."}
{"patent_id": "10-2021-0096794", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1항에 있어서,상기 AI 학습부(500)는차량 내 공조 수단의 동작이 자동 제어되는 동안, 탑승자로부터 수동 입력되는 공조 수단에 대한 조작 신호 정보를 수집하는 패턴 입력부(510);상기 패턴 입력부(510)에서 수집한 상기 조작 신호 정보와 상기 조작 신호 정보가 입력된 시점의 차량 외부 환경 정보 및 상기 추론부(300)에서 추출한 상기 탑승자 관련 정보를 이용하여, 기설정된 인공지능 알고리즘을 이용하여 학습 처리를 수행하는 공조 학습 처리부(520); 및상기 공조 학습 처리부(520)의 학습 결과 모델을 이용하여, 각 탑승자 별로 상기 추론부(300)에서 추론한 상기열적 쾌적성 정보를 보정하거나, 또는, 상기 제어부(400)에 저장된 상기 공조 제어 정보의 업데이트를 수행하는보정부(530);를 더 포함하여,차량 내 공조 수단의 동작이 탑승자 맞춤형으로 자동 제어되도록 하는, 맞춤형 공조 제어 시스템."}
{"patent_id": "10-2021-0096794", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "이미지 생성부에서, 차량 내 위치한 센서부로부터 측정한 차량 내부 영역의 열화상 데이터를 전달받는 열 측정단계(S100);이미지 생성부에서, 상기 열 측정 단계(S100)에 의해 전달받은 상기 열화상 데이터를 이용하여, 열화상 이미지를 생성하는 이미지 생성 단계(S200);이미지 분석부에서, 상기 이미지 생성 단계(S200)에서 생성한 상기 열화상 이미지를 전달받아, 상기 열화상 이미지에 포함되어 있는 다양한 객체 관련 정보를 분석하는 이미지 분석 단계(S300);추론부에서, 상기 이미지 분석 단계(S300)에 의해 분석한 상기 객체 관련 정보를 전달받아, 탑승자 관련 정보를추출하고 각 탑승자에 대한 열적 쾌적성 정보를 추론하는 추론 단계(S400);제어부에서, 상기 추론 단계(S400)에 의해 추론한 각 탑승자에 대한 열적 쾌적성 정보를 이용하여, 기저장되어있는 공조 제어 정보 중 매칭되는 정보를 추출하여, 각 탑승자에 대응되는 차량 내 공조 수단에 대한 동작 제어신호를 생성하여, 차량 내 공조 수단의 동작을 자동 제어하는 공조 제어 단계(S500);AI 학습부에서, 상기 공조 제어 단계(S500)에 의해 차량 내 공조 수단의 동작이 자동 제어되는 동안, 탑승자로부터 수동 입력되는 공조 수단에 대한 조작 신호 정보를 수집하는 패턴 수집 단계(S600);AI 학습부에서, 상기 패턴 수집 단계(S600)에 의해 수집한 상기 조작 신호 정보를 포함하는 학습 데이터를 수집하여 인공지능 알고리즘을 이용한 학습을 수행하는 학습 처리 단계(S700); 및AI 학습부에서, 상기 학습 처리 단계(S700)에 의한 학습 결과를 이용하여, 추론한 상기 열적 쾌적성 정보를 보정하거나 또는, 저장되어 있는 공조 제어 정보의 업데이트를 수행하여, 탑승자 맞춤형 차량 공조 수단의 자동제어를 제공하는 맞춤형 공조 제어 단계(S700);를 포함하는, 맞춤형 공조 제어 방법.공개특허 10-2023-0015539-4-청구항 7 제 6항에 있어서,상기 이미지 분석 단계(S300)는상기 열화상 이미지를 이루고 있는 열화상 데이터를 기준으로 기설정된 객체 항목을 구분하여, 상기 열화상 이미지에 포함되어 있는 객체 관련 정보를 분석하는 열 분석 단계(S310);를 더 포함하는, 맞춤형 공조 제어 방법."}
{"patent_id": "10-2021-0096794", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6항에 있어서,상기 이미지 분석 단계(S300)는외부로부터 차량 내부 관련 이미지들, 사람의 연령대에 따른 온도 픽셀의 분포도 정보 및 사람의 연령대에 따른온도 픽셀의 밀집도 정보 중 적어도 하나 이상을 포함하는 학습 데이터를 수집하여, 기설정된 인공지능 알고리즘을 이용하여 학습 처리를 수행하는 이미지 학습 단계(S320); 및상기 이미지 학습 단계(S320)의 학습 결과 모델을 이용하여, 상기 열화상 이미지에 포함되어 있는 객체 관련 정보를 분석하는 정밀 분석 단계(S330);를 더 포함하는, 맞춤형 공조 제어 방법."}
{"patent_id": "10-2021-0096794", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 6항에 있어서,상기 학습 처리 단계(S700)는상기 패턴 수집 단계(S600)에 의해 수집한 상기 조작 신호 정보, 상기 조작 신호 정보가 입력된 시점의 차량 외부 환경 정보 및 상기 추론 단계(S300)에 의해 추출한 상기 탑승자 관련 정보 중 적어도 하나 이상을 포함하는학습 데이터를 수집하여 학습 처리를 수행하는, 맞춤형 공조 제어 방법."}
{"patent_id": "10-2021-0096794", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 맞춤형 차량 공조 제어 시스템 및 그 방법에 관한 것이다. 본 발명의 목적은 열화상 측정을 통해 차량 내 탑승자의 열적 쾌적성 정보를 측정하여, 탑승자 개인별 맞춤형 차내 공조 제어를 제공할 수 있는 맞춤형 공조 제어 시스템 및 그 방법에 관한 것이다."}
{"patent_id": "10-2021-0096794", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 맞춤형 차량 공조 제어 시스템 및 그 방법에 관한 것으로, 보다 상세하게는 차량 내 탑승자의 열화상 측정을 통해 생성한 열화상 이미지를 이용하여, 탑승자가 느끼는 열적 쾌적성 정보를 추론하여 탑승자 맞춤형 공조 상태 제어를 제공하되, 인공지능 학습을 이용하여 공조 수단의 사용 패턴을 포함한 다양한 외부 정보에 대 한 학습을 수행하여, 개인의 공조 취향을 적용한 가장 최적의 맞춤형 공조 상태 제어를 제공할 수 있는 맞춤형 차량 공조 제어 시스템 및 그 방법에 관한 것이다."}
{"patent_id": "10-2021-0096794", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "종래에는 차량 내 공조 수단의 자동 공조 제어를 수행함에 있어서, 외기온 또는 차량 내부 온도를 기준으로 입 력되는 설정온도에 도달할 수 있도록 토출되는 풍온 또는 풍량을 자동 제어하고 있다. 보다 발전된 기술로, 시트에 구비된 압력 센서 또는 차량 내 구비된 초음파 센서를 이용하여 운전자를 포함하는 차량 내 탑승자의 존재 유무/탑승 유무를 판단하여, 탑승자가 위치한 좌석과 연계되어 있는 벤트를 제어하여 풍 온/풍량/풍향을 자동 제어하고 있다. 그렇지만, 탑승자의 공조 취향에 따라 자동 제어되고 있는 공조 제어 정도에 만족하지 못하고, 추가적으로 수동 제어를 수행하고 있는 실정이다. 특히, 상업용 렌터카가 아닌, 일반적인 차량의 주 탑승자인 운전자가 자동제어되고 있는 공조 제어 정도에 만족 하지 못하고, 추가적으로 수동 제어를 수행할 경우, 자동 공조 제어라는 근본적인 목적을 달성하지 못하는 문제 점이 있을 뿐 아니라, 이로 인해 운전 집중도가 흐트러지는 또다른 문제점이 있다. 이와 관련하여, 국내 공개 특허 제10-2019-0090739호(\"열적 쾌적성 기반의 공조 방법 및 공조기\")에서는 딥러닝 을 수행하는 인공 신경망을 이용한 열화상 기반의 인체의 열적 쾌적성 추정 및 열적 쾌적성 정보 기반의 공조 제어를 포함하여, 과도하거나 부족한 공조 제어로 인한 더위 또는 추위에 의해 발생하는 불쾌감을 방지할 수 있 는 방법 및 공조기를 개시하고 있다. 그렇지만, 이는 개개인 맞춤형 공조 제어가 아닌, 평균치를 토대로 이루어 지는 공조 제어이기 때문에, 보다 개인적인 공조 취향의 적용이 가능한 차량에 적용할 경우, 상술한 바와 같은 문제점을 그대로 포함하게 된다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제10-1199665호(등록일자 2012.11.02.)"}
{"patent_id": "10-2021-0096794", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명은 상기한 바와 같은 종래 기술의 문제점을 해결하기 위하여 안출된 것으로, 본 발명의 목적은 인공지능 알고리즘을 이용하여 탑승자의 공조 수단 사용 패턴을 포함한 다양한 외부 정보에 대한 학습을 수행하 고, 학습 결과를 적용하여 가장 최적의 맞춤형 공조 상태 제어를 수행할 수 있는 맞춤형 차량 공조 제어 시스템 및 그 방법을 제공함에 있다."}
{"patent_id": "10-2021-0096794", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 목적을 달성하기 위한 본 발명의 맞춤형 차량 공조 제어 시스템은, 차량 내 위치한 센서부를 포함하며, 상기 센서부로부터 차량 내부 영역의 열화상 데이터를 측정하고, 측정한 상기 열화상 데이터를 이용 하여 열화상 이미지를 생성하는 이미지 생성부, 상기 이미지 생성부로부터 상기 열화상 이미지를 전 달받아, 상기 열화상 이미지에 포함되어 있는 다양한 객체 관련 정보를 분석하는 이미지 분석부, 상기 이 미지 분석부에서 분석한 상기 객체 관련 정보를 전달받아, 상기 객체 관련 정보 중 탑승자 관련 정보를 추 출하고, 추출한 각 탑승자에 대한 열적 쾌적성 정보를 추론하는 추론부 및 상기 추론부에서 추론한 상기 열적 쾌적성 정보를 이용하여, 기저장되어 있는 공조 제어 정보 중 매칭되는 정보를 추출하여, 추출한 상 기 정보로 차량 내 공조수단에 대한 동작 제어 신호를 생성하는 제어부을 포함하며, 상기 제어부에서 생성한 상기 동작 제어 신호에 의해 차량 내 공조 수단의 동작이 제어되는 동안, 탑승자로부터 입력되는 공조 수단에 대한 조작 신호 정보를 수집하여, 인공지능 알고리즘을 이용한 학습을 수행하여, 학습 결과를 이용하여, 상기 추론부에서 추론한 상기 열적 쾌적성 정보를 보정하거나 또는, 상기 제어부에 저장된 상기 공조 제어 정보의 업데이트를 수행하는 AI 학습부를 더 포함하는 것이 바람직하다. 더 나아가, 상기 이미지 분석부는 상기 열화상 이미지를 이루고 있는 열화상 데이터를 기준으로 기설정된 객체 항목을 구분하여, 상기 열화상 이미지에 포함되어 있는 객체 관련 정보를 분석하는 열 분석부를 더 포함하는 것이 바람직하다. 더 나아가, 상기 이미지 분석부는 외부로부터 차량 내부 관련 이미지들, 사람의 연령대에 따른 온도 픽셀 의 분포도 정보 및 사람의 연령대에 따른 온도 픽셀의 밀집도 정보 중 적어도 하나 이상을 포함하는 학습 데이 터를 수집하여, 기설정된 인공지능 알고리즘을 이용하여 학습 처리를 수행하는 이미지 학습 처리부 및 상 기 이미지 학습 처리부의 학습 결과 모델을 이용하여, 상기 열화상 이미지에 포함되어 있는 상기 객체 관 련 정보를 분석하는 정밀 분석부를 더 포함하는 것이 바람직하다. 더 나아가, 상기 추론부는 기저장되어 있는 추론 알고리즘에 현재 차량 외부 환경 관련 정보, 사람의 연령 대에 따른 신진대사량 정보 및 상기 이미지 분석부에서 분석한 상기 객체 관련 정보를 적용하여, 각 탑승자에 대한 열적 쾌적성 정보를 추론하는 것이 바람직하다. 더 나아가, 상기 AI 학습부는 차량 내 공조 수단의 동작이 자동 제어되는 동안, 탑승자로부터 수동 입력되 는 공조 수단에 대한 조작 신호 정보를 수집하는 패턴 입력부, 상기 패턴 입력부에서 수집한 상기 조 작 신호 정보와 상기 조작 신호 정보가 입력된 시점의 차량 외부 환경 정보 및 상기 추론부에서 추출한 상 기 탑승자 관련 정보를 이용하여, 기설정된 인공지능 알고리즘을 이용하여 학습 처리를 수행하는 공조 학습 처 리부 및 상기 공조 학습 처리부의 학습 결과 모델을 이용하여, 각 탑승자 별로 상기 추론부에서 추론한 상기 열적 쾌적성 정보를 보정하거나, 또는, 상기 제어부에 저장된 상기 공조 제어 정보의 업데이 트를 수행하는 보정부를 더 포함하여, 차량 내 공조 수단의 동작이 탑승자 맞춤형으로 자동 제어되도록 하 는 것이 바람직하다. 상기한 바와 같은 목적을 달성하기 위한 본 발명의 맞춤형 차량 공조 제어 방법은, 이미지 생성부에서, 차량 내 위치한 센서부로부터 측정한 차량 내부 영역의 열화상 데이터를 전달받는 열 측정 단계(S100), 이미지 생성부에 서, 상기 열 측정 단계(S100)에 의해 전달받은 상기 열화상 데이터를 이용하여, 열화상 이미지를 생성하는 이미 지 생성 단계(S200), 이미지 분석부에서, 상기 이미지 생성 단계(S200)에서 생성한 상기 열화상 이미지를 전달 받아, 상기 열화상 이미지에 포함되어 있는 다양한 객체 관련 정보를 분석하는 이미지 분석 단계(S300), 추론부 에서, 상기 이미지 분석 단계(S300)에 의해 분석한 상기 객체 관련 정보를 전달받아, 탑승자 관련 정보를 추출 하고 각 탑승자에 대한 열적 쾌적성 정보를 추론하는 추론 단계(S400), 제어부에서, 상기 추론 단계(S400)에 의 해 추론한 각 탑승자에 대한 열적 쾌적성 정보를 이용하여, 기저장되어 있는 공조 제어 정보 중 매칭되는 정보 를 추출하여, 각 탑승자에 대응되는 차량 내 공조 수단에 대한 동작 제어 신호를 생성하여, 차량 내 공조 수단 의 동작을 자동 제어하는 공조 제어 단계(S500), AI 학습부에서, 상기 공조 제어 단계(S500)에 의해 차량 내 공 조 수단의 동작이 자동 제어되는 동안, 탑승자로부터 수동 입력되는 공조 수단에 대한 조작 신호 정보를 수집하 는 패턴 수집 단계(S600), AI 학습부에서, 상기 패턴 수집 단계(S600)에 의해 수집한 상기 조작 신호 정보를 포 함하는 학습 데이터를 수집하여 인공지능 알고리즘을 이용한 학습을 수행하는 학습 처리 단계(S700) 및 AI 학습 부에서, 상기 학습 처리 단계(S700)에 의한 학습 결과를 이용하여, 추론한 상기 열적 쾌적성 정보를 보정하거나 또는, 저장되어 있는 공조 제어 정보의 업데이트를 수행하여, 탑승자 맞춤형 차량 공조 수단의 자동 제어를 제 공하는 맞춤형 공조 제어 단계(S700)를 포함하는 것이 바람직하다. 더 나아가, 상기 이미지 분석 단계(S300)는 상기 열화상 이미지를 이루고 있는 열화상 데이터를 기준으로 기설 정된 객체 항목을 구분하여, 상기 열화상 이미지에 포함되어 있는 객체 관련 정보를 분석하는 열 분석 단계 (S310)를 더 포함하는 것이 바람직하다. 더 나아가, 상기 이미지 분석 단계(S300)는 외부로부터 차량 내부 관련 이미지들, 사람의 연령대에 따른 온도 픽셀의 분포도 정보 및 사람의 연령대에 따른 온도 픽셀의 밀집도 정보 중 적어도 하나 이상을 포함하는 학습 데이터를 수집하여, 기설정된 인공지능 알고리즘을 이용하여 학습 처리를 수행하는 이미지 학습 단계(S320) 및 상기 이미지 학습 단계(S320)의 학습 결과 모델을 이용하여, 상기 열화상 이미지에 포함되어 있는 객체 관련 정 보를 분석하는 정밀 분석 단계(S330)를 더 포함하는 것이 바람직하다. 더 나아가, 상기 학습 처리 단계(S700)는 상기 패턴 수집 단계(S600)에 의해 수집한 상기 조작 신호 정보, 상기 조작 신호 정보가 입력된 시점의 차량 외부 환경 정보 및 상기 추론 단계(S300)에 의해 추출한 상기 탑승자 관 련 정보 중 적어도 하나 이상을 포함하는 학습 데이터를 수집하여 학습 처리를 수행하는 것이 바람직하다."}
{"patent_id": "10-2021-0096794", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 맞춤형 차량 공조 제어 시스템 및 그 방법은 인공지능 알고리즘을 이용하여 탑승자의 공조 수단 사용 패턴을 포함한 다양한 외부 정보에 대한 학습을 수행하고, 학습 결과를 적용하여 가장 최적의 개인화 된 맞춤형 공조 상태 제어를 수행할 수 있는 장점이 있다. 즉, 종래의 기술을 통해서 또는 다양한 항목의 조건들을 반영한 맞춤형 공조 제어 서비스를 통해서, 평균화하여 제공되는 공조 제어 정보를 기준으로 차량 내 공조 수단의 동작이 자동 제어됨에도 불구하고, 탑승자로부터 공 조 수단에 대한 조작 신호 정보가 입력된다면, 동일한 또는 유사한 열적 쾌적성 정보를 갖고 있는 탑승자라 하 더라도 개개인마다 느끼는 온/냉감이 상이하다는 것을 의미하기 때문에, 이를 감안하여 보다 개인화하여 맞춤형 으로 공조 제어 서비스를 제공하기 위하여, 공조 수단의 자동 제어가 이루어지는 동안 수집되는 수동 제어 패턴 을 학습하여, 가장 최적의 개인화된 맞춤형 공조 제어 서비스를 제공할 수 있다."}
{"patent_id": "10-2021-0096794", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 상기한 바와 같은 구성을 가지는 본 발명에 의한 맞춤형 차량 공조 제어 시스템 및 그 방법을 첨부된 도 면을 참고하여 상세하게 설명한다. 더불어, 시스템은 필요한 기능을 수행하기 위하여 조직화되고 규칙적으로 상호 작용하는 장치, 기구 및 수단 등 을 포함하는 구성 요소들의 집합을 의미한다. 본 발명의 일 실시예에 따른 맞춤형 차량 공조 제어 시스템 및 그 방법은, 차량 내부의 공기 온도 측정이 아닌, 열화상 측정을 통해 탑승자의 열적 쾌적성 정보를 추론하여, 개인별 맞춤형 공조 제어를 제공할 수 있는 시스템 및 방법이다. 특히, 주로 자주 운전하는 탑승자(운전자)이 정해져 있는 차량의 특성 상, 추론한 열적 쾌적성 정 보와 운전자의 공조 수단에 대한 사용 패턴(조작 패턴)을 접목하여 인공지능 학습 처리를 수행하여, 공조 수단 의 조작을 최소화할 수 있는, 가능하면 공조 수단의 조작 없이 탑승자, 특히 운전자의 공조 취향에 맞는 공조 제어 서비스를 제공할 수 있는 시스템 및 방법에 관한 것이다. 더 나아가, 운전자로부터 세부적인 개인 정보(연령, 성별 등)를 입력받아, 이를 학습 데이터에 추가할 경우, 차 량의 외부 환경 정보와, 입력받은 개인 정보를 추가하여 인공지능 학습 처리를 수행하고, 외부 환경 정보와 개 인 정보를 기준으로 그룹화하여 저장 및 관리할 경우, 이를 공조 수단의 초기 제어 설정에 활용함으로써, 차량 내 공조 제어에 의한 만족도를 극대화시킬 수 있는 장점이 있다. 이러한 본 발명의 일 실시예에 따른 맞춤형 공조 제어 시스템은 도 1에 도시된 바와 같이, 이미지 생성부, 이미지 분석부, 추론부, 제어부 및 AI 학습부를 포함하여 구성되는 것이 바람직하다. 이 때, 각각의 구성들은 컴퓨터를 포함하는 하나의 연산처리수단 또는 각각의 연산처리수단에 포함되어 동작을 수 행하는 것이 바람직하다. 각 구성에 대해서 자세히 알아보자면, 상기 이미지 생성부는 차량 내 위치한 센서부를 포함하며, 상기 센서부로부터 차량 내부 영역의 열화상 데 이터를 측정하고, 측정한 상기 열화상 데이터를 이용하여 열화상 이미지를 생성하는 것이 바람직하다. 상세하게는, 상기 이미지 생성부는 차량 내 소정 영역에 부착 구비되는 적어도 하나의 적외선 센서(IR 센 서)로 이루어지는 상기 센서부를 이용하여, 차량 내부 영역의 열화상 데이터를 측정하는 것이 바람직하다. 차량 내부 전체 영역을 효과적으로 측정하기 위하여, 상기 센서부를 이루고 있는 적외선 센서의 개수 또는 부착 구비 되는 위치에 대해서는 한정하지 않으며, 이는 적외선 센서 자체의 스펙에 따라 상이하게 제어하는 것이 바람직 하다. 상기 이미지 분석부는 상기 이미지 생성부로부터 생성한 상기 열화상 이미지를 전달받아, 상기 열화 상 이미지에 포함되어 있는 다양한 객체 관련 정보를 분석하는 것이 바람직하다. 즉, 상기 이미지 분석부는 상기 열화상 이미지에 포함되어 있는 다양한 객체 관련 정보인 탑승자, 차량 내 부 구성품(유리, 시트, 루프 등) 등을 구분하여 분석하는 것이 바람직하다. 이 때, 상기 이미지 분석부는 탑승자을 구분하여 분석함에 있어서, 탑승자 개개인을 구분하여 분석하거나, 탑승자을 그룹지어 구분하여 분석 할 수 있다. 추후에 수행되는 연산량 또는 통신량 등을 감소시키기 위해서는, 운전집중도가 요구되는 운전자는 개별 구분하여 분석하고, 나머지 탑승자들을 하나의 그룹으로 구분하여 분석하는 것이 가장 바람직하나, 이는 일 실시예에 불과하고, 시스템을 제공하는 제공자의 요구에 따라 제어되는 것이 바람직하다. 상기 이미지 분석부는 상술한 바와 같이, 상기 열화상 이미지에 포함되어 있는 다양한 객체 관련 정보를 분석하기 위하여, 도 1에 도시된 바와 같이, 열 분석부를 포함하는 것이 바람직하다. 상기 열 분석부는 상기 열화상 이미지를 이루고 있는 열화상 데이터를 기준으로 미리 설정된 객체 항목을 구분하여, 상기 열화상 이미지에 포함되어 있는 객체 관련 정보를 분석하는 것이 바람직하다. 상세하게는, 상기 열 분석부는 상기 열화상 데이터를 단순하게 해석하여, 사람일 경우 소정 온도 범위의 온도 픽셀이 분포되고, 사람이 아닐 경우(동물, 사물 등), 소정 온도 범위를 벗어나는 온도 픽셀이 분포되는 것 을 반영하여, 차량 내 소정 영역(운전석, 보조석, 후석 등)에 위치하고 있는 사람(미리 설정된 객체 항목)을 구 분하여, 이에 대한 객체 관련 정보로 체온 정보를 분석하는 것이 바람직하다. 이 경우, 탑승자의 존재 유무를 판단하고, 탑승자가 존재할 경우, 해당하는 탑승자의 체온 정보를 분석할 수 있 으나, 평균적으로 성인과는 신진대사량이 상이한 유아가 탑승할 경우 또는, 신체가 노출된 부위(일 예를 들자면, 긴팔 상의를 입고 있는 경우, 반팔 상의를 입고 있는 경우)를 고려하지 않고 탑승자의 체온 정보만을 분석할 경우, 추후에 객체 관련 정보를 토대로 추론한 열적 쾌적성 정보의 정확성이 낮아지는 문제점이 있다. 즉, 평균적으로 성인과는 신진대사량이 상이한 유아에게 성인과 동일한 기준으로 열적 쾌적성 정보를 추론하고, 이에 맞는 자동 공조 제어를 제공할 경우, 더위 또는 추위에 의해 발생할 수 있다. 이러한 점을 고려하여, 상기 이미지 분석부는 도 1에 도시된 바와 같이, 이미지 학습 처리부 및 정밀 분석부를 더 포함하여 구성되는 것이 바람직하다. 상기 이미지 학습 처리부는 외부로부터 차량 내부 관련 이미지들, 다시 말하자면, 차량 출시시 고정되는 내부 구성들의 각 위치를 학습하기 위한 이미지들, 사람의 연령대에 따른 온도 픽셀의 분포도 정보 및 사람의 연령대에 따른 온도 픽셀의 밀집도 정보 중 적어도 하나 이상을 포함하는 학습 데이터를 수집하는 것이 바람직 하다. 상기 이미지 학습 처리부는 미리 설정된 인공지능 알고리즘을 이용하여, 수집한 상기 학습 데이터들의 학 습 처리를 수행하는 것이 바람직하다. 상기 정밀 분석부는 상기 이미지 학습 처리부의 학습 결과 모델을 이용하여, 상기 열화상 이미지에 포함되어 있는 상기 객체 관련 정보들을 정밀 분석하는 것이 바람직하다. 일 예를 들자면, 상기 정밀 분석부는 탑승자과 사물(시트, 창문, 루프 등 차량 내부 객체 항목)을 구분할 수 있으며, 구분한 탑승자에 대한 온도 픽셀의 분포도 정보/밀집도 정보를 활용하여, 의복 착용 부위와 비착용 부위를 추가 구분할 수 있다. 또한, 구분한 탑승자에 대한 온도 픽셀의 분포도 정보/밀집도 정보를 활용하여, 성인과 유아를 추가 구분할 수 도 있다. 상기 정밀 분석부는 이렇게 구분한 상기 객체 항목들에 대한 객체 관련 정보(온도 정보 등)를 분석하는 것 이 바람직하다. 상기 추론부는 상기 이미지 분석부에서 구분한 각 객체 항목들에 대한 분석한 상기 객체 관련 정보들 을 전달받아, 상기 객체 관련 정보들 중 탑승자 관련 정보들을 추출하는 것이 바람직하다. 즉, 차량 시트의 온도를 기준으로 공조 제어를 제공할 필요가 없기 때문에, 탑승자 관련 정보만을 추출하고, 추 출한 각 탑승자에 대한 열적 쾌적성 정보를 추론하는 것이 바람직하다. 상세하게는, 상기 추론부는 미리 저장되어 있는 추론 알고리즘을 이용하여, 현재 차량 외부 환경 관련 정 보, 상기 이미지 분석부에서 분석한 상기 객체 관련 정보들 중 탑승자 관련 정보들 및 사람의 연령대에 따 른 신진대사량 정보를 적용하여, 각각의 탑승자에 대한 열적 쾌적성 정보를 추론하는 것이 바람직하다. 즉, 하기의 수학식 1과 같은 추론 알고리즘을 이용하여, 탑승자에 대한 의복 비착용 부위 온도 정보, 탑승자에 대한 의복 착용 부위 온도 정보, 차량 실내에 구성되어 있는 객체(시트 등) 온도 정보, 외부 환경에 의한 유입 공기 온도, 주행에 따른 유입 풍속, 예측되는 연령대에 대한 신진대사량 정보, 탑승자의 탑승 위치 정보 등을 적용하여, 열적 쾌적성 정보를 추론하는 것이 바람직하다. 수학식 1 여기서, 각 변수들은 하기의 표 1과 같다. 표 1"}
{"patent_id": "10-2021-0096794", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상기 제어부는 상기 추론부에서 추론한 각 탑승자 별 열적 쾌적성 정보를 이용하여, 미리 저장되어 있는 공조 제어 정보 중 매칭되는 정보를 추출하여, 추출한 상기 공조 제어 정보로 차량 내 공조 수단에 대한 동작 제어 신호를 생성하는 것이 바람직하다. 다시 말하자면, 상기 제어부는 상기 추론부에서 추론한 각 탑승자 별 열적 쾌적성 정보를 이용하여, 미리 저장되어 있는 공조 제어 정보(일 예를 들자면, 1. 성인의 열적 쾌적성 정보가 A 값일 경우, 해당하는 풍 향/풍량/풍온/유지시간 정보, 2. 유아의 열적 쾌적성 정보가 B 값일 경우, 해당하는 풍향/풍량/풍온/유지시간 정보 등) 중 매칭되는 정보를 추출하여, 추출한 상기 공조 제어 정보로 차량 내 공조 수단에 대한 동작 제어 신 호를 생성하는 것이 바람직하다. 이 때, 미리 저장되어 있는 공조 제어 정보로는, 소정 기간 동안 설정한 특정 실험군으로부터 외부 온도 조건에 따라 수동 제어하는 공조 패턴을 수집하여 공조 수단의 초기 동작 제어를 위해 설정하는 것이 가장 바람직하며, 단순하게 외기를 기준으로 임의로 설정할 수도 있으며, 이에 대해서 한정하는 것은 아니다. 상기 AI 학습부는 상기 제어부에서 생성한 상기 동작 제어 신호에 의해 차량 내 공조 수단의 동작이 자동 제어되는 동안, 탑승자로부터 입력되는 공조 수단에 대한 조작 신호 정보를 수집하여, 미리 저장되어 있는 인공지능 알고리즘을 이용한 학습을 수행하고, 학습 결과를 이용하여 상기 추론부에서 추론한 탑승자의 열 적 쾌적성 정보를 보정하거나, 또는, 상기 제어부에 저장되어 있는 상기 공조 제어 정보의 업데이트를 수 행하는 것이 바람직하다. 즉, 상술한 바와 같이, 본 발명의 일 실시예에 따른 맞춤형 공조 제어 시스템은 보다 개인화하여 맞춤형으로 서 비스를 제공할 수 있는 차량이라는 공간의 특성과, 주 탑승자의 역할(운전자/동승자)이 정해져 있는 특성을 활 용하여, 상기 AI 학습부를 구성하여 상기 추론부에서 추론한 열적 쾌적성 정보가 같더라도 사람에 따 라 공조 수단의 조작 패턴이 상이한 점을 고려하여 추가 동작을 수행함으로써, 차량 내 공조 수단의 동작이 탑 승자 맞춤형으로 자동 제어되도록 하는 것이 바람직하다. 이를 위해, 상기 AI 학습부는 도 1에 도시된 바와 같이, 패턴 입력부, 공조 학습 처리부 및 보 정부를 더 포함하여 구성되는 것이 바람직하다. 상기 패턴 입력부는 상술한 바와 같이. 상기 제어부에서 생성한 상기 동작 제어 신호에 의해 차량 내 공조 수단의 동작이 자동 제어되는 동안, 탑승자로부터 입력되는 공조 수단에 대한 조작 신호 정보를 수집하는 것이 바람직하다.즉, 가능한 한 평균화하여 제공하고자 하는 공조 제어 정보를 기준으로 차량 내 공조 수단의 동작이 자동 제어 가 이루어짐에도 불구하고, 탑승자로부터 공조 수단에 대한 조작 신호 정보가 입력된다면, 동일한 또는 유사한 열적 쾌적성 정보를 갖고 있는 탑승자라 하더라도 개개인마다 느끼는 온/냉감이 상이하다는 것을 의미하기 때문 에, 이에 대한 개인화/맞춤화된 공조 제어를 제공하기 위하여, 상기 패턴 입력부를 통해서 차량 내 공조 수단의 동작이 자동 제어되는 동안, 탑승자로부터 입력되는 공조 수단에 대한 조작 신호 정보를 수집하게 된다. 상기 공조 학습 처리부는 상기 패턴 입력부에서 수집한 상기 조작 신호 정보와 상기 조작 신호 정보 가 입력된 시점의 차량 외부 환경 정보 및 상기 추론부에서 추출한 상기 탑승자 관련 정보를 이용하여, 미 리 설정된 인공지능 알고리즘을 이용하여 학습 처리를 수행하는 것이 바람직하다. 상세하게는, 상기 공조 학습 처리부는 상기 패턴 입력부에서 수집한 상기 조작 신호 정보인 탑승자의 공조 수단 조작 패턴 정보, 상기 조작 신호 정보가 입력된 시점의 차량 외부 환경 정보인 일사량, 계절, 시간 (주간/야간), 지역 등, 상기 추론부에서 추출한 상기 탑승자 관련 정보인 탑승 위치(운전석/보조석/후석), 탑승자 수를 이용하여, 미리 설정된 인공지능 알고리즘을 이용하여 학습 처리를 수행하는 것이 바람직하다. 이를 통해서, 수치 상 동일 또는 유사한 열적 쾌적성 정보를 갖고 있더라도 특정 탑승자의 공조 수단 조작 패턴 을 학습하여 개인화/맞춤화된 열적 쾌적성 정보가 적용된 공조 수단의 제어에 반영할 수 있으며, 수치 상 동일 또는 유사한 열적 쾌적성 정보를 갖고 있더라도 특정 탑승자의 경우, 외부 환경에 따라 느끼는 온/냉감이 상이 할 수 있기 때문에, 이를 학습하여 개인화/맞춤화된 열적 쾌적성 정보가 적용된 공조 수단의 제어에 반영할 수 있다. 또한, 차량 내 모든 탑승자들이 동일 또는 유사한 열적 쾌적성 정보를 갖고 있더라도 탑승 위치에 따라서, 또는 차량 내 탑승자 수에 따라 느끼는 온/냉감이 상이할 수 있기 때문에, 이를 학습하여 개인화/맞춤 화된 열적 쾌적성 정보가 적용된 공조 수단의 제어에 반영할 수 있다. 상기 보정부는 상기 공조 학습 처리부의 학습 결과 모델을 이용하여, 각 탑승자 별로 상기 추론부 에서 추론한 상기 열적 쾌적성 정보를 보정하거나 또는, 상기 제어부에 저장된 상기 공조 제어 정보 의 업데이트를 수행하는 것이 바람직하다. 이 때, 상기 추론부에서 추론한 상기 열적 쾌적성 정보를 보정할 경우, 상기 추론부에서 탑승자(특히, 운전자)에 따른 추론 알고리즘이 보정되도록 하는 것이 바람직하며, 상기 제어부에 저장된 상기 공조 제어 정보의 업데이트를 수행할 경우, 해당하는 차량에 저장되는 상기 공조 제어 정보에 대한 업데이 트를 수행하여, 각 차량 별 탑승자에 따라 가장 최적화된 그리고 개인화된 공조 수단의 제어가 이루어질 수 있 도록 하는 것이 바람직하다. 도 2 및 도 3은 본 발명의 일 실시예에 따른 맞춤형 공조 제어 방법을 나타낸 순서 예시도로서, 도 2 및 도 2에 도시된 바와 같이, 본 발명의 일 실시예에 따른 맞춤형 공조 제어 방법은 열 측정 단계(S100), 이미지 생성 단 계(S200), 이미지 분석 단계(S300), 추론 단계(S400), 공조 제어 단계(S500), 패턴 수집 단계(S600), 학습 처 리 단계(S700) 및 맞춤형 공조 제어 단계(S800)를 포함하여 구성되는 것이 바람직하다. 각 단계에 대해서 자세히 알아보자면, 상기 열 측정 단계(S100)는 상기 이미지 생성부에서, 차량 내 위치한 상기 센서부로부터 차량 내부 영역의 열화상 데이터를 측정하게 된다. 상기 이미지 생성 단계(S200)는 상기 이미지 생성부에서, 상기 열 측정 단계(S100)에 의해 전달받은 상기 열화상 데이터를 이용하여 열화상 이미지를 생성하게 된다. 상기 이미지 분석 단계(S300)는 상기 이미지 분석부에서, 상기 이미지 생성 단계(S200)에 의해 생성한 상 기 열화상 이미지를 전달받아, 상기 열화상 이미지에 포함되어 있는 다양한 객체 관련 정보를 분석하게 된다. 상세하게는, 상기 이미지 분석 단계(S300)는 상기 열화상 이미지에 포함되어 있는 다양한 객체 관련 정보인 탑 승자, 차량 내부 구성품(유리, 시트, 루프 등) 등을 구분하여 분석하는 것이 바람직하며, 탑승자을 구분하여 분 석함에 있어서, 탑승자 개개인을 구분하여 분석하거나, 탑승자를 그룹지어 구분하여 분석할 수 있다. 추후에 수 행되는 연산량 또는 통신량 등을 감소시키기 위해서는, 운전집중도가 요구되는 운전자는 개별 구분하여 분석하 고, 나머지 탑승자들을 하나의 그룹으로 구분하여 분석하는 것이 가장 바람직하나, 이는 일 실시예에 불과하고, 시스템을 제공하는 제공자의 요구에 따라 제어되는 것이 바람직하다. 이러한 상기 이미지 분석 단계(S300)는 도 3에 도시된 바와 같이, 열 분석 단계(S310) 또는, 이미지 학습 단계 (S320) 및 정밀 분석 단계(S330)를 포함하여 구성되는 것이 바람직하다. 상기 열 분석 단계(S310)를 단독으로구성하거나, 상기 이미지 학습 단계(S320) 및 정밀 분석 단계(S330)만을 구성할 수도 있으나, 가장 바람직하게 는 상기 열 분석 단계(S310)에 의한 분석 결과와 상기 이미지 학습 단계(S320) 및 정밀 분석 단계(S330)에 의한 분석 결과를 통합하여 활용하는 것이 가장 바람직하다. 상기 열 분석 단계(S310)는 상기 열화상 이미지를 이루고 있는 열화상 데이터를 기준으로 미리 설정된 객체 항 목을 구분하여, 상기 열화상 이미지에 포함되어 있는 객체 관련 정보를 분석하게 된다. 상세하게는, 상기 열 분석 단계(S310)는 상기 열화상 데이터를 단순하게 해석하여, 사람일 경우 소정 온도 범위 의 온도 픽셀이 분포되고, 사람이 아닐 경우(동물, 사물 등), 소정 온도 범위를 벗어나는 온도 픽셀이 분포되는 것을 반영하여, 차량 내 소정 영역(운전석, 보조석, 후석 등)에 위치하고 있는 사람(미리 설정된 객체 항목)을 구분하여, 이에 대한 객체 관련 정보로 체온 정보를 분석하는 것이 바람직하다. 이 경우, 탑승자의 존재 유무를 판단하고, 탑승자가 존재할 경우, 해당하는 탑승자의 체온 정보를 분석할 수 있 으나, 평균적으로 성인과는 신진대사량이 상이한 유아가 탑승할 경우 또는, 신체가 노출된 부위(일 예를 들자면, 긴팔 상의를 입고 있는 경우, 반팔 상의를 입고 있는 경우)를 고려하지 않고 탑승자의 체온 정보만을 분석할 경우, 추후에 객체 관련 정보를 토대로 추론한 열적 쾌적성 정보의 정확성이 낮아지는 문제점이 있다. 즉, 평균적으로 성인과는 신진대사량이 상이한 유아에게 성인과 동일한 기준으로 열적 쾌적성 정보를 추론하고, 이에 맞는 자동 공조 제어를 제공할 경우, 더위 또는 추위에 의해 발생할 수 있다. 이러한 점을 고려하여, 상기 이미지 학습 단계(S320) 및 정밀 분석 단계(S330)를 포함하여 구성되며, 상기 이미 지 학습 단계(S320)는 외부로부터 차량 내부 관련 이미지들, 다시 말하자면, 차량 출시시 고정되는 내부 구성들 의 각 위치를 학습하기 위한 이미지들, 사람의 연령대에 따른 온도 픽셀의 분포도 정보 및 사람의 연령대에 따 른 온도 픽셀의 밀집도 정보 중 적어도 하나 이상을 포함하는 학습 데이터를 수집한 후, 미리 설정된 인공지능 알고리즘을 이용하여, 수집한 상기 학습 데이터들의 학습 처리를 수행하게 된다. 상기 정밀 분석 단계(S330)는 상기 이미지 학습 단계(S320)의 학습 결과 모델을 이용하여, 상기 열화상 이미지 에 포함되어 있는 상기 객체 관련 정보들을 정밀 분석하게 된다. 일 예를 들자면, 탑승자과 사물(시트, 창문, 루프 등 차량 내부 객체 항목)을 구분할 수 있으며, 구분한 탑승자 에 대한 온도 픽셀의 분포도 정보/밀집도 정보를 활용하여, 의복 착용 부위와 비착용 부위를 추가 구분할 수 있 다. 또한, 구분한 탑승자에 대한 온도 픽셀의 분포도 정보/밀집도 정보를 활용하여, 성인과 유아를 추가 구분할 수 도 있으며, 이렇게 구분한 상기 객체 항목들에 대한 객체 관련 정보(온도 정보 등)를 분석하게 된다. 상기 추론 단계(S400)는 상기 추론부에서, 상기 이미지 분석 단계(S300)에 의해 구분한 각 객체 항목들에 대한 분석한 상기 객체 관련 정보들을 전달받아, 상기 객체 관련 정보들 중 탑승자 관련 정보들을 추출하게 된 다. 즉, 차량 시트의 온도를 기준으로 공조 제어를 제공할 필요가 없기 때문에, 탑승자 관련 정보만을 추출하고, 추 출한 각 탑승자에 대한 열적 쾌적성 정보를 추론하는 것이 바람직하다. 상세하게는, 상기 추론 단계(S400)는 미리 저장되어 있는 추론 알고리즘을 이용하여, 현재 차량 외부 환경 관련 정보, 상기 이미지 분석 단계(S300)에 의해 분석한 상기 객체 관련 정보들 중 탑승자 관련 정보들 및 사람의 연 령대에 따른 신진대사량 정보를 적용하여, 각각의 탑승자에 대한 열적 쾌적성 정보를 추론하게 된다. 즉, 상기의 수학식 1과 같은 추론 알고리즘을 이용하여, 탑승자에 대한 의복 비착용 부위 온도 정보, 탑승자에 대한 의복 착용 부위 온도 정보, 차량 실내에 구성되어 있는 객체(시트 등) 온도 정보, 외부 환경에 의한 유입 공기 온도, 주행에 따른 유입 풍속, 예측되는 연령대에 대한 신진대사량 정보, 탑승자의 탑승 위치 정보 등을 적용하여, 열적 쾌적성 정보를 추론하는 것이 바람직하다. 상기 공조 제어 단계(S500)는 상기 제어부에서, 상기 추론 단계(S400)에 의해 추론한 각 탑승자 별 열적 쾌적성 정보를 이용하여, 미리 저장되어 있는 공조 제어 정보 중 매칭되는 정보를 추출하여, 추출한 상기 공조 제어 정보로 차량 내 공조 수단에 대한 동작 제어 신호를 생성하고, 생성한 동작 제어 신호를 전달하여 차량 내 공조 수단의 동작을 자동 제어하게 된다. 이 때, 미리 저장되어 있는 공조 제어 정보로는, 소정 기간 동안 설정한 특정 실험군으로부터 외부 온도 조건에 따라 수동 제어하는 공조 패턴을 수집하여 공조 수단의 초기 동작 제어를 위해 설정하는 것이 가장 바람직하며,단순하게 외기를 기준으로 임의로 설정할 수도 있으며, 이에 대해서 한정하는 것은 아니다. 이 때, 본 발명의 일 실시예에 따른 맞춤형 공조 제어 방법은, 상기 공조 제어 단계(S500) 만으로도 다양한 항 목의 조건들을 반영한 맞춤형 공조 제어 서비스를 제공할 수 있으나, 가능한 한 평균화하여 제공되는 공조 제어 정보를 기준으로 차량 내 공조 수단의 동작이 자동 제어됨에도 불구하고, 탑승자로부터 공조 수단에 대한 조작 신호 정보가 입력된다면, 동일한 또는 유사한 열적 쾌적성 정보를 갖고 있는 탑승자라 하더라도 개개인마다 느 끼는 온/냉감이 상이하다는 것을 의미하기 때문에, 보다 개인화하여 맞춤형으로 서비스를 제공할 수 있는 차량 이라는 공간의 특성과, 주 탑승자의 역할(운전자/동승자)이 정해져 있는 특성을 활용하여, 개인화/맞춤화된 공 조 제어를 제공하기 위하여, 상기 패턴 수집 단계(S600), 학습 처리 단계(S700) 및 맞춤형 공조 제어 단계 (S800)를 더 수행하는 것이 바람직하다. 상기 패턴 수집 단계(S600)는 상기 AI 학습부에서, 상기 공조 제어 단계(S500)에 의해 차량 내 공조 수단 의 동작이 자동 제어되는 동안, 탑승자로부터 입력되는 공조 수단에 대한 조작 신호 정보를 수집하게 된다. 상기 학습 처리 단계(S700)는 상기 AI 학습부에서, 상기 패턴 수집 단계(S600)에 의해 수집한 상기 조작 신호 정보를 포함하는 학습 데이터, 상세하게는, 수집한 상기 조작 신호 정보와 상기 조작 신호 정보가 입력된 시점의 차량 외부 환경 정보 및 추출한 상기 탑승자 관련 정보를 이용하여, 미리 설정된 인공지능 알고리즘을 이용하여 학습 처리를 수행하게 된다. 즉, 상기 학습 처리 단계(S700)는 탑승자의 공조 수단 조작 패턴 정보, 상기 조작 신호 정보가 입력된 시점의 일사량, 계절, 시간(주간/야간), 지역 등, 탑승 위치(운전석/보조석/후석), 탑승자 수를 이용하여, 미리 설정된 인공지능 알고리즘을 이용하여 학습 처리를 수행하게 된다. 이를 통해서, 수치 상 동일 또는 유사한 열적 쾌적성 정보를 갖고 있더라도 특정 탑승자의 공조 수단 조작 패턴 을 학습하여 개인화/맞춤화된 열적 쾌적성 정보가 적용된 공조 수단의 제어에 반영할 수 있으며, 수치 상 동일 또는 유사한 열적 쾌적성 정보를 갖고 있더라도 특정 탑승자의 경우, 외부 환경에 따라 느끼는 온/냉감이 상이 할 수 있기 때문에, 이를 학습하여 개인화/맞춤화된 열적 쾌적성 정보가 적용된 공조 수단의 제어에 반영할 수 있다. 또한, 차량 내 모든 탑승자들이 동일 또는 유사한 열적 쾌적성 정보를 갖고 있더라도 탑승 위치에 따라서, 또는 차량 내 탑승자 수에 따라 느끼는 온/냉감이 상이할 수 있기 때문에, 이를 학습하여 개인화/맞춤 화된 열적 쾌적성 정보가 적용된 공조 수단의 제어에 반영할 수 있다. 상기 맞춤형 공조 제어 단계(S800)는 상기 AI 학습부에서, 상기 학습 처리 단계(S700)에 의한 학습 결과 모델을 이용하여, 각 탑승자 별로 추론한 상기 열적 쾌적성 정보를 보정하거나 또는, 저장된 상기 공조 제어 정 보의 업데이트를 수행하는 것이 바람직하다. 이 때, 추론한 상기 열적 쾌적성 정보를 보정할 경우, 탑승자(특히, 운전자)에 따른 추론 알고리즘이 보정되도 록 하는 것이 바람직하며, 저장된 상기 공조 제어 정보의 업데이트를 수행할 경우, 해당하는 차량에 저장되는 상기 공조 제어 정보에 대한 업데이트를 수행하여, 각 차량 별 탑승자에 따라 가장 최적화된 그리고 개인화된 공조 수단의 제어가 이루어질 수 있도록 하는 것이 바람직하다. 본 발명은 상기한 실시예에 한정되지 아니하며, 적용범위가 다양함은 물론이고, 청구범위에서 청구하는 본 발명 의 요지를 벗어남이 없이 당해 본 발명이 속하는 분야에서 통상의 지식을 가진 자라면 누구든지 다양한 변형 실 시가 가능한 것은 물론이다."}
{"patent_id": "10-2021-0096794", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 맞춤형 차량 공조 제어 시스템의 구성 예시도이다. 도 2 및 도 3은 본 발명의 일 실시예에 따른 맞춤형 차량 공조 제어 방법의 순서 예시도이다."}
