{"patent_id": "10-2019-0113303", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0032064", "출원번호": "10-2019-0113303", "발명의 명칭": "펄스 횟수를 입력 신호에 대응시키고 전압으로 가중치를 조절하는 커패시턴스 기반 행렬 곱셈", "출원인": "포항공과대학교 산학협력단", "발명자": "유인경"}}
{"patent_id": "10-2019-0113303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "워드 라인, 비트 라인, 및 커패시터와 연결되는 트랜지스터; 및상기 트랜지스터와 연결되는 커패시터를 포함하되, 상기 비트 라인의 입력은 펄스 발진기(pulse generator)와 연결되고, 출력은 센스 앰프(Sense Amplifier)와 연결되며, 상기 커패시터에 인가되는 전압으로 가중치를 조절하는 펄스 횟수를 입력 신호에 대응시키고 전압으로가중치를 조절하는 커패시턴스 기반 행렬 곱셈 뉴럴 네트워크."}
{"patent_id": "10-2019-0113303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 비트 라인과 상기 펄스 발진기 사이에 위치한 다이오드를 더 포함하는 펄스 횟수를 입력 신호에 대응시키고 전압으로 가중치를 조절하는 커패시턴스 기반 행렬 곱셈 뉴럴 네트워크."}
{"patent_id": "10-2019-0113303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서,상기 비트 라인과 상기 센스 앰프 사이에 배치되는 선택 트랜지스터를 더 포함하는 펄스 횟수를 입력 신호에 대응시키고 전압으로 가중치를 조절하는 커패시턴스 기반 행렬 곱셈 뉴럴 네트워크."}
{"patent_id": "10-2019-0113303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서,상기 선택 트랜지스터의 그라운드에 해당하는 P웰(p-well)을 상기 다이오드와 상기 펄스 발진기 사이에 연결하는 배선을 더 포함하는 펄스 횟수를 입력 신호에 대응시키고 전압으로 가중치를 조절하는 커패시턴스 기반 행렬곱셈 뉴럴 네트워크."}
{"patent_id": "10-2019-0113303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1항에 있어서,상기 워드 라인은 상기 비트 라인과 직교하여 배치되는 펄스 횟수를 입력 신호에 대응시키고 전압으로 가중치를조절하는 커패시턴스 기반 행렬 곱셈 뉴럴 네트워크."}
{"patent_id": "10-2019-0113303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항에 있어서,상기 워드 라인에 입력 신호에 대응하는 게이트 펄스 폭(gate pulse width)을 인가하고, 상기 비트 라인에 전압펄스 트레인(pulse train)을 인가하는 펄스 횟수를 입력 신호에 대응시키고 전압으로 가중치를 조절하는 커패시턴스 기반 행렬 곱셈 뉴럴 네트워크."}
{"patent_id": "10-2019-0113303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1항에 있어서,상기 커패시터에 인가되는 전압은, 상기 비트 라인에 인가되는 전압과 상기 커패시터 플레이트 라인에 인가되는전압과의 차이에 대응되는 펄스 횟수를 입력 신호에 대응시키고 전압으로 가중치를 조절하는 커패시턴스 기반행렬 곱셈 뉴럴 네트워크."}
{"patent_id": "10-2019-0113303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "공개특허 10-2021-0032064-3-제 1항에 있어서,상기 펄스 발진기와 상기 비트 라인 사이에 배치되는 셀프 전압 분배기(self-voltage divider)를 더 포함하는펄스 횟수를 입력 신호에 대응시키고 전압으로 가중치를 조절하는 커패시턴스 기반 행렬 곱셈 뉴럴 네트워크."}
{"patent_id": "10-2019-0113303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1항에 있어서,상기 비트 라인과 상기 센스 앰프 사이에 배치되는 선별기(discriminator)를 더 포함하는 펄스 횟수를 입력 신호에 대응시키고 전압으로 가중치를 조절하는 커패시턴스 기반 행렬 곱셈 뉴럴 네트워크."}
{"patent_id": "10-2019-0113303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "워드 라인, 비트 라인, 및 커패시터와 연결되는 트랜지스터;상기 트랜지스터와 연결되는 커패시터; 및상기 커패시터에 연결되는 플레이트를 포함하되, 상기 비트 라인의 입력은 펄스 발진기(pulse generator)와 연결되고, 출력은 센스 앰프(Sense Amplifier)와 연결되며, 상기 커패시터에 인가되는 전압으로 가중치를 조절하는 가중치 셀들을 포함하는 펄스 횟수를 입력 신호에 대응시키고 전압으로 가중치를 조절하는 커패시턴스 기반 행렬 곱셈 뉴럴 네트워크."}
{"patent_id": "10-2019-0113303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10항에 있어서,상기 커패시터에 인가되는 전압은 상기 비트 라인에 인가되는 전압과 상기 플레이트에 인가되는 전압과의 차이에 대응되는 펄스 횟수를 입력 신호에 대응시키고 전압으로 가중치를 조절하는 커패시턴스 기반 행렬 곱셈 뉴럴네트워크."}
{"patent_id": "10-2019-0113303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 10항에 있어서,상기 가중치 셀들의 워드 라인에 입력 신호에 대응하는 게이트 펄스 폭(gate pulse width)을 인가하고, 상기 가중치 셀들의 커패시터에 전압 펄스 트레인(pulse train)을 인가하여 벡터 행렬 곱셈(VMM: Vector MatrixMultiplication)을 수행하는 펄스 횟수를 입력 신호에 대응시키고 전압으로 가중치를 조절하는 커패시턴스 기반 행렬 곱셈 뉴럴 네트워크."}
{"patent_id": "10-2019-0113303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12항에 있어서,상기 벡터 행렬 곱셈의 출력 정보를 차기 은닉층의 입력 정보로 사용하여 벡터 행렬 곱셈을 수행하는 펄스 횟수를 입력 신호에 대응시키고 전압으로 가중치를 조절하는 커패시턴스 기반 행렬 곱셈 뉴럴 네트워크."}
{"patent_id": "10-2019-0113303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13항에 있어서,상기 벡터 행렬 곱셈을 반복적으로 수행한 결과에 대한 반복 횟수 정보, 가중치 정보, 입력 정보, 출력 정보 및은닉층 정보를 저장하는 상기 뉴럴 네트워크 외부의 저장 매체를 더 포함하는 펄스 횟수를 입력 신호에 대응시키고 전압으로 가중치를 조절하는 커패시턴스 기반 행렬 곱셈 뉴럴 네트워크."}
{"patent_id": "10-2019-0113303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "워드 라인, 비트 라인, 및 커패시터와 연결되는 트랜지스터; 및 상기 트랜지스터와 연결되는 커패시터를 포함하되, 상기 비트 라인의 입력은 펄스 발진기(pulse generator)와 연결되고 출력은 센스 앰프(Sense Amplifier)와연결되며, 상기 커패시터에 인가되는 전압으로 가중치를 조절하는 제1 가중치 셀들; 및워드 라인, 비트 라인, 및 커패시터와 연결되는 트랜지스터; 및 상기 트랜지스터와 연결되는 커패시터를 포함하공개특허 10-2021-0032064-4-되, 상기 비트 라인은 상기 제1 가중치 셀들의 출력 및 센스 앰프(Sense Amplifier)와 연결되며, 상기 제1 가중치 셀들에서 방전되는 전하들을 모으는 제2 가중치 셀들을 포함하는 펄스 횟수를 입력 신호에 대응시키고 전압으로 가중치를 조절하는 커패시턴스 기반 행렬 곱셈 뉴럴 네트워크."}
{"patent_id": "10-2019-0113303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15항에 있어서,상기 커패시터에 인가되는 전압은 상기 비트 라인에 인가되는 전압과 상기 커패시터 플레이트 라인에 인가되는전압과의 차이에 대응되는 펄스 횟수를 입력 신호에 대응시키고 전압으로 가중치를 조절하는 커패시턴스 기반행렬 곱셈 뉴럴 네트워크."}
{"patent_id": "10-2019-0113303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 15항에 있어서,상기 제1 가중치 셀들의 출력과 상기 제2 가중치 셀들의 입력 사이에 배치되는 다이오드를 더 포함하는 펄스 횟수를 입력 신호에 대응시키고 전압으로 가중치를 조절하는 커패시턴스 기반 행렬 곱셈 뉴럴 네트워크."}
{"patent_id": "10-2019-0113303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 15항에 있어서,상기 제1 가중치 셀들의 워드 라인에 입력 신호에 대응하는 게이트 펄스 폭(gate pulse width)을 인가하고, 상기 제1 가중치 셀들의 커패시터에 전압 펄스 트레인(pulse train)을 인가하여 벡터 행렬 곱셈(VMM: VectorMatrix Multiplication)을 수행하는 펄스 횟수를 입력 신호에 대응시키고 전압으로 가중치를 조절하는 커패시턴스 기반 행렬 곱셈 뉴럴 네트워크."}
{"patent_id": "10-2019-0113303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 18항에 있어서,상기 벡터 행렬 곱셈의 출력 정보를 상기 제2 가중치 셀들에 저장하고 차기 은닉층의 입력 정보로 사용하여 벡터 행렬 곱셈을 수행하는 펄스 횟수를 입력 신호에 대응시키고 전압으로 가중치를 조절하는 커패시턴스 기반 행렬 곱셈 뉴럴 네트워크."}
{"patent_id": "10-2019-0113303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 18항에 있어서,상기 제2 가중치 셀들은 상기 벡터 행렬 곱셈을 반복적으로 수행한 결과에 대한 반복 횟수 정보, 가중치 정보,입력 정보, 출력 정보 및 은닉층 정보를 저장하는 펄스 횟수를 입력 신호에 대응시키고 전압으로 가중치를 조절하는 커패시턴스 기반 행렬 곱셈 뉴럴 네트워크."}
{"patent_id": "10-2019-0113303", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 실시예에 따른 펄스 횟수를 입력 신호에 대응시키고 전압으로 가중치를 조절하는 커패시턴스 기반 행 렬 곱셈 뉴럴 네트워크는, 워드 라인, 비트 라인, 및 커패시터와 연결되는 트랜지스터와, 트랜지스터와 연결되는 커패시터를 포함하되, 비트 라인의 입력은 펄스 발진기(pulse generator)와 연결되고, 출력은 센스 앰프(Sense Amplifier)와 연결되며, 커패시터에 인가되는 전압으로 가중치를 조절한다."}
{"patent_id": "10-2019-0113303", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 뉴럴 네트워크에 관한 것으로서, 보다 상세하게는 펄스 횟수를 입력 신호에 대응시키고 전압으로 가 중치를 조절하는 커패시턴스 기반 행렬 곱셈 뉴럴 네트워크에 관한 것이다."}
{"patent_id": "10-2019-0113303", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "모바일용 뉴럴 프로세서는 학습을 서버나 컴퓨터로 수행하고 학습결과를 모바일 뉴럴 프로세서에 저장하여 추론 (inference)을 수행한다. 이 때 뉴럴 프로세서의 가중치에 저장되는 값은 멀티레벨이 되는 것이 바람직하나 멀 티레벨 값에 한계가 있어서 학습을 수행한 후 전지 작업(pruning), 데이터 압축 등의 과정을 거쳐 작은 비트폭 (small bit-width)화 한 다음 그 값을 모바일 뉴럴 프로세서 가중치로 저장한다. 이 가중치는 불휘발성 메모리 또는 휘발성 메모리에 저장할 수 있다. 서버용으로는 Google의 TPU(Tensor Processing Unit)가 있는데 가중치 값을 DRAM에 저장한 후 페치(fetch)하여 행렬 곱셈부(matrix multiply unit, MMU)로 보낸다. 출력(output) 계산 결과는 DRAM에 저장된 가중치 값과 함 께 다시 행렬 곱셈부 입력(input)으로 보내어 최종 출력(output) 결과가 나올 때까지 순환시킨다. 가중치를 불휘발성 메모리에 저장하여 사용하는 경우에는 추론 속도가 빠른 장점이 있으나 은닉층(hidden layer)을 모두 제작해야 하므로 회로 오버헤드(circuit overhead)가 증가하는 단점이 있다. Google의 TPU같은 경우는 가중치 정보를 뉴럴 네트워크 외부에 저장하고, 동일한 뉴럴 네트위크를 다시 사용하면서 순차적으로 계 산하기 때문에 추론 속도는 감소하지만 회로 오버헤드를 줄일 수 있다. 커패시턴스 기반 행렬 곱셈(matrix multiplication)은 커패시턴스를 가중치로 사용한다. 가중치를 결정하기 위 해 커패시터들을 그룹으로 묶거나 커패시터의 크기를 바꾸는 방법이 있다. 위 기재된 내용은 오직 본 발명의 기술적 사상들에 대한 배경 기술의 이해를 돕기 위한 것이며, 따라서 그것은 본 발명의 기술 분야의 당업자에게 알려진 선행 기술에 해당하는 내용으로 이해될 수 없다."}
{"patent_id": "10-2019-0113303", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 인공지능 학습에서 학습결과를 수행하기 위한 가중치 조절 방법에 관한 뉴럴 네트워크 구성 및 작동 원리이다 가중치 소자를 하드웨어를 이용하여 멀티레벨로 제작한다는 것은 물리적 한계가 있기 때문에, 소프트웨어에서 사용하는 가중치 비트폭(weight bit-width)을 따라갈 수 없다. 예를 들어서 16 비트폭의 멀티레벨, 즉, 65,536 저항 레벨을 갖는 저항 메모리 소재는 현재로서는 구현하기 어렵다. 따라서 가중치 값을 소프트웨어만큼 탄력적 으로 입력하면서 벡터 행렬 곱셈이 가능한 행렬 곱셈부의 구조와 작동 방법을 고안해야 한다. 커패시턴스 값을 인위적으로 바꾸는 방법은 커패시터 크기를 탄력적으로 바꿀 수 없고 커패시터 그룹(groupin g)는 회로가 복잡해진다. 인가 전압을 바꾸는 방법은 인가전압의 다이나믹 레인지(dynamic range) 한계 때문에 하드웨어화 하는데 제약이 따른다. 또한 은닉층을 필요한 만큼 제작하는 것도 칩(chip) 크기에 제약을 받는다."}
{"patent_id": "10-2019-0113303", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위하여 본 발명의 실시예에 따른 펄스 횟수를 입력 신호에 대응시키고 전압으로 가중치를 조절하는 커패시턴스 기반 행렬 곱셈 뉴럴 네트워크는, 워드 라인, 비트 라인, 및 커패시터와 연결되는 트랜지 스터와; 상기 트랜지스터와 연결되는 커패시터를 포함하되, 상기 비트 라인의 입력은 펄스 발진기(pulse generator)와 연결되고, 출력은 센스 앰프(Sense Amplifier)와 연결되며, 상기 커패시터에 인가되는 전압으로 가중치를 조절한다. 상기 비트 라인과 상기 펄스 발진기 사이에 위치한 다이오드를 더 포함할 수 있다. 상기 비트 라인과 상기 센스 앰프 사이에 배치되는 선택 트랜지스터를 더 포함할 수 있다. 상기 선택 트랜지스터의 그라운드에 해당하는 P웰(p-well)을 상기 다이오드와 상기 펄스 발진기 사이에 연결하 는 배선을 더 포함할 수 있다. 상기 워드 라인은 상기 비트 라인과 직교하여 배치될 수 있다. 상기 워드 라인에 입력 신호에 대응하는 게이트 펄스 폭(gate pulse width)을 인가하고, 상기 비트 라인에 전압 펄스 트레인(pulse train)을 인가할 수 있다. 상기 커패시터에 인가되는 전압은, 상기 비트 라인에 인가되는 전압과 상기 커패시터 플레이트 라인에 인가되는 전압과의 차이에 대응될 수 있다. 상기 펄스 발진기와 상기 비트 라인 사이에 배치되는 셀프 전압 분배기(self-voltage divider)를 더 포함할 수 있다. 상기 비트 라인과 상기 센스 앰프 사이에 배치되는 선별기(discriminator)를 더 포함할 수 있다. 본 발명의 실시예에 따른 펄스 횟수를 입력 신호에 대응시키고 전압으로 가중치를 조절하는 커패시턴스 기반 행 렬 곱셈 뉴럴 네트워크는, 워드 라인, 비트 라인, 및 커패시터와 연결되는 트랜지스터와; 상기 트랜지스터와 연결되는 커패시터와; 상기 커패시터에 연결되는 플레이트를 포함하되, 상기 비트 라인의 입력은 펄스 발진기 (pulse generator)와 연결되고, 출력은 센스 앰프(Sense Amplifier)와 연결되며, 상기 커패시터에 인가되는 전 압으로 가중치를 조절하는 가중치 셀들을 포함한다. 상기 커패시터에 인가되는 전압은 상기 비트 라인에 인가되는 전압과 상기 플레이트에 인가되는 전압과의 차이 에 대응될 수 있다. 상기 가중치 셀들의 워드 라인에 입력 신호에 대응하는 게이트 펄스 폭(gate pulse width)을 인가하고, 상기 가 중치 셀들의 커패시터에 전압 펄스 트레인(pulse train)을 인가하여 벡터 행렬 곱셈(VMM: Vector Matrix Multiplication)을 수행할 수 있다. 상기 벡터 행렬 곱셈의 출력 정보를 차기 은닉층의 입력 정보로 사용하여 벡터 행렬 곱셈을 수행할 수 있다. 상기 벡터 행렬 곱셈을 반복적으로 수행한 결과에 대한 반복 횟수 정보, 가중치 정보, 입력 정보, 출력 정보 및 은닉층 정보를 저장하는 상기 뉴럴 네트워크 외부의 저장 매체를 더 포함할 수 있다. 본 발명의 실시예에 따른 펄스 횟수를 입력 신호에 대응시키고 전압으로 가중치를 조절하는 커패시턴스 기반 행 렬 곱셈 뉴럴 네트워크는, 워드 라인, 비트 라인, 및 커패시터와 연결되는 트랜지스터; 및 상기 트랜지스터와 연결되는 커패시터를 포함하되, 상기 비트 라인의 입력은 펄스 발진기(pulse generator)와 연결되고 출력은 센 스 앰프(Sense Amplifier)와 연결되며, 상기 커패시터에 인가되는 전압으로 가중치를 조절하는 제1 가중치 셀들 과; 워드 라인, 비트 라인, 및 커패시터와 연결되는 트랜지스터; 및 상기 트랜지스터와 연결되는 커패시터를 포 함하되, 상기 비트 라인은 상기 제1 가중치 셀들의 출력 및 센스 앰프(Sense Amplifier)와 연결되며, 상기 제1 가중치 셀들에서 방전되는 전하들을 모으는 제2 가중치 셀들을 포함한다. 상기 커패시터에 인가되는 전압은 상기 비트 라인에 인가되는 전압과 상기 커패시터 플레이트 라인에 인가되는 전압과의 차이에 대응될 수 있다. 상기 제1 가중치 셀들의 출력과 상기 제2 가중치 셀들의 입력 사이에 배치되는 다이오드를 더 포함할 수 있다. 상기 제1 가중치 셀들의 워드 라인에 입력 신호에 대응하는 게이트 펄스 폭(gate pulse width)을 인가하고, 상 기 제1 가중치 셀들의 커패시터에 전압 펄스 트레인(pulse train)을 인가하여 벡터 행렬 곱셈(VMM: Vector Matrix Multiplication)을 수행할 수 있다. 상기 벡터 행렬 곱셈의 출력 정보를 상기 제2 가중치 셀들에 저장하고 차기 은닉층의 입력 정보로 사용하여 벡 터 행렬 곱셈을 수행할 수 있다. 상기 제2 가중치 셀들은 상기 벡터 행렬 곱셈을 반복적으로 수행한 결과에 대한 반복 횟수 정보, 가중치 정보, 입력 정보, 출력 정보 및 은닉층 정보를 저장할 수 있다."}
{"patent_id": "10-2019-0113303", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이와 같은 본 발명의 실시예에 따른 펄스 횟수를 입력 신호에 대응시키고 전압으로 가중치를 조절하는 커패시턴 스 기반 행렬 곱셈 뉴럴 네트워크는, 가중치와 은닉층 수를 탄력적으로 조절할 수 있으며, 회로 부하를 줄일 수 있고 행렬 곱셈 유닛 칩 크기(matrix multiplication unit chip size)도 최소화할 수 있다."}
{"patent_id": "10-2019-0113303", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "위 발명의 배경이 되는 기술 란에 기재된 내용은 오직 본 발명의 기술적 사상에 대한 배경 기술의 이해를 돕기 위한 것이며, 따라서 그것은 본 발명의 기술 분야의 당업자에게 알려진 선행 기술에 해당하는 내용으로 이해될 수 없다. 아래의 서술에서, 설명의 목적으로, 다양한 실시예들의 이해를 돕기 위해 많은 구체적인 세부 내용들이 제시된 다. 그러나, 다양한 실시예들이 이러한 구체적인 세부 내용들 없이 또는 하나 이상의 동등한 방식으로 실시될 수 있다는 것은 명백하다. 다른 예시들에서, 잘 알려진 구조들과 장치들은 다양한 실시예들을 불필요하게 이해 하기 어렵게 하는 것을 피하기 위해 블록도로 표시된다. 도면에서, 레이어들, 필름들, 패널들, 영역들 등의 크기 또는 상대적인 크기는 명확한 설명을 위해 과장될 수 있다. 또한, 동일한 참조 번호는 동일한 구성 요소를 나타낸다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"간접적으로 연결\"되어 있는 경우도 포함한다. 그러나, 만약 어떤 부분이 다른 부분과 \"직접적으로 연결되어 있다\"고 서술되어 있으면, 이는 해당 부분과 다른 부분 사이에 다른 소자가 없음을 의미할 것이다. \"X, Y, 및 Z 중 적어도 어느 하나\", 그리고 \"X, Y, 및 Z로 구성된 그룹으로부터 선택된 적어도 어느 하나\"는 X 하나, Y 하나, Z 하나, 또는 X, Y, 및 Z 중 둘 또는 그 이상의 어떤 조합 (예를 들면, XYZ, XYY, YZ, ZZ) 으로 이해될 것이다. 여기에서, \"및/또는\"은 해당 구성들 중 하나 또는 그 이상의 모 든 조합을 포함한다. 여기에서, 첫번째, 두번째 등과 같은 용어가 다양한 소자들, 요소들, 지역들, 레이어들, 및/또는 섹션들을 설명 하기 위해 사용될 수 있지만, 이러한 소자들, 요소들, 지역들, 레이어들, 및/또는 섹션들은 이러한 용어들에 한 정되지 않는다. 이러한 용어들은 하나의 소자, 요소, 지역, 레이어, 및/또는 섹션을 다른 소자, 요소, 지역, 레 이어, 및 또는 섹션과 구별하기 위해 사용된다. 따라서, 일 실시예에서의 첫번째 소자, 요소, 지역, 레이어, 및 /또는 섹션은 다른 실시예에서 두번째 소자, 요소, 지역, 레이어, 및/또는 섹션이라 칭할 수 있다. \"아래\", \"위\" 등과 같은 공간적으로 상대적인 용어가 설명의 목적으로 사용될 수 있으며, 그렇게 함으로써 도면 에서 도시된 대로 하나의 소자 또는 특징과 다른 소자(들) 또는 특징(들)과의 관계를 설명한다. 이는 도면 상에 서 하나의 구성 요소의 다른 구성 요소에 대한 관계를 나타내는 데에 사용될 뿐, 절대적인 위치를 의미하는 것 은 아니다. 예를 들어, 도면에 도시된 장치가 뒤집히면, 다른 소자들 또는 특징들의 \"아래\"에 위치하는 것으로 묘사된 소자들은 다른 소자들 또는 특징들의 \"위\"의 방향에 위치한다. 따라서, 일 실시예에서 \"아래\" 라는 용어 는 위와 아래의 양방향을 포함할 수 있다. 뿐만 아니라, 장치는 그 외의 다른 방향일 수 있다 (예를 들어, 90도 회전된 혹은 다른 방향에서), 그리고, 여기에서 사용되는 그런 공간적으로 상대적인 용어들은 그에 따라 해석된 다. 여기에서 사용된 용어는 특정한 실시예들을 설명하는 목적이고 제한하기 위한 목적이 아니다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다 고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제 외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 다른 정의가 없는 한, 여기에 사용된 용어들은 본 발명이 속하는 분야에서 통상적인 지식을 가진 자에게 일반적으로 이해되는 것과 같은 의미를 갖는 다. 도 1은 본 발명의 일 실시예에 따른 뉴럴 네트워크를 개략적으로 나타내는 회로도이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 뉴럴 네트워크(neural network)는 입력 뉴런, 출력 뉴런 , 및 가중치 셀을 포함한다. 시냅스 소자는 입력 뉴런으로부터 수평으로 연장하는 로우 라인 (R)(row lines) 및 출력 뉴런으로부터 수직으로 연장하는 컬럼 라인(C)(column lines)의 교차점에 배치될 수 있다. 설명의 편의를 위해 도 1에는 예시적으로 각각 네 개의 입력 뉴런 및 출력 뉴런이 도시되었으 나, 본 발명은 이에 한정되지 않는다. 입력 뉴런은 학습 모드(learning mode), 리셋 모드(reset mode), 보정 또는 읽기 모드(reading mode)에서 로우 라인(R)을 통하여 각 가중치 셀로 전기적 펄스들(pulses)을 전송할 수 있다. 출력 뉴런은 학습 모드 또는 리셋 모드 또는 보정 또는 읽기 모드에서 컬럼 라인(C)을 통하여 가중치 셀 로부터 전기적 펄스를 수신할 수 있다. 도 2는 본 발명의 일 실시예에 따른 뉴럴 네트워크의 가중치 셀을 개략적으로 나타내는 회로도이다. 도 3은 본 발명의 일 실시예에 따른 뉴럴 네트워크의 가중치 셀의 작동 원리를 개략적으로 나타내는 회로도이다. 도 2 및 도 3을 참조하면, 본 발명의 실시예에 따른 뉴럴 네트워크의 가중치 셀은, 워드 라인, 비트 라인, 및 커패시터와 연결되는 트랜지스터와, 트랜지스터와 연결되는 커패시터를 포함 하고, 워드 라인은 비트 라인과 직 교하여 배치된다. 실시예로서, 커패시터와 연결되는 플레이트 라인을 더 포함할 수 있고, 플레이트 라인은 워드 라인과 평행하게 비트 라인과 직교하여 배치될 수 있다. 실시예로서, 비트 라인의 입력은 펄스 발진기와 연결되고, 출력은 센스 앰프와 연결될 수 있다. 본 발명의 실시예에 따른 뉴런 네트워크의 가중치 셀은 커패시터에 인가되는 전압으로 가중치를 조절한다. 실시예로서, 1T-1C 어큐뮬레이터 셀(accumulator cell)의 트랜지스터 그라운드, 예로서 NMOS 트랜지스터의 P웰 (p-well)은 다이오드와 셀프 전압 분배기(self-voltage divider) 사이에 배선으로 연결될 수 있다. 셀프 전압 분배기와 비트 라인 사이에는 다이오드가 배치될 수 있다. 본 발명의 실시예에 따른 가중치 비트폭을 탄력적으로 적용하기 위하여 가중치를 새롭게 정의한다. 현재까지는 커패시턴스를 기초로 하는 가중치에서 Q=CV(전하량=커패시턴스×전압)를 적용하여 C를 멀티레벨화 하였다. 본 발명에서는 V를 가중치로 지정하고 멀티레벨화 한다. Q=CV는 DC 전압 V 대신 펄스 회수 n과 펄스 전압 Vp로 표 현되는 Q=nCVp으로 변환될 수 있다. 펄스 트레인을 인가할 경우 펄스 트레인을 인가하는 시간 은 펄스 회수 n을 결정한다. 이 때 를 입력 신호(input)에 대응시키고 Vp를 가중치로 정의하면 와 Vp의 곱이 가능해 진다. 전압 Vp는 임의로 선형적으로 조정할 수 있으므로 멀티레벨이 가능하다. 따라서 커패시터 플레이트 (plate) 라인 전압 VDi가 인가되는 제1 가중치 셀(cell)에서 선택 트랜지스터의 워드 라인에 펄스 폭(pulse width) 를 입력 신호에 대응하는 입력으로 인가하고 비트 라인에 Vpj 전압 펄스 트레인을 인가하면 Q=nC(Vpj-VDi)가 성립되고 Vp=Vpj-VDi가 가중치가 된다. 여기서 i는 가중치 array의 행의 개수이고 j는 가중치 array의 열의 개수이다. 그로 인해 입력은 로 조절하고 가중치는 Vpj-VDi로 조절하는 방식이 가능해진다. 본 발명의 일 실시예에 따르면, 트랜지스터와 커패시터로 구성된 가중치 셀을 이용하여 커패시터를 반복적으로 충방전하여 일정 시간동안 방전하는 전하량을 출력값으로 한다. 가중치는 커패시터에 인가되는 전압(Vp=Vpj- VDi)으로 정의한다. 실시예로서, 가중치는 커패시터에 인가하는 충전전압 Vpj와 커패시터 플레이트 라인에 인가하 는 전압 VDi와의 차이에 대응될 수 있다. 입력 신호는 입력 라인, 즉, 제1 가중치 셀 어레이의 워드 라인에 인가 하는 게이트 펄스 폭()에 대응시킨다. 비트 라인에는 펄스 전압이 Vpj가 되는 펄스 트레인을 인가한다. 펄스 주기는 게이트에 인가하는 펄스 폭의 다이 내믹 레인지(dynamic range)에 대응하여 최적화 한다. Vpj 크기는 커패시터의 플레이트 라인(PL: Plate Line)에 인가하는 전압 VDi의 두배 이상이 되도록 조정한다. 따라서 Vpj-VDi가 가중치의 다이내믹 레인지를 결정한다. Vpj가 인가되는 순간에는 가중치 셀의 커패시터에 충전이 되고 Vpj=0V가 되는 딜레이 순간에는 VDi 전압에 의해 방전이 된다. 워드 라인에는 게이트 전압 VG을 인가하되 펄스 폭을 입력 신호 크기에 동기화하여 를 조절한 다. 따라서 에 의해 펄스 카운트 \"n\"이 결정되고 커패시터에 인가되는 충방전 회수가 결정된다. 이에 따라 펄스 횟수 n이 입력 신호에 대응하게 되고 충전 전압은 Vpj-VDi가 된다. Vpj=2VDi일 경우 방전되는 전하량은 Q=nCVDi로서 C는 가중치 셀에서 단위 셀의 커패시터가 갖는 커패시턴스 값이다. 행렬 곱셈(matrix multiplication)은 입력 신호에 대응하는 n과 가중치에 대응하는 (Vpj-VDi)의 곱으로 수행되어 Q를 출력하게 된 다. 도 4는 본 발명의 일 실시예에 따른 뉴럴 네트워크 구성을 개략적으로 나타내는 회로도이다. 도 4를 참조하면, 가중치는 열 별 펄스 트레인 전압과 행 별 플레이트 라인 전압의 차이와 대응하고 입력 신호 는 제1 가중치 셀의 행 별 선택 트랜지스터에 인가하는 게이트 전압 펄스 폭(), 즉, n에 대응시킨다. 가중치를 결정하는 (Vpj-VDi) 값이 완전하게 랜덤한 값을 갖는 것은 아니나 일정 범위에서 각 입력 신호()에 대 해 가중치 별로 벡터 행렬 곱셈을 동시에 수행할 수 있다. 각각의 비트 라인에는 셀프 전압 분배기(self-voltage divider)를 연결하여 커패시터를 충전하는 전압을 조절한 다. 비트 라인과 공통 펄스 발진기 사이에는 셀프 전압 분배기를 배치하고 비트라인과 셀프 전압 분배기 사이에 는 다이오드를 배치한다. 커패시터의 플레이트 라인에는 각각의 전압 VDi를 인가하여 (VPj-VDi) 전압이 각 커패시 터에 인가되도록 한다. 각 셀에 인가되는 (VPj-VDi) 전압은 행의 VDi 전압과 열의 VPj 전압으로 결정된다. 따라서 각 셀에 인가되는 충전 전압은 각각 다르다. 은닉층과 연결되는 출력 비트 라인들은 각각 방전된 전하를 모으는 기능을 하는 또 하나의 1T-1C 어레이 어큐뮬 레이터(accumulator)에 연결한다. 가중치 셀 어레이로 구성되는 뉴럴 네트워크를 작동하는 동안 어큐뮬레이터로 부터 전하의 역류가 발생하지 않도록 뉴럴 네트워크와 어큐뮬레이터 사이에 다이오드를 추가한다. 도 5 및 도 6은 본 발명의 일 실시예에 따른 뉴럴 네트워크의 동작을 설명하기 위한 회로도이다. 도 5 및 도 6 에서는 발명의 이해를 위해 어큐뮬레이터의 각 선택 트랜지스터의 P웰(p-well)과 셀프 전압분배기와 다이오드 사이를 연결하는 배선을 생략하여 회로를 간명하게 표현하였다. 도 5를 참조하면, 완전한 랜덤 가중치로 벡터 행렬 곱셈을 수행할 수는 없으나 일정한 가중치 범위로 벡터 행렬 곱셈을 동시에 진행할 수 있다. 1T-1C 셀로 어레이로 구성되는 어큐뮬레이터의 공통 플레이트는 그라운드에 연 결하여 뉴럴 네트워크에서 방전되는 전하들이 모이도록 한다. 셀프 전압 분배기에 인가하는 게이트(WLj) 전압(Vj)에 따라 뉴럴 네트워크로 입력 되는 펄스 트레인 전압 Vpj가 결정된다. 이 때의 VPj 전압은 VDi의 두 배보다 크도록 하는 것이 바람직하다. 즉 j번째 열에 인가되는 게이트 전 압 Vj는 j열에 입력되는 입력 전압 Vpj가 VDi의 두 배보다 크도록 게이트 전압의 다이나믹 레인지(dynamic range)를 설계한다. 축적된 전하들의 양이 일정 값을 넘으면 활성화하게 되는데 이 전하들을 축적하는 동안 어큐뮬레이터의 커패시 터에 축적되는 전하에 의해 역전압이 증가하게 된다. 이 전압이 뉴럴 네트워크에서 방전(discharging)되는 전하 들을 막을 수 있으므로 역전압이 무시될 수 있을 정도로 트랜지스터-커패시터 쌍의 어레이를 충분히 많이 제작 한다. 또한 축적된 전하량을 검출하고 활성화 전압을 결정하기 위하여 선별(discrimination) 개념을 도입한다. 즉, 어큐뮬레이터에 축적된 전하들을 일정시간 동안 방전시켜서 어큐뮬레이터에 전하들이 남아 있을 경우에 차 기 은닉층의 입력 정보로 사용한다. 어큐뮬레이터에 전하들이 남아있지 않는다면 차기 은닉층의 입력이 없게 된 다. 잔류 전하 여부를 측정하는 것은 센스 앰프(sense amplifier)로 수행하고 일정 시간 어큐뮬레이터의 전하들 을 소멸시키는 것은 NMOS-PMOS 트랜지스터 쌍으로 수행한다. 선별(discrimination) 방법을 적용하여 총 전하 중 일정량을 방출한 후에도 전하들이 남을 경우 활성 (activation)이 가능한 전하량으로 정의한다. 따라서 잔류 전하가 감지될 경우 차기 은닉층의 입력 노드에 전압 을 인가한다. 도 6을 참조하면, 어큐뮬레이터에 모인 전하들을 방출시킬 때는 어큐뮬레이터 플레이트에 VCC/2 전압을 인가한다. 이 전하들이 선별기(disctriminator) 역할을 하는 인버터로 흘러가도록 하기 위하여 인버터에 전압을 인가한 다음 방전용 선택 트랜지스터(DT)의 게이트에 V'g 전압을 인가한다. 이 때 인버터의 NMOS 트랜지스터가 작동하므로 전하들이 그라운드로 소멸된다. Inverter에 전압을 인가하는 임계 시간을 정하면 전하들이 남을 수 도 있고 완전히 소멸될 수도 있다. 전하가 남게 되면 임계 시간 후(혹은 문턱시간 후) 인버터의 PMOS 트랜지스 터가 작동하게 되어 남은 전하들이 센스 앰프(sense amplifier)로 감지된다. 잔류 전하가 감지될 경우 차기 은 닉층 입력에 정보를 입력하고 잔류 전하들이 감지되지 않을 경우 은닉층 입력에 정보를 입력하지 않는다. 이러한 과정을 은닉층 별로 순환시켜야 하므로 각 레이어별 가중치 정보, 입력정보 등을 뉴럴 네트워크 외부 저 장장치에 저장하여 추론(inference)시 순환 컴퓨팅(computing)에 사용한다. 완전히 랜덤한 가중치로 벡터 행렬 곱셈을 수행하지 않고 제한적인 랜덤한 가중치로 벡터 행렬 곱셈을 수행하는 것은 동시 벡터 행렬 곱셈과 순차 벡터 행렬 곱셈의 중간 정도의 기능을 갖게 된다. 이를 준(pseudo) 벡터 행렬 곱셈으로 정의한다. 공통 플레이트 패드를 갖는 DRAM형 뉴럴 네트워크에서는 완전한 벡터 행렬 곱셈이 불가능하 고 행 또는 열별 순차 행렬 곱셈만 가능하다. 순차 행렬 곱셈 방식에서는 완전히 랜덤한 가중치가 가능하기 때문에 정확도가 높다. 준(pseudo) 벡터 행렬 곱셈은 DRAM형 뉴럴 네트워크의 순차 행렬 곱셈에 비해 정확도가 떨 어질 수는 있으나 행렬 곱셈을 동시에 진행하므로 상대적인 속도가 빠르다. 따라서 플레이트 라인을 사용하는 뉴럴 네트워크로 준 벡터 행렬 곱셈을 수행하여 신속히 1차 판단하고 DRAM형 뉴럴 네트워크로 순차 행렬 곱셈을 수행하여 세밀한 정보를 판단하는 방식을 사용할 수 있다. 본 발명의 실시예에 따른, 펄스 횟수를 입력 신호에 대응시키고 전압으로 가중치를 조절하는 커패시턴스 기반 행렬 곱셈 뉴럴 네트워크는, 일정 커패시턴스 값을 갖는 커패시터에 랜덤하게 접근(access)할 수 있는 선택 트 랜지스터를 제작하여 가중치 셀 어레이(weight cell array)를 구성하고 이를 네트워크 레이어로 제작한 다음 동 시에 행렬 곱셈을 수행하되, 출력 값을 다음 은닉층의 입력 정보로 사용하는 리커런트(recurrent) 혹은 이터레 이션(iteration) 방식을 적용한다. 제1 가중치 셀에 충방전을 반복하여 이에 의해 축적되는 전하량을 출력으로 한다. 입력은 제 1 가중치 셀에 인가되는 충방전 횟수에 대응되고 가중치는 커패시터에 인가하는 전압에 대응된 다. 전술한 바와 같은 본 발명의 실시예들에 따르면, 본 발명의 실시예에 따른 펄스 횟수를 입력 신호에 대응시키고 전압으로 가중치를 조절하는 커패시턴스 기반 행렬 곱셈 뉴럴 네트워크는, 가중치와 은닉층 수를 탄력적으로 조 절할 수 있으며, 회로 부하를 줄일 수 있고 행렬 곱셈 유닛 칩 크기(matrix multiplication unit chip size)도 최소화할 수 있다. 이상과 같이 본 발명에서는 구체적인 구성 요소 등과 같은 특정 사항들과 한정된 실시예 및 도면에 의해 설명되 었으나 이는 본 발명의 보다 전반적인 이해를 돕기 위해서 제공된 것일 뿐, 본 발명은 상기의 실시예에 한정되 는 것은 아니며, 본 발명이 속하는 분야에서 통상적인 지식을 가진 자라면 이러한 기재로부터 다양한 수정 및 변형이 가능하다. 따라서, 본 발명의 사상은 설명된 실시예에 국한되어 정해져서는 아니되며, 후술하는 특허청구범위뿐 아니라 이 특허청구범위와 균등하거나 등가적 변형이 있는 모든 것들은 본 발명 사상의 범주에 속한다고 할 것이다."}
{"patent_id": "10-2019-0113303", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 뉴럴 네트워크를 개략적으로 나타내는 회로도이다. 도 2는 본 발명의 일 실시예에 따른 뉴럴 네트워크의 가중치 셀을 개략적으로 나타내는 회로도이다. 도 3은 본 발명의 일 실시예에 따른 뉴럴 네트워크의 가중치 셀의 작동 원리를 개략적으로 나타내는 회로도이다. 도 4는 본 발명의 일 실시예에 따른 뉴럴 네트워크 구성을 개략적으로 나타내는 회로도이다. 도 5 및 도 6은 본 발명의 일 실시예에 따른 뉴럴 네트워크의 동작을 설명하기 위한 회로도이다."}
