{"patent_id": "10-2023-0030195", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0132393", "출원번호": "10-2023-0030195", "발명의 명칭": "이미징 대상 영역 감지 방법과 장치", "출원인": "노을 주식회사", "발명자": "송영훈"}}
{"patent_id": "10-2023-0030195", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "헤마토크릿 측정 없이 슬라이드 글래스 상에서 소정의 제 1 구간 동안 제 1 속도로 검체를 도말하는 단계;상기 슬라이드 글래스 상에서 소정의 제 2 구간 동안 상기 제 1 속도보다 더 빠른 제 2 속도로 상기 검체를 도말하는 단계; 및상기 제 1 구간에 대응되는 영역과 상기 제 2 구간에 대응되는 영역을 이미지 캡처하는 단계를 포함하는 것을특징으로 하는 헤마토크릿 측정 없이 검체를 진단하는 방법."}
{"patent_id": "10-2023-0030195", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 슬라이드 글래스 상에서 소정의 제 3 구간 동안 제 3 속도로 검체를 도말하는 단계; 및 상기 제 3 구간에 대응되는 영역을 이미지 캡처하는 단계를 더 포함하되, 상기 제 3 속도는 상기 제 2 속도보다 빠른 것을 특징으로 하는 헤마토크릿 측정 없이 검체를 진단하는 방법."}
{"patent_id": "10-2023-0030195", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 검체는 혈액이고,상기 이미지 캡처에 기초하여:상기 제 1 구간에 대응되는 제 1 도말 영역에 상기 도말 방향과 수직으로 적어도 2개의 포인트에서 상기 혈액의적혈구 수를 카운트하는 단계; 상기 제 2 구간에 대응되는 제 2 도말 영역에 상기 도말 방향과 수직으로 적어도 2개의 포인트에서 상기 혈액의적혈구 수를 카운트하는 단계; 상기 제 3 구간에 대응되는 제 3 도말 영역에 상기 도말 방향과 수직으로 적어도 2개의 포인트에서 상기 혈액의적혈구 수를 카운트하는 단계; 및상기 카운트된 적혈구 수와 소정의 기준 카운트값을 비교하는 단계; 및상기 기준 카운트값에 가장 근접한 값을 가지는 포인트가 속한 도말 영역을 염색 영역으로 결정하는 단계를 더포함하는 것을 특징으로 하는 헤마토크릿 측정 없이 검체를 진단하는 방법."}
{"patent_id": "10-2023-0030195", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서, 상기 카운트된 적혈구 수와 상기 소정의 기준 카운트값을 비교하는 단계는,상기 제 1 도말 영역의 상기 적어도 2개의 포인트 중 최대 적혈구 수를 가지는 제 1 포인트를 검출하는 단계;상기 제 2 도말 영역의 상기 적어도 2개의 포인트 중 최대 적혈구 수를 가지는 제 2 포인트를 검출하는 단계;상기 제 3 도말 영역의 상기 적어도 2개의 포인트 중 최대 적혈구 수를 가지는 제 3 포인트를 검출하는 단계;및상기 제 1 포인트, 상기 제 2 포인트, 및 상기 제 3 포인트에 대응되는 적혈구 수와 상기 소정의 기준 카운트값을 비교하는 단계를 포함하는 것을 특징으로 하는 헤마토크릿 측정 없이 검체를 진단하는 방법.공개특허 10-2023-0132393-3-청구항 5 제 4 항에 있어서, 상기 제 1 도말 영역의 상기 적어도 2개의 포인트는 3개의 포인트이고,상기 제 2 도말 영역의 상기 적어도 2개의 포인트는 3개의 포인트이고, 및상기 제 3 도말 영역의 상기 적어도 2개의 포인트도 3개의 포인트인 것을 특징으로 하는 헤마토크릿 측정 없이검체를 진단하는 방법."}
{"patent_id": "10-2023-0030195", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 3 항에 있어서, 상기 제 1 도말 영역의 상기 적어도 2개의 포인트는 3개의 포인트이고,상기 제 2 도말 영역의 상기 적어도 2개의 포인트는 3개의 포인트이고, 및상기 제 3 도말 영역의 상기 적어도 2개의 포인트도 3개의 포인트이되, 상기 측정된 적혈구 수와 상기 소정의 기준 카운트값을 비교하는 단계는,상기 제 1 도말 영역의 상기 3개의 포인트 중 중간값의 적혈구 수를 가지는 제 1 포인트를 검출하는 단계;상기 제 2 도말 영역의 상기 3개의 포인트 중 중간값의 적혈구 수를 가지는 제 2 포인트를 검출하는 단계;상기 제 3 도말 영역의 상기 3개의 포인트 중 중간값의 적혈구 수를 가지는 제 3 포인트를 검출하는 단계; 및상기 제 1 포인트, 상기 제 2 포인트, 및 상기 제 3 포인트에 대응되는 적혈구 수와 상기 소정의 기준 카운트값을 비교하는 단계를 포함하는 것을 특징으로 하는 헤마토크릿 측정 없이 검체를 진단하는 방법."}
{"patent_id": "10-2023-0030195", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 3 항에 있어서, 상기 검체는 혈액인 것을 특징으로 하고,상기 제 1 구간에 대응되는 상기 제 1 도말 영역에 상기 도말 방향과 수직으로 상기 적어도 2개의 포인트에서상기 혈액의 적혈구 수를 카운트하는 단계는,상기 도말하는 방향에 수직으로 상기 제 1 구간에 대응되는 영역에 소정의 간격으로 1-1 필드, 1-2 필드 및 1-3필드를 결정하는 단계;상기 1-1 필드 좌우로 소정의 필드를 추가로 할당하고 할당된 세개의 필드 내의 적혈수 수를 카운트하여 중간값을 가지는 필드를 상기 1-1 필드의 대표 필드로 결정하는 단계;상기 1-2 필드 좌우로 소정의 필드를 추가로 할당하고 할당된 세개의 필드 내의 적혈수 수를 카운트하여 중간값을 가지는 필드를 상기 1-2 필드의 대표 필드로 결정하는 단계;상기 1-3 필드 좌우로 소정의 필드를 추가로 할당하고 할당된 세개의 필드 내의 적혈수 수를 카운트하여 중간값을 가지는 필드를 상기 1-3 필드의 대표 필드로 결정하는 단계; 및상기 1-1 필드의 대표 필드, 상기 제 1-2 필드의 대표 필드, 상기 제 1-3 필드의 대표 필드의 적혈구 수의 중간값을 상기 제 1 구간에 대응되는 영역의 적혈구 수로 결정하는 단계를 포함하는 헤마토크릿 측정 없이 검체를진단하는 방법."}
{"patent_id": "10-2023-0030195", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 3 항에 있어서, 상기 검체는 혈액인 것을 특징으로 하고,상기 제 2 구간에 대응되는 상기 제 2 도말 영역에 상기 도말 방향과 수직으로 상기 적어도 2개의 포인트에서상기 혈액의 적혈구 수를 카운트하는 단계는,상기 도말하는 방향에 수직으로 상기 제 2 구간에 대응되는 영역에 소정의 간격으로 2-1 필드, 2-2 필드 및 2-3필드를 결정하는 단계;공개특허 10-2023-0132393-4-상기 2-1 필드 좌우로 소정의 필드 영역을 추가로 할당하고 할당된 세개의 필드 영역 내의 적혈수 수를 카운트하여 중간값을 가지는 필드를 상기 2-1 필드의 대표 필드로 결정하는 단계;상기 2-2 필드 좌우로 소정의 필드 영역을 추가로 할당하고 할당된 세개의 필드 영역 내의 적혈수 수를 카운트하여 중간값을 가지는 필드를 상기 2-2 필드의 대표 필드로 결정하는 단계;상기 2-3 필드 좌우로 소정의 필드 영역을 추가로 할당하고 할당된 세개의 필드 영역 내의 적혈수 수를 카운트하여 중간값을 가지는 필드를 상기 2-3 필드의 대표 필드로 결정하는 단계; 및상기 2-1 필드의 대표 필드, 상기 제 2-2 필드의 대표 필드, 상기 제 2-3 필드의 대표 필드의 적혈구 수의 중간값을 상기 제 2 구간에 대응되는 영역의 적혈구 수로 결정하는 단계를 포함하는 헤마토크릿 측정 없이 검체를진단하는 방법."}
{"patent_id": "10-2023-0030195", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 3 항에 있어서,상기 검체는 혈액인 것을 특징으로 하고,상기 제 3 구간에 대응되는 상기 제 3 도말 영역에 상기 도말 방향과 수직으로 상기 적어도 2개의 포인트에서상기 혈액의 적혈구 수를 카운트하는 단계는,상기 도말하는 방향에 수직으로 상기 제 3 구간에 대응되는 영역에 소정의 간격으로 3-1 필드, 3-2 필드 및 3-3필드를 결정하는 단계;상기 3-1 필드 좌우로 소정의 필드 영역을 추가로 할당하고 할당된 세개의 필드 영역 내의 적혈수 수를 카운트하여 중간값을 가지는 필드를 상기 3-1 필드의 대표 필드로 결정하는 단계;상기 3-2 필드 좌우로 소정의 필드 영역을 추가로 할당하고 할당된 세개의 필드 영역 내의 적혈수 수를 카운트하여 중간값을 가지는 필드를 상기 3-2 필드의 대표 필드로 결정하는 단계;상기 3-3 필드 좌우로 소정의 필드 영역을 추가로 할당하고 할당된 세개의 필드 영역 내의 적혈수 수를 카운트하여 중간값을 가지는 필드를 상기 3-3 필드의 대표 필드로 결정하는 단계; 및상기 3-1 필드의 대표 필드, 상기 제 3-2 필드의 대표 필드, 상기 제 3-3 필드의 대표 필드의 적혈구 수의 중간값을 상기 제 3 구간에 대응되는 영역의 적혈구 수로 결정하는 단계를 포함하는 헤마토크릿 측정 없이 검체를진단하는 방법."}
{"patent_id": "10-2023-0030195", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서, 상기 슬라이드 글래스 내에서 상기 제 1 속도로 검체를 도말하기 전 상기 슬라이드 글래스의 상기 제 1 구간 직전 구간에서 상기 제 2 속도보다 더 빠른 속도로 도말을 개시하는 단계를 더 포함하는 것을 특징으로 하는 헤마토크릿 측정 없이 검체를 진단하는 방법."}
{"patent_id": "10-2023-0030195", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "검체를 로딩하기 위한 슬라이드 글래스 및 상기 슬라이드 글래스 상에서 검체를 도말하기 위한 필름을 포함하는카트리지를 로딩할 수 있는 카트리지 로더부;상기 필름을 상기 슬라이드 글래스 상에서 소정의 제 1 구간 동안 제 1 속도로 상기 검체를 도말하도록 제어하고, 상기 슬라이드 글래스 상에서 소정의 제 2 구간 동안 상기 제 1 속도보다 더 빠른 제 2 속도로 상기 검체를도말하도록 제어하고, 상기 제 1 구간에 대응되는 영역과 상기 제 2 구간에 대응되는 영역을 이미지 캡처부를통해 캡처하도록 제어하는 프로세서를 포함하는 것을 특징으로 하는 헤마토크릿 측정 없이 검체를 진단하는 장치."}
{"patent_id": "10-2023-0030195", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서, 상기 프로세서는 상기 슬라이드 글래스 상에서 제 3 구간 동안 상기 제 2 속도보다 더 빠른 제 3 속도로 검체를 도말하도록 제어하고, 상기 제 3 구간에 대응되는 영역을 상기 이미지 캡처부를 통해 캡처하도록 제어하는 것을 특징으로 하는공개특허 10-2023-0132393-5-헤마토크릿 측정 없이 검체를 진단하는 장치."}
{"patent_id": "10-2023-0030195", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,상기 검체는 혈액이고,상기 프로세서는 상기 캡처에 기초하여:상기 제 1 구간에 대응되는 제 1 도말 영역에 상기 도말 방향과 수직으로 소정의 간격으로 이격된 3개의 포인트에서 상기 혈액의 적혈구 수를 카운트하고, 상기 제 2 구간에 대응되는 제 2 도말 영역에 상기 도말 방향과 수직으로 소정의 간격으로 3개의 포인트에서 상기 혈액의 적혈구 수를 카운트하고, 상기 제 3 구간에 대응되는 제 3 도말 영역에 상기 도말 방향과 수직으로 소정의 간격으로 3개의 포인트에서 상기 혈액의 적혈구 수를 카운트하고; 상기 측정된 적혈구 수와 소정의 기준 카운트값을 비교하고; 및상기 기준 카운트값에 가장 근접한 값을 가지는 포인트가 속한 도말 영역을 염색 영역으로 결정하는 것을 특징으로 하는 헤마토크릿 측정 없이 검체를 진단하는 장치."}
{"patent_id": "10-2023-0030195", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서, 상기 프로세서는,상기 제 1 도말 영역의 상기 3개의 포인트 중 최대 적혈구 수를 가지는 제 1 포인트를 검출하고, 상기 제 2 도말 영역의 상기 3개의 포인트 중 최대 적혈구 수를 가지는 제 2 포인트를 검출하고, 상기 제 3 도말 영역의 상기 3개의 포인트 중 최대 적혈구 수를 가지는 제 3 포인트를 검출하고, 및상기 제 1 포인트, 상기 제 2 포인트, 및 상기 제 3 포인트에 대응되는 적혈구 수와 상기 소정의 기준 카운트값을 비교하는 것을 특징으로 하는 헤마토크릿 측정 없이 검체를 진단하는 장치."}
{"patent_id": "10-2023-0030195", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 13 항에 있어서, 상기 프로세서는,상기 제 1 도말 영역의 상기 3개의 포인트 중 중간값의 적혈구 수를 가지는 제 1 포인트를 결정하고, 상기 제 2 도말 영역의 상기 3개의 포인트 중 중간값의 적혈구 수를 가지는 제 2 포인트를 결정하고,상기 제 3 도말 영역의 상기 3개의 포인트 중 중간값의 적혈구 수를 가지는 제 3 포인트를 결정하고; 및상기 제 1 포인트, 상기 제 2 포인트, 및 상기 제 3 포인트에 대응되는 적혈구 수와 상기 소정의 기준 카운트값을 비교하는 것을 특징으로 하는 헤마토크릿 측정 없이 검체를 진단하는 장치."}
{"patent_id": "10-2023-0030195", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 13 항에 있어서, 상기 프로세서는, 상기 도말하는 방향에 수직으로 상기 제 1 구간에 대응되는 영역에 소정의 간격으로 1-1 필드, 1-2 필드 및 1-3필드를 결정하고, 상기 1-1 필드 좌우로 소정의 필드를 추가로 할당하고 할당된 세개의 필드 내의 적혈수 수를 카운트하여 중간값을 가지는 필드를 상기 1-1 필드의 대표 필드로 결정하고,상기 1-2 필드 좌우로 소정의 필드를 추가로 할당하고 할당된 세개의 필드 내의 적혈수 수를 카운트하여 중간값을 가지는 필드를 상기 1-2 필드의 대표 필드로 결정하고,상기 1-3 필드 좌우로 소정의 필드를 추가로 할당하고 할당된 세개의 필드 내의 적혈수 수를 카운트하여 중간값공개특허 10-2023-0132393-6-을 가지는 필드를 상기 1-3 필드의 대표 필드로 결정하고, 및상기 1-1 필드의 대표 필드, 상기 제 1-2 필드의 대표 필드, 상기 제 1-3 필드의 대표 필드의 적혈구 수의 중간값을 상기 제 1 구간에 대응되는 영역의 적혈구 수로 결정하는, 헤마토크릿 측정 없이 검체를 진단하는 방법."}
{"patent_id": "10-2023-0030195", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "검체를 로딩하기 위한 슬라이드 글래스, 상기 슬라이드 글래스 상에서 검체를 도말하기 위한 필름, 및 상기 필름을 지지하는 캡을 포함하는 카트리지를 로딩할 수 있는 카트리지 로더부;상기 캡이 상기 필름을 푸쉬하는 정도를 제어하여 상기 필름과 상기 슬라이드 글래스 간의 각도를 제어하되, 상기 슬라이드 글래스 상에 소정의 제 1 구간 동안 제 1 각도로 상기 검체를 떨어뜨려 도말하도록 제어하고, 상기슬라이드 글래스 상에 소정의 제 2 구간 동안 상기 제 1 각도보다 더 큰 제 2 각도로 상기 검체를 떨어뜨려 도말하도록 제어하고, 상기 제 1 구간에 대응되는 영역과 상기 제 2 구간에 대응되는 영역을 이미지 캡처부를 통해 캡처하도록 제어하는 프로세서를 포함하는 것을 특징으로 하는 헤마토크릿 측정 없이 검체를 진단하는 장치."}
{"patent_id": "10-2023-0030195", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 17 항에 있어서, 상기 프로세서는 상기 슬라이드 글래스 상에 제 3 구간 동안 상기 제 2 각도보다 더 큰 제 3 각도로 검체를 떨어뜨려 도말하도록제어하고, 상기 제 3 구간에 대응되는 영역을 상기 이미지 캡처부를 통해 캡처하도록 제어하는 것을 특징으로하는 헤마토크릿 측정 없이 검체를 진단하는 장치."}
{"patent_id": "10-2023-0030195", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 18 항에 있어서,상기 검체는 혈액이고,상기 프로세서는 상기 캡처에 기초하여:상기 제 1 구간에 대응되는 제 1 도말 영역에 상기 도말 방향과 수직으로 소정의 간격으로 이격된 3개의 포인트에서 상기 혈액의 적혈구 수를 카운트하고, 상기 제 2 구간에 대응되는 제 2 도말 영역에 상기 도말 방향과 수직으로 소정의 간격으로 3개의 포인트에서 상기 혈액의 적혈구 수를 카운트하고, 상기 제 3 구간에 대응되는 제 3 도말 영역에 상기 도말 방향과 수직으로 소정의 간격으로 3개의 포인트에서 상기 혈액의 적혈구 수를 카운트하고; 상기 측정된 적혈구 수와 소정의 기준 카운트값을 비교하고; 및상기 기준 카운트값에 가장 근접한 값을 가지는 포인트가 속한 도말 영역을 염색 영역으로 결정하는 것을 특징으로 하는 헤마토크릿 측정 없이 검체를 진단하는 장치."}
{"patent_id": "10-2023-0030195", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 19 항에 있어서, 상기 프로세서는,상기 제 1 도말 영역의 상기 3개의 포인트 중 중간값의 적혈구 수를 가지는 제 1 포인트를 결정하고, 상기 제 2 도말 영역의 상기 3개의 포인트 중 중간값의 적혈구 수를 가지는 제 2 포인트를 결정하고,상기 제 3 도말 영역의 상기 3개의 포인트 중 중간값의 적혈구 수를 가지는 제 3 포인트를 결정하고; 및상기 제 1 포인트, 상기 제 2 포인트, 및 상기 제 3 포인트에 대응되는 적혈구 수와 상기 소정의 기준 카운트값을 비교하는 것을 특징으로 하는 헤마토크릿 측정 없이 검체를 진단하는 장치."}
{"patent_id": "10-2023-0030195", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시예에 따라, 헤마토크릿 측정 없이 검체를 진단하는 방법은 헤마토크릿 측정 없이 슬라이드 글 래스 상에서 소정의 제 1 구간 동안 제 1 속도로 검체를 도말하는 단계; 슬라이드 글래스 상에서 소정의 제 2 구 간 동안 상기 제 1 속도보다 더 빠른 제 2 속도로 상기 검체를 도말하는 단계; 및 제 1 구간에 대응되는 영역과 상기 제 2 구간에 대응되는 영역을 이미지 캡처하는 단계를 포함한다."}
{"patent_id": "10-2023-0030195", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 검체 진단 장치에서 검체의 도말 속도를 가변시켜 헤마토크릿 측정 없이 일회의 도말로 이미징 대상 영역을 감지하는 방법과 장치에 관한 것이다."}
{"patent_id": "10-2023-0030195", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "헤마토크릿(hematocrit)은 혈액검사의 일종으로 전체 혈액 중에서 적혈구 비율이 얼마나 되는지를 %로 나타낸 것이다. 헤마토크릿 수치 검사를 통해 주로 빈혈을 진단할 수 있다. 남녀 별로 다소 차이가 있으나 남성의 경우 정상 헤마토크릿 기준치는 보통 39~52% 정도이고 여성의 경우 정상 헤마토크릿 기준치는 36~48%이다. 헤마토크 릿 수치가 떨어지면 혈액의 산소 운반 능력이 떨어지고 반대로 헤마토크릿 수치가 올라가면 혈액이 끈적해져 혈 액 흐름이 느려지게 된다."}
{"patent_id": "10-2023-0030195", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예에 따라, 헤마토크릿 측정 없이 검체를 진단하는 방법은 헤마토크릿 측정 없이 슬라이드 글 래스 상에서 소정의 제 1 구간 동안 제 1 속도로 검체를 도말하는 단계; 슬라이드 글래스 상에서 소정의 제 2 구간 동안 상기 제 1 속도보다 더 빠른 제 2 속도로 상기 검체를 도말하는 단계; 및 제 1 구간에 대응되는 영역 과 상기 제 2 구간에 대응되는 영역을 이미지 캡처하는 단계를 포함한다. 본 개시의 일 실시예에 따라, 헤마토크릿 측정 없이 검체를 진단하는 장치는 검체를 로딩하기 위한 슬라이드 글 래스 및 상기 슬라이드 글래스 상에서 검체를 도말하기 위한 필름을 포함하는 카트리지를 로딩할 수 있는 카트 리지 로더부; 필름을 상기 슬라이드 글래스 상에서 소정의 제 1 구간 동안 제 1 속도로 상기 검체를 도말하도록 제어하고, 상기 슬라이드 글래스 상에서 소정의 제 2 구간 동안 상기 제 1 속도보다 더 빠른 제 2 속도로 상기 검체를 도말하도록 제어하고, 상기 제 1 구간에 대응되는 영역과 상기 제 2 구간에 대응되는 영역을 이미지 캡 처부를 통해 캡처하도록 제어하는 프로세서를 포함하는 것을 특징으로 한다. 본 개시의 일 실시예에 따라, 헤마토크릿 측정 없이 검체를 진단하는 장치는 검체를 로딩하기 위한 슬라이드 글 래스, 상기 슬라이드 글래스 상에서 검체를 도말하기 위한 필름, 및 상기 필름을 지지하는 캡을 포함하는 카트 리지를 로딩할 수 있는 카트리지 로더부; 캡이 상기 필름을 푸쉬하는 정도를 제어하여 상기 필름과 상기 슬라이 드 글래스 간의 각도를 제어하되, 상기 슬라이드 글래스 상에 소정의 제 1 구간 동안 제 1 각도로 상기 검체를 떨어뜨려 도말하도록 제어하고, 상기 슬라이드 글래스 상에 소정의 제 2 구간 동안 상기 제 1 각도보다 더 큰 제 2 각도로 상기 검체를 떨어뜨려 도말하도록 제어하고, 상기 제 1 구간에 대응되는 영역과 상기 제 2 구간에 대응되는 영역을 이미지 캡처부를 통해 캡처하도록 제어하는 프로세서를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0030195", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시에서 사용되는 용어에 대해 간략히 설명하고, 본 개시의 일 실시예에 대해 구체적으로 설명하기로 한다. 본 개시에서 사용되는 용어는 본 개시의 일 실시예에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적 인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 본 개시의 실 시예의 설명 부분에서 상세히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명 칭이 아닌, 그 용어가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 개시 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 본 개시에 기재된 \"...부\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 아래에서는 첨부한 도면을 참고하여 본 개시의 실시예에 대하여 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 개시의 일 실시예는 여러 가지 상이한 형태 로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 개시의 일 실시예를 명 확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 본 개시 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 도 1은 본 개시의 일 실시예에 따른 검체 진단 장치를 나타내는 블럭도이다. 본 개시의 일 실시예에 따라 검체 진단 장치는 감염 진단을 위해 먼저 검체를 도말하기 위한 기능을 수행 하므로 검체 도말 장치라고 불리울 수도 있다. 도 1에 도시된 바와 같이, 본 개시의 일 실시예에 따른 검체 진단 장치는, 카트리지 로더부, 프로 세서, 이미지 검경부, 이미지 캡처부, 사용자 출력 인터페이스, 사용자 입력 인터페이 스, 메모리를 포함할 수 있다. 검체 진단 장치의 각 구성요소들은 모두 필수적인 것은 아니 며, 제조사의 설계 사상에 따라 각 구성요소들은 가감될 수 있다. 이하 상기 구성요소들에 대해 차례로 살펴본다. 카트리지 로더부는 적혈구 검체를 로딩하는 부분으로서, 카트리지가 카트리지 로더부에 로딩되면 적혈구 검체가 카트리지에 로딩된 후 도말되고, 이미지 검경부에 의해 검경될 수 있도록 탑재될 수 있다. 카트리지는 검체를 로딩하는 슬라이드 글래스와 슬라이드 글래스 상에 로딩된 검체를 도말하기 위한 스미어링 필름을 포함할 수 있다. 카트리지에 대한 상세한 설명은 도 2를 참조하여 설명하도록 한다. 프로세서는, 검체 진단 장치의 전반적인 동작을 제어한다. 프로세서는 메모리에 저장 된 프로그램들을 실행함으로써, 카트리지 로더부, 이미지 검경부, 이미지 캡처부, 사용자 출 력 인터페이스, 사용자 입력 인터페이스, 및 메모리를 제어할 수 있다. 본 개시의 일 실시예에 의하면, 프로세서는, 인공 지능(AI) 프로세서를 탑재할 수도 있다. 인공 지능(AI) 프로세서는, 인공 지능(AI)을 위한 전용 하드웨어 칩 형태로 제작될 수도 있고, 기존의 범용 프로세서(예: CPU또는 application processor) 또는 그래픽 전용 프로세서(예: GPU - Graphic Processing Unit)의 일부로 제작 되어 검체 진단 장치에 탑재될 수도 있다. 프로세서는 본 개시의 일 실시예에 따라 인공 지능(AI) 프로세서일 수 있다. 본 개시의 일 실시예에 의하면, 프로세서는 검체 진단 장치에서 적혈구 이미지에 따른 감염 진단을 수행하고 메모리에 저장된 프로그램을 실행하여 검체 진단 장치의 전반적인 제어를 수행할 수 있다. 프로세서는 본 개시의 도 7 내지 도 9를 통해 설명된 검체를 도말하고 감염을 진단하는 방법을 직 접 수행하거나 검체 진단 장치의 컴포넌트를 제어하여 필요한 동작을 수행할 수 있다. 검체 진단에 따른 특정 질병 감염 여부 및/또는 검체로부터 카운트되는 적혈구 수 정보는 메모리에 저장 될 수 있다. 이미지 검경부는 현미경과 같은 광학 장치로서, 적혈구 이미지를 확대해서 볼 수 있는 장치를 의미한다. 이미지 검경부는 검체 진단 장치에 함께 구비될 수도 있고, 별도로 구비되는 옵션 장치일 수도 있 다. 이미지 검경부를 통해 카트리지 로더부에 놓인 도말된 적혈구 검체를 확대하여 확인할 수 있다. 이미지 검경부는 광학 현미경일 수 있고, 광학 현미경 중에서도 명시야 현미경, 위상차 현미경, 암 시야 현미경, 편광 현미경, 형광 현미경 중 어느 하나일 수 있다. 이미지 캡처부는 이미지 검경부를 통해 확인되는 적혈구 검체 이미지를 캡처한다. 이미지 캡처부 는 보통 정밀 카메라로 이루어진다. 이미지 캡처부의 카메라는 CMOS 센서로 이루어질 수도 있으나 이에 한정되는 것은 아니다. 이미지 캡처부에 의해 캡처된 적혈구가 포함된 이미지는 이미지 분류를 위해 프로세서에 의해 이미지 프로세싱 - 그래픽 처리된다. 사용자 출력 인터페이스는, 오디오 신호 또는 비디오 신호의 출력을 위한 것으로, 디스플레이부가 포함될 수 있다. 도시되지 않았으나 제작자의 선택에 따라 사용자 출력 인터페이스는 선택적으로 음향 출 력부도 포함될 수 있다. 본 개시의 일 실시예에 의하면, 검체 진단 장치는 디스플레이부를 통해서 검체 진단 장치와 관련된 정보를 표시할 수 있다. 예를 들어, 검체 진단 장치에 의해 수행된 말라리아 감염 이미지와 함께 말라리아 중에서도 어떤 종인지 여부와 감염율 그리고 환자의 상태를 디스플레이부에 표시할 수 있다. 디스플레이부와 터치패드가 레이어 구조를 이루어 터치 스크린으로 구성될 수도 있다. 디스플레이부 가 터치패드가 레이어 구조를 이루어 터치 스크린으로 구성되는 경우, 디스플레이부는 출력 장치 이외에 입력 장치로도 사용될 수 있다. 디스플레이부는 액정 디스플레이(liquid crystal display), 박막 트랜지스터 액정 디스플레이(thin film transistor-liquid crystal display), 발광 다이오드(LED, light- emitting diode), 유기 발광 다이오드(organic light-emitting diode), 플렉시블 디스플레이(flexible display), 3차원 디스플레이(3D display), 전기영동 디스플레이(electrophoretic display) 중에서 적어도 하나 를 포함할 수 있다. 그리고 검체 진단 장치의 구현 형태에 따라 디스플레이부를 2개 이상 포함할 수도 있다. 본 개시의 일 실시예에 의하면, 사용자 출력 인터페이스는 검체에 따른 감염 진단에 따른 다양한 정보를 출력할 수 있다. 예를 들어, 검체가 혈액이고 감염 진단이 말라리아 감염 진단인 경우 말라리아 감염 분류, 감 염율, 환자 상태 결과 뿐 아니라 다양한 이미지 검경 관련 정보를 디스플레이부를 통해 출력할 수 있다. 본 개시의 일 실시예에 의하면 사용자 출력 인터페이스에는 검체의 일정 필드 내의 적혈구 수가 표시될 수 있다. 본 개시의 일 실시예에 의하면, 사용자 출력 인터페이스는 현재 파워 레벨, 동작 모드(예컨대, 이미지 검 경 모드, 감염 판단 모드, 슬립 모드 등) 등을 표시할 수도 있다. 사용자 입력 인터페이스는, 사용자로부터의 입력을 수신하기 위한 것이다. 사용자 입력 인터페이스(260 0)는 키 패드(key pad), 돔 스위치 (dome switch), 터치 패드(접촉식 정전 용량 방식, 압력식 저항막 방식, 적 외선 감지 방식, 표면 초음파 전도 방식, 적분식 장력 측정 방식, 피에조 효과 방식 등), 조그 휠, 조그 스위치 중 적어도 하나일 수 있으나, 이에 한정되는 것은 아니다. 사용자 입력 인터페이스는 음성 인식 모듈을 포함할 수 있다. 예를 들어, 검체 진단 장치는 마이크 로폰을 통해 아날로그 신호인 음성 신호를 수신하고, ASR(Automatic Speech Recognition) 모델을 이용하여 음성 부분을 컴퓨터로 판독 가능한 텍스트로 변환할 수 있다. 검체 진단 장치는 자연어 이해(Natural LanguageUnderstanding, NLU) 모델을 이용하여 변환된 텍스트를 해석하여, 사용자의 발화(utterance) 의도를 획득할 수 있다. 여기서 ASR 모델 또는 NLU 모델은 인공지능 모델일 수 있다. 인공지능 모델은 인공지능 모델의 처리에 특 화된 하드웨어 구조로 설계된 인공지능 전용 프로세서에 의해 처리될 수 있다. 이 때 프로세서는 인공지 능 전용 프로세서일 수 있다. 인공지능 모델은 학습을 통해 만들어 질 수 있다. 여기서, 학습을 통해 만들어진 다는 것은, 기본 인공지능 모델이 학습 알고리즘에 의하여 다수의 학습 데이터들을 이용하여 학습됨으로써, 원 하는 특성(또는, 목적)을 수행하도록 설정된 기 정의된 동작 규칙 또는 인공지능 모델이 만들어짐을 의미한다. 인공지능 모델은, 복수의 신경망 레이어들로 구성될 수 있다. 복수의 신경망 레이어들 각각은 복수의 가중치들 (weight values)을 갖고 있으며, 이전(previous) 레이어의 연산 결과와 복수의 가중치들 간의 연산을 통해 신경 망 연산을 수행한다. 언어적 이해는 인간의 언어/문자를 인식하고 응용/처리하는 기술로서, 자연어 처리(Natural Language Processing), 기계 번역(Machine Translation), 대화 시스템(Dialog System), 질의 응답(Question Answering), 음성 인식/합성(Speech Recognition/Synthesis) 등을 포함한다. 메모리는, 프로세서의 처리 및 제어를 위한 프로그램을 저장할 수도 있고, 입/출력되는 데이터들 (예컨대, 검체 진단 장치의 진단 정보, 적혈구 이미지, 적혈구의 수)을 저장할 수도 있다. 메모리 는 인공지능 모델을 저장할 수도 있다. 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(RAM, Random Access Memory) SRAM(Static Random Access Memory), 롬(ROM, Read-Only Memory), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 또한, 검체 진단 장치 는 인터넷(internet)상에서 저장 기능을 수행하는 웹 스토리지(web storage) 또는 클라우드 서버를 운영 할 수도 있다. 통신부는, 근거리 통신부, 원거리통신부를 포함할 수 있다. 근거리 통신부(2810, short- range wireless communication interface)는, 블루투스 통신부, BLE(Bluetooth Low Energy) 통신부, 근거리 무 선 통신부(Near Field Communication interface), WLAN(와이파이) 통신부, 지그비(Zigbee) 통신부, 적외선 (IrDA, infrared Data Association) 통신부, WFD(Wi-Fi Direct) 통신부, UWB(Ultra Wideband) 통신부, Ant+ 통신부 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 원거리통신부는, 이동 통신망 상에서 기지국, 외부의 단말, 서버 중 적어도 하나와 무선 신호를 송수신한다. 여기에서, 무선 신호는, 음성 호 신호, 화상 통화 호 신호 또는 문자/멀티미디어 메시지 송수신에 따른 다양한 형태의 데이터를 포함할 수 있다. 원거 리통신부는, 3G 모듈, 4G 모듈, 5G 모듈, LTE 모듈, NB-IoT 모듈, LTE-M 모듈 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 본 개시의 일 실시예에 의하면, 통신부를 통해 검체 진단 장치 외부의 서버나 다른 전기기기와 통 신을 하고 데이터를 송수신할 수 있다. 통신부는 검체 진단 장치의 판매 목적이나 가격 경쟁력을 위해 옵션으로 포함될 수도 있고 통신이 필요하지 않은 경우 포함되지 않을 수도 있다. 도 2는 본 개시의 일 실시예에 따라 카트리지 로더부에 로딩되는 카트리지를 나타내는 도면이다. 검체를 도말하고 검체 이미지를 캡처하고 염색하기 위해서는 검체가 로딩되는 카트리지가 필요하다. 도 2는 이 러한 카트리지를 보여주는 도면이다. 카트리지는 하부에 슬라이드 글래스, 그리고 슬라이드 글래스 상에 검체가 로딩될 경우 이를 도말하기 위한 필름, 필름을 포함하는 카트리지(100 0)의 상부와 슬라이드 글래스 간 도말이 되도록 이동하도록 하는 가드레일, 그리고 염색을 위한 시 약을 탑재하는 시약 탑재부를 포함할 수 있다. 시약 탑재부는 도 2에서 3개의 투입구(1201, 1202, 1203)를 포함하고 있으나 이는 실시예에 불과할 뿐 투입구의 수는 조정될 수 있다. 검체가 슬라이드 글래스 상에 로딩되면 가드레일을 통해 필름이 이동하면서 검체를 도말하게 된다. 보통 혈액 검체 도말 전에는 헤마토크릿을 먼저 측정한 후 낮은(low) 헤마토크릿 혈액인지 아니면 정상 (normal) 헤마토크릿 혈액인지를 판단한 후 판단 결과에 따라 적절한 속도로 혈액 도말을 진행하게 된다. 예를 들어 낮은(low) 헤마토크릿 혈액이면 단일 혈액 부피당 RBC(red blood cell count) 개수가 적기 때문에 한 뷰 (view)에 보이는 RBC 개수를 늘리려면 정상(normal) 헤마토크릿 보다는 속도가 빨라야 한다. 따라서, 도말 속도를 결정하기 위해 혈액 도말 전 반드시 헤마토크릿 측정이 선행되어야 한다. 하지만, 본 개시에서는 헤마토크릿 측정 없이 도말 속도를 복수개로 하여 슬라이드 글래스 상 도말 속도가 다른 각 영역을 이미지 캡처하고 적혈구 수를 카운트하여 최종 염색을 할 수 있는 적절한 영역을 결정할 수 있다. 도 3a는 본 개시의 일 실시예에 따라 검체 도말 방향에 따라 소정 구간마다 도말 속도를 달리하는 것을 나타내 는 도면이다. 도 3a를 참조하면, 화살표 방향으로 검체의 도말이 이루어지게 되는데, 필름이 1010의 영역을 지나는 구 간에서는 v1 속도로 도말을 하고, 필름이 1020의 영역을 지나는 구간에서는 v2(>v1) 속도로 도말하게 된다. 1020 영역에서 속도가 1010 영역에서 속도에 비해 커야 하는 이유는 도말되는 혈액 검체에서 혈구가 뭉치 지 않고 하나로 펴져서 모노레이어(monolayer)가 되도록 하기 위해서이다. 1010 영역과 1020 영역을 각각 다른 속도로 도말한 후 슬라이드 글래스 상에 도말된 검체를 이미지 캡처하면 1010 영역과 1020 영역에서 RBC 분포가 달라지게 될 것이다. 1010 영역에서 대표적인 RBC를 구하기 위해 도 3a 에서 보는 바와 같이 도말 방향 대비 수직 방향으로 2개 이상의 포인트를 결정한다. 도 3a에서는 1010 영역에서 3개의 포인트를 결정하였는데, 이는 일 실시예에 불과할 뿐 결정되는 포인트의 수는 3개보다 적은 2개이거나 3 개보다 많은 수로 결정될 수 있다. 본 개시에서는 설명의 편의 상 3개의 포인트를 결정하여 RBC를 결정하는 것 을 아래에서 살펴보도록 한다. 본 개시의 일 실시예에 따라, 3개의 포인트는 소정의 간격으로 서로 이격될 수 있다. 검체 진단 장치의 프로세서는 3개의 포인트에 대응되는 필드(예를 들어, 1920 X 1200 픽셀 크기의 필드) 내에서 RBC를 구할 수 있다. 본 개시의 일 실시예에 따라, 검체 진단 장치의 프로세서는 카운트된 RBC와 소정의 기준 카운트값 을 비교할 수 있다. 예를 들어 실험적으로 앞선 필드 내에 RBC가 500이고, 1010 영역 3개의 포인트 각각에서 구 해진 RBC가 120, 380, 470이라고 할 때 프로세서는 470을 1010 영역의 대표 RBC로 결정할 수 있다. 1020 영역에 대해서도 3개의 포인트를 결정하여 3개의 포인트에 대응되는 필드에서 RBC를 구할 수 있다. 1010 영역에서 수행한 동일한 방식으로 1020 영역의 3개 포인트에 대해 RBC를 구한 결과 각 포인트 별로 350, 510, 550 값을 획득했을 때, 프로세서는 510을 1020 영역의 대표 RBC로 결정할 수 있다. 또한 프로세서는 1010 영역의 대표 RBC 470과 1020 영역의 대표 RBC 510을 비교하여 기준 카운트값 500에 1020 영역의 대표 RBC 510가 더 근접했음을 결정하고, 1020 영역이 1010 영역 보다는 염색에 더 적합한 영역이 라고 결정할 수 있다. 본 개시의 일 실시예에 따라, 1010 영역 3개의 포인트로부터 1010 영역의 대표 RBC 값을 구할 때, 3개의 포인트 의 RBC 중 중간값을 대표 RBC로 결정할 수 있다. 예를 들어 위의 예에서, 1010 영역 3개의 포인트 각각에서 구 해진 RBC가 120, 380, 470이라고 할 때 프로세서는 380을 1010 영역의 대표 RBC로 결정할 수 있다. 마찬 가지 방법으로 1020 영역의 대표 RBC는 510이 된다. 그리고, 또한 프로세서는 1010 영역의 대표 RBC 380 과 1020 영역의 대표 RBC 510을 비교하여 기준 카운트값 500에 1020 영역의 대표 RBC 510가 더 근접했음을 결정 하고, 1020 영역이 1010 영역 보다는 염색에 더 적합한 영역이라고 결정할 수 있다. 본 개시의 일 실시예에 따라, 1010 영역 3개의 포인트로부터 1010 영역의 대표 RBC 값을 구할 때, 3개의 포인트 의 RBC 중 최대값을 대표 RBC로 결정할 수 있다. 3개의 포인트의 RBC 중 최대값을 대표 RBC로 결정하는 이유는 세로 줄무늬가 발생하여 원하지 않는 영역에서 RBC 값을 얻는 경우를 방지하기 위함이다. 예를 들어 위의 예에 서, 1010 영역 3개의 포인트 각각에서 구해진 RBC가 120, 380, 470이라고 할 때 프로세서는 470을 1010 영역의 대표 RBC로 결정할 수 있다. RBC가 120인 경우는 예를 들어 줄무늬에 의해 제대로 된 RBC가 카운트될 수 없는 영역일 수 있다. 마찬가지 방법으로 1020 영역의 대표 RBC는 550이 된다. 그리고, 또한 프로세서는 1010 영역의 대표 RBC 470과 1020 영역의 대표 RBC 550을 비교하여 기준 카운트값 500에 1010 영역의 대표 RBC 470가 더 근접했음을 결정하고, 1010 영역이 1020 영역 보다는 염색에 더 적합한 영역이라고 결정할 수 있다. 도 3b는 본 개시의 일 실시예에 따라 검체 도말 방향에 따라 소정 구간마다 도말 속도를 달리하는 것을 나타내 는 도면이다. 도 3b는 도 3a와 달리 도말 영역을 세개(1010, 1020, 1030)로 나눈다. 일 실시예에 따라 세번째 영역인 1030 영 역에서는 v3(>v2)의 속도로 도말한다. 도 3b는 각각 다른 속도로 도말하는 영역이 3개로 늘어났을 뿐 그 외 동작은 앞선 도 3a에서의 동작과 동일하므 로 중복되는 설명은 생략하기로 한다. 검체 진단 장치의 프로세서는 1030 영역에서 도 3a에서 소개 된 방법과 동일한 방법에 의해 1030 영역의 대표 RBC를 구할 수 있다. 그리고 프로세서는 1010 영역의 대 표 RBC, 1020 영역의 대표 RBC, 1030 영역의 대표 RBC를 소정의 기준 RBC 값과 비교하여 1010, 1020, 1030 중 가장 염색에 적합한 영역을 결정할 수 있다. 일 실시예에서, 도말 속도는 슬라이드 글래스의 길이와 다른 제반 조건에 따라 조금씩 달라질 수 있으나, 대략 v1 = 10~50 mm/s, v2 = 20~60 mm/s, v3 = 30~70 mm/s 일 수 있다. 하지만, 이러한 속도 범위에도 불구하고 v1 < v2 < v3 관계는 유지되는 것이 바람직하다. 도 3c는 본 개시의 일 실시예에 따라 검체 도말 방향에 따라 소정 구간마다 도말 속도를 달리하는 것을 나타내 는 도면이다. 도 3c에서는 슬라이드 글래스 내에서 1010 영역을 v1 속도로 검체를 도말하기 전 슬라이드 글래스 의 제 1 구간 직전 구간인 1040 영역에서 v2 및 v3 보다 더 빠른 속도인 v0로 도말을 개시할 수 있다. 1040 영역 에서 v0 속도로 도말을 개시하는 이유는 필름이 슬라이드 글래스 상에서 도말을 개시할 때 대량의 혈액을 슬라이드 글래스 상에 떨구기 위함이다. 도 4는 본 개시의 일 실시예에 따라 도말 방향에 빈줄이 발생하는 경우를 나타내는 도면이다. 도말 방향에 빈 줄이 나타나는 것은, 슬라이스 글래스 내 이물질이 존재하거나, 스미어링 대상 필름 에 이물질이 존재하거나, 슬라이스 글래스에 유분기가 묻어있거나, 혈액이 너무 오래되어 애그리게 이션(aggregation)이 발생하는 것 중 적어도 어느 하나의 이유 때문이다. 도 4와 같이 도말 시 빈줄이 발생하게 되면 해당 영역의 혈액 RBC 값은 적절한 값을 나타내지 못한다. 따 라서, 본 개시의 일 실시예에 따라 도말 시 속도를 변경하고 혈구 이미지를 캡처하고 RBC 값을 확인할 때 빈줄 이 있는 영역을 선택하면 RBC 값 오류가 커지게 된다. 이러한 빈줄은 도말 방향으로 나타나게 되므 로 도말 속도가 동일한 영역 내에서 도말 방향의 수직으로 복수의 포인트를 선정하여 RBC를 구하는 것이 바람직 하다. 복수의 포인트는 2개 이상의 포인트 일 수 있다. 도 4에서는 본 개시의 일 실시예에 따라 3개의 포인트를 정하여 RBC 값을 구하는 것을 보여준다. 도 4를 참조하면 본 개시의 일 실시예에 따라 도말 방향과 수직으로 세개의 포인트 1011, 1012, 1013에서 RBC를 구하여 적절한 RBC를 해당 영역의 대표 RBC로 선정하게 된다. 예를 들어 1012 포인트에서 RBC는 빈줄로 인해 RBC 값이 현저히 낮을 것이다. 그에 반해 1011 포인트와 1013 포인트에는 빈줄이 없으므로 RBC는 적절한 값이 산출될 것이다. 도 5a는 본 개시의 일 실시예에 따라 이미지 캡처 시 세포가 없는 경우가 포함된 혈구 이미지이다. 도 5a에서 510, 520, 530은 일례로 v1 속도로 도말하는 도말 방향 수직으로 3개의 포인트에 대응되는 필드에서 혈구 이미지를 보여주고 있고, 540, 550, 560은 v2 속도로 도말하는 도말 방향 수직으로 3개의 포인트에 대응되 는 필드에서 혈구 이미지를 보여주고 있다. 여기서 필드는 RBC를 카운트하기 위한 소정의 카운트 영역을 의미하 는데, 일례로 1920x1200 픽셀 영역일 수 있다. 도 4에서와 같이 빈줄의 영향을 최소화하기 위해 도말 방향에 수직으로 복수의 포인트에서 RBC를 구하더 라도, 빈줄이 많이 발생하거나 도 5a에서 보는 바와 같이 복수의 포인트 중 어느 하나의 필드에서 혈구세포가 빈 곳이 발생할 수 있다. 이와 같이 혈구 세포가 빈 곳이 발생함에 의해 적정한 RBC가 획득되지 못하는 것을 방지하기 위한 방법이 필요하다. 도 5b는 본 개시의 일실시예에 따라 이미지 캡처 시 세포가 없는 혈구 이미지가 포함된 경우에 적절한 RBC를 획 득하기 위한 방법을 도시한다. 도 5b를 참조하면, 본 개시의 일 실시예에 따라 카트리지에서 도말 방향의 수직 방향으로 세개의 포 인트를 결정하고 세개의 포인트의 좌우 필드를 추가로 지정하여 각각의 필드에서 RBC를 구하는 것이 도시되고 있다. 본 개시의 일 실시예에 따라, 검체 진단 장치의 프로세서는 도말 방향의 수직 방향 중 좌측에 510C 포인트를 중심으로 좌우로 510L, 510R 포인트를 추가하여 각각의 포인트에 대응되는 필드에서 RBC를 획득 할 수 있다. 획득된 RBC는 510L 포인트에서 400, 510C 포인트에서 150, 510R 포인트에서 140이다. 획득된 RBC 를 고려할 때 510C 지점에서는 혈구 세포가 비어있는, 적정한 RBC가 반영되지 않고 있는 필드라고 볼 수 있다. 또한, 검체 진단 장치의 프로세서는 도말 방향의 수직 방향 중앙에 520C 포인트를 중심으로 좌우로 520L, 520R 포인트를 추가하여 각각의 포인트에 대응되는 필드에서 RBC를 획득한다. 획득된 RBC는 520L 포인트에서 200, 520C 포인트에서 550, 520R 포인트에서 220이다. 앞서의 경우와 마찬가지로 520L과 520R 포인 트는 혈구 세포가 비정상적으로 비어있는 필드로 볼 수 있다. 마찬가지로 검체 진단 장치의 프로세서 는 도말 방향의 수직 방향 중 우측에 530C 포인트를 중심으로 좌우로 530L, 530R 포인트를 추가하여 각각의 포인트에 대응되는 필드에서 RBC를 획득할 수 있다. 획득된 RBC는 530L 포인트에서 410, 530C 포인트에 서 430, 530R 포인트에서 420이다. 530L, 530C, 530R 포인트에서는 RBC 값을 고려할 때 혈구 세포가 비정상적으 로 비어있는 필드는 없는 것으로 판단될 수 있다. 검체 진단 장치의 프로세서는 도말 방향의 수직 방향으로 세개의 포인트의 대표 RBC를 결정할 수 있다. 대표 RBC를 결정할 때 예를 들어 인접한 세개의 필드 중 중간값을 택하거나 최대값을 택할 수 있다. 비정상적인 혈구 세포 분포를 보이는 경우가 많이 발생하는 것은 아니므로 인접한 세개의 필드 중 중간값을 택 하여도 적정 RBC 값을 구할 수 있을 것이나 빈 혈구 세포로 인한 RBC 값 오류로부터 최대한 안전한 선택을 하기 위해 세개의 필드 중 최대값을 갖는 RBC 값을 취할 수도 있다. 다만, 세개의 필드 중 최대값을 갖는 RBC 값을 취할 경우 도말이 적절하게 되지 않아 비정상적으로 많은 RBC 값이 발생하는 경우의 오류가 반영될 리스크도 있 다. 하지만, 도 5b에 따른 방식은 결국 9개의 포인트 중 가장 적절한 RBC 값을 선정하여 해당 영역의 대표 RBC 를 선정하도록 하므로 3개의 포인트 만으로 결정하는 경우보다는 2중 안전 장치를 통한 적정 RBC 값을 구할 수 있도록 해준다. 만일 인접한 세개의 필드 중 중간값을 택하는 경우, 도 5b에서 좌측 포인트에서는 510L-410, 가운데 포인트에서 는 520R-220, 우측 포인트에서는 530R-420이 선택될 것이다. 검체 진단 장치의 프로세서는 RBC 값 410, 220, 420 중에서 앞선 도 3a를 참조하여 설명된 바와 같은 방식에 의해 최종 대표 RBC 값을 선정하게 된다. 만일 인접한 세개의 필드 중 최대값을 택하는 경우, 도 5b에서 좌측 포인트에서는 510R-420, 가운데 포인트에서 는 520C-550, 우측 포인트에서는 530C-430이 선택될 것이다. 검체 진단 장치의 프로세서는 RBC 값 420, 550, 430 중에서 앞선 도 3a를 참조하여 설명된 바와 같은 방식에 의해 최종 대표 RBC 값을 선정하게 된다. 도 6은 본 개시의 일 실시예에 따라 도말 시 필름 각도를 조절하여 도말하는 것을 보여주는 도면이다. 본 개시의 일 실시예에 따라 슬라이드 글래스 상에서 각 도말 영역에서 속도를 조절하여 도말하는 방법 외에 각 도말 영역에서 필름이 슬라이드 글래스와 이루는 각도를 조절하여 도말할 수 있다. 도 6을 참조하면, 본 개시의 일 실시예에 따라 카트리지의 상부에 포함된 캡(cap, 1410)은 필름을 상단 누르는 기능을 수행할 수 있다. 캡을 통해 필름을 누르면 필름과 슬라이드 글래스 간에 이루어지는 각도가 조절될 수 있다. 일 실시예에서, 캡의 누르는 동작은 검체 진단 장치 의 프로세서가 수행할 수 있다. 도 6에서 가장 위의 (a)에서는 캡이 필름을 가장 강하게 눌러 필름과 슬라이드 글래스 간의 각도가 작다. 이와 같이 필름과 슬라이드 글래스 간의 각도가 작으면 검체인 혈액이 슬라이드 글래스 상에 조금 깔리게 되므로 도말 속도가 낮은 것과 동일한 효과가 발생할 수 있다. 반대로 도 6의 (c)와 같이 캡이 필름을 가장 약하게 누르면 필름과 슬라이드 글래스 간의 각도가 커 지게 되면 검체인 혈액이 슬라이드 글래스 상에 많이 깔리게 되므로 도말 속도가 높은 것과 동일한 효과 를 거둘 수 있다. 이와 같이 프로세서는 슬라이드 글래스 상에서 영역 별로 캡의 누르는 강 도를 조절하여 혈액이 슬라이드 글래스 상에서 혈액이 깔리는 양을 조절할 수 있다. 이와 같이 프로세서 는 필름 과 슬라이드 글래스가 이루는 각도를 제어함으로써 슬라이드 글래스 상에 혈 액이 깔리는 양을 조절함으로써 혈액 이미지를 캡처한 후 RBC 값을 획득하여 최적의 염색 영역을 결정할 수 있 다. 도 7은 본 개시의 일 실시예에 따라 도말 방향으로 소정의 구간 마다 도말 속도를 달리하여 염색 영역을 결정하 는 것을 보여주는 흐름도이다. 단계 S710에서, 검체 진단 장치의 프로세서는 사전에 헤마토크릿 측정없이 슬라이드 글래스 상에서 소정의 제 1 구간 동안 제 1 속도로 검체를 도말할 수 있다. 이 때 검체는 혈액일 수 있다. 단계 S720에서, 검체 진단 장치의 프로세서는 슬라이드 글래스 상에서 소정의 제 2 구간 동 안 제 1 속도보다 더 빠른 제 2 속도로 검체를 도말할 수 있다. 단계 S730에서, 검체 진단 장치의 프로세서는 슬라이드 글래스 상에서 소정의 제 3 구간 동 안 제 2 속도보다 더 빠른 제 3 속도로 검체를 도말할 수 있다. 만약 슬라이드 글래스 상에서 서로 다른 속도로 도말하는 영역을 2개로만 나눌 경우에 단계 S730은 생략될 수 있다. 마찬가지로 만약 슬라이드 글래스 상에서 서로 다른 속도로 도말하는 영역을 4개로 나눌 경우에 추가로 검체 진단 장치의 프로세서 는 슬라이드 글래스 상에서 소정의 제 4 구간 동안 제 3 속도보다 더 빠른 제 4 속도로 검체를 도 말할 수 있다. 일 실시예에 따라, 도말이 진행될 수록 도말 영역 별로 도말 속도는 더 빨라지는 것이 바람직하 고 하나의 영역 내에서는 동일한 속도를 유지하는 것이 바람직하다. 단계 S740에서, 일 실시예에서, 검체 진단 장치의 프로세서는 제 1 내지 제 3 구간에 대응되는 제 1 도말 영역 내지 제 3 도말 영역의 검체 이미지를 이미지 캡처부를 제어하여 캡처할 수 있다. 단계 S750에서, 검체 진단 장치의 프로세서는 제 1, 2, 3 구간에서 도말되는 방향의 수직방향으로 적어도 2개의 포인트에서 검체 혈액의 적혈구 수를 카운트하여 각 포인트별 RBC 값을 획득할 수 있다. 적어도 2 개의 포인트는 3개의 포인트일 수 있다. 단계 S760에서, 검체 진단 장치의 프로세서는 카운트된 적혈구 수(RBC)와 기준 카운트 값을 비교할 수 있다. 일 실시예에서, 카운트된 적혈구 수와 상기 소정의 기준 카운트값을 비교하는 것은, 제 1 도말 영역의 적어도 2 개의 포인트 중 최대 적혈구 수를 가지는 제 1 포인트를 검출하고, 제 2 도말 영역의 적어도 2개의 포인트 중 최대 적혈구 수를 가지는 제 2 포인트를 검출하고, 제 3 도말 영역의 적어도 2개의 포인트 중 최대 적혈구 수를 가지는 제 3 포인트를 검출하는 것을 포함한다. 또한, 제 1 포인트, 제 2 포인트, 및 제 3 포인트에 대응되는 적혈구 수와 상기 소정의 기준 카운트값을 비교하는 것을 포함한다. 일 실시예에서, 각 도말 영역에서 도말 방향에 수직으로 3개의 포인트를 결정하고, 카운트된 적혈구 수와 상기 소정의 기준 카운트값을 비교하는 것은, 제 1 도말 영역의 3개의 포인트 중 중간값의 적혈구 수를 가지는 제 1 포인트를 검출하고, 제 2 도말 영역의 3개의 포인트 중 중간값의 적혈구 수를 가지는 제 2 포인트를 검출하고, 제 3 도말 영역의 3개의 포인트 중 중간값의 적혈구 수를 가지는 제 3 포인트를 검출하고, 제 1 포인트, 제 2 포인트, 및 제 3 포인트에서 각각 검출된적혈구 수와 소정의 기준 카운트값을 비교하는 것을 포함한다. 단계 S770에서, 검체 진단 장치의 프로세서는 카운트된 적혈구 수(RBC)가 기준 카운트값에 가장 근 접한 값을 가지는 포인트가 속한 도말 영역을 염색 영역으로 결정하여 혈구 염색을 수행할 수 있다. 도 8a 내지 도 8c는 본 개시의 일 실시예에 따라 이미지 캡처 시 세포가 없는 혈구 이미지가 포함된 경우를 대 비하여 적절한 RBC를 획득하기 위한 방법을 보여주는 흐름도이다. 도 8a를 참조하면, 제 1 구간에서 혈구 이미지 캡처 시 세포가 없는 혈구 이미지가 포함된 경우를 대비하여 적 절한 RBC를 획득하기 위한 방법을 보여주는 흐름도이다. 단계 S751a에서, 본 개시의 일 실시예에 따라 검체 진단 장치의 프로세서는 도말하는 방향에 수직 으로 제 1 구간에 대응되는 영역에 소정의 간격으로 1-1 필드, 1-2 필드, 1-3 필드를 결정한다. 단계 S753a에서, 본 개시의 일 실시예에 따라 검체 진단 장치의 프로세서는 1-1 필드의 좌우 필드 를 혈구 이미지를 획득하는 필드로 추가 할당하여 1-1 필드와 좌우 필드를 포함하는 세개의 필드 내 적혈구 수 를 카운트한다. 일 실시예에서, 검체 진단 장치의 프로세서는 세개의 필드 내 적혈구 수 중 중간값 을 가지는 필드를 1-1 필드의 대표 필드로 결정할 수 있다. 일 실시예에서, 검체 진단 장치의 프로세서 는 세개의 필드 내 적혈구 수 중 최대값을 가지는 필드를 1-1 필드의 대표 필드로 결정할 수 있다. 단계 S755a에서, 본 개시의 일 실시예에 따라 검체 진단 장치의 프로세서는 1-2 필드의 좌우 필드 를 혈구 이미지를 획득하는 필드로 추가 할당하여 1-2 필드와 좌우 필드를 포함하는 세개의 필드 내 적혈구 수 를 카운트한다. 일 실시예에서, 검체 진단 장치의 프로세서는 세개의 필드 내 적혈구 수 중 중간값 을 가지는 필드를 1-2 필드의 대표 필드로 결정할 수 있다. 일 실시예에서, 검체 진단 장치의 프로세서 는 세개의 필드 내 적혈구 수 중 최대값을 가지는 필드를 1-2 필드의 대표 필드로 결정할 수 있다. 단계 S757a에서, 본 개시의 일 실시예에 따라 검체 진단 장치의 프로세서는 1-3 필드의 좌우 필드 를 혈구 이미지를 획득하는 필드로 추가 할당하여 1-3 필드와 좌우 필드를 포함하는 세개의 필드 내 적혈구 수 를 카운트한다. 일 실시예에서, 검체 진단 장치의 프로세서는 세개의 필드 내 적혈구 수 중 중간값 을 가지는 필드를 1-3 필드의 대표 필드로 결정할 수 있다. 일 실시예에서, 검체 진단 장치의 프로세서 는 세개의 필드 내 적혈구 수 중 최대값을 가지는 필드를 1-3 필드의 대표 필드로 결정할 수 있다. 단계 S759a에서, 본 개시의 일 실시예에 따라 검체 진단 장치의 프로세서는 1-1 필드의 대표 필드, 1-2 필드의 대표 필드, 1-3 필드의 대표 필드의 적혈구 수 중 중간값을 제 1 구간에 대응되는 영역의 적혈구 수 로 결정할 수 있다. 또는 본 개시의 일 실시예에 따라 검체 진단 장치의 프로세서는 1-1 필드의 대 표 필드, 1-2 필드의 대표 필드, 1-3 필드의 대표 필드의 적혈구 수 중 최대값을 제 1 구간에 대응되는 영역의 적혈구 수로 결정할 수 있다. 도 8b를 참조하면, 제 2 구간에서 혈구 이미지 캡처 시 세포가 없는 혈구 이미지가 포함된 경우를 대비하여 적 절한 RBC를 획득하기 위한 방법을 보여주는 흐름도이다. 도 8b에 따라 제 2 구간에서 혈구 이미지 캡처 시 세포 가 없는 혈구 이미지가 포함된 경우 적절한 RBC를 획득하는 것은 구간이 제 2 구간으로 바뀌었을 뿐, 적절한 RBC를 결정하는 방법은 앞선 도 8a에 따른 제 1 구간에서 RBC를 결정하여 획득하는 방법과 동일하므로 중복되는 설명은 생략하도록 한다. 마찬가지로 도 8c에 따라 제 3 구간에서 혈구 이미지 캡처 시 세포가 없는 혈구 이미지가 포함된 경우 적절한 RBC를 획득하는 것은 구간이 제 3 구간으로 바뀌었을 뿐, 적절한 RBC를 결정하는 방법은 앞선 도 8a에 따른 제 1 구간에서 RBC를 결정하여 획득하는 방법과 동일하므로 중복되는 설명은 생략하도록 한다. 도 9는 본 개시의 일 실시예에 따라 도말 시 필름 각도를 조절하여 도말하는 방법을 보여주는 흐름도이다. 단계 S910에서, 본 개시의 일 실시예에 따라 검체 진단 장치의 프로세서는 카트리지에서 필 름을 지지하는 캡이 필름을 슬라이드 글래스 상으로 푸쉬하는 정도를 제어하여 필름 과 슬라이드 글래스 간에 이루어지는 각도를 제어하되, 슬라이드 글래스 상에 소정의 제 1 구간 동안 제 1 각도로 검체를 떨어뜨려 도말할 수 있다. 단계 S920에서, 본 개시의 일 실시예에 따라 검체 진단 장치의 프로세서는 슬라이드 글래스 상에 소정의 제 2 구간 동안 필름과 슬라이드 글래스 간에 이루어지는 각도가 제 1 각도보다 큰 제 2 각도로 검체를 떨어뜨려 도말할 수 있다. 단계 S930에서, 본 개시의 일 실시예에 따라 검체 진단 장치의 프로세서는 슬라이드 글래스 상에서 소정의 제 3 구간 동안 필름과 슬라이드 글래스 간에 이루어지는 각도가 제 2 각도보다 큰제 3 각도로 검체를 떨어뜨려 도말할 수 있다. 단계 S940에서, 본 개시의 일 실시예에 따라 검체 진단 장치의 프로세서는 제 1 내지 제 3 구간에 대응되는 제 1 내지 제 3 도말 영역의 혈구 이미지를 이미지 캡처부를 통해 캡처하도록 제어할 수 있다. 단계 S950에서, 본 개시의 일 실시예에 따라 검체 진단 장치의 프로세서는 제 1, 2, 3 구간에서 도 말되는 방향의 수직방향으로 적어도 2개의 포인트에서 검체인 혈액의 적혈구 수를 카운트할 수 있다. 단계 S960에서, 본 개시의 일 실시예에 따라 검체 진단 장치의 프로세서는 카운트된 적혈구 수와 기준 카운트 값을 비교할 수 있다. 단계 S970에서, 본 개시의 일 실시예에 따라 검체 진단 장치의 프로세서는 기준 카운트값에 가장 근접한 값을 가지는 포인트가 속한 도말 영역을 염색 영역으로 결정하여 염색을 수행할 수 있다. 본 개시의 일 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되 어 컴퓨터 판독 가능 매체에 기록될 수 있다. 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구 조 등을 단독으로 또는 조합하여 포함할 수 있다. 매체에 기록되는 프로그램 명령은 본 개시를 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD- ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 본 개시의 일부 실시예는 컴퓨터에 의해 실행되는 프로그램 모듈과 같은 컴퓨터에 의해 실행가능한 명령어를 포 함하는 기록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의 의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체 및 통신 매체를 모두 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구 현된 휘발성 및 비휘발성, 분리형 및 비분리형 매체를 모두 포함한다. 통신 매체는 전형적으로 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈, 또는 반송파와 같은 변조된 데이터 신호의 기타 데이터, 또는 기타 전송 메커니즘을 포함하며, 임의의 정보 전달 매체를 포함한다. 또한, 본 개시의 일부 실시예는 컴퓨터에 의해 실 행되는 컴퓨터 프로그램과 같은 컴퓨터에 의해 실행가능한 명령어를 포함하는 컴퓨터 프로그램 또는 컴퓨터 프 로그램 제품 (computer program product)으로도 구현될 수 있다. 기기로 읽을 수 있는 저장매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, '비일 시적 저장매체'는 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는다. 예로, '비일시적 저장매체'는 데이터가 임시적으로 저장되는 버퍼를 포함할 수 있다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 진단 장치 내의 메모리에 탑재되어 진단 장치의 프로세서에 의해 실행될 수 있다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법 은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품 으로서 판매자 및 구매자 간에 거래될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어를 통해 또는 두개 의 사용자 장치들(예: 스마트폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품(예: 다운로더블 앱(downloadable app))의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다."}
{"patent_id": "10-2023-0030195", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 따른 검체 진단 장치를 나타내는 블럭도이다. 도 2는 본 개시의 일 실시예에 따라 카트리지 로더부에 로딩되는 카트리지를 나타내는 도면이다. 도 3a는 본 개시의 일 실시예에 따라 검체 도말 방향에 따라 소정 구간마다 도말 속도를 달리하는 것을 나타내 는 도면이다. 도 3b는 본 개시의 일 실시예에 따라 검체 도말 방향에 따라 소정 구간마다 도말 속도를 달리하는 것을 나타내 는 도면이다. 도 3c는 본 개시의 일 실시예에 따라 검체 도말 방향에 따라 소정 구간마다 도말 속도를 달리하는 것을 나타내 는 도면이다. 도 4는 본 개시의 일 실시예에 따라 도말 방향에 빈줄이 발생하는 경우를 나타내는 도면이다. 도 5a는 본 개시의 일 실시예에 따라 이미지 캡처 시 세포가 없는 경우가 포함된 혈구 이미지이다. 도 5b는 본 개시의 일실시예에 따라 이미지 캡처 시 세포가 없는 혈구 이미지가 포함된 경우에 적절한 RBC를 획 득하기 위한 방법을 도시한다. 도 6은 본 개시의 일 실시예에 따라 도말 시 필름 각도를 조절하여 도말하는 것을 보여주는 도면이다. 도 7은 본 개시의 일 실시예에 따라 도말 방향으로 소정의 구간 마다 도말 속도를 달리하여 염색 영역을 결정하 는 것을 보여주는 흐름도이다. 도 8a 내지 도 8c는 본 개시의 일 실시예에 따라 이미지 캡처 시 세포가 없는 혈구 이미지가 포함된 경우를 대 비하여 적절한 RBC를 획득하기 위한 방법을 보여주는 흐름도이다. 도 9는 본 개시의 일 실시예에 따라 도말 시 필름 각도를 조절하여 도말하는 방법을 보여주는 흐름도이다."}
