{"patent_id": "10-2019-0131462", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0048010", "출원번호": "10-2019-0131462", "발명의 명칭": "AI기반 흉부 X-ray 자동판독기", "출원인": "박창수", "발명자": "박창수"}}
{"patent_id": "10-2019-0131462", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "폐를 진단할 시, 미리 등록된 영상촬영장치로부터 흉부 X-ray 영상을 입력받고 폐 진단결과를 미리 등록된 정보처리장치로 전송하는 통신부; 및상기 흉부 X-ray 영상이 입력될 시, 흉부 X-ray 영상으로부터 폐를 진단하고 진단결과를 상기 정보처리장치로전송하는 제어부; 를 포함하고 있으며,상기 제어부에 의해 폐를 진단하는 것은상기 흉부 X-ray 영상이 입력될 시, 미리 등록된 폐의 활성 형상 모델(Active Contour Model)의 형태분석 AI 포맷으로부터 폐 이미지를 시스템적으로 분할함으로써 다수의 상이한 사용자에 대해 폐 이미지를 분할하고,상기 폐 이미지가 분할될 시, 분할된 폐 이미지로부터 폐의 피처 메타데이터를 추출함으로써, 머신 러닝 기반으로 폐의 피처별로 영상분석 기초데이터를 획득하고,상기 폐의 피처 메타데이터가 추출될 시, 폐 영상 패치(patch)의 피처값을 추출하는 GLCM(Grey Level Co-occurence Matrix)의 융합머신러닝 AI 포맷으로부터 폐의 피처를 추출함으로써, 머신 러닝 기반의 피처 추출을수행하며,상기 폐의 피처가 추출될 시, 폐의 진단을 위한 대표되는 폐의 피처별 융합딥러닝(F-Deep Learning) AI 포맷으로부터 폐를 진단함으로써 다수의 상이한 사용자에 대해 시스템적으로 폐를 진단하고,상기 폐가 진단될 시, 진단결과를 미리 등록된 관리 정보처리장치로 전송하도록 함으로써 제공하는 것을 특징으로 하는 AI기반 흉부 X-ray 자동판독기."}
{"patent_id": "10-2019-0131462", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 폐 이미지를 분할하는 것은상기 흉부 X-ray 영상이 입력될 시, 입력 영상에 대한 히스토그램 등가화(Histogram equalization)의 정규화(Normalization)로부터 화질이 상이한 입력 영상을 제 1 전처리하고,상기 정규화가 될 시, 입력 영상의 픽셀 주변의 로컬 영역의 밝기 평균을 임계값으로 사용하는 이진화로부터 시스템적으로 분할할 초기값을 생성함으로써 제 2 전처리하고,상기 이진화가 될 시, 상기 폐의 활성 형상 모델의 형태분석 AI 포맷으로부터 폐 이미지를 시스템적으로 분할함으로써 다수의 상이한 사용자에 대해 폐 이미지를 분할하며,상기 폐를 진단하는 것은,상기 폐의 피처가 추출될 시, 폐의 진단을 위한 대표되는 폐의 피처별 영상분포도의 융합딥러닝 AI 포맷으로부터 폐를 진단함으로써 다수의 상이한 사용자에 대해 시스템적으로 폐를 진단하는 것을 특징으로 하는 AI기반 흉부 X-ray 자동판독기."}
{"patent_id": "10-2019-0131462", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 폐를 진단하는 것은폐의 진단을 위해, 폐의 피처의 메타데이터에 의해 데이터 분포를 작성하고 화면 내에서 폐의 피처의 활동영역을 특정화하여 감시 여부를 설정함으로써, 빅데이터 패턴을 분석하고,상기 빅데이터 패턴이 분석될 시, 고유 폐의 피처의 형상 패턴, 움직임 패턴에 의해 상시 폐의 피처의 형상, 움공개특허 10-2021-0048010-3-직임을 분석해서 감지 여부를 설정함으로써, 활성 패턴을 분석하고,상기 폐의 피처가 추출될 시, 상기 빅데이터 패턴과 상기 활성 패턴에 따른 대표되는 폐의 피처별 영상분포도의융합딥러닝 AI 포맷으로부터 폐를 진단함으로써 다수의 상이한 사용자에 대해 시스템적으로 폐를 진단하는 것을특징으로 하는 AI기반 흉부 X-ray 자동판독기."}
{"patent_id": "10-2019-0131462", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "실시예는 AI기반 흉부 X-ray 자동판독기에 관한 것이다. 구체적으로, 이러한 자동판독기는 영상촬영장치에서 흉부 X-ray 영상을 입력받아, 미리 등록된 폐의 활성 형상 모델(Active Contour Model)의 형태분석 AI 포맷으로부터 폐 이미지를 시스템적으로 분할함으로써 다수의 상이한 (뒷면에 계속)"}
{"patent_id": "10-2019-0131462", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 명세서에 개시된 내용은 결핵 등의 폐를 진단할 시, 의료 영상촬영장치로부터 흉부 X-ray 영상을 입력받아 분석해서 정보처리장치에 제공함으로써, 의사의 폐 진단을 돕는 기술에 관한 것이다."}
{"patent_id": "10-2019-0131462", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 명세서에서 달리 표시되지 않는 한, 이 섹션에 설명되는 내용들은 이 출원의 청구항들에 대한 종래 기술이 아니며, 이 섹션에 포함된다고 하여 종래 기술이라고 인정되는 것은 아니다. 일반적으로, 폐질환(무기폐)은 사망률 세계 4위, 국내 7위의 질병으로 현재 방사선과 전문의가 없는 병원이 70% 이상인 상황이고, 입원환자 및 외래환자의 기본 검사인 흉부 X-ray 사진에서 진단 시 어려움을 겪고 있다. 한편, 또한 인공지능(AI) 기술이 다양화되고 있는 가운데 의료기기 산업의 기술 경쟁력 강화가 매우 중요한 국 가 정책 목표가 되고 있다. 그리고, 흉부 X-ray 자동판독기를 설치 운영하여 폐질환 진단의 정확성과 신속성을 높여 폐질환 발병률 및 감염을 현저히 줄일 수 있다. 그래서, 국가적 폐 조기검진사업을 추진중이고, 환자가 적기에 치료받을 수 있도록 도움을 주고자 노력중이다. 이에 따라 제안하는 결과를 적용한다면 질병확대로 인한 환자의 경제적 부담을 줄이고, 환자의 조기 치료율을 높일 수 있다. 그리고, 다양한 폐 질환 관리 사업에 적용하여 건강한 생활실천 및 조기검진으로 폐질환 발생 최소화와 사회적, 심리적 지지를 통해 환자가 삶의 의지를 갖고 건강한 삶을 누릴 수 있도록 기여할 수 있다. 이러한 배경의 선행기술문헌은 관련 선행기술을 살펴볼 경우, 특허문헌으로부터 선행기술을 조사해서 관련 선행 기술로서 직접적으로 관련된 국내선행기술이 검색되지 않고 참고할만한 아래의 특허문헌이 나올 정도일 뿐이다. (특허문헌 1) KR101274530 Y1 참고적으로, 이러한 특허문헌 1의 기술은 사람의 흉부를 CT 등으로 촬영한 현재 영상을 이전에 촬영했던 과거 영상과 정합하여 이상 부위를 표출함으로써, 폐암, 폐결절 등 폐의 기능적 질환을 조기에 진단하는 기술에 관한 정도이다."}
{"patent_id": "10-2019-0131462", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "개시된 내용은, 흉부 X-ray 영상을 촬영할 시, 이러한 흉부 X-ray 영상에 대해 AI 기반으로 정상, 비정상, 결핵 을 시스템적으로 판별함으로써, 의사의 보조 역할을 할 수 있도록 하는 AI기반 흉부 X-ray 자동판독기를 제공하 고자 한다."}
{"patent_id": "10-2019-0131462", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "실시예에 따른 AI기반 흉부 X-ray 자동판독기는, 영상촬영장치에서 흉부 X-ray 영상을 입력받아, 미리 등록된 폐의 활성 형상 모델(Active Contour Model)의 형 태분석 AI 포맷으로부터 폐 이미지를 시스템적으로 분할함으로써 다수의 상이한 사용자에 대해 폐 이미지를 분 할한다. 그리고, 이러한 폐 이미지가 분할될 시, 분할된 폐 이미지로부터 폐의 피처 메타데이터를 추출함으로써, 머신 러닝 기반으로 폐의 피처별로 영상분석 기초데이터를 획득한다. 그리고 나서, 이러한 폐의 피처 메타데이터가 추출될 시, 폐 영상 패치(patch)의 피처값을 추출하는 GLCM(Grey Level Co-occurence Matrix)의 융합머신러닝 AI 포맷으로부터 폐의 피처를 추출함으로써, 머신 러닝 기반의 피 처 추출을 수행한다. 그래서, 이렇게 폐의 피처가 추출될 시, 폐의 진단을 위한 대표되는 폐의 피처별 융합딥러닝(F-Deep Learning) AI 포맷으로부터 폐를 진단함으로써 다수의 상이한 사용자에 대해 시스템적으로 폐를 진단한다. 그리고, 이렇게 폐가 진단될 시, 진단결과를 미리 등록된 관리 정보처리장치로 전송하도록 함으로써 제공하는 것을 특징으로 한다."}
{"patent_id": "10-2019-0131462", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "실시예들에 의하면, 흉부 X-ray 영상을 촬영할 시, 이러한 흉부 X-ray 영상에 대해 AI 기반으로 정상, 비정상, 결핵을 시스템적으로 판별함으로써, 의사의 보조 역할을 해서 조기 확진하여, 효과적으로 치료하고 예방한다."}
{"patent_id": "10-2019-0131462", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시내용의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시예들을 참조하면 명확해질 것이다. 그러나 본 개시내용은 이하에서 개시되는 실시 예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될"}
{"patent_id": "10-2019-0131462", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "수 있으며, 단지 본 실시 예들은 본 개시내용의 개시가 완전하도록 하고, 본 개시내용이 속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 개시내용은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 도면부호는 동일 구성 요소를 지칭한다. 본 개시내용의 실시 예들을 설명함에 있어서 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불 필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것이다. 그리고 후술 되는 용어들은 본 개시내용의 실시 예에서의 기능을 고려하여 정의된 용어들로써 이는 사용자, 운용자의 의도 또는 관례 등에 따 라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 도 1은 일실시예에 따른 AI기반 흉부 X-ray 자동판독기의 구성을 도시한 블록도이다. 도 1에 도시된 바와 같이, 일실시예의 흉부 X-ray 자동판독기는 폐를 진단할 시, 영상촬영장치로부터 흉부 X- ray 영상을 입력받고 폐의 진단 결과를 정보처리장치로 전송하는 통신부와 상기 흉부 X-ray 영상에 의해 폐를 진단하는 제어부를 포함한다. 그리고, 일실시예에 따른 흉부 X-ray 자동판독기는 상기 제어부가 이러한 경우, 상기 흉부 X-ray 영상에 대해 AI 기반으로 정상, 비정상, 결핵을 시스템적으로 판별함으로써, 의사의 보조 역할을 하는 것이다. 부가적으로, 이러한 흉부 X-ray 자동판독기는 폐를 진단할 시, 사용자 키 조작에 따라 진단 명령 등을 입력받아 상기 제어부에 전송함으로써, 일실시예에 따른 판독 등이 이루어질 수 있도록 하는 키신호 입력부를 포함한다. 상기 통신부는 폐를 진단할 시, 미리 등록된 영상촬영장치로부터 흉부 X-ray 영상을 입력받고 상기 흉부 X-ray 영상의 폐 진단 결과를 미리 등록된 정보처리장치로 전송한다. 그래서, 이렇게 폐 진단 결과는 정보처리 장치로 전송되어 의사의 최종적인 폐에 대한 정상, 비정상, 결핵을 판독하는데 보조역할을 한다.상기 제어부는 상기한 바와 같이 흉부 X-ray 영상이 입력될 시, 흉부 X-ray 영상으로부터 폐를 진단하고 폐 진단 결과를 상기 정보처리장치로 전송하도록 한다. 구체적으로, 일실시예에 따라 상기 제어부는 이러 한 경우, 상기 흉부 X-ray 영상에 대해 AI 기반으로 정상, 비정상, 결핵을 시스템적으로 판별함으로써, 의사의 보조 역할을 하는 것이다(이에 대한 구체적인 설명은 도 2 등을 참조해서 후술한다.). 도 2는 도 1의 AI기반 흉부 X-ray 자동판독기의 동작을 순서대로 도시한 플로우 차트이다(도 1 참조). 도 2에 도시된 바와 같이, 일실시예의 자동판독기는 먼저 미리 등록된 영상촬영장치로부터 흉부 X-ray 영상이 입력될 시, 미리 등록된 폐의 활성 형상 모델의 형태분석 AI 포맷으로부터 폐 이미지를 시스템적으로 분할함으 로써 다수의 상이한 사용자에 대해 폐 이미지를 분할한다(S201). 그리고 나서, 이렇게 폐 이미지가 분할될 시, 분할된 폐 이미지로부터 폐의 피처 메타데이터를 추출함으로써, 머신 러닝 기반으로 폐의 피처별로 영상분석 기초데이터를 획득한다(S202). 다음, 이러한 폐의 피처 메타데이터가 추출될 시, 폐 영상 패치의 피처값을 추출하는 GLCM의 융합머신러닝 AI 포맷으로부터 폐의 피처를 추출함으로써, 머신 러닝 기반의 피처 추출을 수행한다(S203). 그래서, 이러한 폐의 피처가 추출될 시, 폐의 진단을 위한 대표되는 폐의 피처별 융합딥러닝 AI 포맷으로부터 폐를 진단함으로써 다수의 상이한 사용자에 대해 시스템적으로 폐를 진단한다(S204). 그리고 나서, 이렇게 폐가 진단될 시, 진단된 결과를 미리 등록된 관리 정보처리장치로 전송하도록 함으로써 제 공한다. 따라서, 이를 통해 일실시예는 AI기반의 흉부 X-ray 판독으로부터 의사 보조역할을 하여 정상, 비정상, 결핵을 판독하고 조기 확진하여, 효과적으로 치료하고 예방한다. 이상과 같이, 일실시예는 흉부 X-ray 영상을 촬영할 시, 이러한 흉부 X-ray 영상에 대해 AI 기반으로 정상, 비 정상, 결핵을 시스템적으로 판별함으로써, 의사의 보조 역할을 해서 조기 확진하여, 효과적으로 치료하고 예방 한다. 도 3 내지 도 6은 도 1의 AI기반 흉부 X-ray 자동판독기에 적용된 폐의 활성 형상 모델의 형태분석 AI 포맷에 의한 폐 분할 동작을 설명하기 위한 도면이다. 구체적으로, 도 3은 입력된 흉부 X-ray 영상에 대한 히스토그램 등가화(Histogram equalization)의 정규화 (Normalization)로부터 화질이 상이한 입력 영상을 제 1 전처리하는 동작을 설명하기 위한 도면이다. 그리고, 도 4는 이러한 히스토그램 등가화 결과를 보여주는 도면이다. 또한, 도 5는 폐의 활성 형상 모델의 개념을 설명하기 위한 도면이다. 그리고, 도 6은 이러한 폐의 활성 형상 모델 결과를 보여주는 도면이다. 도 3 내지 도 6에 도시된 바와 같이, 일실시예에 따른 폐의 활성 형상 모델의 형태분석 AI 포맷에 의한 폐 분할 동작은 먼저 도 3과 같이, 흉부 X-ray 영상이 입력될 시, 입력 영상에 대한 히스토그램 등가화의 정규화로부터 화질이 상이한 입력 영상을 제 1 전처리한다. 추가적으로, 히스토그램 등가화의 결과는 밝은 이미지나 어두운 이미지 어떤 것을 사용해도 동일한 결과가 나온 다. 이것은 이미지의 인식을 할 때 유용하다. 예를 들면 얼굴인식을 할 때 대상 이미지를 등가화를 하고 나면 동일한 밝기가 되기 때문에 동일한 환경에서 작업을 할 수 있다. 이론적인 방법은 이미지의 각 픽셀의 cumulative distribution function(cdf) 값을 구하고 히스토그램 등가화 공식에 대입하여 0 ~ 255 사이의 값으로 변환을 하게 된다. 이렇게 새롭게 구해진 값으로 이미지를 표현하면 균 일화된 이미지를 얻을 수 있다. 다음, 도 4와 같이 이렇게 정규화가 될 시, 입력 흉부 X-ray 영상의 픽셀 주변의 로컬(local) 영역의 밝기 평균 을 임계값으로 사용하는 이진화로부터 시스템적으로 분할할 초기값을 생성함으로써 제 2 전처리한다. 추가적으로, 실용적인 관점에서 간단하면서도 효과적인 방법은 픽셀 주변의 로컬 영역의 밝기 평균을 임계값으 로 사용하는 것이다. 이 방법은 영상 픽셀마다 서로 다른 threshold를 사용하는데, 그 threshold 값은 그 픽셀 을 중심으로 한 n × n 주변 영역의 밝기 평균에 일정한 상수를 빼서 결정한다."}
{"patent_id": "10-2019-0131462", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이러한 경우, 주변 영역의 크기를 어떻게 잡느냐와 상수 C를 어떻게 주느냐(+, - 모두 가능)에 따라서 결과가 달라질 수 있으며 문제에 따라서 적절히 값을 조정하면 좋은 이진화 결과를 얻을 수 있다. 그리고 나서, 도 5, 도 6에서와 같이 이렇게 이진화가 될 시, 상기 폐의 활성 형상 모델의 형태분석 AI 포맷으 로부터 폐 이미지를 시스템적으로 분할함으로써 다수의 상이한 사용자에 대해 폐 이미지를 분할한다. 이러한 경우, 참고적으로 관련된 deformable model은 구속 조건과 이미지 힘에 의해 영향을 받는 에너지를 최소 화하고 변경 가능한 스플라인으로, 오브젝트 윤곽과 변형에 저항하는 내부 힘을 향해 끌어 당긴다. 상기 deformable model은 에너지 최소화를 통해 변형 가능 모델을 이미지에 매치하는 일반적인 기술의 특별한 경우로 이해될 수 있다. 2차원에서 활성 형상 모델은 이 접근법의 이산 버전을 나타내며, 점 분포 모델을 활용하여 형 상 범위를 교육 세트에서 학습한 명시적인 영역을 제한한다. 추가적으로, 도 1의 흉부 X-ray 자동판독기는 전술한 융합딥러닝 AI 포맷에 의해 폐가 진단될 시, 폐의 피처에 대한 영상분포도로부터 폐를 진단함으로써, 폐를 진단받는 환자가 많고 상이하더라도 보다 효율적으로 폐 진단 이 되도록 한다. 이를 위해, 일실시예의 X-ray 자동판독기는 폐의 피처가 추출될 시, 폐의 진단을 위한 대표되는 폐의 피처별 영 상분포도의 융합딥러닝 AI 포맷으로부터 폐를 진단함으로써 다수의 상이한 사용자에 대해 시스템적으로 폐를 진 단한다. 구체적으로, 상기 폐를 진단하는 것은 먼저 폐의 진단을 위해, 폐의 피처의 메타데이터에 의해 데이터 분포를 작성하고 화면 내에서 폐의 피처의 활동영역을 특정화하여 감시 여부를 설정함으로써, 빅데이터 패턴을 분석한 다. 이러한 경우, 상기 빅데이터 패턴 분석은 분석된 영상의 메타데이터가 폐의 피처에 대한 수많은 정보를 가지며 폐의 피처의 속성값 중 폐의 피처분류, 영역, 날짜, 시간 등의 데이터를 이용하여 데이터 분포를 작성한다. 그 리고 화면 내에서 폐의 피처의 활동영역을 특정화하여 폐의 피처가 등장하는 구역과 등장하지 않는 구역을 구분, 사용자는 특정화된 데이터 그룹에 대하여 감시 여부(정상, 비정상)를 설정함으로써 이루어진다. 그리고, 이렇게 빅데이터 패턴이 분석될 시, 고유 폐의 피처의 형상 패턴, 움직임 패턴에 의해 상시 폐의 피처 의 형상, 움직임을 분석해서 감지 여부를 설정함으로써, 활성 패턴을 분석한다. 그래서, 영상분석의 기본이 되는 폐의 피처 인식과 분류는 딥 러닝 기반의 분석 엔진을 사용하여 기존 비디오 움직임 기반의 분석에 비해 매우 높은 정확도로 분석 가능하다. 그리고, 기 지능형과 달리 영상 내에서 특정 조건을 만족하기 위한 가상 영역, 선 등의 설정을 하지 않고 규칙 과 빅데이터 패턴과 움직임 패턴을 중심으로 분석을 진행함으로써 이에 따른 장점을 가진다. 참고적으로, 기존의 제품 지능형은 비디오 움직임 기반(전경/후경 처리 방식)으로 영상 내의 움직임(영상의 변 화)과 객체(움직임이 발생한 객체, 종류를 구부하지 않음)를 인식하는 방식이다. 그리고, 상황 판단을 위해 영상 내 가상의 영역(사각형, 다각형)과 선(펜스) 등의 특정 조건설정을 한다. 여기 에서, 특정조건이란 가상의 영역과 선을 지정하고 객체의 발견 또는 체류 시간, 계수를 측정하여 조건에 맞는 경우의 알람을 말한다. 그리고 나서, 이러한 폐의 피처가 추출될 시, 상기 빅데이터 패턴과 상기 활성 패턴에 따른 대표되는 폐의 피처 별 영상분포도의 융합딥러닝 AI 포맷으로부터 폐를 진단함으로써 다수의 상이한 사용자에 대해 시스템적으로 폐 를 진단한다. 따라서, 이를 통해 일실시예의 흉부 X-ray 자동판독기는 전술한 융합딥러닝 AI 포맷에 의해 폐가 진단될 시, 폐 의 피처별 영상분포도로부터 폐를 진단함으로써, 폐를 진단받는 환자가 많고 상이하더라도 보다 효율적으로 폐진단이 된다. 한편, 이에 더하여 도 1의 흉부 X-ray 자동판독기에 적용된 GLCM의 융합머신러닝 AI 포맷에 의한 폐의 피처 추 출 동작을 보다 상세하게 설명하면 아래와 같다. 기본적으로 텍스쳐 영상에 대한 정의는 여러 가지가 있지만 대상이 되는 데이터 영상 내에 포함되어 있는 공간 적 특성을 부각하는 영상을 나타낸다. 이러한 경우, GLCM은 현재의 화소와 그 이웃하는 화소의 밝기 값의 평균, 대비, 상관관계 등과 같은 기본적인 통계량을 계산한다. 그래서, 다시 그 계산 값을 커널내의 중심 화소에 새로운 밝기 값으로 할당하여 표현하고 입력 흉부 X-ray 영상에 대해서 부분적인 텍스쳐 특징으로 표현하는 것이다. 이때, 상기 GLCM은 Homogenity와, Contrast, Dissimiliarity를 포함한다. 상기 Homogenity는 행렬 내 각 화소들의 균일한 정도를 나타낸다. 그리고, Contrast와 Dissimiliarity는 화소 간 명암차이를 구분하여 표현하기 위한 개념으로 대각선으로부터 멀리 떨어져 있는 화소의 경우 높은 가중치가 적용된다. ASM과 에너지는 명암의 균일함을 측정한다. 화소간의 밝기 변화가 없으며 각 화소의 값이 비슷한 값 이 된다."}
{"patent_id": "10-2019-0131462", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일실시예에 따른 AI기반 흉부 X-ray 자동판독기의 구성을 도시한 블록도 도 2는 도 1의 AI기반 흉부 X-ray 자동판독기의 동작을 순서대로 도시한 플로우 차트 도 3 내지 도 6은 도 1의 AI기반 흉부 X-ray 자동판독기에 적용된 폐의 활성 형상 모델의 형태분석 AI 포맷에 의한 폐 분할 동작을 설명하기 위한 도면"}
