{"patent_id": "10-2023-0122821", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0070395", "출원번호": "10-2023-0122821", "발명의 명칭": "인플루언서의 게시물을 이용한 상품 추천 및 판매 페이지 연계 서비스 제공 방법, 장치 및 프", "출원인": "주식회사 웨얼리", "발명자": "권수희"}}
{"patent_id": "10-2023-0122821", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨팅 장치에 의해 수행되는 방법에 있어서,인플루언서의 채널에 업로드되는 게시물에서 상기 인플루언서가 착용한 아이템의 특징을 분석하는 단계;분석 결과를 기초로 상기 아이템과 유사한 상품을 추출하는 단계; 및추출된 상품을 판매하는 판매 페이지의 링크를 상기 게시물과 연계하는 단계;를 포함하는, 인플루언서의 게시물을 이용한 상품 추천 및 판매 페이지 연계 서비스 제공 방법."}
{"patent_id": "10-2023-0122821", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 아이템과 유사한 상품을 추출하는 단계는,상기 아이템의 특징을 분석한 결과로부터 입력 데이터를 추출하는 단계;상기 입력 데이터를 기 학습된 인공지능 모델에 입력하는 단계; 및상기 인공지능 모델의 출력을 획득하고, 상기 출력에 기초하여 상기 아이템과 유사한 상품을 추출하는 단계;를포함하는, 인플루언서의 게시물을 이용한 상품 추천 및 판매 페이지 연계 서비스 제공 방법."}
{"patent_id": "10-2023-0122821", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,온라인에서 판매되는 상품을 종류에 따라 수집하는 단계;상품의 종류에 따라 기 설정된 항목을 기초로 수집되는 상품 각각의 특징을 분석하는 단계; 및상기 상품의 특징과 해당 상품이 판매되는 판매 페이지를 매칭하여 저장하는 단계;를 더 포함하고,상기 아이템과 유사한 상품을 추출하는 단계는,상기 인플루언서가 착용한 아이템과 상기 온라인에서 판매되는 상품과의 유사도를 산출하는 단계; 및유사도를 산출한 결과에 따라 상기 아이템과 유사한 상품을 선정하는 단계;를 포함하고,상기 유사도를 산출하는 단계는,상기 아이템과 상기 온라인에서 판매되는 상품간의 특징 각각을 비교하는 단계;특징 각각이 유사한 정도에 따라 점수를 부가하는 단계; 및부가된 점수를 통합하여 유사도를 산출하는 단계;를 포함하는, 인플루언서의 게시물을 이용한 상품 추천 및 판매 페이지 연계 서비스 제공 방법."}
{"patent_id": "10-2023-0122821", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 아이템과 유사한 상품을 추출하는 단계는,공개특허 10-2024-0070395-3-상기 인플루언서의 쿠키 정보를 획득하는 단계;상기 쿠키 정보를 기초로 상기 인플루언서가 방문한 판매 페이지를 추출하는 단계; 및추출된 판매 페이지에서 상기 인플루언서가 착용한 아이템과 유사한 상품을 추출하는 단계;를 포함하는, 인플루언서의 게시물을 이용한 상품 추천 및 판매 페이지 연계 서비스 제공 방법."}
{"patent_id": "10-2023-0122821", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 아이템과 유사한 상품을 추출하는 단계는,상기 아이템이 가려진 부분을 예측하는 단계;예측된 결과를 기초로 적어도 하나 이상의 상기 아이템의 전체 모양을 생성하는 단계; 및상기 전체 모양을 기초로 상기 아이템과 유사한 상품을 추출하는 단계;를 포함하는, 인플루언서의 게시물을 이용한 상품 추천 및 판매 페이지 연계 서비스 제공 방법."}
{"patent_id": "10-2023-0122821", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 게시물과 연계하는 단계는,상기 게시물의 기 설정된 부분에 특정 버튼을 생성하는 단계;사용자가 상기 특정 버튼을 누르는 경우 상기 유사한 상품에 대한 정보를 순차적으로 표시하는 단계; 및상기 사용자가 상기 상품을 누르는 경우 상기 상품의 판매페이지를 제공하는 단계;를 포함하는, 인플루언서의게시물을 이용한 상품 추천 및 판매 페이지 연계 서비스 제공 방법."}
{"patent_id": "10-2023-0122821", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 게시물과 연계하는 단계는,상기 인플루언서로부터 개인 정보를 획득하는 단계;획득된 개인 정보를 이용하여 상기 인플루언서의 채널과 연동되는 개인 판매 페이지를 생성하는 단계; 및상기 인플루언서의 게시물을 통해 추출된 상품을 상기 개인 판매 페이지에 게시하는 단계;를 더 포함하고,상기 개인 판매 페이지에 게시하는 단계는,상기 상품을 판매하는 판매 페이지로부터 상기 상품에 대한 상세정보를 수집하는 단계; 및수집된 상세정보를 해당 상품과 매칭하여 게시하는 단계;를 포함하는, 인플루언서의 게시물을 이용한 상품 추천및 판매 페이지 연계 서비스 제공 방법."}
{"patent_id": "10-2023-0122821", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항 또는 제7항 중 적어도 한 항에 있어서,상기 인플루언서의 게시물과 연동된 페이지 링크를 통해 상기 상품을 판매하는 판매 페이지에 접속한 사용자들또는 상기 개인 판매 페이지에 접속한 사용자들을 판단하는 단계; 및공개특허 10-2024-0070395-4-상기 사용자들이 상기 상품을 구매하는 경우 기 설정된 비율에 따라 상기 인플루언서에게 수수료를 제공하는 단계;를 포함하는, 인플루언서의 게시물을 이용한 상품 추천 및 판매 페이지 연계 서비스 제공 방법."}
{"patent_id": "10-2023-0122821", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "하나 이상의 인스트럭션을 저장하는 메모리; 및상기 메모리에 저장된 상기 하나 이상의 인스트럭션을 실행하는 프로세서를 포함하고,상기 프로세서는 상기 하나 이상의 인스트럭션을 실행함으로써, 제1항의 방법을 수행하는, 장치."}
{"patent_id": "10-2023-0122821", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "하드웨어인 컴퓨터와 결합되어, 제1항의 방법을 수행할 수 있도록 컴퓨터에서 독출가능한 기록매체에 저장된 컴퓨터프로그램."}
{"patent_id": "10-2023-0122821", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인플루언서의 채널에 업로드되는 게시물을 분석하여 인플루언서가 착용한 아이템과 유사한 상품을 추 출하고, 추출된 상품을 판매하는 판매 페이지의 링크를 인플루언서의 게시물과 자동으로 연계하는 인플루언서의 게시물을 이용한 상품 추천 및 판매 페이지 연계 서비스 제공 방법, 장치 및 프로그램에 관한 것이다. 본 발명의 실시 예에 따른 인플루언서의 게시물을 이용한 상품 추천 및 판매 페이지 연계 서비스 제공 방법은 인 플루언서의 채널에 업로드되는 게시물에서 상기 인플루언서가 착용한 아이템의 특징을 분석하는 단계와, 분석 결 과를 기초로 상기 아이템과 유사한 상품을 추출하는 단계와, 추출된 상품을 판매하는 판매 페이지의 링크를 상기 게시물과 연계하는 단계를 포함한다."}
{"patent_id": "10-2023-0122821", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인플루언서의 게시물을 이용한 상품 추천 및 판매 페이지 연계 서비스 제공 방법, 장치 및 프로그램 에 관한 것으로, 보다 자세하게는 인플루언서의 채널에 업로드되는 게시물을 분석하여 인플루언서가 착용한 아 이템과 유사한 상품을 추출하고, 추출된 상품을 판매하는 판매 페이지의 링크를 인플루언서의 게시물과 자동으 로 연계하는 인플루언서의 게시물을 이용한 상품 추천 및 판매 페이지 연계 서비스 제공 방법, 장치 및 프로그 램에 관한 것이다."}
{"patent_id": "10-2023-0122821", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "오늘날, SNS 이용자는 SNS를 통해 자신의 팔로워들에게 영향력을 미치고 있으며, 특히 팔로워(followers)가 많 은 인플루언서(influencer)와 같은 SNS 이용자의 같은 경우에는 소셜 네트워크 서비스의 채널 별로 수십에서 수 백만 명의 팔로워들을 보유하며 트랜드를 선도하고 있다. 인플루언서가 사용하거나 리뷰한 상품이 팔로워들의 구매로 이어지는 것에 착안하여 인플루언서의 영향력을 매 개로 하는 마케팅 방법 및 플랫폼이 생기고 있다. 인플루언서는, 자신이 판매하고자 하는 상품의 링크를 자신의 SNS 계정에 연동시켜, 자신의 팔로워가 링크를 통해 접속하여 상품을 구매하도록 할 수 있다. 그러나, 인플루언서는 판매하고자 하는 상품에 대한 링크를 본인의 채널에 직접 올려 홍보하여야함에 따라 불편 함이 존재하고, 팔로워들은 인플루언서가 판매하는 상품에 대해서만 구매를 할 수 있을 뿐이며, 판매하지는 않 으나 인플루언서가 착용한 아이템에 대해서 구매를 원하는 경우에는 댓글이나 메신저 등을 통해 아이템에 대한 정보를 물어보아야함에 따라 불편함이 존재하고 있다."}
{"patent_id": "10-2023-0122821", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는 인플루언서의 채널에 업로드되는 게시물을 분석하여 인플루언서가 착용한 아 이템과 유사한 상품을 추출하고, 추출된 상품을 판매하는 판매 페이지의 링크를 인플루언서의 게시물과 자동으 로 연계하는 인플루언서의 게시물을 이용한 상품 추천 및 판매 페이지 연계 서비스 제공 방법, 장치 및 프로그 램을 제공하는 것이다.본 발명이 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0122821", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 해결하기 위한 본 발명의 실시 예에 따른 인플루언서의 게시물을 이용한 상품 추천 및 판매 페이 지 연계 서비스 제공 방법은 인플루언서의 채널에 업로드되는 게시물에서 상기 인플루언서가 착용한 아이템의 특징을 분석하는 단계와, 분석 결과를 기초로 상기 아이템과 유사한 상품을 추출하는 단계와, 추출된 상품을 판 매하는 판매 페이지의 링크를 상기 게시물과 연계하는 단계를 포함할 수 있다. 또한, 상기 아이템과 유사한 상품을 추출하는 단계는, 상기 아이템의 특징을 분석한 결과로부터 입력 데이터를 추출하는 단계와, 상기 입력 데이터를 기 학습된 인공지능 모델에 입력하는 단계와, 상기 인공지능 모델의 출력 을 획득하고, 상기 출력에 기초하여 상기 아이템과 유사한 상품을 추출하는 단계를 포함할 수 있다. 또한, 온라인에서 판매되는 상품을 종류에 따라 수집하는 단계와, 상품의 종류에 따라 기 설정된 항목을 기초로 수집되는 상품 각각의 특징을 분석하는 단계와, 상기 상품의 특징과 해당 상품이 판매되는 판매 페이지를 매칭 하여 저장하는 단계를 더 포함하고, 상기 아이템과 유사한 상품을 추출하는 단계는, 상기 인플루언서가 착용한 아이템과 상기 온라인에서 판매되는 상품과의 유사도를 산출하는 단계와, 유사도를 산출한 결과에 따라 상기 아 이템과 유사한 상품을 선정하는 단계를 포함하고, 상기 유사도를 산출하는 단계는, 상기 아이템과 상기 온라인 에서 판매되는 상품간의 특징 각각을 비교하는 단계와, 특징 각각이 유사한 정도에 따라 점수를 부가하는 단계 와, 부가된 점수를 통합하여 유사도를 산출하는 단계를 포함할 수 있다. 또한, 상기 아이템과 유사한 상품을 추출하는 단계는, 상기 인플루언서의 쿠키 정보를 획득하는 단계와, 상기 쿠키 정보를 기초로 상기 인플루언서가 방문한 판매 페이지를 추출하는 단계와, 추출된 판매 페이지에서 상기 인플루언서가 착용한 아이템과 유사한 상품을 추출하는 단계를 포함할 수 있다. 또한, 상기 아이템과 유사한 상품을 추출하는 단계는, 상기 아이템이 가려진 부분을 예측하는 단계와, 예측된 결과를 기초로 적어도 하나 이상의 상기 아이템의 전체 모양을 생성하는 단계와, 상기 전체 모양을 기초로 상기 아이템과 유사한 상품을 추출하는 단계를 포함할 수 있다. 또한, 상기 게시물과 연계하는 단계는, 상기 게시물의 기 설정된 부분에 특정 버튼을 생성하는 단계와, 사용자 가 상기 특정 버튼을 누르는 경우 상기 유사한 상품들에 대한 정보를 순차적으로 표시하는 단계와, 상기 사용자 가 상기 상품을 누르는 경우 상기 상품의 판매페이지를 제공하는 단계를 포함할 수 있다. 또한, 상기 게시물과 연계하는 단계는, 상기 인플루언서로부터 개인 정보를 획득하는 단계와, 획득된 개인 정보 를 이용하여 상기 인플루언서의 채널과 연동되는 개인 판매 페이지를 생성하는 단계와, 상기 인플루언서의 게시 물을 통해 추출된 상품을 상기 개인 판매 페이지에 게시하는 단계를 더 포함하고, 상기 개인 판매 페이지에 게 시하는 단계는, 상기 상품을 판매하는 판매 페이지로부터 상기 상품에 대한 상세정보를 수집하는 단계와, 수집 된 상세정보를 해당 상품과 매칭하여 게시하는 단계를 포함할 수 있다. 또한, 상기 인플루언서의 게시물과 연동된 페이지 링크를 통해 상기 상품을 판매하는 판매 페이지에 접속한 사 용자들 또는 상기 개인 판매 페이지에 접속한 사용자들을 판단하는 단계와, 상기 사용자들이 상기 상품을 구매 하는 경우 기 설정된 비율에 따라 상기 인플루언서에게 수수료를 제공하는 단계를 포함할 수 있다. 상술한 과제를 해결하기 위한 본 발명의 실시 예에 따른 인플루언서의 게시물을 이용한 상품 추천 및 판매 페이 지 연계 서비스 제공 장치는 하나 이상의 인스트럭션을 저장하는 메모리와, 상기 메모리에 저장된 상기 하나 이 상의 인스트럭션을 실행하는 프로세서를 포함하고, 상기 프로세서는 상기 하나 이상의 인스트럭션을 실행함으로 써, 인플루언서의 게시물을 이용한 상품 추천 및 판매 페이지 연계 서비스 제공 방법을 수행할 수 있다. 상술한 과제를 해결하기 위한 본 발명의 일 실시 예에 따른 인플루언서의 게시물을 이용한 상품 추천 및 판매 페이지 연계 서비스 제공 프로그램은 하드웨어인 컴퓨터와 결합하여, 인플루언서의 게시물을 이용한 상품 추천 및 판매 페이지 연계 서비스 제공 방법을 수행할 수 있도록 컴퓨터에서 독출가능한 기록매체에 저장될 수 있다. 본 발명의 기타 구체적인 사항들은 상세한 설명 및 도면들에 포함되어 있다."}
{"patent_id": "10-2023-0122821", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 인플루언서가 착용한 아이템과 유사한 상품을 추출하고, 추출된 상품을 판매하는 판매 페이지의 링크 를 인플루언서의 게시물과 자동으로 연계함으로써, 인플루언서가 상품의 판매를 위한 판매 페이지의 링크를 별 도로 업로드해야하는 번거로움이 감소될 수 있다. 또한, 사용자가 인플루언서가 착용한 아이템과 유사한 상품을 구매하기 위해 인플루언서에게 문의하거나 웹서핑 을 통해 상품을 찾아내야 하는 번거로움이 감소될 수 있다."}
{"patent_id": "10-2023-0122821", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0122821", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 제한되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술 분야의 통상의 기술자에게 본 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 외에 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 명세서 전체에 걸쳐 동일한 도면 부호는 동일한 구성 요소를 지칭하며, \"및/또는\"은 언급된 구성요소들의 각각 및 하나 이상의 모든 조합을 포함한다. 비록 \"제1\", \"제2\" 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단 지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 구성 요소는 본 발명의 기술적 사상 내에서 제2 구성요소일 수도 있음은 물론이다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야의 통상의 기술자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또한, 일반적으로 사용되 는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해석되지 않는다. 명세서에서 사용되는 \"부\" 또는 “모듈”이라는 용어는 소프트웨어, FPGA 또는 ASIC과 같은 하드웨어 구성요소 를 의미하며, \"부\" 또는 “모듈”은 어떤 역할들을 수행한다. 그렇지만 \"부\" 또는 “모듈”은 소프트웨어 또는 하드웨어에 한정되는 의미는 아니다. \"부\" 또는 “모듈”은 어드레싱할 수 있는 저장 매체에 있도록 구성될 수 도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 \"부\" 또는 “모듈”은 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라 이버들, 펌웨어, 마이크로 코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 구성요소들과 \"부\" 또는 “모듈”들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 \"부\" 또는 “모듈”들로 결합되거나 추가적인 구성요소들과 \"부\" 또는 “모듈”들로 더 분리될 수 있다. 본 명세서에서, 컴퓨터는 적어도 하나의 프로세서를 포함하는 모든 종류의 하드웨어 장치를 의미하는 것이고, 실시 예에 따라 해당 하드웨어 장치에서 동작하는 소프트웨어적 구성도 포괄하는 의미로서 이해될 수 있다. 예 를 들어, 컴퓨터는 스마트폰, 태블릿 PC, 데스크톱, 노트북 및 각 장치에서 구동되는 사용자 클라이언트 및 애 플리케이션을 모두 포함하는 의미로서 이해될 수 있으며, 또한 이에 제한되는 것은 아니다. 이하, 첨부된 도면을 참조하여 본 발명의 실시예를 상세하게 설명한다. 본 명세서에서 설명되는 각 단계들은 컴퓨터에 의하여 수행되는 것으로 설명되나, 각 단계의 주체는 이에 제한 되는 것은 아니며, 실시 예에 따라 각 단계들의 적어도 일부가 서로 다른 장치에서 수행될 수도 있다. 도 1은 본 발명의 실시 예에 따른 인플루언서의 게시물을 이용한 상품 추천 및 판매 페이지 연계 서비스 제공 시스템을 도시한 도면이다. 도 1을 참조하면, 본 발명의 실시 예에 따른 인플루언서의 게시물을 이용한 상품 추천 및 판매 페이지 연계 서 비스 제공 시스템은 제공 장치, 사용자 단말 및 외부 서버를 포함할 수 있다. 여기서, 도 1에 도시된 인플루언서의 게시물을 이용한 상품 추천 및 판매 페이지 연계 서비스 제공 시스템은 일 실시 예에 따른 것이고, 그 구성 요소가 도 1에 도시된 실시 예에 한정되는 것은 아니며, 필요에 따라 부가, 변 경 또는 삭제될 수 있다. 제공 장치는 인플루언서의 채널에 업로드되는 게시물에서 인플루언서가 착용한 아이템의 특징을 분석하고, 분석 결과를 기초로 아이템과 유사한 상품을 추출하고, 추출된 상품을 판매하는 판매 페이지의 링크를 게시물과 연계할 수 있다. 사용자 단말은 네트워크를 통해 웹사이트에 접속할 수 있으며, 제공 장치로부터 인플루언서의 게시물 을 이용한 상품 추천 및 판매 페이지 연계 서비스를 제공받을 수 있다. 사용자 단말은 사용자 단말의 적어도 일부분에 디스플레이를 구비하는 스마트폰, 태플릿 PC, 데스크 톱 및 노트북 중 적어도 하나를 포함할 수 있으며, 브라우저를 실행하는 과정에서 제공 장치로부터 제공되 는 인플루언서의 게시물을 이용한 상품 추천 및 판매 페이지 연계 서비스를 제공받을 수 있다. 그러나, 이에 한 정되지 않는다. 사용자 단말은 제공 장치가 제공하는 각종 서비스 및 플랫폼에 관한 어플리케이션을 다운로드, 설치 및 실행함으로써, 어플리케이션을 통해 제공 장치가 제공하는 각종 서비스를 제공받을 수 있다. 이를 위해 사용자 단말은 스마트폰과 같이 어플리케이션의 구동이 가능한 운영체제를 탑재할 수 있다. 그러나, 이에 한정되지 않고, 사용자 단말은 어플리케이션의 구동이 가능한 다른 범용적인 장치들이 적용될 수 있다. 다양한 실시 예에서, 사용자 단말은 어플리케이션 외에 웹 기반으로도 서비스를 제공할 수 있으며, 사용자 단말이 서비스를 제공하는 방법은 특정한 형식으로 제한되지 않는다. 외부 서버는 네트워크를 통해 제공 장치와 연결될 수 있으며, 제공 장치가 인플루언서의 게시물 을 이용한 상품 추천 및 판매 페이지 연계 서비스 제공 방법을 수행하기 위한 각종 정보를 저장 및 관리할 수 있다. 또한, 외부 서버는 제공 장치가 인플루언서의 게시물을 이용한 상품 추천 및 판매 페이지 연계 서비 스 제공 방법을 수행함에 따라 생성되는 각종 정보 및 데이터를 제공받아 저장할 수 있다. 예를 들어, 외부 서 버는 제공 장치 외부에 별도로 구비되는 저장 서버일 수 있다. 도 2를 참조하여, 제공 장치의 하드웨어 구성에 대해 설명하도록 한다. 도 2는 본 발명의 실시 예에 따른 제공 장치의 하드웨어 구성도이다. 도 2를 참조하면, 본 발명의 실시 예에 따른 제공 장치(이하, 컴퓨팅 장치)는 하나 이상의 프로세서, 프로세서에 의하여 수행되는 컴퓨터 프로그램을 로드(Load)하는 메모리, 버스, 통신 인터 페이스 및 컴퓨터 프로그램을 저장하는 스토리지를 포함할 수 있다. 여기서, 도 2에는 본 발명"}
{"patent_id": "10-2023-0122821", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "의 실시예와 관련 있는 구성요소들만 도시되어 있다. 따라서, 본 발명이 속한 기술분야의 통상의 기술자라면 도 2에 도시된 구성요소들 외에 다른 범용적인 구성 요소들이 더 포함될 수 있음을 알 수 있다. 프로세서는 컴퓨팅 장치의 각 구성의 전반적인 동작을 제어한다. 프로세서는 CPU(Central Processing Unit), MPU(Micro Processor Unit), MCU(Micro Controller Unit), GPU(Graphic Processing Unit) 또는 본 발명의 기술 분야에 잘 알려진 임의의 형태의 프로세서를 포함하여 구성될 수 있다. 또한, 프로세서는 본 발명의 실시예들에 따른 방법을 실행하기 위한 적어도 하나의 애플리케이션 또는 프 로그램에 대한 연산을 수행할 수 있으며, 컴퓨팅 장치는 하나 이상의 프로세서를 구비할 수 있다. 다양한 실시예에서, 프로세서는 프로세서 내부에서 처리되는 신호(또는, 데이터)를 일시적 및/또는 영구적으로 저장하는 램(RAM: Random Access Memory, 미도시) 및 롬(ROM: Read-Only Memory, 미도시)을 더 포 함할 수 있다. 또한, 프로세서는 그래픽 처리부, 램 및 롬 중 적어도 하나를 포함하는 시스템온칩(SoC: system on chip) 형태로 구현될 수 있다. 메모리는 각종 데이터, 명령 및/또는 정보를 저장한다. 메모리는 본 발명의 다양한 실시예에 따른 방 법/동작을 실행하기 위하여 스토리지로부터 컴퓨터 프로그램을 로드할 수 있다. 메모리에 컴퓨 터 프로그램이 로드되면, 프로세서는 컴퓨터 프로그램을 구성하는 하나 이상의 인스트럭션들을 실행함으로써 상기 방법/동작을 수행할 수 있다. 메모리는 RAM과 같은 휘발성 메모리로 구현될 수 있을 것 이나, 본 개시의 기술적 범위가 이에 한정되는 것은 아니다. 버스는 컴퓨팅 장치의 구성 요소 간 통신 기능을 제공한다. 버스는 주소 버스(address Bus), 데 이터 버스(Data Bus) 및 제어 버스(Control Bus) 등 다양한 형태의 버스로 구현될 수 있다. 통신 인터페이스는 컴퓨팅 장치의 유무선 인터넷 통신을 지원한다. 또한, 통신 인터페이스는 인 터넷 통신 외의 다양한 통신 방식을 지원할 수도 있다. 이를 위해, 통신 인터페이스는 본 발명의 기술 분 야에 잘 알려진 통신 모듈을 포함하여 구성될 수 있다. 몇몇 실시예에서, 통신 인터페이스는 생략될 수도 있다. 스토리지는 컴퓨터 프로그램을 비 임시적으로 저장할 수 있다. 컴퓨팅 장치를 통해 인플루언서 의 게시물을 이용한 상품 추천 및 판매 페이지 연계 서비스 제공 방법을 수행하는 경우, 스토리지는 인플 루언서의 게시물을 이용한 상품 추천 및 판매 페이지 연계 서비스 제공 방법을 제공하기 위하여 필요한 각종 정 보를 저장할 수 있다. 스토리지는 ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리 등과 같은 비휘발성 메모리, 하드 디스크, 착탈형 디스크, 또는 본 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터로 읽을 수 있는 기록 매체를 포함하여 구성될 수 있다. 컴퓨터 프로그램은 메모리에 로드될 때 프로세서로 하여금 본 발명의 다양한 실시예에 따른 방 법/동작을 수행하도록 하는 하나 이상의 인스트럭션들을 포함할 수 있다. 즉, 프로세서는 상기 하나 이상 의 인스트럭션들을 실행함으로써, 본 발명의 다양한 실시예에 따른 상기 방법/동작을 수행할 수 있다. 일 실시예에서, 컴퓨터 프로그램은 인플루언서의 채널에 업로드되는 게시물에서 상기 인플루언서가 착용한 아이템의 특징을 분석하는 단계와, 분석 결과를 기초로 상기 아이템과 유사한 상품을 추출하는 단계와, 추출된 상품을 판매하는 판매 페이지의 링크를 상기 게시물과 연계하는 단계를 포함하는, 인플루언서의 게시물을 이용 한 상품 추천 및 판매 페이지 연계 서비스 제공 방법을 수행하도록 하는 하나 이상의 인스트럭션을 포함할 수 있다. 본 발명의 실시예와 관련하여 설명된 방법 또는 알고리즘의 단계들은 하드웨어로 직접 구현되거나, 하드웨어에 의해 실행되는 소프트웨어 모듈로 구현되거나, 또는 이들의 결합에 의해 구현될 수 있다. 소프트웨어 모듈은 RAM(Random Access Memory), ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리(Flash Memory), 하드 디스크, 착탈형 디스크, CD-ROM, 또는 본 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터 판독가능 기록매체에 상주할 수도 있다. 본 발명의 구성 요소들은 하드웨어인 컴퓨터와 결합되어 실행되기 위해 프로그램(또는 애플리케이션)으로 구현 되어 매체에 저장될 수 있다. 본 발명의 구성 요소들은 소프트웨어 프로그래밍 또는 소프트웨어 요소들로 실행 될 수 있으며, 이와 유사하게, 실시 예는 데이터 구조, 프로세스들, 루틴들 또는 다른 프로그래밍 구성들의 조 합으로 구현되는 다양한 알고리즘을 포함하여, C, C++, 자바(Java), 어셈블러(assembler) 등과 같은 프로그래밍 또는 스크립팅 언어로 구현될 수 있다. 기능적인 측면들은 하나 이상의 프로세서들에서 실행되는 알고리즘으로 구현될 수 있다. 이하, 도 3을 참조하여, 컴퓨팅 장치가 제공하는 인플루언서의 게시물을 이용한 상품 추 천 및 판매 페이지 연계 서비스 제공 방법에 대해 설명하도록 한다. 도 3은 본 발명의 실시 예에 따른 인플루언서의 게시물을 이용한 상품 추천 및 판매 페이지 연계 서비스 제공 방법을 나타내는 도면이다. 도 3을 참조하면, 컴퓨팅 장치는 인플루언서의 채널에 업로드되는 게시물에서 인플루언서가 착용한 아이템 의 특징을 분석할 수 있다(S100). 인플루언서는 동영상 플랫폼(예: 유튜브(Youtube)), 인터넷 방송 플랫폼(예: Afreeca TV, Twitch TV, 다음팟 등), 포털 사이트 플랫폼(예: 다음, 구글 등), SNS 플랫폼(예: 인스타그램, 트 위터, 페이스북 등) 등의 플랫폼 중 적어도 하나의 플랫폼에서 활동하며, 각 플랫폼에서 인기를 얻으면서 수많 은 구독자들(또는 팔로어(follower))을 보유하는 이들을 의미할 수 있다. 인플루언서는 개인 채널에 게시물을 업로드할 수 있으며, 본 발명의 실시 예에 따른 게시물은 이미지 또는 영상을 포함할 수 있으나, 이에 한정되는 것은 아니다. 컴퓨팅 장치는 인플루언서의 채널에 게시물이 업로드되면, 게시물을 분석하여 인플루언서가 착용한 아이템 을 추출할 수 있다. 여기서, 인플루언서가 착용한 아이템은 의류, 신발, 악세서리 등을 포함할 수 있고, 인플루 언서가 사용하고 있는 제품이나, 인플루언서 주변에서 촬영된 제품 등을 포함할 수 있다. 예를 들어, 인플루언서는 셀카(self camera)를 본인의 채널에 업로드할 수 있고, 컴퓨팅 장치는 인플루언 서가 업로드한 이미지를 기초로, 인플루언서가 착용하고 있는 자켓을 아이템으로 추출하고, 인플루언서의 뒷 배 경에 촬영된 장식장을 아이템으로 추출할 수 있다. 컴퓨팅 장치는 추출된 아이템 각각에 대한 특징을 분석할 수 있고, 아이템의 특징은 아이템의 종류, 색상, 길이, 모양 등을 포함할 수 있다. 예를 들어, 인플루언서가 착용하고 있는 갈색 긴팔 자켓에 대해 컴퓨팅 장치 는 아이템의 종류를 자켓인 것으로 분석하고, 색상을 갈색인 것으로 분석하고, 길이는 긴팔 또는 허리까지 오는 길이인 것으로 분석하고, 모양은 카라가 없고, 체크무늬이며, 주머니가 있는 것으로 분석할 수 있다. 그러 나, 분석한 결과는 이에 한정되지 않으며, 더 구체적으로 아이템의 원단이나, 자재 종류, 주머니의 위치, 단추 의 개수 등을 분석할 수도 있다. 한편, 컴퓨팅 장치는 아이템의 종류에 따라 각각 다른 특징을 분석할 수 있다. 예를 들어, 추출된 아이템 이 장식장인 경우, 컴퓨팅 장치는 장식장의 색상, 서랍의 개수, 모양 등을 특징으로 분석할 수 있다. 컴퓨팅 장치는 분석 결과를 기초로 아이템과 유사한 상품을 추출할 수 있다(S200). 컴퓨팅 장치는 온 라인에서 판매되는 상품 중 인플루언서가 착용한 아이템과 동일하거나 유사한 상품을 추출할 수 있다. 컴퓨팅 장치가 유사한 상품을 추출하는 구체적인 방법은 도 4 내지 도 7을 통해 설명하도록 한다. 도 4는 본 발명의 제1실시 예에 따른 유사한 상품을 추출하는 방법을 나타내는 도면이다. 도 4를 참조하면, 컴퓨팅 장치는 온라인에서 판매되는 상품을 종류에 따라 수집할 수 있다(S210). 컴퓨팅 장치는 온라인에서 판매되는 상품을 수집하여 상품의 모양이나, 형태, 이름, 상세정보 등을 통해 상품의 종류를 분류할 수 있다. 예를 들어, 상품의 형태가 티셔츠 모양인 경우 해당 상품을 의류로 분류할 수 있다. 또한, 컴퓨팅 장치는 상품이 판매되는 판매 사이트의 특징에 따라 상품을 종류에 따라 분류할 수 있다. 예 를 들어, 의류를 판매하는 판매 사이트에서 판매되는 상품의 경우 의류로 분류하고, 가구를 판매하는 판매 사이 트에서 판매되는 상품의 경우 가구로 분류할 수 있다. 또한, 컴퓨팅 장치는 검색 카테고리에 따라 상품의 종류를 분류할 수 있다. 예를 들어, 컴퓨팅 장치 는 웹사이트에서 의류로 검색할 경우 검색되는 상품에 대해 상품의 종류를 의류로 분류할 수 있고, 가구로 검색 할 경우 검색되는 상품에 대해 상품의 종류를 의류로 분류할 수 있다. 더 나아가, 컴퓨팅 장치는 상품을 더 상세한 종류로 분류하는 것 또한 가능할 수 있다. 예를 들어, 의류의 경우, 티셔츠, 바지, 아우터, 신발, 속 옷 등으로 분류하고, 가구의 경우 침대, 쇼파, 테이블, 수납장 등으로 분류하고, 화장품의 경우 피부, 눈, 입술또는 기초, 색조 등으로 분류할 수 있다. 컴퓨팅 장치는 상품의 종류에 따라 기 설정된 항목을 기초로 수집되는 상품 각각의 특징을 분석할 수 있다 (S211). 컴퓨팅 장치는 상품의 종류에 따라 특징을 분석할 항목을 저장하고 있을 수 있으며, 상품의 종류 에 해당하는 항목에 따라 상품의 특징을 분석할 수 있다. 예를 들어, 의류의 경우, 색상, 종류, 길이, 모양을 항목으로 저장하고 있을 수 있고, 컴퓨팅 장치는 의류로 분류된 상품들 각각의 색상, 종류, 길이, 모양을 분석할 수 있다. 컴퓨팅 장치는 상품의 특징과 해당 상품이 판매되는 판매 페이지를 매칭하여 저장할 수 있다(S212). 이는, 이후 단계에서 인플루언서가 착용한 아이템과 유사한 상품을 판매하는 판매 페이지를 제공하기 위한 것일 수 있 다. 또한, 컴퓨팅 장치는 온라인에서 판매되는 상품의 특징을 분석한 결과를 이용하여 인공지능 모델을 학습시 킬 수 있다. 예를 들어, 상품의 특징을 인공지능 모델의 입력 데이터로써 학습시키고, 해당 특징을 포함하는 상 품을 출력 데이터로써 학습시킬 수 있다. 컴퓨팅 장치는 인플루언서가 착용한 아이템의 특징을 분석한 결과로부터 입력 데이터를 추출할 수 있다 (S213). 컴퓨팅 장치는 인플루언서가 착용한 아이템의 특징을 기 설정된 형태의 입력 데이터로 변환할 수 있다. 컴퓨팅 장치는 입력 데이터를 기 학습된 인공지능 모델에 입력하고(S214), 인공지능 모델의 출력을 획득하 고, 출력에 기초하여 아이템과 유사한 상품을 추출할 수 있다(S215). 즉, 인공지능 모델은 학습된 결과에 따라 입력 데이터에 해당하는 출력 데이터를 출력할 수 있고, 컴퓨팅 장치는 출력 데이터를 기초로 인플루언서 가 착용한 아이템과 유사한 상품을 추출할 수 있다. 도 5는 본 발명의 제2실시 예에 따른 유사한 상품을 추출하는 방법을 나타내는 도면이다. 도 5를 참조하면, 컴퓨팅 장치는 온라인에서 판매되는 상품을 종류에 따라 수집할 수 있다(S220). 온라인 에서 판매되는 상품을 종류에 따라 수집하는 방법은 상기 S210 단계에서 기재한 방법과 동일하게 수행될 수 있 다. 컴퓨팅 장치는 상품의 종류에 따라 기 설정된 항목을 기초로 수집되는 상품 각각의 특징을 분석할 수 있다 (S221). 상품 각각의 특징을 분석하는 방법은 상기 S211 단계에서 기재한 방법과 동일하게 수행될 수 있다. 컴퓨팅 장치는 상품의 특징과 해당 상품이 판매되는 판매 페이지를 매칭하여 저장할 수 있다(S222). 이는, 이후 단계에서 인플루언서가 착용한 아이템과 유사한 상품을 판매하는 판매 페이지를 제공하기 위한 것일 수 있 다. 컴퓨팅 장치는 인플루언서가 착용한 아이템과 온라인에서 판매되는 상품과의 유사도를 산출할 수 있다 (S223). 구체적으로, 컴퓨팅 장치는 인플루언서가 착용한 아이템과 온라인에서 판매되는 상품간의 특징 각 각을 비교할 수 있다. 컴퓨팅 장치는 수집된 상품들 각각과 인플루언서가 착용한 아이템의 특징을 비교할 수 있고, 인플루언서가 착용한 아이템이 포함되는 상품의 종류로 분류된 상품들 각각과 인플루언서가 착용한 아 이템의 특징을 비교할 수 있다. 또한, 컴퓨팅 장치는 각 특징별 동일하지 않은 상품들을 모두 필터링한 후 필터링되지 않은 상품과 인플루 언서가 착용한 아이템의 특징을 비교할 수 있다. 예를 들어, 인플루언서가 착용한 아이템이 하얀색 셔츠인 경우 셔츠가 아닌 상품들을 모두 필터링하고, 하얀색이 아닌 상품들을 모두 필터링한 후, 필터링되지 않은 상품들과 인플루언서가 착용한 아이템의 특징을 비교할 수 있다. 컴퓨팅 장치는 특징 각각이 유사한 정도에 따라 점수를 부가할 수 있다. 예를 들어, 인플루언서가 착용한 아이템이 갈색 긴팔 자켓인 경우, 인플루언서가 착용한 아이템과 색상이 동일한 정도에 따라 상품의 점수를 부 가하고, 카라 모양이 동일한 정도에 따라 상품의 점수를 부가하고, 무늬가 동일한 정도에 따라 상품의 점수를 부가할 수 있다. 컴퓨팅 장치는 부가된 점수를 통합하여 인플루언서가 착용한 아이템과 상품들 각각에 대한 유사도를 산출 할 수 있다. 인플루언서가 착용한 아이템과 상품간의 유사도를 산출하는 방법은 상품의 종류에 따라 상이할 수 있고, 특징을 분류한 항목마다 상이할 수 있다. 컴퓨팅 장치는 유사도를 산출한 결과에 따라 아이템과 유사한 상품을 선정할 수 있다(S224). 컴퓨팅 장치 는 유사도가 가장 높은 상품을 인플루언서가 착용한 아이템과 가장 유사한 상품으로 선정할 수 있다. 또한, 컴퓨팅 장치는 복수개의 상품을 인플루언서가 착용한 아이템과 유사한 상품으로 선정할 수 있으며, 유사도가 높은 순서대로 기 설정된 순위까지의 상품을 인플루언서가 착용한 아이템과 유사한 상품으로 선정할 수 있다. 또한, 컴퓨팅 장치는 유사도가 기 설정된 값 이상인 모든 상품들을 인플루언서가 착용한 아이템과 유사한 상품으로 선정할 수 있다. 그러나, 유사도에 따라 유사한 상품을 선정하는 방법은 이에 한정되는 것은 아니다. 도 6은 본 발명의 제3실시 예에 따른 유사한 상품을 추출하는 방법을 나타내는 도면이다. 도 6을 참조하면, 컴퓨팅 장치는 인플루언서의 쿠키 정보를 획득할 수 있다(S230). 인플루언서는 인플루언 서가 소지한 사용자 단말을 통해 웹서핑을 수행할 수 있고, 컴퓨팅 장치는 인플루언서가 수행하는 웹 서핑에 대한 쿠키 정보를 수집할 수 있다. 쿠키 정보는 사용자가 어떠한 웹사이트를 방문할 경우 사용자의 웹 브라우저를 통해 사용자 단말에 설치되는 작은 기록 정보 파일을 의미할 수 있다. 컴퓨팅 장치는 수집되는 쿠키 정보를 기초로 인플루언서가 방문한 판매 페이지를 추출할 수 있다(S231). 예를 들어, 인플루언서는 여러 웹사이트를 방문할 수 있으며, 방문하는 웹사이트는 판매 페이지뿐만 아니라, SNS 플랫폼, 동영상 플랫폼, 포털 사이트 플랫폼 등을 포함할 수 있다. 이에 따라, 컴퓨팅 장치는 인플루 언서가 방문한 웹사이트들 중 판매 페이지만을 추출할 수 있다. 컴퓨팅 장치는 추출된 판매 페이지에서 인플루언서가 착용한 아이템과 유사한 상품을 추출할 수 있다 (S232). 즉, 인플루언서는 판매 페이지에 접속하여 상품을 구매했을 수 있으므로, 컴퓨팅 장치는 인플루언 서가 방문한 판매 페이지에서 수집되는 상품을 기초로 인플루언서가 착용한 아이템과 유사한 상품을 추출할 수 있다. 이를 통해, 인플루언서가 착용한 아이템과 동일한 상품을 추출할 가능성이 증가될 수 있다. 여기서, 컴퓨 팅 장치가 인플루언서가 방문한 판매 페이지에서 인플루언서가 착용한 아이템과 유사한 상품을 추출하는 것은 도 4 및 도 5에서 기재한 방법에 따라 수행될 수 있다. 즉, 컴퓨팅 장치는 인플루언서가 방문한 판매 페이지를 인공지능 모델에 입력 데이터로써 추가적으로 입력 할 수 있고, 인공지능 모델은 인플루언서가 방문한 판매 페이지에서 판매되는 상품 중 인플루언서가 착용한 아 이템의 특징에 해당하는 상품을 출력할 수 있다. 컴퓨팅 장치는 인공지능 모델의 출력을 기초로 인플루언 서가 착용한 아이템과 유사한 상품을 추출할 수 있다. 또한, 컴퓨팅 장치는 인플루언서가 방문한 판매 페이지에서 판매되는 상품들 각각과 인플루언서가 착용한 아이템간의 특징을 비교하여 유사도를 산출하고, 산출되는 유사도에 따라 인플루언서가 착용한 아이템과 유사한 상품을 추출할 수 있다. 그러나, 인플루언서가 방문한 판매 페이지에서 인플루언서가 착용한 아이템과 유사한 상품을 추출하는 방법은 이에 한정되는 것은 아니다. 도 7은 본 발명의 제4실시 예에 따른 유사한 상품을 추출하는 방법을 나타내는 도면이다. 도 7을 참조하면, 컴퓨팅 장치는 아이템이 가려진 부분을 예측할 수 있다(S240). 인플루언서가 개인 채널 에 셀카를 업로드한 경우, 컴퓨팅 장치는 인플루언서가 착용한 의류를 아이템으로써 추출할 수 있다. 그러 나, 인플루언서가 착용한 의류나 사진의 각도 등에 따라 아이템에는 가려진 부분이 발생할 수 있다. 예를 들어, 인플루언서가 셔츠를 입고, 셔츠 위에 자켓을 입고 있는 경우 사진상에서 셔츠의 소매 부분은 가려져 있을 수 있다. 이에 따라, 컴퓨팅 장치는 셔츠의 가려진 소매 부분을 예측할 수 있고, 예측 결과는 적어도 하나 이 상일 수 있다. 예를 들어, 컴퓨팅 장치는 셔츠의 소매를 반팔로 예측할 수 있고, 셔츠의 소매를 단추가 달 린 긴팔로 예측할 수 있고, 셔츠의 소매를 시보리로 마감된 긴팔로 예측할 수 있다. 컴퓨팅 장치는 예측된 결과를 기초로 하나 이상의 아이템의 전체 모양을 생성할 수 있다(S241). 컴퓨팅 장 치는 사진상에서 가려지지 않은 부분과 예측된 결과 각각을 조합하여 전체 모양을 생성할 수 있다. 전체 모양을 생성하는 것은 아이템의 전체 모양에 대한 이미지를 생성하는 것일 수 있고, 전체 모양에 대한 특징을 분석하는 것일 수 있다. 예를 들어, 컴퓨팅 장치는 사진상에서 가려지지 않은 셔츠의 가운데 부분과, 예측 된 결과인 셔츠의 소매 부분을 연결하여 셔츠 전체 모양에 대한 이미지를 생성할 수 있다. 또한, 컴퓨팅 장치 는 사진상에서 가려지지 않은 부분의 특징, 예를 들어, 단추의 개수, 색상, 카라의 모양 등을 분석하고, 예측된 결과를 이용하여 소매의 모양, 소매의 길이 등을 분석할 수 있다. 컴퓨팅 장치는 전체 모양을 기초로 아이템과 유사한 상품을 추출할 수 있다(S242). 여기서, 컴퓨팅 장치 가 전체 모양을 기초로 인플루언서가 착용한 아이템과 유사한 상품을 추출하는 것은 도 4 및 도 5에서 기 재한 방법에 따라 수행될 수 있다. 즉, 컴퓨팅 장치는 전체 모양을 기초로 판단한 아이템의 특징을 인공지능 모델에 입력 데이터로써 입력할 수 있고, 인공지능 모델은 입력된 아이템의 특징에 해당하는 상품을 출력할 수 있다. 컴퓨팅 장치는 인공 지능 모델의 출력을 기초로 인플루언서가 착용한 아이템과 유사한 상품을 추출할 수 있다. 또한, 컴퓨팅 장치는 전체 모양을 기초로 판단한 아이템의 특징을 온라인에서 판매되는 상품들 각각의 특 징과 비교하여 유사도를 산출하고, 산출되는 유사도에 따라 인플루언서가 착용한 아이템과 유사한 상품을 추출 할 수 있다. 그러나, 전체 모양을 기초로 인플루언서가 착용한 아이템과 유사한 상품을 추출하는 방법은 이에 한정되는 것은 아니다. 다시 도 3을 참조하면, 컴퓨팅 장치는 추출된 상품을 판매하는 판매 페이지의 링크를 게시물과 연계할 수 있다(S300). 컴퓨팅 장치는 인플루언서가 업로드한 게시물의 기 설정된 부분에 특정 버튼을 생성할 수 있 고, 사용자가 생성된 특정 버튼을 누르는 경우 유사한 상품들이 나열되도록 인스트럭션을 제공할 수 있다. 컴퓨 팅 장치는 유사한 상품들 각각에 대한 명칭, 금액, 판매 사이트에 대한 정보를 간략하게 기재할 수 있고, 사용자가 하나의 상품을 선택하는 경우 해당 상품의 판매 페이지를 제공할 수 있다. 컴퓨팅 장치는 표시되는 상품들 각각에 대한 판매 페이지를 매칭하여 저장하고 있을 수 있으며, 사용자가 특정 상품을 선택하는 경우, 특정 상품을 판매하는 판매 페이지를 사용자에게 제공할 수 있다. 도 8은 본 발명의 실시 예에 따른 페이지의 링크를 게시물과 연계한 예시를 나타내는 도면이다. 도 8을 참조하면, 컴퓨팅 장치는 (a)와 같이, 인플루언서가 업로드한 게시물의 아래에 구매하기 버튼을 생 성할 수 있다. 인플루언서가 착용한 아이템을 구매하기를 원하는 사용자는 구매하기 버튼을 누를 수 있고, 컴퓨 팅 장치는 구매하기 버튼의 입력이 획득되면, (b)와 같이, 추출한 유사한 상품들을 순차적으로 표시할 수 있다. 다시 도 3을 참조하면, 컴퓨팅 장치는 인플루언서의 개인 정보를 획득할 수 있으며, 개인 정보는 인플루언 서의 개인 채널 주소를 포함할 수 있다. 컴퓨팅 장치는 획득된 개인 정보를 이용하여 인플루언서의 채널과 연동되는 개인 판매 페이지를 생성할 수 있다. 개인 판매 페이지는 인플루언서가 착용한 아이템과 유사한 상품들을 모아놓은 온라인상의 공간으로, 컴퓨 팅 장치는 추출된 유사한 상품들을 개인 판매 페이지에 게시할 수 있다. 개인 판매 페이지에는 인플루언서 의 게시물을 통해 추출된 상품들이 누적되어 게시될 수 있다. 예를 들어, 컴퓨팅 장치는 인플루언서가 업 로드한 제1게시물을 통해 추출된 유사한 상품을 개인 판매 페이지에 게시하고, 다른 날짜에 인플루언서가 업로 드한 제2게시물을 통해 추출된 유사한 상품을 개인 판매 페이지에 개시할 수 있다. 이를 통해, 사용자들이 이전 게시물에 대해 추출된 유사한 상품에 대해서도 한번에 구매가 가능하도록 할 수 있다. 컴퓨팅 장치는 상품을 판매하는 판매 페이지로부터 상품에 대한 상세정보를 수집하고, 수집된 상세정보를 해당 상품과 매칭하여 게시할 수 있다. 즉, 사용자가 개인 판매 페이지에서 특정 상품을 선택하는 경우 컴퓨팅 장치는 해당 상품에 대한 상세정보를 사용자에게 제공할 수 있다. 컴퓨팅 장치는 개인 판매 페이지를 인플루언서의 게시물과 연동할 수 있다. 예를 들어, 컴퓨팅 장치 는 사용자가 게시물의 기 설정된 부분에 생성된 특정 버튼을 누르는 경우 개인 판매 페이지가 사용자에게 제공 되도록 할 수 있다. 한편, 사용자는 개인 판매 페이지에서 복수개의 상품을 구매하기를 원할 수 있고, 복수개의 상품 각각의 판매 사이트는 상이할 수 있다. 컴퓨팅 장치는 사용자가 구매한 상품 각각에 해당하는 판매 사이트에 고객 정보 및 주문 정보를 제공할 수 있고, 판매 사이트를 관리하는 관리자는 컴퓨팅 장치에서 제공되는 고객 정보 및 주문 정보를 이용하여 사용자에게 해당 상품을 제공할 수 있다. 또한, 컴퓨팅 장치는 사용자가 개인 판매 페이지에서 특정 상품을 선택하는 경우, 해당 상품을 판매하는 판매 페이지를 제공할 수도 있다. 컴퓨팅 장치는 인플루언서의 게시물과 연동된 페이지 링크를 통해 상품을 판매하는 판매 페이지에 접속한 사용자들 또는 개인 판매 페이지에 접속한 사용자들을 판단할 수 있다.컴퓨팅 장치는 해당 사용자들이 상품을 구매하는 경우 기 설정된 비율에 따라 인플루언서에게 수수료를 제 공할 수 있다. 전술한 바와 같이 본 발명의 실시 예에 따르면, 인플루언서의 채널에 업로드되는 게시물을 분석하여 인플루언서 가 착용한 아이템과 유사한 상품을 추출하고, 추출된 상품을 판매하는 판매 페이지의 링크를 인플루언서의 게시 물과 자동으로 연계하는 인플루언서의 게시물을 이용한 상품 추천 및 판매 페이지 연계 서비스 제공 방법, 장치 및 프로그램을 실현할 수 있다."}
{"patent_id": "10-2023-0122821", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상, 첨부된 도면을 참조로 하여 본 발명의 실시예를 설명하였지만, 본 발명이 속하는 기술분야의 통상의 기술 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로, 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며, 제한적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2023-0122821", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 예에 따른 인플루언서의 게시물을 이용한 상품 추천 및 판매 페이지 연계 서비스 제공 시스템을 도시한 도면이다. 도 2는 본 발명의 실시 예에 따른 제공 장치의 하드웨어 구성도이다. 도 3은 본 발명의 실시 예에 따른 인플루언서의 게시물을 이용한 상품 추천 및 판매 페이지 연계 서비스 제공 방법을 나타내는 도면이다. 도 4는 본 발명의 제1실시 예에 따른 유사한 상품을 추출하는 방법을 나타내는 도면이다. 도 5는 본 발명의 제2실시 예에 따른 유사한 상품을 추출하는 방법을 나타내는 도면이다. 도 6은 본 발명의 제3실시 예에 따른 유사한 상품을 추출하는 방법을 나타내는 도면이다. 도 7은 본 발명의 제4실시 예에 따른 유사한 상품을 추출하는 방법을 나타내는 도면이다. 도 8은 본 발명의 실시 예에 따른 페이지의 링크를 게시물과 연계한 예시를 나타내는 도면이다."}
