{"patent_id": "10-2021-0008433", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0106243", "출원번호": "10-2021-0008433", "발명의 명칭": "에이아이 호흡기환자 모니터링 장치", "출원인": "박언호", "발명자": "박언호"}}
{"patent_id": "10-2021-0008433", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "에 있어서, 상기 EIT 생체데이터 측정부는, 사람이 누울 수 있는 EIT 측정 쿠션을 구비하며,상기 EIT 측정 쿠션은, 띠 형태의 라인 홈이 형성되며, 라인 홈의 바닥면에 EIT 센서 벨트가 부착됨을 특징으로하는 AI 호흡기환자 모니터링 장치."}
{"patent_id": "10-2021-0008433", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 제어부는,측정되는 EIT 생체데이터와 바이오 생체데이터를 기반으로 호흡기 환자의 인공호흡기 파라미터 셋팅값, 약물 투여량, 약물 투여 시기를 포함하는 환자치료 가이드 정보를 산출하여 상기 터치스크린 화면에 표시하는 AI 호흡기환자 모니터링 장치."}
{"patent_id": "10-2021-0008433", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,측정되는 EIT 생체데이터와 바이오 생체데이터를 기반으로 환자치료 가이드 정보를 산출하는 것은, 인공지능 학습 분석을 통하여 산출함을 특징으로 하는 터치스크린 화면에 표시하는 AI 호흡기환자 모니터링 장치."}
{"patent_id": "10-2021-0008433", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서, 상기 AI 호흡기환자 모니터링 장치는,상기 터치스크린화면, EIT 생체데이터 측정부, 바이오 생체데이터 측정부, 제어부가 구비되는 본체;상기 본체를 지지하며 외장 배터리와 수납장이 구비되는 거치대;상기 거치대를 지지하며 바퀴 이동이 가능한 트롤리;를 포함하는 AI 호흡기환자 모니터링 장치."}
{"patent_id": "10-2021-0008433", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서,상기 본체의 상단에 마련되어 환자의 상태를 색상 발광을 통해 알려주는 알람등;상기 본체의 하단에 마련되어 터치스크린화면에 표시되는 수치나 화면 조정을 입력받는 로터리;를 포함하는 AI 호흡기환자 모니터링 장치.공개특허 10-2022-0106243-3-청구항 6"}
{"patent_id": "10-2021-0008433", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "입력 및 표시가 이루어지는 터치스크린화면; 전기 임피던스 단층촬영(EIT)을 통해서 호흡기 환자의 EIT 생체데이 터를 측정하는 EIT 생체데이터 측정부; 호흡기 환자의 심전도, 체온, 혈압, 산소/이산화탄소 포화도를 포함하는 바이오 생체데이터를 측정하는 바이오 생체데이터 측정부; 측정되는 EIT 생체데이터와 바이오 생체데이터를 시간 동기화시켜 상기 터치스크린화면에 함께 표시하는 제어부;를 포함할 수 있다."}
{"patent_id": "10-2021-0008433", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 AI 호흡기환자 모니터링 장치로서, 코로나19 등의 호흡기 질환을 가진 호흡기환자를 모니터링하는 AI 호흡기환자 모니터링 장치에 관한 것이다."}
{"patent_id": "10-2021-0008433", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "호흡기질환을 발현하는 바이러스의 출현 시기가 점점 빨라지면 이로 인한 호흡기환자의 폭발적인 증가가 지금부 터 언제든지 일어날 수 있다. 호흡기환자의 증가는 인공호흡기, 에크모, 음압병동과 같은 특수한 장비와 시설을 필요로 한다. 또한, 중증환자 의 비율이 높아질수록 경험이 많은 의료진을 필요로 하게 된다. 하지만 우리나라뿐만 아니라 전 세계적으로 이 러한 특수 장비와 시설은 부족하며, 의료진의 수도 매우 부족한 상황이다. 호흡기환자가 폐에 이상이 있는 경우 평균 분당 12~20회 호흡을 하는 폐를 안전하게 지속적으로 관찰할 수 있는 방법은 EIT기술을 통한 것 외에는 없다. 하지만 EIT에서 관찰되는 폐의 모습은 단순 이미지이며 이를 보고 판단 하는 것은 의료진의 몫이다. EIT기술을 통하여 호흡기환자의 폐를 실시간으로 관찰하는 것도 매우 중요한 데이터이지만, 기본적인 모니터링 장비에서 측정하는 심전도, 체온, 혈압, 산소/이산화탄소 포화도 역시 매우 중요한 데이터이다. 하지만 각 각의 장비들은 연동되지 못하며 의료진이 각 각의 장비를 살피며 환자의 상태를 확인해야 하는 비효율적인 문제가 있 다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제10-1132595호"}
{"patent_id": "10-2021-0008433", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 기술적 과제는 여러 개의 의료장비를 하나의 장비로 통합하여 분산되어있던 생체데이터를 한 장비로 모이게 하여 최신 의료 AI기술을 통하여 정확하고 빠르게 호흡기환자 맞춤 치료가 가능하도록 하는데 있다."}
{"patent_id": "10-2021-0008433", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시 형태는 입력 및 표시가 이루어지는 터치스크린화면; 전기 임피던스 단층촬영(EIT)을 통해서 호 흡기 환자의 EIT 생체데이터를 측정하는 EIT 생체데이터 측정부; 호흡기 환자의 심전도, 체온, 혈압, 산소/이산 화탄소 포화도를 포함하는 바이오 생체데이터를 측정하는 바이오 생체데이터 측정부; 측정되는 EIT 생체데이터와 바이오 생체데이터를 시간 동기화시켜 상기 터치스크린화면에 함께 표시하는 제어부;를 포함할 수 있다. 상기 제어부는, 측정되는 EIT 생체데이터와 바이오 생체데이터를 기반으로 호흡기 환자의 인공호흡기 파라미터 셋팅값, 약물 투여량, 약물 투여 시기를 포함하는 환자치료 가이드 정보를 산출하여 상기 터치스크린 화면에 표 시할 수 있다. 측정되는 EIT 생체데이터와 바이오 생체데이터를 기반으로 환자치료 가이드 정보를 산출하는 것은, 인공지능 학 습 분석을 통하여 산출함을 특징으로 하는 터치스크린 화면에 표시할 수 있다. 상기 AI 호흡기환자 모니터링 장치는, 상기 터치스크린화면, EIT 생체데이터 측정부, 바이오 생체데이터 측정부, 제어부가 구비되는 본체; 상기 본체를 지지하며 외장 배터리와 수납장이 구비되는 거치대; 상기 거치대 를 지지하며 바퀴 이동이 가능한 트롤리;를 포함할 수 있다. 상기 본체의 상단에 마련되어 환자의 상태를 색상 발광을 통해 알려주는 알람등; 상기 본체의 하단에 마련되어 터치스크린화면에 표시되는 수치나 화면 조정을 입력받는 로터리;를 포함할 수 있다. 상기 EIT 생체데이터 측정부는, 사람이 누울 수 있는 EIT 측정 쿠션을 구비하며, 상기 EIT 측정 쿠션은, 띠 형 태의 라인 홈이 형성되며, 라인 홈의 바닥면에 EIT 센서 벨트가 부착됨을 특징으로 할 수 있다."}
{"patent_id": "10-2021-0008433", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 형태에 따르면 EIT장비를 통해서 획득하는 생체데이터와 기존에 환자 모니터링 장비를 통해서 얻을 수 있는 환자의 생체데이터를 바탕으로 AI기술을 통하여 의료진이 환자 치료에 도움을 줄 수 있다. 또한 본 발명의 실시 형태에 따르면 코로나19 그리고 앞으로 발생 할 수 있는 호흡기질환 발병 바이러스의 출연 에 있어서 보다 신속하고 유연한 대책을 마련할 수 있도록 도와줄 수 있다. 또한 본 발명의 실시 형태에 따르면 AI 의료 기술을 바탕으로 환자를 보다 빠르고 정확하게 치료 할 수 있도록 도와주어 부족한 병상 수, 의료장비, 의료진을 효율적으로 가동 할 수 있도록 도와줄 수 있다. 현재의 EIT장비의 경우 폐의 실시간 모니터링 이미지만을 보여주지만, 또한 본 발명의 실시 형태에 따르면 실시 간 측정되는 이미지를 분석하여 의료진에게 최선의 치료방법을 제시할 수 있다. 또한 본 발명의 실시 형태에 따르면 호흡기환자의 치료에 필요한 생체데이터를 한 화면으로 신속하게 관찰할 수 있다. 또한 본 발명의 실시 형태에 따르면 환자가 병상에 누워 치료를 받는 과정에서 불필요한 외상을 최소한으로 방 지할 수 있다."}
{"patent_id": "10-2021-0008433", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명에 따른 실시예들은 첨부된 도면들을 참조하여 설명한다. 각 도면의 구성요소들에 참조부호를 부 가함에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 부호를 가지 도록 하고 있음에 유의해야 한다. 또한, 본 발명의 실시예를 설명함에 있어, 관련된 공지 구성 또는 기능에 대 한 구체적인 설명이 본 발명의 실시예에 대한 이해를 방해한다고 판단되는 경우에는 그 상세한 설명은 생략한다. 또한, 이하에서 본 발명의 실시예들을 설명할 것이나, 본 발명의 기술적 사상은 이에 한정되거나 제 한되지 않고 당업자에 의해 변형되어 다양하게 실시될 수 있다. 도 1은 본 발명의 실시예에 따른 AI 호흡기환자 모니터링 장치의 사시도이며, 도 2는 본 발명의 실시예에 따른 AI 호흡기환자 모니터링 장치의 구성 블록도이며, 도 3은 본 발명의 실시예에 따른 EIT 측정 쿠션의사시도이다. 기존에 병원에서 일반적인 환자 모니터링 장비가 있을 경우 AI 호흡기환자 모니터링 장비는 EIT로 환자의 폐를 측정하는 기능만 사용할 수 있는데, 본 발명은 EIT장비를 통해서 획득하는 생체데이터와 기존에 환자 모니터링 장비를 통해서 얻을 수 있는 환자의 생체데이터를 모두 함께 디스플레이 되도록 한다. 이때, 본 발명은 단순히 각 각의 생체 데이터를 하나의 기계 화면으로 보이게 하는 것이 아니라 각 각의 데이터 를 바탕으로 AI를 통하여 호흡기환자의 치료에 있어서 인공호흡기 파라미터 세팅 값에 대하여 가이드라인을 제 시하며, 환자에 투여되는 약물의 양, 투여되는 시기를 의료진에게 가이드 해줄 수 있도록 한다. 이를 위하여 본 발명의 실시예에 따른 AI 호흡기환자 모니터링 장치는, 도 1 및 도 2에 도시한 바와 같이 터치 스크린화면, EIT 생체데이터 측정부, 바이오 생체데이터 측정부, 제어부가 구비되는 본체 와, 본체를 지지하며 외장 배터리와 수납장이 구비되는 거치대와, 거치대를 지지하며 바퀴 이동이 가능한 트롤리와, 본체의 상단에 마련되어 환자의 상태를 색상 발광을 통해 알려주는 알람등 과, 본체의 하단에 마련되어 터치스크린화면에 표시되는 수치나 화면 조정을 입력받는 로터리를 포함 할 수 있다. 이하 상술하기로 한다. 거치대는, 본체를 지지하며 외장 배터리와 수납장이 구비되는 지지대이다. 외장 배터리는, 터치스크 린화면, EIT 생체데이터 측정부, 바이오 생체데이터 측정부, 제어부 등에 구동 전력을 제 공한다. 또한 외장 배터리는 다른 장비와 연동될 수 있으며, 수납장은 다양한 구조 형태로서 구현될 수 있다. 트롤리는, 거치대를 지지하며 바퀴 이동이 가능하도록 하는 수단이다. 트롤리의 경우 환자에 따 라 이동이 필요할 시 사용된다. 만약 이동형으로 사용을 하지 않을 경우 트롤리가 필요없으며 펜던트와 같 은 곳에 거치대가 고정 부착될 수 있다. 본체는, 패널 형태로 구현되는데, 도시된 바와 같이 사각체 패널 형태에 국한되지 않고 원형체 패널, 삼각 체 패널, 오각체 패널 등의 다양한 형태를 가질 수 있다. 본체에는, 도 2에 도시한 바와 같이 터치스크린화면, EIT 생체데이터 측정부, 바이오 생체데이 터 측정부, 제어부가 구비된다. 터치스크린화면은, 화면 표시 수단일 뿐만 아니라 터치펜이나 손가락 등의 터치 수단에 의하여 터치를 감 지하여 입력 및 표시가 이루어지는 화면으로서, 사용자와의 소통을 위한 그래픽 유저 인터페이스(GUI;Graphic User Interface)를 표시한다. 여기서 작업 화면이라 함은, 대기 화면 그림 화면, 동영상 화면, 어플리케이션 화 면, 제어 화면 등의 다양한 동작 화면을 말한다. 따라서 측정이 이루어질 때 환자의 연령, 키, 몸무게, 성별 등의 환자 정보를 터치스크린화면을 통해 입력할 수 있게 된다. 바이오 생체데이터 측정부는, 호흡기 환자의 심전도, 체온, 혈압, 산소/이산화탄소 포화도를 포함하는 바 이오 생체데이터를 측정하는 기능을 수행한다. 따라서 심전도 측정 센서, 침습적/ 비침습적 체온, 열압 측정 센 서, 산소/이산호탄소 측정 센서가 본체 뒤의 연결 포트를 통해 연결되어 구비된다. 참고로, 체온과 혈압측 정의 경우 침습적 측정방법과 비침습적 측정방법 모두 가능하며, 소포화도와 이산화탄소 포화도를 동시에 측정 이 가능하며, 산소포화도 센서만 환자에게 부착하여 산소포화도만 모니터링 할 수 있다. EIT 생체데이터 측정부는, 전기 임피던스 단층촬영(EIT)을 통해서 호흡기 환자의 EIT 생체데이터를 측정한 다. 공지되어 있는 바와 같이 EIT(EIT, Electrical Impedance Tomography)는, 전기 임피던스 단층촬영을 통해 영상 형태의 EIT 생체데이터를 생성하는 기술이다. 이를 위해 EIT 생체데이터 측정부는, 전류 주입 및 전압 감 지를 위한 복수의 전극들이 형성되며, 측정하고자 하는 호흡기환자의 흉부 둘레를 따라 부착되는 흉부 전극(EIT 센서)들이 구비된다. 여기서, 흉부 전극은, 전류 주입 및 전압 감지를 위한 복수의 전극들이 형성되며, 측정하고자 하는 호흡기환자 의 흉부 둘레를 따라 부착된다. 복수의 전극들은 단순 전극 또는 복합 전극 중 적어도 어느 하나이며, 플렉시블 ( Flexible)한 탄성 재질로 구성된 베이스 플레이트의 일면에 배열되어 흉부에 부착될 수 있다. 또한, 복 수의 전극들은 호흡기환자의 흉부에 따라 부착되어 폐 내부에 대한 임피던스 데이터를 측정하기 위한 EIT 전극일 수 있다. EIT 전극은 호흡기환자가 감지할 수 없는 비교적 낮은 전류, 예를 들면 1mA 이하의 고주파 전류를 주입하고 유도 전압을 측정하는데 사용되며, EIT 전극을 통해 측정된 전류-전압 데이터는 영상화 알고리즘을 통 해 흉부(폐) 폐쇄 시 그 형태와 폐쇄의 원인이 되는 구조적 변화를 검출하는데 사용될 수 있다. 따라서 EIT 생체데이터 측정부는 복수의 전극들에서의 적어도 하나 이상의 선택된 전극 쌍들에 전류를 선 택적으로 공급하고, 선택되지 않은 전극들을 통해 전압을 측정하여 임피던스 데이터로부터 흉부의 내부를 영상 화할 수 있게 된다. 이를 위해 EIT 생체데이터 측정부는 전류 주입 모듈, 전압 측정 모듈(미도시), 영상 생성 모듈(미도시) 및 EIT 제어 모듈(미도시)를 포함할 수 있다. 전류 주입 모듈은 호흡기환자의 흉부에 부착된 복수의 전극들 중에서 적어도 하나의 선택된 전극 쌍을 통하여 복수의 주파수 범위를 갖는 전류를 주입할 수 있다. 실시예에 따라서, 전류 주입 모듈은 선택된 전극 쌍 및 주파수를 선택하고, 선택된 주파수에 따른 전압 신호를 생성하여 전류로 변환하며, 선택된 전극 쌍들을 통해 호흡기환자의 흉부에 변환된 전류를 주입할 수 있다. 다른 실시예에 따라서, 전류 주입 모듈은 전압 신호를 위상이 서로 다른 두 전류로 변환하고, 진폭 및 주파수가 동일하도록 두 전류를 교정하며, 선택된 전극 쌍을 통해 호흡기환자의 흉부에 교정된 두 전류를 주입할 수도 있 다. 전압 측정 모듈은 복수의 전극들 중 선택되지 않은 전극들로부터 주입되는 전류에 따라 유기된(induced) 전압을 측정할 수 있다. 예를 들면, 전압 측정 모듈은 측정된 전압의 기울기를 근거로 하여 검출된 전압에 포함된 노이 즈를 제거하고, 검출된 전압의 기울기가 기설정된 임계값을 초과하는 경우, 임계값을 초과하는 구간의 전압을 기설정된 전압값으로 대체할 수 있다. 영상 생성 모듈은 측정된 전압을 기반으로 흉부에서의 임피던스 데이터를 측정하여 흉부의 내부를 영상화할 수 있다. 예를 들면, 영상 생성 모듈은 주입된 전류에 의해 유기된 전압차 신호를 복수의 전극들 중 선택되지 않은 전극들을 통해 획득하며, 호흡기환자의 흉부 둘레 및 전극 위치에 따른 임피던스 데이터를 획득할 수 있다. 이후, 영상 생성 모듈은 측정된 임피던스 데이터 값으로 호흡기환자의 흉부에 대한 도전율 및 유전율 영상을 복 원하여 흉부 영상을 영상화할 수 있다. 구체적으로, 영상 생성 모듈은 호흡기환자의 흉부의 영상화를 위해, 복 수의 전극들이 갖는 측정 프로토콜을 가짐으로 인해, 흉부 전극의 위치에 따른 민감도와 해상도를 제어할 수도 있다. 이러한 다수의 측정 프로토콜을 이용한 측정값들 또는 그 조합과 흉부 전극을 통해 생성한 3차원 모델링 영상에서 개선한 민감도 행렬을 이용하여, 호흡기환자의 흉부 내부의 도전율과 유전율 영상 즉, 임피던스 영상 인 흉부 영상을 생성할 수 있다. EIT 제어 모듈은, 복수의 전극들에서의 적어도 하나 이상의 전극 쌍들의 선택을 제어하고, 선택되지 않은 전극 들의 선택을 제어하며, 호흡 측정부로부터 입력되는 호흡 파라미터에 기초하여 전체 변수(global variable)가 획득되도록 제어할 수 있다. EIT 제어 모듈은 호흡기환자의 흉부에 대한 임피던스 데이터를 측정하 도록 전류 주입 모듈을 제어할 수 있다. 제어부는, 측정되는 EIT 생체데이터와 바이오 생체데이터를 시간 동기화시켜 터치스크린화면에 함께 표시한다. 여기서 시간 동기화라 함은, EIT 생체데이터와 바이오 생체데이터의 측정 시간 주기가 다를 수 있는 데, 이러한 측정 시간 주기를 하나의 화면에 표시하기 위하여 동기화시키는 것이다. 상술하면, 심전도 측정의 경우 3Leads를 사용하여 측정하는 방식을 택하고, 또한 환자의 심전에 문제가 있을 경 우 6Leads를 사용 할 수 있는 기능을 통하여 보다 정밀한 환자의 심전도 측정을 가능하게 한다. 하지만 심전도 측정의 원리와 EIT기술을 통한 환자의 폐 관찰의 원리가 서로 같은 원리이며, 작용부위가 밀접하여 각 각의 측 정이 완벽하게 이루어지지 않는다. 따라서, 6Leads심전도 측정과 EIT 기술을 통하여 환자의 폐를 관찰을 동시에 행할 때에는 1분을 기준으로 측정되는 시간의 비를 다르게 하는 것이다(Ex. ECG : EIT를 2 : 1 / min). 이와 같 이 각 각의 센서에 영향을 주지 않도록 하여 호흡기환자 중 심전도에 이상이 감지되었을 때, 폐 관찰되는 비율 을 조정하고 심전도를 더 많이 측정될 수 있도록 할 수 있다. 나아가, 제어부는, 측정되는 EIT 생체데이터와 바이오 생체데이터를 기반으로 호흡기 환자의 인공호흡기 파라미터 셋팅값, 약물 투여량, 약물 투여 시기를 포함하는 환자치료 가이드 정보를 산출하여 터치스크린 화면에 표시할 수 있다. 따라서 단순히 각 각의 생체 데이터를 하나의 기계 화면으로 보이게 하는 것이 아니라 각 각의 데이터를 바탕으로 AI를 통하여 호흡기환자의 치료에 있어서 인공호흡기 파라미터 세팅 값에 대하여 가이 드라인을 제시하며, 환자에 투여되는 약물의 양, 투여되는 시기를 의료진에게 가이드 해줄 수 있게 된다. 여기서, EIT 생체데이터와 바이오 생체데이터를 기반으로 환자치료 가이드 정보를 산출하는 것은, 미리 등록된 데이터베이스(DB)를 활용하여 산출할 수 있다. 또는 EIT 생체데이터와 바이오 생체데이터를 미리 딥러닝 학습된 인공지능 학습 분석에 적용하여 환자치료 가이드 정보를 산출할 수 있다. 한편, AI 호흡기환자 모니터링 장치는, 본체의 상단에 마련되어 환자의 상태를 색상 발광을 통해 알려주는 알람등과, 본체의 하단에 마련되어 터치스크린화면에 표시되는 수치나 화면 조정을 입력받는 로터리 를 추가 구비할 수 있다. 따라서 위급한 알람은 빨간색, 다음으로 위급한 알람은 주황, 노란색으로 나타납니다. 또한, 일반적인 알람의 경우 초록색으로 경고할 수 있다. 한편, 현재 생산되는 EIT기술을 통하여 환자의 폐를 관찰하는 의료기기의 경우 환자의 흉부에 부착하는 센서벨 트로 인하여 환자의 피부에 상처가 나는 경우가 많다. 이러한 환자의 외상을 방지하기 위하여 본 발명은 환자의 등에 쿠션감이 있는 것을 깔고 눕게 하며 그 곳에는 EIT 센서 벨트가 지나갈 수 있는 빈 공간을 만들어 주도록 한다. 또한, 의료진이 필요시 환자의 몸에 이러한 쿠션감 있는 보조기구를 부착할 수 있도록 별도로 만들어진 일회용 접착 붕대를 사용하도록 한다. 이를 위하여 EIT 생체데이터 측정부는, 도 3에 도시한 바와 같이 사람이 누울 수 있는 ETI 측정 쿠션을 구 비한다. 즉, EIT 측정 쿠션은, EIT장비의 EIT 센서 벨트가 환자의 피부에 외상을 입히는 것을 방지하기 위한 것으로서, 머리부터 환자의 허벅지까지 깔아주는 것으로 쿠션감을 가지도록 한다. 따라서 EIT 측정 쿠션은, 띠 형 태의 라인 홈이 형성되며, 라인 홈의 바닥면에 EIT 센서 벨트가 부착되도록 한다. 여기서 EIT 센서라 함은 상술 한 흉부 전극을 말하는 것으로서, EIT 센서 벨트는 흉부 전극이 배열된 벨트로서 EIT 생체 데이터 측정시에 호 흡기환자의 폐를 측정하기 위해 흉부 가슴에 둘러지는 벨트를 말한다. 이러한 EIT 센서 벨트는 본체 뒤에 연결된다. 이상에서와 같이 도면과 명세서에서 최적 실시예가 개시되었다. 여기서 특정한 용어들이 사용되었으나, 이는 단 지 본 발명을 설명하기 위한 목적에서 사용된 것이지 의미 한정이나 특허청구범위에 기재된 본 발명의 범위를 제한하기 위하여 사용된 것은 아니다. 그러므로 본 기술 분야의 통상의 지식을 가진 자라면 이로부터 다양한 변 형 및 균등한 타 실시예가 가능하다는 점을 이해할 것이다. 따라서 본 발명의 진정한 기술적 보호범위는 첨부된 특허청구범위의 기술적 사상에 의해 정해져야 할 것이다."}
{"patent_id": "10-2021-0008433", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 AI 호흡기환자 모니터링 장치의 사시도. 도 2는 본 발명의 실시예에 따른 AI 호흡기환자 모니터링 장치의 구성 블록도. 도 3은 본 발명의 실시예에 따른 EIT 측정 쿠션의 사시도."}
