{"patent_id": "10-2019-0113576", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0032159", "출원번호": "10-2019-0113576", "발명의 명칭": "무선 통신 기반의 감성표현장치", "출원인": "주식회사 필링크코리아", "발명자": "이두천"}}
{"patent_id": "10-2019-0113576", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선통신 장치를 통하여 신호 송수신하는 통신부;통신부로부터 전달된 송신자가 보내온 정보에 의하여 수신된 신호값을 기초로 연산한 동작신호에 의하여 동작부를 제어하는 제어부;제어부로부터 보내온 동작신호에 의하여 선택된 광, 사운드, 진동 그리고 향기를 표현하는 동작부를 포함하여이루어진 무선 통신 기반의 감성표현장치."}
{"patent_id": "10-2019-0113576", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,동작부는,천연색 모두를 표현할 수 있는 조명 모듈, 소리를 낼 수 있는 사운드모듈, 특정패턴의 진동을 발생하는 진동 모듈, 향기를 외부로 발산하는 향기 모듈로 이루어지며, 제어부는, 배터리 및 전원관리와 통신을 통해 들어온 신호를 통해 내장된 MCU를 통하여 설정된 동작패턴 및 동작형태를정의된 패턴을 저장하여 동작이 가능하게 동작프로그램에 의하여 동작하는 것을 특징으로 하는 무선 통신 기반의 감성표현장치."}
{"patent_id": "10-2019-0113576", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,광, 사운드, 진동 그리고 향기 중의 어느 한가지 혹은 2 이상을 함께 표현하는 것을 특징으로 하는 무선 통신기반의 감성표현장치."}
{"patent_id": "10-2019-0113576", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,제어부는,장치의 전원 공급과 무선 통신 신호를 송수신하는 대기하는 시작단계(S1);송신자로 부터 전송된 신호인 문자, 광, 진동, 향기 신호들의 데이터를 포함하여 이루어진 명령프로트콜을 수신하는 단계(S2);수신된 명령프로토콜을 분석하여 감성 표현 문자, 그래픽, 진동 패턴 , 향기 패턴을 판단하는 패턴판단단계(S3);상기 패턴판단계에 의하여 분석된 패턴에 대한 DB데이터를 실렉트하여 동작패턴을 결정하는 단계(S4);상기 결정된 동작 패턴에 의하여 사용자 메모리에 저장된 동작 패턴을 시스템메모리의 실행 프로그램에 의하여표현할 감정표현동작 명령을 동작부에 송신하는 명령실행단계(S5);상기 명령실행단계로 부터 전달된 명령신호에 의하여 광, 사운드, 진동, 향기 모듈에 대한 동작이 수행되는 표공개특허 10-2021-0032159-3-현단계(S6);상기 표현단계에 의하여 감정표현을 모듈의 정상동작을 비교판단하는 단계(S7);상기 비교판단 단계에서 정상 동작이면 다음 동작신호를 대기하고, 이상동작인 경우에는 시작단계로 리턴하는결과판단단계(S8)을 포함하는 것을 특징으로 하는 무선 통신 기반의 감성표현장치."}
{"patent_id": "10-2019-0113576", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,광,진동,사운드 그리고 향의 표현방법 중 동시 또는 한 두 가지의 동작중,인간감성표현 패턴을 색체, 행동, 광학적인 심리에 따른 설정된 패턴에 의하여 동작하거나,사용자 자신이 상기 설정된 패턴중에서 사용자가 설정한 감성표현 패턴을 임의로 수정 추가 변경가능한 것을 특징으로 하는 무선 통신 기반의 감성표현장치"}
{"patent_id": "10-2019-0113576", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 무선 통신 기반의 빛, 소리, 진동, 향기와 같은 오감을 통한 감성 표현 장치에 관한 것이다. 본 발명은 무선통신 장치를 통하여 신호 송수신하는 통신부; 통신부로부터 전달된 송신자가 보내온 정보에 의하여 수신된 신호값을 기초로 연산한 데이터값을 동작부에 동작 (뒷면에 계속)"}
{"patent_id": "10-2019-0113576", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 무선 통신 기반의 빛, 소리, 진동, 향기와 같은 오감을 통한 감성 표현 장치에 관한 것이다."}
{"patent_id": "10-2019-0113576", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "사회가 고도화, 전문화되면서 통신, 교통, 문화발달이 보다 빠르고 신속한 형태로 발전되면서 인적교류가 다변 화되고 있다. 인간끼리의 의사소통 방식 또한 단어의 축약, 직설적인 표현 등으로 소통방식이 발전해왔으나 이 는 필연적으로 인간 개인의 감성은 배제된, 표현의 직설화로 인하여 원하지 않는 오해나 상처가 발생하는 부작 용들이 종종 생기게 되었다. 따라서 인간교류 시 특히 사랑하는 사이나 가족, 친구와 같이 상호 간의 배려가 필요한 대상을 위하여 본인이 나 상대방 존중이 사라진 직설적 표현 방식에서 벗어나, 교류하는 본인 또는 상대방의 감성 상태를 인간이 느낄 수 있는 다양한 감각 기관을 통하여 다양하게 표현하여, 직접적인 면대면(face to face) 대화보다 오히려 더욱 친밀하고 개성을 느낄 수 있는 무선 통신 수단의 필요성이 요구되고 있다."}
{"patent_id": "10-2019-0113576", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 직접적인 면대면(face to face) 대화보다 더욱 본인의 다양한 감정 상태를 상대에게 전달할 수 있는 송수신 사용자간의 내적 감성을 표현할 수 있는 장치를 제공하고자 한다. 본 발명은 또한 무선전화기를 포함하여 PC, 노트북, 태블렛 등의 다양한 무선 통신 장비를 이용하더라도 상대에 게 문자나 이모티콘과 같은 표현수단 외에도 소리, 빛, 진동, 향기으로 이루어진 표현 장치와 수단이 내장된 감 성표현장치를 제공하고자 한다."}
{"patent_id": "10-2019-0113576", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 무선통신 장치를 통하여 신호 송수신하는 통신부; 통신부로부터 전달된 송신자가 보내온 정보에 의하여 수신된 신호값을 기초로 연산한 데이터값을 동작부에 동작 신호를 보내는 제어부; 제어부로부터 보내온 동작신호에 의하여 선택된 빛, 사운드, 진동 그리고 향기를 표현하는 동작부를 포함하여 이루어진 무선 통신 기반의 감성표현장치를 제공한다. 본 발명은 특히 동작부는, 천연색 모두를 표현할 수 있는 조명 모듈, 소리를 낼 수 있는 사운드모듈, 특정패턴의 진동을 발생하는 진동 모 듈, 향기를 외부로 발산하는 향기 모듈로 이루어지며, 제어부는, 배터리 및 전원관리와 통신을 통해 들어온 신호를 통해 내장된 MCU를 통하여 설정된 동작패턴 및 동작형태를 정의된 패턴을 저장하여 동작이 가능하게 동작프로그램에 의하여 동작하는 것을 특징으로 하는 무선 통신 기반 의 감성표현장치를 제공한다. 본 발명은 특히 무선통신 기반의 송수신자의 인적정보와 송수신정보를 수집관리하여 인공지능서버와 데이터베이 스서버와 연동하여 송수신자의 변화하는 감성패턴과 성향들을정의하여 관리하는 동시에 각각의 서버에 대한 정 보를 공유가공하는 정보수집서버; 무선통신 기반의 감성표현장치의 통신부의 송수신 신호에 기초하여 동작부에 대한 제어신호에 의하여 제어하는 제어부로 이루어진 감성표현장치에 대한 동작을 제어하는 감성표현장치 제어부; 송수신자의 인적정보와 송수신정보 그리고 실사용중인 송수신자의 개인적 인적요인, 계절, 날씨, 외기온도들을 포함하는 환경요인을 분석하여 감정변화를 예측하는 알고리즘을 탑재한 인공지능 서버; 정보수집서버, 감성표현장치제어부, 인공지능서버를 포함한 송수신자와 통신상의 데이터 정보를 수집저장관리하 는 D/B서버를 포함하여 이루어진 무선 통신 기반의 감성표현 AI 플랫폼 서버에 의하여 상기한 동작부에 대한 제 어신호를 송신한다."}
{"patent_id": "10-2019-0113576", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "빛(=광) 칼라의 변화, 광 패턴의 변화, 소리, 진동, 향기를 통하여 인간의 감성을 자극하여 본인이나 상대방의 감성상태와 상황에 대해 인공지능서버를 통한 감성표현 패턴에 의하여, 송수신자간의 배려와 이해를 포함한 표 현수단을 통해 전달됨에 따라, 송수신자 사용자들의 사이에 내재된 감정을 함께 표현하여 사용자간의 풍요롭고 윤택한 통신이 가능하게 하였다.."}
{"patent_id": "10-2019-0113576", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 본 발명의 대표적인 실시예를 첨부한 도면에 의하여 구체적으로 설명한다."}
{"patent_id": "10-2019-0113576", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 발명에서 제시하는 실시예는 도면에 예시하고 발명을 실시하기 위한 구체적인 내용에 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위 에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 각 도면을 설명하면서 유사한 참조부호를 유사한 구성요소에 대해 사용하였다. 다양한 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다 혹은 무선 통신에 의항 송신 수신이 라고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해되어야 할 것이다. 본 발명에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함 하다\" 또는 \"이루어지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반적으 로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 가 지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미 로 해석되지 않는다. 본 발명에서 빛은 광, 조명, 디스플레이 기능들을 갖는 소신호 점멸등과 같은 LED 발광체, LCD, OLED, 와 같은 그래픽 수단을 의미하며, 육안으로 식별가능한 모든 발광체를 포함한다. 본 발명에서 소리(사운드)도 인간이 감지 가능한 다양한 소리로, 특히 스피커와 같은 증폭장치를 통하여 공급되 는 음성, 음악, 특정주파수 신호등을 모두 포함한다. 본 발명에서 진동이란 진동발생 장치에 의한 특정한 진동과 함께, 주파수를 달리하는 장, 단진동들을 모두 포함 한다. 또한 향기란 인간이 감지 가능한 향은 모두 포함가능하며, 이들은 현재 상용화된 다양한 아로마 캄파운드 (aromtic compounds)는 물론 천연 혹은 천연 에센셜 오일과 프래그런스 오일향을 조향하여 만든 다양한 향을 포 함한다. 본 발명의 대표적인 내부 구성도는 도 1에 도시하며, 도 2 는 타 송신장치와 본 발명의 장치 간의 동작을 설명하는 동작구성도이며, 도 3a 와 3b는 실제 대표적 제품구성도이다. 도 4는 본 발명의 송신자의 신호에 의하여 동작하는 내부 동작 프로그램의 흐름도이다. 본 발명은 스마트폰, PC단말기 혹은 태블렛과 같은 무선통신 장치(이하 스마트 기기라 칭한다)를 통하여 신호 송수신하는 통신부; 통신부로부터 전달된 송신자가 보내온 정보에 의하여 수신된 신호값을 기초로 연산한 데이터값을 동작부에 동작 신호를 보내는 제어부; 제어부로부터 보내온 동작신호에 의하여 선택된 광, 사운드, 진동 그리고 향기를 표현하는 동작부를 포함하여 이루어진 무선 통신 기반의 감성표현장치에 관한 것이다. 2인 혹은 다수인(多數人) 간에 통신하는 방식이 종래 음성 통신 외에도 문자, 문자와 이모티콘, 카카오톡과 같 은 문자와 그래픽 그리고 동영상을 함께 전달하고 있다. 이러한 전달에 있어서, 송신자의 감정상태를 표현하기 위하여, ^|^, ^^, ~~ ,, , , 혹은 동영상과 같은 다양한 표현방식들이 동원되고 있다. 본 발명은 송신자의 이러한 다양한 문자, 그래픽 등의 표현된 정보를 기초로 송신자의 감정상태를 인공지능 서버에 의하여, 송신자가 표현하는 감정을 일정한 패턴화하여 저장한 다음, 송신자의 문자, 그래픽 등의 표현형태를 연 산처리하여, 해당 송신자의 감정을 패턴화한 청각, 촉각, 시각, 후각을 자극할 수 있는 음성, 촉각, 사운드, 향 을 직접적으로 느낄 수 있게 표현하는 표현장치를 개발한 것이다. 본 발명의 대표적 실시예로 도 3a, 3b에 도시하듯이, 정면에 빛표현부, 일측면에 사운드표현부, 타측면 에 향표현부 그리고 상측에 진동표현부으로 구성되어진다. 본 실시예에서 제시한 정면, 측면 그리고 상 면들에 표현된 표현부들은 동작부에 대한 설명을 위한 것으로, 원형, 타원형, 다면체, 고리 혹은 불규칙한 형태 로 구성가능하며, 본 실시예외에도 다양한 형태의 외형과 형태를 갖출수 있으며, 본 실시예로 제시한 도면에 의 하여 본 발명의 표현장치가 제한되는 것은 아니다. 본 발명은 보다 구체적으로 송신자가 송신한 문자 혹은 그래픽 혹은 사운드중 감정을 표현하는 이모티콘, 감정 을 표현하는 특정문자열을 감지하여, 인공지능 서버를 통하여 해당 특정 문자열에 해당하는 감성 신호 패턴을 저장부에서 실렉트하여 표현한다. 송신자의 사용된 문자나 그래픽 혹은 사운드 데이터를 리딩(reading)하여, 이들 데이터에 기초하여 송신자의 축 적된 감정표현의 패턴을 연산정리하며, 현재의 심리상태에 따라 설정된 빛, 사운드, 진동, 향기의 데이터를 수 신자에게 표현한다. 따라서 수신자는 송신자의 표현된 빛, 사운드 진동, 향기의 표현상태를 송신자의 감성 상태 를 시각, 청각, 촉각 그리고 후각을 통하여 파악하여, 송신자와의 대화 진행중 감성을 마치 직접 대면하여 대화하는 것처럼 혹은 직접 대화한 것보다 더 정확하게 감정상태를 이해할 수 있게 하였다. 본 발명은 더 나아가서, 빛, 사운드, 진동 그리고 향기 중의 어느 한가지 혹은 2 이상을 함께 표현하는 무선 통 신 기반의 감성표현장치에 관한 것이다. 송신자의 다양한 감정을 표현함에 있어, 수신자는 빛만을 혹은 광과 사운드 혹은 광과 진동,, 이렇게 표현하는 방식을 임의로 취사선택할 수 있게 구성하였다. 구체적으로 예를 들면, 특정 송신자에 대하여, 해당 송신자로부터 오는 신호값중에서 향기와 진동 데이터만을 수신한다는 설정을 하거나, 혹은 사운드와 진동 그리고 향기 데이터값만을 수신한다는 설정으로 표현하는 방식 을 임의로 선택할 수 있게 하였다. 이는 수신자의 상태, 즉, 감정상태는 물론, 수신자의 위치가 사무실, 병원, 거실, 식당 등의 환경에 따라 해당 수신 데이터의 표현을 한정하도록 할 수 있게 하는 것이다. 본 발명은 더 나아가서, 송신자가 송신한 화상 데이터 중 감정을 표현하는 이모티콘, 감정을 표현하는 특정화상 값과 축적된 감정표현 패턴들을 감지하여 인공지능 알고리즘에 의하여 동작하는 인공지능서버를 통하여 해당 특 정 화상 값에 해당하는 감성 신호 패턴을 저장부에서 실렉트하여 표현하는 것을 특징으로 하는 무선 통신 기반 의 감성표현장치이다. 송신자가 문자나 사운드가 없이 특정한 그래픽 데이터를 송신한 경우, 이 송신 화상 데이터를 리딩하여 이것에 적합한 심리상태 패턴을 표현하도록 구성한 것이다. 예를들어 송신자의 그래픽에서 화가 나거나, 신경이 예민한 그래픽만을 송신하는 경우, 해당 송신 그래픽 데이 터값을 기초로 수신자에게도 해당 그래픽에 해당한 경우 수신자에게 선택가능한, 진동, 사운드, 빛 그리고 향기 의 데이터값 중 예민한 경우에 표현가능한 값을 인공지능 서버의 인공지능 알고리즘에 의하여 패턴화된 데이터 로 부터 실렉트하여 표현하여, 수신자는 송신자의 심리상태를 파악하고 그에 따라 적절한 대응이 가능하게 하였 다. 이러한 상태의 감정상태를 직접 대면상태가 아니라도 감정표현 패턴을 통하여 수신자는 리딩함에 따라 통신 중 발생가능한 대화상의 문제를 미연에 방지가능하게 하였다. 본 발명은 더 나아가서, 송신자가 송신한 사운드 데이터 중 감정을 표현하는 특정 사운드 값을 감지하여 인공지 능 서버의 인공지능 알고리즘에 의하여 패턴화된 데이터로 부터 해당 특정 사운드 값에 해당하는 감성 신호 패 턴을 저장부에서 실렉트하여 표현하는 것을 특징으로 하는 무선 통신 기반의 감성표현장치이다. 송신자가 문자나 화상데이터 없이 특정한 사운드 신호만을 송신한 경우에도 이 송신 데이터에 해당하는 감성상 태를 인공지능 서버의 인공지능 알고리즘에 의하여 패턴화된 데이터로 부터 송신자의 심리를 보다 용이하게 이 해할 수 있게 한 것이다. 본 발명은 더 나아가서, 송신자가 송신한 데이터 중 감정을 표현하는 진동값을 감지하여 서버를 통하여 해당 특 정 진동 값에 해당하는 감성 신호 패턴을 인공지능 서버의 인공지능 알고리즘에 의하여 패턴화된 데이터들이 저 장된 저장부에서 실렉트하여 표현하는 것을 특징으로 하는 무선 통신 기반의 감성표현장치이다. 송신자가 문자, 화상, 그래픽의 정보가 없이 특정한 진동 패턴을 송신한 경우에도, 보내온 데이터값을 리딩하여 해당 감성 표현에 적합한 감성상태를 그래픽, 사운드, 진동 등으로 표현하게 구성한 것이다. 본 발명은 더 나아가서,송신자가 송신한 향기 데이터 중 감정을 표현하는 특정 향기 값을 감지하여버를 통하여 해당 특정 향기 값에 해당하는 감성 신호 패턴을 저장부에서 실렉트하여 표현하는 것을 특징으로 하는 무선 통 신 기반의 감성표현장치이다. 송신자로부터 보내온 신호에서 사운드,문자, 그래픽이 없이 특정한 향기 데이터 만을 송신한 경우에도 해당 데 이터 값에 적합한 감성 상태를 표현할 수 있게 한 것이다. 본 발명은 더 나아가서, 빛, 진동, 사운드 그리고 향의 표현방법 중 동시 또는 한 두 가지의 동작중, 인간감성표현 패턴을 색체, 행동, 광학적인 심리에 따른 설정된 패턴에 의하여 동작하거나, 사용자 자신이 상기 설정된 패턴중에서 사용자가 설정한 감성표현 패턴을 임의로 수정 추가 변경가능하도록 하 였다. 즉, 별도의 외장 메모리의 확장으로 광, 사운드, 진동, 향의 패턴을 인간의 감성표현으로 설정된 기존의 패턴을 사용할 수있는 동시에, 사용자가 이미 설정된 패턴의 수정, 추가, 변경이 가능하게 하였다. 따라서 특정한 사용자간에 특정되게 인식가능한 패턴의 설정도 가능하게 하여, 외부인은 패턴을 보거나 느낀다 하여도 특정사용자 만이 가능하게 하는 것이다. 본 발명의 구체적인 동작 흐름도는 도 4에 도시한 바와 같다. 본 발명은 장치의 전원 공급과 무선 통신 신호를 송수신하는 대기하는 시작단계(S1); 송신자로 부터 전송된 신호인 문자, 광, 진동, 향기 신호들의 데이터를 포함하여 이루어진 명령프로트콜을 수신 하는 단계(S2); 수신된 명령프로토콜을 분석하여 감성 표현 문자, 그래픽, 진동 패턴 , 향기 패턴을 판단하는 패턴판단단계 (S3); 상기 패턴판단계에 의하여 분석된 패턴에 대한 DB데이터를 실렉트하여 동작패턴을 결정하는 단계(S4); 상기 결정된 동작 패턴에 의하여 사용자 메모리에 저장된 동작 패턴을 시스템메모리의 실행 프로그램에 의하여 표현할 감정표현동작 명령을 동작부에 송신하는 명령실행단계(S5); 상기 명령실행단계로 부터 전달된 명령신호에 의하여 광, 사운드, 진동, 향기 모듈에 대한 동작이 수행되는 표 현단계(S6); 상기 표현단계에 의하여 감정표현을 모듈의 정상동작을 비교판단하는 단계(S7); 상기 비교판단 단계에서 정상 동작이면 다음 동작신호를 대기하고, 이상동작인 경우에는 시작단계로 리턴하는 결과판단단계(S8)를 포함하여 이루어진다. 본 발명의 감정표현 장치의 동작을 위한 보다 구체적인 예는, 무선통신 기반의 송수신자의 인적정보와 송수신정보를 수집관리하여 인공지능서버와 데이터베이스서버와 연동하 여 송수신자의 변화하는 감성패턴과 성향들을정의하여 관리하는 동시에 각각의 서버에 대한 정보를 공유가공하 는 정보수집서버; 무선통신 기반의 감성표현장치의 통신부의 송수신 신호에 기초하여 동작부에 대한 제어신호에 의하여 제어하는 제어부로 이루어진 감성표현장치에 대한 동작을 제어하는 감성표현장치 제어부; 송수신자의 인적정보와 송수신정보 그리고 실사용중인 송수신자의 개인적 인적요인, 계절, 날씨, 외기온도들을 포함하는 환경요인을 분석하여 감정변화를 예측하는 알고리즘을 탑재한 인공지능 서버; 정보수집서버, 감성표현장치제어부, 인공지능서버를 포함한 송수신자와 통신상의 데이터 정보를 수집저장관리하 는 D/B서버를 포함하여 이루어진 무선 통신 기반의 감성표현 AI 플랫폼 서버에 의하여 감정표현 장치에 대 한 제어신호를 송신하게 한다. 상기한 무선통신장치(WC=wireless communicator)는 무선(유선포함)에 의하여 문자, 소리, 영상을 송수신하는 스 마트폰, 태블릿, PC와 같은 장비를 의미하며, 송수신자로 이루어진 사용자가 상기 문자, 소리, 영상을 원하는 송신과 수신이 가능한 모든 장비를 포함한다. 또한 감정표현장치(HEET=Human emotion expression tool)는 본발 명의 동일자 출원한 감정표현장치에 의한 것을 의미한다. 상기 정보수집서버는, 송수신자의 생년월일, 혈액형, 취미, 직업, 학력을 포함하는 서지적정보와 함께, 송수신자의 사용언어, 사용시간과 함께 식성, 음악, 운동을 포함하는 다양한 개인적 성향, 또한 송수신자의 생 체리듬, 표현종류빈도, 감정표현종류까지 포함하여, 이들 데이터를 추적 수집하여 D/B서버에 사용자의 데이터값 을 계속 업데이트하며, 이 업데이트 값은 인공지능I서버와 연동하여 가입자의 변화하는 감성패턴과 성향등을 정 의하여 관리하는 인적, 환경적등의 데이터 정보를 수집관리하는 서버이다. 보다 구체적으로는 특정한 사용자(송신자혹은 수신자를 모두 포함)가 문자 혹은 이모티콘, 혹은 동영상이나 그 래픽 등의 정보를 도1에 도시하듯이, 무선통신이 가능한 스마트폰,PC 또는 기타 포터블장치에 연결되거나 자체 에 통신기능과 범용OS시스템(안드로이드, 윈도우즈, 리룩스)에 의하여 다른 수신자에게 전달하는 경우, 송신자 가 사용하는 언어(예, 한글과 영어의 사용비율, 습관등)와 함께 송신자의 감정상태를 표현하는 문자 혹은 이모 티콘과 같은 그래픽 표현수단을 수집하여, 희노애락등의 표현시 자주 사용하는 문자나 그래픽을 수집 정리하여 전달하는 기능을 포함한다. 동일한 형태로 수신자도 송신자에 대한 답변으로 문자나 그래픽 혹은 사운드등의 답변을 보내는 경우, 수신자의 희노애락의 감정표현의 수단들을 수집정리한다. 상기 인공지능 서버는, 정보수집서버와 감성표현장치의 동작제어 서버와 연동하여 가입된 사용자의 정보를 토대로 사용패턴을 분석하며, 송수신자의 일일사용량, 주 또는 월평균 감정표현종류, 표현빈도, 상대방 바이오리듬, 생체리듬에 따른 감정상 태를 포함하는 인적정보와 계절, 우천, 바람, 눈 내림을 포함하는 환경정보를 분석하여 송수신자의 감정변화를 예측알고리즘에 의하여 예측하며, 상기 송수신자의 인적 정보와 환경정보에 근거하여 예측 알고리즘에 의하여 처리한 데이터값에 의하여 감성표현 장치에 대한 사운드, 광, 진동 그리고 향기 동작 패턴을 송신한다. 보다 구체적으로 특정한 연인관계, 가족관계에서 연인이나 가족, 친구, 동료, 직장동료, 동창등의 다양한 네트 워크 간에 반복되어 전달되는 문자데이터, 그래픽 데이터, 영상, 사운드 등의 데이터를 정보로 사용패턴을 분석 하여, 송신자가 인식못하고 보내는 문자나 사운드에 기초하여 송신자의 감정상태를 예측하여, 송신자는 예측 못한 감 정상태를 표현하는 문자, 사운드, 진동, 향기를 표현하는 본 발명자의 감정표현장치를 통하여 수신자에게 송신 자의 감성(희노애락)상태를 표현할 수있게 한다. 따라서 송신자와 수신자 간에 직접 대면한 상태와 같이 상대방 의 감정상태를 감정표현장치를 통하여 인식함에 따라, 수신자는 송신자에 대하여 혹은 반대로 송신자는 수신자 에 대하여 현재의 감정상태에 맞는 최적의 문자, 광, 사운드, 향 들을 표현할 수 있게 하였다. 상기 D/B 서버는, 정보수집 서버의 가입자 인적정보와 환경정보와 함께 사용자의 사용문자, 그래픽, 사운드의 사용 패턴, 습관적 인 언어나 영상의 표현 패턴과 이것에 연관된 사용자의 감정 표현 패턴을 기록저장하며, AI서버의 감정변화알고리즘에 의하여 처리한 데이터값도 함께 저장하며, 송수신자의 누적사용된 데이터 값에 의하여 패턴화된 데이터값과 함께 송수신자의 동작패턴을 포함하여 저장한 다."}
{"patent_id": "10-2019-0113576", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 은 본 발명의 대표적인 내부 구성도, 도 2 는 타 송신장치와 본 발명의 장치 간의 동작을 설명하는 동작구성도이며, 도 3a 와 3b는 실제 대표적 샘플 사시도. 도 4는 본 발명의 송신자의 신호에 의하여 동작하는 내부 동작 프로그램의 흐름도, 도 5 는 본 발명의 대표적인 내부 모듈간의 작동 상태 구성도이다."}
