{"patent_id": "10-2021-0166052", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0078354", "출원번호": "10-2021-0166052", "발명의 명칭": "부분방전 패턴 분석을 수행하는 부분방전 측정 시스템 및 이를 위한 동작 방법", "출원인": "(주)시그너스", "발명자": "박부영"}}
{"patent_id": "10-2021-0166052", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "고전압 기기에 구비되어 부분방전과 연관된 데이터를 수집하도록 구현된 하나 이상의 PD 측정센서;상기 고전압 기기 또는 상기 PD 측정센서로부터 획득된 센싱 데이터에 대한 전처리를 수행하고, 상기 전처리가수행된 전처리 데이터를 상기 게이트웨이로 송신하도록 구현되는 하나 이상의 엣지디바이스;상기 하나 이상의 PD 측정센서 및 상기 하나 이상의 엣지 디바이스와 연동되는 게이트웨이; 및상기 게이트웨이로부터 전달된 부분방전 데이터를 기반으로 부분방전의 상태를 가시화하는 HMI(Human-MachineInterface)를 포함하되,상기 HMI에는 Auto-ML(Automatic Machine Learning) 기술이 적용되는, 부분방전 패턴 분석을 수행하는 부분방전 측정 시스템."}
{"patent_id": "10-2021-0166052", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 일 실시 예에 따른 부분방전 패턴 분석을 수행하는 부분방전 측정 시스템은, 고전압 기기에 구비되어 부분방 전과 연관된 데이터를 수집하도록 구현된 하나 이상의 PD 측정센서; 상기 고전압 기기 또는 상기 PD 측정센서로 부터 획득된 센싱 데이터에 대한 전처리를 수행하고, 상기 전처리가 수행된 전처리 데이터를 상기 게이트웨이로 송신하도록 구현되는 하나 이상의 엣지디바이스; 상기 하나 이상의 PD 측정센서 및 상기 하나 이상의 엣지 디바 이스와 연동되는 게이트웨이; 및 상기 게이트웨이로부터 전달된 부분방전 데이터를 기반으로 부분방전의 상태를 가시화하는 HMI(Human-Machine Interface)를 포함하되, 상기 HMI에는 Auto-ML(Automatic Machine Learning) 기 술이 적용된다."}
{"patent_id": "10-2021-0166052", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 명세서는 부분방전 측정 시스템 및 이를 위한 동작 방법에 관한 것으로, 더 구체적으로는 부분방전 패턴 분 석을 수행하는 부분방전 측정 시스템 및 이를 위한 동작 방법 에 관한 것이다."}
{"patent_id": "10-2021-0166052", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "부분방전(Partial Discharge, 이하 'PD')은 도 1과 같이 각종 산업체 및 전력계통 변전소에 설치되는 고압 배전 반, 고압 케이블, 변압기, 가스절연 개폐장치(Gas Insulated Switchgear, 이하 GIS) 등 전력기기 시스템의 어느 한 부분에 생기는 방전을 총칭할 수 있다. 부분방전(PD)의 종류는 전극의 첨단 부근에 생기는 코로나 방전, 절 연물의 표면을 따라서 생기는 연면방전, 절연물 내의 공극에 생기는 보이드 방전 등을 들 수 있다. 1970년대 중반부터 개발 적용된 부분방전 측정법(IEC60270)이 연구되어 왔으나 현장에 적용할 경우, 외부의 백 그라운드 노이즈로 인하여 차폐실에서 측정된 데이터와 같은 신뢰성 있는 결과를 얻을 수 없을 뿐만 아니라 측 정결과의 재현성이 떨어지는 것으로 알려져 왔다. 국내에서도 부분방전 측정을 위한 시제품이 출시되고 있으나 수천만원 대 고가 제품이며, 외국제품의 경우에는 1억원 대 고가 제품이어서 상시 진단 솔루션으로 활용하기에는 경제성이 낮다는 문제가 존재한다. 종래 제안으로 '전력기기의 부분방전 감시 시스템'에 관한 등록특허공보 제10-2117938 호를 참조할 수 있다."}
{"patent_id": "10-2021-0166052", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 명세서의 일 목적은, 부분방전 패턴 분석을 수행하는 부분방전 측정 시스템 및 이를 위한 동작 방법을 제공 하는데 있다."}
{"patent_id": "10-2021-0166052", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 일 실시 예에 따른 부분방전 패턴 분석을 수행하는 부분방전 측정 시스템은, 고전압 기기에 구비되어 부분방 전과 연관된 데이터를 수집하도록 구현된 하나 이상의 PD 측정센서; 상기 고전압 기기 또는 상기 PD 측정센서로 부터 획득된 센싱 데이터에 대한 전처리를 수행하고, 상기 전처리가 수행된 전처리 데이터를 상기 게이트웨이로 송신하도록 구현되는 하나 이상의 엣지디바이스; 상기 하나 이상의 PD 측정센서 및 상기 하나 이상의 엣지 디바 이스와 연동되는 게이트웨이; 및 상기 게이트웨이로부터 전달된 부분방전 데이터를 기반으로 부분방전의 상태를 가시화하는 HMI(Human-Machine Interface)를 포함하되, 상기 HMI에는 Auto-ML(Automatic Machine Learning) 기술이 적용된다."}
{"patent_id": "10-2021-0166052", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 일 실시 예에 따르면, Auto-ML 인공지능 기술의 적용을 통하여 높은 정밀도로 부분방전 패턴 분석을 수행하 는 부분방전 측정 시스템 및 이를 위한 동작 방법이 제공될 수 있다."}
{"patent_id": "10-2021-0166052", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "전술한 특성 및 이하 상세한 설명은 모두 본 명세서의 설명 및 이해를 돕기 위한 예시적인 사항이다. 즉, 본 명 세서는 이와 같은 실시 예에 한정되지 않고 다른 형태로 구체화될 수 있다. 다음 실시 형태들은 단지 본 명세서 를 완전히 개시하기 위한 예시이며, 본 명세서가 속하는 기술 분야의 통상의 기술자들에게 본 명세서를 전달하 기 위한 설명이다. 따라서, 본 명세서의 구성 요소들을 구현하기 위한 방법이 여럿 있는 경우에는, 이들 방법 중 특정한 것 또는 이와 동일성 있는 것 가운데 어떠한 것으로든 본 명세서의 구현이 가능함을 분명히 할 필요 가 있다. 본 명세서에서 어떤 구성이 특정 요소들을 포함한다는 언급이 있는 경우, 또는 어떤 과정이 특정 단계들을 포함 한다는 언급이 있는 경우는, 그 외 다른 요소 또는 다른 단계들이 더 포함될 수 있음을 의미한다. 즉, 본 명세 서에서 사용되는 용어들은 특정 실시 형태를 설명하기 위한 것일 뿐이고, 본 명세서의 개념을 한정하기 위한 것 이 아니다. 나아가, 발명의 이해를 돕기 위해 설명한 예시들은 그것의 상보적인 실시 예도 포함한다. 본 명세서에서 사용되는 용어들은 본 명세서가 속하는 기술 분야의 통상의 기술자들이 일반으로 이해하는 의미 를 갖는다. 보편적으로 사용되는 용어들은 본 명세서의 맥락에 따라 일관적인 의미로 해석되어야 한다. 또한, 본 명세서에서 사용되는 용어들은, 그 의미가 명확히 정의된 경우가 아니라면, 지나치게 이상적이거나 형식적인 의미로 해석되지 않아야 한다. 이하 첨부된 도면을 통하여 본 명세서의 실시 예가 설명된다. 도 1은 부분 방전에 의한 절연 사고에 관한 도면이다. 도 1을 참조하면, 부분방전은 제조공정, 기계적 스트레스 또는 절연 노화공정상의 결함으로 인한 고장, 불순물 또는 균열의 존재로 인해 고전압(HV) 장치의 절연 재료 내부에서 발생하는 방전을 의미한다. 또한, 부분방전(PD)는 부적인 절연구조를 파괴하여 절연열화를 초래하고 결국에는 장기적으로 전체절연을 통해 확산되어 고전압 장치의 고장을 일으킬 수 있다. 도 2는 본 일 실시 예에 따른 부분방전 측정 시스템의 개념도를 보여준다. 도 2를 참조하면, 본 일 실시 예에 따른 부분방전 측정 시스템은 PD 측정센서, 엣지바이스, 게 이트웨이 및 HMI(Human-Machine Interface, 140)을 포함할 수 있다. 예를 들어, 도 2의 PD 측정센서(110는 폐쇄 배전반 또는 금속으로 차단된 전력기기의 이상 시 발생하는 내부 부분방전으로 인하여 발생된 전자파에 유기된 과도대지 전압(Transient Earth Voltage, 이하 'TEV' 센서)를 측 정하는 TEV 센서를 포함할 수 있다. 또한, PD 측정센서는 노이즈 필터를 포함할 수 있으며, 전원 인입단에 NCT(Noise cut transformer)의 구 현을 통해 노이즈의 처리가 가능할 수 있다. 일 예로, 노이즈 필터는 측정대역에 최적화된 다중 밴드패스필터 (Band Pass Filter)로 구현될 수 있다. 또한, PD 측정센서는 커패시턴스의 크기 최적화에 따른 TEV 센서 어레이를 기반으로 제작될 수 있다. 또한, PD 측정센서는 센싱되는 모든 신호를 손실 없이 샘플링하가 위한 샘플 앤 홀드(Sample & Hold) 회로 를 포함할 수 있다.예를 들어, 도 2의 엣지디바이스는 수집된 센서 데이터에 대한 전처리를 수행할 뿐만 아니라 전처리 데이 터를 게이트웨이로 전송할 수 있다. 이 경우, 엣지디바이스는 수집된 데이터를 미리 정해진 규격에 따라 연산 및 변환하여 로컬 또는 원격 데 이터베이스에 저장할 수 있다. 또한, 엣지디바이스는 센서 정보 데이터에 시각 데이터를 포함하는 동기화 된 데이터를 생성할 수 있다. 또한, 엣지디바이스는 수집된 데이터, 전처리된 데이터 또는 동기화된 데이터를 무선통신을 통해 게이트웨 이로 전송할 수 있다. 한편, 엣지디바이스는 데이터 트래픽 및 커버리지를 분석할 수 있다. 이러한 분석 과정에는 엣지디바이스와 연관된 데이터의 양, 전송 주기 및 신호 간섭에 대한 분석정보가 함께 고려 될 수 있다. 예를 들어, 도 2의 게이트웨이는 하나 이상의 PD 측정센서 및 하나 이상의 엣지바이스와 무선 통신(예로, LoRa 통신)을 기반으로 연동될 수 있다. 여기서, 무선 통신은 송수신 데이터 자체를 수백~수천개로 심볼화하여 전송함으로써 노이즈에 보다 강건한 CSS(Chirp Spread Spectrum) 변조 기법이 적용될 수 있다. 예를 들어, 도 2의 HMI는 인공지능을 이용한 부분방전 감지를 위한 진단 소프트웨어를 기반으로 구현될 수 있다. 특히, HMI에는 부분방전의 상태를 가시화할 수 있으며, 이를 위하여 부분방전 패턴과 연관된 데이터베이스 (DB)가 미리 구축될 수 있다. 여기서, 부분방전 패턴과 연관된 데이터베이스(DB)는 부분방전(PD) 이벤트의 번호, 센서명(일 예로, 센서명은 DAS 번호와 센서 번호의 조합으로 구성 가능), 부분방전(PD) 이벤트의 발생 시각, 부분방전(PD) 이벤트 데이터 파일의 이름, 부분방전(PD) 결과와 일치율이 표시될 수 있다. 또한, HMI에는 Auto-ML AI 알고리즘이 적용될 수 있으며, SaaS형 어플리케이션을 통해 구현될 수 있다. 또한, HMI에는 자동으로 부분방전 패턴을 인식하여 별도의 분석 기능 및 분석결과에 대한 보고서 생성 기 능이 구현될 수 있을 뿐만 아니라 부분방전 신호의 검출 시 관리자에게 자동으로 알림 기능이 구현될 수 있다. 도 3은 본 일 실시 예에 따른 부분방전 측정 시스템의 블록도를 보여준다. 도 3을 참조하면, 복수의 TEV 센서로부터 수집된 부분방전 데이터(PD Data)는 무선통신을 통해 수집되어 별도의 플랫폼 서버에 저장될 수 있다. 또한, 수집된 부분방전 데이터(PD Data)에 대한 PD 상태정보와 함께 머신러닝 기반의 AI를 통한 상태 예측 정보가 제공될 수 있다. 도 4는 본 일 실시 에에 따른 부분방전 패턴 분석을 수행하는 시뮬레이션 화면을 보여준다. 도 2 내지 도 4를 참조하면, 본 일 실시 예에 따른 부분방전 측정 시스템에는 기계 스스로 ML 개발 과정에 필요 한 분석 및 수정 행위를 반복하며 고품질의 머신러닝 모델을 생성하는 Auto-ML(Automatic Machine Learning) 기술이 적용될 수 있다. 도 4와 같은 Auto-ML 기술은 노이즈 등 복잡한 부분방전 패턴을 정형화하여 비전문가도 쉽게 판독할 수 있도록 할 수 있다는 장점이 존재한다. 본 명세서의 상세한 설명에서는 구체적인 실시 예에 관하여 설명하였으나, 본 명세서의 범위에서 벗어나지 않는 한도 내에서 여러 가지 변형이 가능하다. 그러므로, 본 명세서의 범위는 상술한 실시 예에 국한되어 정해져서는 안되며 후술하는 특허청구범위뿐만 아니라 이 발명의 특허청구범위와 균등한 것들에 의해 정해져야 한다."}
{"patent_id": "10-2021-0166052", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 부분 방전에 의한 절연 사고에 관한 도면이다. 도 2는 본 일 실시 예에 따른 부분방전 측정 시스템의 개념도를 보여준다. 도 3은 본 일 실시 예에 따른 부분방전 측정 시스템의 블록도를 보여준다. 도 4는 본 일 실시 에에 따른 부분방전 패턴 분석을 수행하는 시뮬레이션 화면을 보여준다."}
