{"patent_id": "10-2012-0008372", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2013-0087232", "출원번호": "10-2012-0008372", "발명의 명칭": "시각신경 회로장치 및 이를 이용한 객체 탐색 시스템, 방법", "출원인": "교통안전공단", "발명자": "한일송"}}
{"patent_id": "10-2012-0008372", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "자극에 의한 시각피질에서의 뉴런 시간에 따른 반응을 전압으로 구현하고, 상기 전압과 동일한 전압을 출력하는회로를 구성한 시각신경 회로장치에 있어서,이미지나 영상 중 적어도 하나에, 상기 이미지나 영상의 배경과 탐색하고자 하는 객체를 구분하기 위한 기준치(Offset)가 적용된 값을 입력으로 하는 트랜스컨덕턴스부;상기 기준치(Offset)를 설정할 수 있는 외부제어전압 인가부;상기 트랜스컨덕턴스부의 출력전압을 미러링(Mirroring)하여 역류를 방지하는 미러링부;상기 미러링부의 출력전압을 버퍼링하여 피드백되는 전압이 역류하지 않도록 하며, 상기 미러링부의 출력전압에상기 객체의 패턴과 동일한 프레임에 대한 입력 전압을 증폭시키는 버퍼부;를 포함하는 시각신경 회로장치."}
{"patent_id": "10-2012-0008372", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 트랜스컨덕턴스부는상기 이미지나 영상의 픽셀에, 상기 기준치(Offset) 값이 상기 객체에 음(-)의 값으로 적용된 전압이 차동 입력전압으로 인가되는 것을 특징으로 하는 시각신경 회로장치."}
{"patent_id": "10-2012-0008372", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 트랜스컨덕턴스부는상기 이미지나 영상의 픽셀에, 상기 기준치(Offset) 값이 상기 객체에는 음(-)의 값으로, 상기 배경에는 양(+)의 값으로 적용된 전압이 차동 입력 전압으로 인가되는 것을 특징으로 하는 시각신경 회로장치."}
{"patent_id": "10-2012-0008372", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 시각신경 회로장치는 상기 객체와 배경을 구분하기 위한 기준치가 적용된 두 개의 입력 전압과, 상기 기준치로 설정된 상기 외부제어전압과, 일정 이득을 가지는 차동 트랜스컨덕턴스 증폭기와 등가회로로 대체가능한것을 특징으로 하는 시각신경 회로장치."}
{"patent_id": "10-2012-0008372", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 내지 제4항 중 적어도 한 항에 있어서,상기 시각신경 회로장치는 적어도 하나 이상 병렬이나 직렬 중 적어도 하나의 조합으로 연결되는 것을 특징으로하는 시각신경 회로장치."}
{"patent_id": "10-2012-0008372", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서, 상기 차동 트랜스컨덕턴스 증폭기는BJT(Bipolar Juction Transistor), JFET(Junction Field-Effect Transistor), MOSFET(Metal-Oxide공개특허 10-2013-0087232-3-Semiconductor Field-Effect Transistor), GaAs MESFET(Metal Semiconductor FET) 중 적어도 하나 또는 적어도하나의 조합으로 구성되는 것을 특징으로 하는 시각신경 회로장치."}
{"patent_id": "10-2012-0008372", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "시각신경 회로장치를 이용한 객체 탐색 시스템에 있어서,이미지나 영상 중 적어도 하나에서, 상기 이미지나 영상의 객체를 탐색하기 위해 입력 영상을 흑백 영상으로 변환하는 변환부;상기 흑백 영상에서 상기 객체와 배경을 구분하기 위한 기준치(Offset)를 적용하는 기준치 적용부;상기 기준치가 적용된 상기 이미지나 영상에, 탐색하기 위한 상기 객체의 형상의 프레임을 이용하여, 상기 프레임과 일치하는 형상에 가중치를 부여하는 가중치 적용부;상기 기준치 및 가중치가 적용된 영상에서 상기 객체를 선별 및 탐지해내는 탐지부;를 포함하는 시각신경 회로장치를 이용한 객체 탐색 시스템."}
{"patent_id": "10-2012-0008372", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 기준치 적용부는상기 객체의 탐색의 오류 및 노이즈를 제거하기 위해, 상기 흑백 영상의 픽셀값에 상기 배경은 양(+)의 기준치값을 적용하고, 상기 객체는 음(-)의 기준치 값을 적용하여 상기 객체와 배경 간의 차이를 발생시키는 것을 특징으로 하는 시각신경 회로장치를 이용한 객체 탐색 시스템."}
{"patent_id": "10-2012-0008372", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서, 상기 가중치 적용부는상기 기준치가 적용된 영상에서, 상기 객체의 형상의 프레임과 일치하는 형상에 가중치를 부여하되,상기 기준치가 적용된 값에 상기 가중치를 곱하는 연산으로 가중치를 부여하는 것을 특징으로 하는 시각신경 회로장치를 이용한 객체 탐색 시스템."}
{"patent_id": "10-2012-0008372", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서, 상기 기준치 적용부와 상기 가중치 적용부는시각신경처리를 이용하여 각 픽셀에 기준치(Synaptic Offset)과 가중치(Synaptic Weight)를 부여하여 방향성을가지도록 하되,상기 방향성은 적어도 하나의 수와 방향으로 확장가능한 것을 특징으로 하는 시각신경 회로장치를 이용한 객체탐색 시스템."}
{"patent_id": "10-2012-0008372", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "시각신경 회로장치를 이용한 객체 탐색 방법에 있어서,이미지나 영상 중 적어도 하나를 흑백 영상으로 변환하는 제1 단계;상기 이미지나 영상의 객체와 배경을 구분하기 위한 기준치(Offset)를, 탐색하고자 하는 패턴의 형상의 객체에적용하되, 상기 배경에는 상기 기준치를 적용하지 않는 제2 단계;상기 객체의 형상과 일치하는 프레임에 가중치를 두어, 상기 기준치가 적용된 영상에 상기 객체가 가중치를 얻공개특허 10-2013-0087232-4-을 수 있도록 가중치를 부여하는 제3 단계;상기 기준치 및 가중치로 강조된 영역인 탐색하고자하는 객체를 탐지하는 제4 단계;를 포함하는 시각신경 회로장치를 이용한 객체 탐색 방법."}
{"patent_id": "10-2012-0008372", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 객체(F)와 배경(B)은 하기 수학식에 의해 산출가능하며, 상기 영상은 input, 상기 기준치는 offset으로,상기 가중치는 weight으로 정의되는 것을 특징으로 하는 시각신경 회로장치를 이용한 객체 탐색 방법."}
{"patent_id": "10-2012-0008372", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "시각신경 회로장치를 이용한 객체 탐색 방법에 있어서,이미지나 영상 중 적어도 하나를 흑백 영상으로 변환하는 제1 단계;상기 이미지나 영상의 객체와 배경을 구분하기 위하나 기준치(Offset)를, 탐색하고자 하는 패턴의 형상의 객체에 음(Negative)의 값으로 적용하고, 상기 배경에는 양(Positive)의 값으로 적용하는 제2 단계;상기 객체의 형상과 일치하는 프레임에 가중치를 두어, 상기 기준치가 적용된 영상에 상기 객체가 가중치를 얻을 수 있도록 가중치를 부여하는 제3 단계;상기 기준치 및 가중치로 강조된 영역인 탐색하고자하는 객체를 탐지하는 제4 단계;를 포함하는 시각신경 회로장치를 이용한 객체 탐색 방법."}
{"patent_id": "10-2012-0008372", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 객체(F)와 배경(B)은 하기 수학식에 의해 산출가능하며, 상기 영상은 input, 상기 기준치는 offset으로,상기 가중치는 weight으로 정의되는 것을 특징으로 하는 시각신경 회로장치를 이용한 객체 탐색 방법."}
{"patent_id": "10-2012-0008372", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항 내지 제14항 중 적어도 한 항에 있어서,시각신경처리를 이용하여 각 픽셀에 기준치(Synaptic Offset)과 가중치(Synaptic Weight)를 부여하여 방향성을가지도록 하되,상기 방향성은 적어도 하나의 수와 방향으로 확장가능한 것을 특징으로 하는 시각신경 회로장치를 이용한 객체탐색 방법.공개특허 10-2013-0087232-5-명 세 서기 술 분 야본 발명의 실시예는 시각신경 회로장치 및 이를 이용한 객체 탐색 시스템, 방법에 관한 것으로, 보다 상세하게 [0001]는, 지속적으로 움직이는 배경에서도 객체를 높은 정확도로 탐지해낼 수 있는 시각신경 회로장치 및 이를 이용한 객체 탐색 시스템, 방법에 관한 것이다.배 경 기 술일반적으로, 뇌과학(Brain Science, 腦科學)은 뇌의 신비를 밝혀내서 인간의 물리적, 정신적 기능을 심층적으로 [0002]탐구하는 응용학문으로, 수학·물리학·화학·생물학 등 기초과학 분야는 물론, 의학·공학·인지과학 등을 복합적으로 적용해 뇌의 신비를 밝히고, 이를 통해 인간이 갖는 물리적·정신적 기능성의 전반을 심층적으로 탐구하는 응용 학문이다.뇌의 작용원리와 의식현상에 대한 연구를 통해 인간의 정체성을 밝혀내고, 이를 통해 과학·의학·교육·산업· [0003]문화 전반에 근본적이고 실제적인 변혁을 가져오는 것을 목표로 한다.예를 들어, 인간의 뇌 정보 처리기능을 기계에 적용해 인간의 신경망 같은 신경회로망을 개발, 현재의 컴퓨터보 [0004]다 더 능동적인 업무를 수행할 수 있는 장치를 개발하는 등이 이에 해당한다고 할 수 있다. 신경회로망(神經回路網)은 인간의 두뇌나 신경세포의 반응과 유사하게 설계된 회로로, 인간과 같이 사고하는 능 [0005]력을 가지는 반도체 칩으로서, 많은 수의 간단한 소자를 통신으로 연결하고, 이를 통해 정보를 표현하고 기억하도록 만들어졌다.인간 두뇌의 신경회로인 뉴런(Neuron)의 구조를 그대로 본 뜬 것이며, 이는 인공지능 컴퓨터의 핵심기술로 음성 [0006]인식, 문자 인식, 영상 처리, 자연 언어의 이해 등의 분야에서 주로 이용되고, 선진국을 중심으로 연구가 활발히 진행중이다.뇌의 정보처리는 뉴런(Neuron)으로 불리우는 비교적 단순한 기능을 수행하는 개개의 세포들이 일정한 제약에 따 [0007]라 구성된 연결 망(Network)의 생리적 활성화를 통해 이루어진다. 뇌는 신체의 다른 장기와 마찬가지로 세포들로 이루어져 있지만, 다른 장기와는 달리 세포들의 연결망이 기능을 형성하는 주요 요소이다시스템 신경과학(System Neuroscience)은 세포 집단의 활성화의 공간적, 시간적 분포를 이해하고자 하는 신경과 [0008]학의 한 분야이며, 그 대표적인 분야가 시각 신경과학이라 할 수 있다. 시각 시스템을 구성하는 망막(Retina),외슬체(Lateral Geniculat Body), 상구(Superior Colliculus), 시각피질(Visual Cortex)의 세포들의 입력, 출력 연결 패턴을 이해하고, 세포들에 의한 신호의 접수, 처리, 저장, 변환 방식을 연구함으로써 생물학적 시각이어떻게 이루어지는지를 규명하는 것이 시각 신경과학의 과제이다.이를 위해, 한국특허공개번호 제10-2006-0089487호에는 사용자에게 보다 우수한 화질의 영상을 제공할 수 있는 [0009]기술이 개시되는데, 이는 도 1을 참조하여 설명하면, 확률 신경회로망 이론을 적용한 영상보상장치의 구성은,현재 프레임을 구성하는 화소들 중 에러가 발생된 에러화소를 검출하는 에러화소 검출부(110) 및 현재프레임을학습하여 현재프레임 학습결과를 저장하고 기저장된 이전프레임 학습결과를 이용하여 검출부에 의해 검출된 에러화소의 화소값을 추정하는 신경회로망부(120)이다.상기와 같은 구성에 의한 영상보상방법은, 현재프레임을 구성하는 각각의 화소에 대해, 상기 화소의 주변화소들 [0010]각각에 대한 주변화소값들의 집합인 주변화소값군과 상기 화소의 화소값을 일대일로 대응시키고, 일대일 대응관계를 상기 현재프레임 학습결과로서 생성하는 학습단계; 생성된 상기 현재프레임 학습결과를 저장하는저장단계; 상기 현재프레임을 구성하는 화소들 중 에러가 발생된 에러화소를 검출하는 검출단계; 및 기저장된이전프레임 학습결과를 이용하여, 검출된 상기 에러화소의 화소값을 추정하는 추정단계;를 포함한다.이와 같이, 최근, 생체기반의 시각(Vision) 및 시각 신경변화를 이용한 시각장치에 대한 많은 연구가 진행되고 [0011]있다.그러나, 아직 컴퓨터상에서의 시각 알고리즘으로서의 이용에서는 효과적이기는 하지만, 실질적인 이용에 있어 [0012]공개특허 10-2013-0087232-6-그 대부분이 인간이나 동물의 시각과 같은 정확성이 결여되어 있고, 특히, 야외 조건에서 주간과 야간처럼 밝기변화가 크고, 움직이는 차량에서 사용하는 것과 같이, 배경이 계속적으로 변화하는 사용환경에서는, 현재 수준의 컴퓨터 알고리즘이나 산업 기술을 적용하기에는 어려운 등의 문제점이 있었다.선행기술문헌특허문헌(특허문헌 0001) 한국특허공개번호 제10-2006-0089487호 [0013]발명의 내용해결하려는 과제본 발명의 실시예는 전술한 문제점을 해결하기 위하여 창안된 것으로서, 기준치(Offset)를 흑백으로 변환된 영 [0014]상에 적용함으로써, 객체와 배경 간의 차이를 높게 함과 동시에, 움직이는 화면에서도 객체를 정확히 탐지 및파악해낼 수 있는 시각신경 회로장치 및 이를 이용한 객체 탐색 시스템, 방법을 제공하는 것을 목적으로 한다.본 발명의 실시예는, 기준치가 적용된 영상에 객체와 유사하거나 동일한 형상의 프레임을 설정하고, 영상에서 [0015]프레임과 유사하거나 동일한 객체에 대해 가중치를 부여함으로써, 노이즈나 오류가 제거되어 객체 탐지의 정확성을 극대화시킬 수 있는 시각신경 회로장치 및 이를 이용한 객체 탐색 시스템, 방법을 제공하는 것을 목적으로한다.본 발명의 실시예는, 차동 트랜스컨덕턴스 증폭기를 이용함으로써, 기준치가 적용된 입력 전압을 차동 입력으로 [0016]하고, 기준치 자체를 외부제어전압으로 설정함으로써, 1차적으로 기준치가 객체와 배경 간에 차이가 발생하도록하며, 2차적으로 프레임과 동일한 형상에 가중치를 부여하여 객체를 정확하게 탐지해낼 수 있는 시각신경 회로장치 및 이를 이용한 객체 탐색 시스템, 방법을 제공하는 것을 목적으로 한다.과제의 해결 수단상기한 바와 같은 목적을 달성하기 위하여 본 발명은 실시예들 중에서, 자극에 의한 시각피질에서의 뉴런 시간 [0017]에 따른 반응을 전압으로 구현하고, 상기 전압과 동일한 전압을 출력하는 회로를 구성한 시각신경 회로장치에있어서, 이미지나 영상 중 적어도 하나에, 상기 이미지나 영상의 배경과 탐색하고자 하는 객체를 구분하기 위한기준치(Offset)가 적용된 값을 입력으로 하는 트랜스컨덕턴스부; 상기 기준치(Offset)를 설정할 수 있는 외부제어전압 인가부; 상기 트랜스컨덕턴스부의 출력전압을 미러링(Mirroring)하여 역류를 방지하는 미러링부; 상기미러링부의 출력전압을 버퍼링하여 피드백되는 전압이 역류하지 않도록 하며, 상기 미러링부의 출력전압에 상기객체의 패턴과 동일한 프레임에 대한 입력 전압을 증폭시키는 버퍼부; 를 포함하는 시각신경 회로장치를 이용하여 과제를 해결할 수 있도록 이루어진다.일 실시예에서, 상기 트랜스컨덕턴스부는 상기 이미지나 영상의 픽셀에, 상기 기준치(Offset) 값이 상기 객체에 [0018]음(-)의 값으로 적용된 전압이 차동 입력 전압으로 인가되는 것을 특징으로 하는 시각신경 회로장치를포함한다.일 실시예에서, 상기 트랜스컨덕턴스부는 상기 이미지나 영상의 픽셀에, 상기 기준치(Offset) 값이 상기 객체에 [0019]는 음(-)의 값으로, 상기 배경에는 양(+)의 값으로 적용된 전압이 차동 입력 전압으로 인가되는 것을 특징으로하는 시각신경 회로장치를 포함한다.일 실시예에서, 상기 시각신경 회로장치는 상기 객체와 배경을 구분하기 위한 기준치가 적용된 두 개의 입력 전 [0020]압과, 상기 기준치로 설정된 상기 외부제어전압과, 일정 이득을 가지는 차동 트랜스컨덕턴스 증폭기와 등가회로로 대체가능한 것을 특징으로 하는 시각신경 회로장치를 포함한다.일 실시예에서, 상기 시각신경 회로장치는 적어도 하나 이상 병렬이나 직렬 중 적어도 하나의 조합으로 연결되 [0021]는 것을 특징으로 하는 시각신경 회로장치를 포함한다.공개특허 10-2013-0087232-7-일 실시예에서, 상기 차동 트랜스컨덕턴스 증폭기는 BJT(Bipolar Juction Transistor), JFET(Junction Field- [0022]Effect Transistor), MOSFET(Metal-Oxide Semiconductor Field-Effect Transistor), GaAs MESFET(MetalSemiconductor FET) 중 적어도 하나 또는 적어도 하나의 조합으로 구성되는 것을 특징으로 하는 시각신경 회로장치를 포함한다.실시예들 중에서, 시각신경 회로장치를 이용한 객체 탐색 시스템에 있어서,이미지나 영상 중 적어도 하나에서, [0023]상기 이미지나 영상의 객체를 탐색하기 위해 입력 영상을 흑백 영상으로 변환하는 변환부; 상기 흑백 영상에서상기 객체와 배경을 구분하기 위한 기준치(Offset)를 적용하는 기준치 적용부; 상기 기준치가 적용된 상기 이미지나 영상에, 탐색하기 위한 상기 객체의 형상의 프레임을 이용하여, 상기 프레임과 일치하는 형상에 가중치를부여하는 가중치 적용부; 상기 기준치 및 가중치가 적용된 영상에서 상기 객체를 선별 및 탐지해내는 탐지부;를 포함하는 시각신경 회로장치를 이용한 객체 탐색 시스템을 이용하여 과제를 해결할 수 있도록 이루어진다.일 실시예에서, 상기 기준치 적용부는 상기 객체의 탐색의 오류 및 노이즈를 제거하기 위해, 상기 흑백 영상의 [0024]픽셀값에 상기 배경은 양(+)의 기준치 값을 적용하고, 상기 객체는 음(-)의 기준치 값을 적용하여 상기 객체와배경 간의 차이를 발생시키는 것을 특징으로 하는 시각신경 회로장치를 이용한 객체 탐색 시스템을 이용하여 과제를 해결할 수 있도록 이루어진다.일 실시예에서, 상기 가중치 적용부는 상기 기준치가 적용된 영상에서, 상기 객체의 형상의 프레임과 일치하는 [0025]형상에 가중치를 부여하되, 상기 기준치가 적용된 값에 상기 가중치를 곱하는 연산으로 가중치를 부여하는 것을특징으로 하는 시각신경 회로장치를 이용한 객체 탐색 시스템을 포함한다.일 실시예에서, 상기 기준치 적용부와 상기 가중치 적용부는 시각신경처리를 이용하여 각 픽셀에 기준치 [0026](Synaptic Offset)과 가중치(Synaptic Weight)를 부여하여 방향성을 가지도록 하되, 상기 방향성은 적어도 하나의 수와 방향으로 확장가능한 것을 특징으로 하는 시각신경 회로장치를 이용한 객체 탐색 시스템을 포함한다.실시예들 중에서, 시각신경 회로장치를 이용한 객체 탐색 방법에 있어서, 미지나 영상 중 적어도 하나를 흑백 [0027]영상으로 변환하는 제1 단계; 상기 이미지나 영상의 객체와 배경을 구분하기 위한 기준치(Offset)를, 탐색하고자 하는 패턴의 형상의 객체에 적용하되, 상기 배경에는 상기 기준치를 적용하지 않는 제2 단계; 상기 객체의형상과 일치하는 프레임에 가중치를 두어, 상기 기준치가 적용된 영상에 상기 객체가 가중치를 얻을 수 있도록가중치를 부여하는 제3 단계; 상기 기준치 및 가중치로 강조된 영역인 탐색하고자하는 객체를 탐지하는 제4 단계; 를 포함하는 시각신경 회로장치를 이용한 객체 탐색 방법을 이용하여 과제를 해결할 수 있도록 이루어진다.발명의 효과이상에서 설명한 바와 같이, 상기와 같은 구성을 갖는 본 발명의 개시된 기술은 1차적으로 기준치가 객체와 배 [0028]경 간에 차이가 발생하도록 차동 트랜스컨덕턴스 증폭기의 입력 전압을 인가하며, 2차적으로 객체와 동일한 프레임을 설정하고, 프레임과 동일한 형상에 가중치를 부여하여 객체 탐지의 오류율을 0%에 근접하게 만들 수 있으며, 객체 탐지의 오류로 인해 발생할 수 있는 사고를 미연에 방지할 수 있고, 탐지 오류로 인한 유지 보수 비용, 시간과 인력 채용 등의 비용을 최소한으로 낮출 수 있으며, 오류로 인해 오작동하는 기기 및 프로그램에 대한 불신을 완벽히 해소할 수 있어 제조사, 더 나아가 이 제품을 채용하는 각종 회사의 이미지까지 쇄신할 수 있는 등의 효과를 거둘 수 있다.도면의 간단한 설명도 1은 종래 기술에 따른 확률 신경회로망 이론을 적용한 영상보상장치의 개략도이다. [0029]도 2는 방향성을 갖는 빛을 고양이의 눈에 비추었을 때, 고양이의 대뇌피질 반응을 나타낸 도면이다.도 3은 자극에 대한 뉴런의 시간에 따른 반응을 전압대비 트랜스컨덕턴스로 표현한 도면이다.도 4는 본 발명의 트랜스컨덕턴스 신경회로의 기본 구성도 및 이를 구현하기 위한 설계도, VLSI로 구현된 소자의 실시예이다.도 5는 본 발명에 따른 시각신경 회로장치를 설명하는 회로도이다.공개특허 10-2013-0087232-8-도 6은 본 발명에 따른 시각신경 회로장치의 다른 예를 도시한 도이다.도 7의 상부 도면은 인위적인 시각피질에서의 수직방향 가중치 프레임의 예를 나타낸 도면이고, 하부 도면은 다양한 자극에 대한 시각피질의 반응을 나타낸 도면이다.도 8은 가중치 프레임을 적용하여 오토바이 탑승자를 인식하는 실시예이다.도 9는 가중치 프레임을 방향성 신호에 적용하여 에어백 작동 감지를 인식하는 실시예이다.도 10은 가중치의 단순 적용에 따른 대응한계상황을 나타내는 도면이다.도 11은 본 발명에 따른 시각신경 회로장치를 이용한 객체 탐색 시스템을 도시한 블록도이다.도 12는 본 발명에 따른 시각신경 회로장치의 원리도이다.도 13은 본 발명에 따른 시각신경 회로장치에 기준치를 적용한 실시예이다.도 14는 본 발명에 따른 기준치 적용을 포함한 운전석 안전벨트 감지용 가중치 프레임의 실시예이다.도 15는 도 14의 프레임으로 전방 탑승자의 안전벨트 착용감지 실시예를 나타낸 도면이다.도 16은 본 발명에 따른 시각신경 회로장치를 이용한 객체 탐색 방법을 도시한 흐름도이다.도 17은 본 발명에 따른 시각신경 회로장치를 이용한 객체 탐색 방법으로 보행자를 탐색한 실시예이다.발명을 실시하기 위한 구체적인 내용이하, 첨부된 도면을 참조하여 본 발명의 실시예를 상세하게 설명한다. 이하의 설명에 있어서, 당업자에게 주지 [0030]저명한 기술에 대해서는 그 상세한 설명을 생략할 수 있다.또한, 본 발명의 구성 요소를 설명하는 데 있어서, 동일한 명칭의 구성 요소에 대하여 도면에 따라 다른 참조부 [0031]호를 부여할 수도 있으며, 서로 다른 도면임에도 불구하고 동일한 참조부호를 부여할 수도 있다. 그러나, 이와같은 경우라 하더라도 해당 구성 요소가 실시예에 따라 서로 다른 기능을 갖는다는 것을 의미하거나, 서로 다른실시예에서 동일한 기능을 갖는다는 것을 의미하는 것은 아니며, 각각의 구성 요소의 기능은 해당 실시예에서의각각의 구성요소에 대한 설명에 기초하여 판단하여야 할 것이다.또한, 본 발명의 실시예를 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 요지 [0032]를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략할 수 있다.또한, 본 발명의 구성 요소를 설명하는 데 있어서, 제 1, 제 2, A, B, (a), (b) 등의 용어를 사용할 수 있다. [0033]이러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소의 본질이나 차례 또는 순서 등이 한정되지 않는다. 어떤 구성 요소가 다른 구성요소에 \"연결\", \"결합\" 또는 \"접속\"된다고 기재된 경우, 그 구성 요소는 그 다른 구성요소에 직접적으로 연결되거나 접속될 수 있지만, 각 구성 요소 사이에 또 다른 구성 요소가 \"연결\", \"결합\" 또는 \"접속\"될 수도 있다고 이해되어야 할 것이다.단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한 복수의 표현을 포함하는 것으로 이해되어야 하고, \"포함 [0034]하다\"또는 \"가지다\" 등의 용어는 설시된 특징, 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이존재함을 지정하려는 것이며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다.각 단계들에 있어 식별부호(예를 들어, a, b, c 등)는 설명의 편의를 위하여 사용되는 것으로 식별부호는 각 단 [0035]계들의 순서를 설명하는 것이 아니며, 각 단계들은 문맥상 명백하게 특정 순서를 기재하더라도 명기된 순서와다르게 일어날 수 있다. 즉, 각 단계들은 명기된 순서와 동일하게 일어날 수도 있고 실질적으로 동시에 수행될수도 있으며 반대의 순서대로 수행될 수도 있다.이하, 본 발명에 따른 실시예를 첨부된 예시도면을 참고로 하여 상세하게 설명한다. [0036]도 2는 방향성을 갖는 빛을 고양이의 눈에 비추었을 때, 고양이의 대뇌피질 반응을 나타낸 도면이다. [0037]Hodgkin-Huxley 형식론의 뉴런, 및 Hubel과 Wiesel의 시각피질 실험에 따르면, 방향성을 갖는 빛을 고양이의 눈 [0038]공개특허 10-2013-0087232-9-에 비추었을 때, 고양이 대뇌 피질의 뉴런은 특정 방향성을 가지며 특정 방향의 자극에만 반응한다. 도 2에서좌측 도면은 빛의 모양 또는 방향을 나타내며, 우측 도면은 빛의 모양 또는 방향에 따른 반응의 크기를 나타낸다. 따라서, 뇌는 독립적으로 특정 방향성에 자극하는 뉴런들의 집합체로 볼 수 있다.비록, 시각피질의 명확한 모델은 없지만, Hubel 및 Wiesel의 고양이의 선모양 피질에 대한 연구는 간단한 세포 [0039]의 기능으로 개념을 확립했다. 이러한 발견은 형질(Character)부터 복잡한 자연계의 이미지까지 사물인식에 대한 다양한 이론들을 발생시켰다.이러한 신경생리학에 대한 연구는 생물학적으로 그럴듯한 전기적 실행의 원리들을 소개하였다. 전기적 실행의 [0040]하나는 본 발명의 실시예에서 이용되는 Hodgkin 및 Huxley의 뉴런 모델이며, 제안된 생체근원 시각을 전기적으로 처리하는 실행 가능성을 보여준다. 본 발명의 실시예 또한 도 2에 도시한 바와 같은 Hubel 및 Wiesel에 의한간단한 세포의 실험결과로부터 발견되었다. 본 발명의 실시예는 간단한 시각세포를 모방함으로써, 시각피질에유사한 정확성을 얻을 수 있다.도 3은 자극에 대한 뉴런의 시간에 따른 반응을 전압과 트랜스컨덕턴스로 표현한 도면이다. 즉, 시각피질에 자 [0041]극을 가하고, 그에 따른 뉴런의 시간에 따른 반응을 측정하여 전압-트랜스컨덕턴스(Vm-g)로 표현할 수 있다.트랜스컨덕턴스(Transconductance)란, 트랜스어드미턴스의 실수보로, FET의 게이트 전극과 드레인 전극 사이의 [0042]트랜스컨덕턴스인 경우에는, 게이트 전압 Eg, 드래인 전류 ID 사이의 관계를 주는 곡선의 경사로서, gm＝∂ID/∂Eg (ED는 일정)로 주어지며, 상호 컨덕턴스라고도 한다.Hodgkin-Huxley(H-H)는 도 3에 도시한 바와 같이 뉴런을 생체 물리학적으로 특징화하는데 광범위하게 사용될 수 [0043]있다. H-H 형식론은 특별한 이점을 주지는 않지만, 비동기 자극에 대한 개념은 신경망 컴퓨팅 시스템 또는 신경망 개념의 주요 요소로 광범위하게 사용된다.도 4는 본 발명에 따른 트랜스컨덕턴스 신경회로의 기본 구성도 및 이를 구현한 VLSI 설계도, 제작 소자를 도시 [0044]한 도이다.도 4를 참조하면, (a)는 트랜스컨덕턴스 신경회로를 I로 표현한 도이고, (b)는 트랜스컨덕턴스 신경회로를 V로 [0045]표현한 도, VLSI 설계도, 제작 소자를 도시한 도이다.(a)와 (b)의 회로는 한 쌍의 NMOS(N Metal Oxide Semiconductor) 트랜지스터 M1 및 M2에 의해 전압이 제어된 [0046]선형 컨덕턴스 회로로 제안되었으며, MOS 트랜지스터의 컨덕턴스는 아날로그 회로 설계에서 필수적인 구성요소중 하나이고, 이러한 회로는 실행 시넵스로부터 뉴런에 이르기까지 다양한 신경망에 응용될 수 있다.(a)를 참조하면, I는 하기 수학식 1에 의해 산출될 수 있다. [0047]수학식 1[0048][0049][0050]따라서, (b)를 참조하면, VBIAS는 PMOS(P Metal Oxide Semiconductor)과 같은 M3에 의해, 다이오드와 같은 구 [0051]동을 하도록 바이어스값을 가지며 이루어진다.공개특허 10-2013-0087232-10-도 5는 본 발명에 따른 시각신경 회로장치를 도시한 도이다. 도 5를 참조하면, 도 3의 자극에 대한 뉴런의 시간 [0052]에 따른 특정 반응과 동일한 전압을 출력하는 회로 구성의 예를 나타낸다.자극에 대한 뉴런의 시간에 따른 반응과 동일한 전압을 출력하는 회로를 구성할 때, 생물 세포의 특성을 반영할 [0053]수 있다. 여기서, 하나의 회로는 하나의 뉴런에 대응한다. 따라서, 본 회로를 수개 병렬 연결하여 칩을 만드는경우, 뇌와 유사한 기능을 할 수 있다. 다만, 모든 뉴런의 전압 특성에 맞추어 변형하여야 하며, 또한 각각의뉴런의 연결 특성을 고려하여야 한다.시각신경 회로장치(100)는 자극에 의한 시각피질에서의 뉴런의 시간에 따른 반응을 전압으로 표현하며, 표현된 [0054]전압과 동일한 전압을 출력하되, 두뇌 신경망처럼 뉴런과 뉴런, 또는 뉴런과 센서를 가중치를 가진 연결고리로시각신경회로를 구성한다.이를 위해, 본 발명에 따른 시각신경 회로장치(100)는 트랜스컨덕턴스부(110), 외부제어전압 인가부(120), 미러 [0055]링부(130), 버퍼부(140)를 포함한다.트랜스컨덕턴스부(110)는 생물신경세포의 활동상태(Action Potential)과 세포막 이온별 선택적 트랜스컨덕턴스 [0056]특성을 반영하여 모방 구현하며, 외부제어전압 인가부(120)는 트랜스컨덕턴스의 산출전류를 추가로 프로그램가능하도록 트랜스컨덕턴스부(110)에 전압을 인가시키도록 구성된다.미러링부(130)는 트랜스컨덕턴스부(110)의 출력 전류를 복제하고, 트랜스컨덕턴스부(110)의 출력 전압을 미러링 [0057](Mirroring)하여 역류를 방지하며, 버퍼부(140)는 출력단에서 피드백되는 출력전압을 버퍼링(Buffering)하여 전압 역류를 방지한다.도 6은 본 발명에 따른 시각신경 회로장치의 다른 예를 도시한 도이다. 도 6의 회로에서 상부와 하부는 각각 도 [0058]3의 Leakage part, Na(나트륨 이온)(또는 K(칼륨 이온)) part에 대응하며, 각각의 Part를 병렬로 추가 연결하여N 개의 파트로 확장할 수도 있다. 트랜스컨덕턴스부(③)와 미러링부(④)는 상기 도 5와 같다.① 부분은 버퍼부를 나타낸다. 버퍼부는 회로의 출력단에서 피드백되는 전압이 역류하지 않도록 버퍼링하며, 입 [0059]력 전압을 증폭하는 부분이다. ② 부분은 지연부를 나타낸다. 도 3에서 특정 라인에 지연 응답이 나타나는 것과같은 효과가 나오도록 입력을 지연시키는 역할을 한다. 지연 시간은 파라미터 설정에 따라 조정이 가능하다.도 6의 시각신경 회로장치는 전압방출부(⑤)를 더 포함할 수 있는데, 도 3의 그래프 그래프에서 피크(peak) 응 [0060]답(스파이크 발생부) 후 전압 응답이 떨어지는 현상이 발생하는 것과 같이 전압을 방출하는 역할을 한다. 따라서, 피크 응답이 발생한 후 도 6의 회로에 다시 전압이 입력되더라도 일정 시간이 지나야지만 다시 피크 응답이발생할 수 있다. 이것은 세포의 휴지기와 같은 효과를 발생시키기 위한 것이다. 즉, 스파이크 발생 후 휴지기에는 외부로부터 자극이 와도 반응이 없다.본 발명에 따른 시각신경 회로장치는 쉐이핑(Shaping)부(⑥)를 더 포함할 수 있는데, 즉 쉐이핑부는 입력 파형 [0061]을 쉐이핑하여 출력하는 역할을 하며, 펄스와 같은 형상으로 나타날 수 있도록 한다. 일 실시예에서, 도 5의 시각신경 회로장치(100)는 전압방출부, 쉐이핑부를 더 구비할 수 있다.컨덕턴스 요소의 경험적인 수학형식은 수학식 2와 같이 표현되며, 여기서 b는 막피(Membrane) 포텐셜의 S자 결 [0062]장(Sigmoid) 함수이다. 그리고 Vm은 막피 포텐셜이며, 전체적으로 능동 포텐셜 및 관련된 이온의 전도로 동적으로 모델화될 수 있다.수학식 2[0063][0064]공개특허 10-2013-0087232-11-[0065]수학식 2의 함수적 구성은 컨덕턴스, 곱셈, 덧셈(또는 뺄셈), 및 미분방정식에 의해 제어된다. 수학식 2에서 미 [0066]분방정식은 LPF(Low Pass Filter)에 의해 실행될 수 있으며, 지연된 응답을 야기한다. 이러한 관계식으로부터생물학적 뉴런의 동적 활동이 도 5에 나타낸 바와 같은 막피 포텐셜에 의해 제어된 이온 기반의 컨덕턴스로 전기적으로 실행될 수 있다.도 7의 상부도면은 인위적인 시각피질에서의 수직방향 가중치 프레임의 예를 나타낸 도면이다. 도 2에 나타난 [0067]바와 같이 오리엔테이션 선택성의 조율 속성(Tuning Propertes)이 시각피질에서의 지각력에 대한 키 역할을 하는 것으로 여겨지기 때문에 본 발명은 각각 다른 오리엔테이션 입력을 사용하였다. 도 6에 나타낸 바와 같이, 5x 5시넵스의 가중치로 조율된 피처 맵(feature map)은 간단한 세포의 오리엔테이션 선택성 속성을 모방하기 위해 부가조정으로 매칭될 수 있다. 시넵스의 가중치는 블랙: 그레이: 화이트 각각에 대해 1:-0.6:0.1의비율이다. 즉, 중앙의 검은 부분 픽셀의 가중치가 1이며, 회색부분 픽셀의 가중치는 -0.6이고, 백색부분 픽셀의가중치는 0.1이다. 해당 가중치는 Hubel 및 Wiesel의 실험에서 고양이에게 주는 자극과 같은 효과를 준다. 픽셀의 크기와 가중치의 크기는 기재된 크기에 한정되는 것은 아니며, 설정에 따라 달라질 수 있다. 또한, 피처 맵을 입력 영상 전체에 대해 가중하여 뉴런 회로에 입력할 수 있다.도 7의 하부도면은 다양한 자극에 대한 시각피질의 반응을 나타낸 도면이다. 모의실험의 결과는 도 7의 하부에 [0068]도시한 바와 같으며, 조율된 피처 오리엔테이션은 도 2에서 나타낸 Hubel 및 Wiesel의 실험의 결과와 일치하는결과를 나타내는 것으로 평가된다.본 발명의 실시예에서, 시각피질의 신경변화 실행의 요소는 전기적으로 프로그램화할 수 있는 MOSFET(Metal [0069]Oxide Semiconductor Field Effect Transistor)에기초하여 구현될 수 있다. 그러나, 본 발명은 MOSFET 외에 다른 종류의 트랜지스터의 사용을 배제하는 것은 아니다.결과적으로, 도 7의 원리로 뉴런과 연결고리는 구성하는 회로 구성이 생성될 수 있다. [0070]도 8은 가중치 프레임을 적용하여 오토바이 탑승자를 인식하는 실시예이다. 도 8에 도시된 바와 같이, 신경변화 [0071]시각신호 처리의 가능성은 버스로부터 카메라를 이용하여 촬영된 이미지 시퀀스로부터 보행자를 검출하는데 적용될 수 있다. 보행자의 환경은 차량이 움직인 후 각각의 행인들 사이에 크게 다를 수 있다. 따라서, 정확한 검출 알고리즘이 이와 같이 빠르게 변화되는 환경하에서 정확하게 실행될 필요가 있다.비교적 고정된 특정 객체를 인식하는 것은, (a)와 같이 사람의 머리와 상체가 가지는 특성 가중치 프레임을 도 [0072]로상 영상에 적용하면, (b)와 같이 후면에서도 오토바이의 탑승자가 감지되는 검색 기능을 가진다.도 9는 가중치 프레임을 방향성 신호에 적용하여 에어백 작동 감지를 인식하는 실시예이다. 도 9에 도시된 바와 [0073]같이, 객체감지를 위한 가중치 프레임을 에어백으로 적용하면, 차랑 내 탑승자 감시 영상에서 에어백 작동을 감시할 수 있다.비교적 고정된 환경에서의 변화 상태, 예를 들면, 도로의 보행자, 오토바이, 차량, 또는 실내의 출입자의 움직 [0074]임과 차량 실내의 탑승자의 움직임, 에어백 작동 등은 변화의 폭이 작은 배경을 활용하는 전후 이미지 시퀀스를고려할 수 있고, 이처럼 가중치 프레임은 감지하고자 하는 객체의 형상에 따라 달라질 수 있다.도 10은 가중치의 단순 적용에 따른 대응한계상황을 나타내는 도면이다. 도 10에 도시된 바와 같이, 객체 자체 [0075]가 고정된 상황이고, 객체가 계속적으로 변화하며, 조명 여건의 변동도 큰 경우에는, 이미지 시퀀스의 영상 차이를 이용하기에는 제한적일 수밖에 없다.공개특허 10-2013-0087232-12-즉, 도 8의 (a)와 같은 객체 가중치 프레임은 움직이는 또는 변화하는 사람 객체 감지에 효율적이나, 다양한 배 [0076]경이 존재하는 경우에는, 단일 영상만으로 처리되는 흑백 영상 자체는 모두 양(Positive)의 값을 가지게되므로, 도 8의 (b)와 같은 정지처리 영상은 감지 결과가 다르게 나타날 수 있다.예를 들면, 도 10의 (a)를 보면, 처리 후 흑백 영상과 같이 객제 감지용 가중치 프레임을 정지처리 영상에 단순 [0077]적용하면, 사실과 다른 결과가 감지될 수 있다.즉, 감지하고자 하는 객체와 유사한 패턴의 다른 객체가 노이즈(Noise)로 감지될 수 있는 것이다. [0078]따라서, 상기와 같은 문제를 해결하기 위한 본 발명은, 처리된 흑백 영상의 가중치 프레임을 적용할 때, 객체를 [0079]중심으로 기준치를 적용하여 선별력을 높이도록 설계되며, 이는 도 11을 참조하여 설명한다.도 11은 본 발명에 따른 시각신경 회로장치를 이용한 객체 탐색 시스템을 도시한 블록도이다. 도 11에 도시된 [0080]바와 같이, 본 발명에 따른 시각신경 회로장치를 이용한 객체 탐색 시스템(1)은 변환부(10), 기준치 적용부(30), 가중치 적용부(50), 탐지부(90)를 포함한다.변환부(10)는 입력된 이미지 영상을 흑백 영상으로 변환시키며, 기준치 적용부(30)는 변환부에 의해 변환된 처 [0081]리 흑백영상의 픽셀에 기준치(Offset)를 적용하도록 구비되며, 가중치 적용부(50)의 가중치 적용방법은 전술한방법으로 실행될 수 있고, 이는 중복되므로 생략하기로 한다.탐지부(90)는 시각신경 뉴런 회로에 가중치가 적용된 값을 입력하며, 시각신경회로를 통해 강조된 영역을 탐지 [0082]할 수 있고, 이때, 가중치 적용부(50)에 의해 가중치가 적용된 흑백 영상에 대해 수직방향 가중치 프레임과 같은 방법으로, 탐지하고자 하는 객체와 유사한 형상의 프레임을 가중할 수도 있다.도 12는 본 발명에 따른 시각신경 회로장치의 원리도이다. 도 12에 도시된 바와 같이, 일정 길이(W: Width)에 [0083]대해 양(+)과 음(-)의 기준치(k: Offset)를 적용할 수 있다.즉, 가중치를 적용하기 전에, 탐지하고자 하는 객체의 배경이 되는 픽셀값에는 +k 의 기준치(Offest)를 적용하 [0084]고, 탐지하고자 하는 객체에는 -k 의 기준치(Offset)를 적용하여, 흑백이 된 영상에 탐지하려는 객체를 부각시킬 수 있는 것이다.이는, 본 발명의 출원인이 출원한 시각신경 회로장치 및 그 시각신경 회로장치를 이용한 객체탐색방법보다 강화 [0085]된 탐지방법이며, 이를 통해 배경이 계속적으로 변화하는 상황에서도 객체를 가중치 프레임에서 발생했던 노이즈가 없이 탐색할 수 있는 것이다.예를 들면, 배경은 + 값을 적용하고, 객체인 패턴은 - 값을 가지도록 흑백영상에 기준치 값을 적용하며, 가중치 [0086]프레임이 적용될 흑백영상 가운데 배경에 대응되는 영역은 픽셀값이 기준치를 더하고, 객체에 대응되는 영역은픽셀값에서 기준치를 뺀 후, 가중치 프레임을 적용한다.배경이 탐색하고자 하는 패턴에 비해 상대적으로 높은 값을 가지게 되므로, 즉, 배경에 + 값을 적용하고, 탐색 [0087]하고자 하는 패턴에 - 값을 적용하여 그 둘의 차이는 더욱 벌어지게 되므로, 배경과 패턴인 객체의 차이로 인해선별력이 높아질 수 밖에 없는 것이다.기준치 값은 영상과 패턴 등의 종류에 따라 달라질 수 있는데, 예를 들면, 기준치 값은 흑백 영상의 각 픽셀값 [0088]의 평균으로 정할 수도 있다.따라서, 이상적인(Ideal) 알고리즘 상에서만 아니라, 인간이나 동물의 시각과 같은 정확성을 가지면서도, 계속 [0089]적으로 변화하는 영상에서도 가중치 프레임을 적용하기 전에 기준치(Offset)를 적용하여 노이즈 및 오류가 없도록 정확하게 객체를 탐색해낼 수 있다.도 13은 본 발명에 따른 시각신경 회로장치에 기준치를 적용한 실시예이다. 도 13에 도시된 바와 같이, 트랜스 [0090]컨덕턴스 신경회로에 기준치인 k 값을 변동시키면서, VLSI를 프로그램할 수 있다.트랜스컨덕턴스의 입력값(Vin+, Vin-)이 각각 양의 값과 음의 값인 기준치가 되는 경우, 흑백 영상에서 배경과 [0091]패턴이 정확히 선별될 수 있다.공개특허 10-2013-0087232-13-즉, k값은 도 5를 참조하면, 외부제어전압인가부(120)의 vc값으로, 외부제어전압은 변동이 가능한 값이고, 이러 [0092]한 기준치가 설정된 경우, 차동 트랜스컨덕턴스 증폭기인 시각신경 회로장치의 입력전압 Vin+, Vin-의 값의 차가 커지게 되고, 그 차이만큼 증폭되어 출력되므로, 객체와 배경의 구분은 더욱 커질 수 있으며, 흑백영상에서배경과 패턴이 정확히 선별될 수 있다.차동 트랜스컨덕턴스 증폭기는 BJT(Bipolar Juction Transistor), JFET(Junction Field-Effect Transistor), [0093]MOSFET(Metal-Oxide Semiconductor Field-Effect Transistor), GaAs MESFET(Metal Semiconductor FET) 중 적어도 하나 또는 적어도 하나의 조합으로 구성될 수 있다.FET으로 실현한 차동 증폭기는 매우 작은 입력 바이어스 전류와 매우 높은 입력 저항의 장점을 제공하며, BJT로 [0094]실현한 차동 증폭기는 FET으로 실현한 것보다 작은 입력 옵셋 전압과 넓은 대역폭을 제공하며, GaAs는 가장 넓은 대역폭을 제공하는데, 구현될 객체탐색의 특성에 따라 다양하게 설정가능하며, 이에 한정되지 않음은 자명하다 할 것이다.이러한 차동 트랜스컨덕턴스 증폭기는 병렬 또는 직렬로 적어도 하나 이상 연결될 수 있으며, 이는 다양하게 변 [0095]경 및 변형이 가능함은 자명하다 할 것이다.도 14는 본 발명에 따른 기준치 적용을 포함한 운전석 안전벨트 감지용 가중치 프레임의 실시예이다. 도 14에 [0096]도시된 바와 같이, F는 객체이고, B는 배경이라고 할 때, 객체에 적용되는 기준치 및 가중치와, 배경에 적용되는 가중치는 하기 수학식 3과 같다.수학식 3[0097][0098]상기 수학식 3을 보면 알 수 있듯이, 배경(B)에는 입력값(input)에 가중치(weight)만 적용이 되었지만, 탐지 및 [0099]탐색하고자 하는 패턴인 객체(F)에는 입력값(input)에 가중치를 곱하기 전에, 오프셋(offset)값을 뺀 것을 알수 있다.여기서, 배경(B)에도 하기 수학식 4와 같이 오프셋 값을 더하여 그 차이를 더욱 넓게 할 수도 있다. [0100]수학식 4[0101][0102]도 15는 도 14의 프레임으로 전방 탑승자의 안전벨트 착용감지 실시예를 나타낸 도면이다. 도 15에 도시된 바와 [0103]같이, 입력영상 및 흑백영상으로부터 기준치(Offset) 적용되어 객체를 탐색한 실시예를 볼 수 있다.즉, 도 14의 안전벨트 프레임의 객체(F)에 기준치를 빼고 가중치를 곱했고, 배경(B)에는 가중치를 곱하거나, 기 [0104]준치를 더하여 가중치를 곱했으므로, 그 차이는 더욱 벌어지게 되고, 좌측의 입력영상이 우측의 입력영상과 같공개특허 10-2013-0087232-14-이 변환되어, 객체인 안전벨트가 흰색으로 탐지된 것을 볼 수 있다.따라서, 조수석 안전벨트 가중치 프레임을 통해 전방 탑승자 모두, 즉 운전석과 조수석의 안전벨트 착용이 모두 [0105]감지된 것을 알 수 있고, 이러한 간단한 프레임과 기준치 적용만으로도 구현성 및 정확성이 높은 객체탐색을 실현할 수 있게 된다.도 16은 본 발명에 따른 시각신경 회로장치를 이용한 객체 탐색 방법을 도시한 흐름도이다. 도 16에 도시된 바 [0106]와 같이, 본 발명에 따른 시각신경 회로장치를 이용한 객체 탐색 방법은 입력된 영상을 흑백 영상으로 변환하면서 시작한다(S10).흑백 영상의 픽셀에 가중치를 부여하는 단계는 하기의 단계(S20, S30)로 이루어진다. [0107]즉, 흑백 영상의 픽셀값에 객체와 배경이 구분될 수 있도록 기준치(Offset)값을 적용한 후(S20), 객체의 형상과 [0108]같은 프레임으로 객체를 탐지할 수 있도록, 탐지하고자 객체 특성 형상 프레임을 출력 영상에 가중치를 적용한다(S30).변환된 흑백영상에 대해, 도 6과 같은 시각신경처리를 모방하도록, 각 픽셀에 가중치(Synaptic Weight)를 부여 [0109]하여 방향성을 갖도록 할 수 있고, 가중치는 변환된 흑백 영상과 가중치 프레임을 곱하는 연산을 통해 부여될수 있다.즉, 변환된 흑백영상에서 그레이 이미지에 방향성을 가져서 시각신경 회로장치에 입력될 수 있도록, 픽셀에 가 [0110]중치를 부여할 수 있다.또한, 가중치 방향은 설정에 따라 다양한 수로 확장될 수 있는데, 이때 가중치가 적용된 흑백 영상이 시각신경 [0111]회로에 입력될 수 있도록, 탐지하고자 하는 개체와 유사한 형상의 프레임을 출력 영상에 가중할 수 있다.이러한 과정은 수직방향 가중치의 프레임에서 중간의 검은 부분에는 가중치 1을 부여하고, 회색 부분은 가중치 [0112]-0.6을 부여하며, 백색 부분은 가중치 0.1을 부여함으로써 수행될 수 있으며, 이러한 수치는 예시일 뿐, 다양한방법으로 가중치가 부여될 수 있음은 자명하다 할 것이다.이때, 가중치가 적용된 이미지를 시각신경회로에 입력하면, 오리엔테이션 특색들이 추출될 수 있으며, 이 경우, [0113]추출될 다른 오리엔테이션 각들의 수는 추출될 타입에 따라 다를 수 있다.예를 들면, 차량 또는 인조물의 많은 일직선은 에지(Edges)를 갖는 경향이 있는 반면, 보행자와 같은 생물학적 [0114]대상체는 오리엔테이션 피처 추출물에 이용되는 것보다 미리 규정된 특징들이 많지 않다.여기서, 프레임은 보행자를 찾기 위한 프레임으로, 인간의 상체와 유사한 형상으로 선택될 수 있고, 도로에 위 [0115]치한 인간을 찾기 위한 프레임의 경우, 프레임보다 위/아래로 확장된 프레임이 될 수 있다.따라서, 기준치가 적용된 개체 특성 프레임을 적용하기 위해서는, 처리 영상의 기준치 변환을 적용하고, 탐지하 [0116]고자 하는 객체의 특성 형상을 가중 처리하여 출력 영상으로 생성할 수 있다.마지막으로, 강조된 영역을 탐지하게 되면, 입력 영상에서 탐색하고자 하는 영역을 높은 정확도를 가지고 선별 [0117]해낼 수 있게 된다(S40).도 17은 본 발명에 따른 시각신경 회로장치를 이용한 객체 탐색 방법으로 보행자를 탐색한 실시예이다. 도 17에 [0118]도시된 바와 같이, 머리와 상체(Torso)로 객체의 특성 가중치를 사용하며, 정지 영상 단위 분석으로 시각회로장치 또는 객체 감지 시스템 등을 적용함에 따라 복잡한 배경이 있는 이미지에도 적용할 수 있다.즉, 차량이 이동함에 따라 차량에서 촬영하는 이미지의 배경은 계속적으로 변하게 되고, 초당 프레임 수는 차량 [0119]의 속도에 따라 증가하므로, 배경의 영향을 감소시키기 위한 이미지 시퀀스와 같은 경우에는 제한이 발생한다.따라서, 기준치 적용을 처리된 흑백영상에 적용하고, 강조된 영역을 탐지하면, 예상 불가능한 조명의 급변 상황 [0120]과 제한적인 정지 영상에서도 보행자를 감지할 수 있게 된다.시각신경회로를 통한 특정 객체 이미지는, 인간의 상체 토르소(Upper Torso)의 형판을 사용할 수 있는데, 간단 [0121]한 트레이닝의 수단으로 시각신경 회로에서 형판을 사용하는 것이며, 이는 인간의 다른 신체부위, 예를 들면,얼굴이나 다리를 사용할 수도 있다.공개특허 10-2013-0087232-15-또한, 입력되는 영상에서 보여지는 모든 보행자를 검색할 필요는 없으며, 카메라에 근접한 보행자부터 일정 범 [0122]위의 수의 보행자만 검색하도록 구현될 수도 있다.보행자 검출의 응용을 위해, 특히, 차량에 대해, 예를 들면 달리는 경로에 근접한 보행자 검색이 요구될 수도 [0123]있고, 시각으로 보이는 영역을 가로질러 움직이는 보행자를 검색할 수도 있다.생체 시각들은 이미지를 전체로 처리하기보다는, 사물에 의해 보다 경계되는 것으로 정의되는데, 이를 이용하여 [0124]생체 근원의 신경변화 시각은 시각피질의 원시적 기능을 모방함으로써, 보행자를 검출할 수 있는 방법으로 제한되었으며, 신경망 검출기를 다양한 객체 형태에 적용하는 실시예로 삽입되었다.이를 통해, 버스에서 상업적으로 이용될 수 있는 카메라에 의해 획득된 이미지, 승용차의 카 블랙박스 이미지로 [0125]부터 도로상의 보행자나 이륜차 탑승자, 차량 내 탑승자의 신변 안전 장치를 검출하는 것이 실현 가능함을 입증하였다.본 출원은 1차적으로 기준치가 객체와 배경 간에 차이가 발생하도록 차동 트랜스컨덕턴스 증폭기의 입력 전압을 [0126]인가하며, 2차적으로 객체와 동일한 프레임을 설정하고, 프레임과 동일한 형상에 가중치를 부여하여 객체 탐지의 오류율을 0%에 근접하게 만들 수 있으며, 자극에 의한 시각피질에서의 뉴런 시간에 따른 반응을 전압으로 표현하고, 표현된 전압과 동일한 전압을 출력하는 회로와 뉴런과 뉴런 사이의 연결고리(Synapse) 망의 병렬 구조체계로 인간의 시각 신경에 가장 근접한 시각신경회로를 제공할 수 있다.이와 같은 시스템을 차량에 적용하는 경우, 차량 탑승자의 안전 벨트 착용 상태 등 탑승 상황을 인식할 수 있어 [0127]사고 발생시, 신속하고 효율적인 구조 서비스를 가능케하고, 주/야간 차량 주변의 보행자를 탐지할 수 있게 됨으로써, 차량 시스템의 운행 효율을 높일 수 있으며, 이러한 시스템은 인지하고자 하는 객체에 따른 프레임을다양화하는 경우, 차량에 한정되지 않고 각종 객체를 탐지하는 장비, 시스템에 적용가능함은 자명하다 할 것이다.이상에서, 본 발명의 실시예를 구성하는 모든 구성 요소들이 하나로 결합하거나 결합하여 동작하는 것으로 기재 [0128]되어 있다고 해서, 본 발명이 반드시 이러한 실시예에 한정되는 것은 아니다. 즉, 본 발명의 목적 범위 안에서라면, 그 모든 구성 요소들이 하나 이상으로 선택적으로 결합하여 동작할 수도 있다. 또한, 그 모든 구성 요소들이 각각 하나의 독립적인 하드웨어로 구현될 수 있지만, 각 구성 요소들의 그 일부 또는 전부가 선택적으로조합되어 하나 또는 복수 개의 하드웨어에서 조합된 일부 또는 전부의 기능을 수행하는 프로그램 모듈을 갖는컴퓨터 프로그램으로서 구현될 수도 있다. 또한, 이와 같은 컴퓨터 프로그램은 USB 메모리, CD 디스크, 플래쉬메모리 등과 같은 컴퓨터가 읽을 수 있는 저장매체(Computer Readable Media)에 저장되어 컴퓨터에 의하여 읽혀지고 실행됨으로써, 본 발명의 실시예를 구현할 수 있다. 컴퓨터 프로그램의 저장매체로서는 자기 기록매체, 광기록매체, 캐리어 웨이브 매체 등이 포함될 수 있다.또한, 기술적이거나 과학적인 용어를 포함한 모든 용어들은, 상세한 설명에서 다르게 정의되지 않는 한, 본 발 [0129]명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 갖는다. 사전에 정의된 용어와 같이 일반적으로 사용되는 용어들은 관련 기술의 문맥상의 의미와 일치하는 것으로 해석되어야 하며, 본 발명에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다.이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 [0130]서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가능할 것이다. 또한, 본 발명에 개시된 실시예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하기위한 것이며, 이러한 실시예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 따라서, 본 발명의보호 범위는 청구범위에 의하여 해석되어야 하며, 그와 균등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다.부호의 설명100: 시각신경 회로장치 [0131]110: 트랜스컨덕턴스부 120: 외부제어전압 인가부공개특허 10-2013-0087232-16-130: 미러링부 140: 버퍼부1: 시각신경 회로장치를 이용한 객체 탐색 시스템10: 변환부 30: 기준치 적용부50: 가중치 적용부 90: 탐지부도면도면1공개특허 10-2013-0087232-17-도면2공개특허 10-2013-0087232-18-도면3도면4공개특허 10-2013-0087232-19-도면5공개특허 10-2013-0087232-20-도면6공개특허 10-2013-0087232-21-도면7공개특허 10-2013-0087232-22-도면8공개특허 10-2013-0087232-23-도면9도면10공개특허 10-2013-0087232-24-도면11도면12공개특허 10-2013-0087232-25-도면13도면14공개특허 10-2013-0087232-26-도면15도면16공개특허 10-2013-0087232-27-도면17공개특허 10-2013-0087232-28-"}
{"patent_id": "10-2012-0008372", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 시각신경 회로장치 및 이를 이용한 객체 탐색 시스템, 방법에 관한 것으로, 더욱 상세하게는 계속적으 로 배경이 변화하는 환경에서도, 높은 정확도를 가지고 객체를 선별할 수 있는 시각신경 회로장치 및 이를 이용 한 객체 탐색 시스템, 방법을 제공하기 위한 것이다. 그 기술적 구성은 자극에 의한 시각피질에서의 뉴런 시간에 따른 반응을 전압으로 구현하고, 상기 전압과 동일한 전압을 출력하는 회로를 구성한 시각신경 회로장치에 있어서, 이미지나 영상 중 적어도 하나에, 상기 이미지나 영상의 배경과 탐색하고자 하는 객체를 구분하기 위한 기준치(Offset)가 적용된 값을 입력으로 하는 트랜스컨덕 턴스부; 상기 기준치(Offset)를 설정할 수 있는 외부제어전압 인가부; 상기 트랜스컨덕턴스부의 출력전압을 미러 링(Mirroring)하여 역류를 방지하는 미러링부; 상기 미러링부의 출력전압을 버퍼링하여 피드백되는 전압이 역류 하지 않도록 하며, 상기 미러링부의 출력전압에 상기 객체의 패턴과 동일한 프레임에 대한 입력 전압을 증폭시키 는 버퍼부; 를 포함하여 이루어지는 것을 특징으로 한다."}
{"patent_id": "10-2012-0008372", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 실시예는 시각신경 회로장치 및 이를 이용한 객체 탐색 시스템, 방법에 관한 것으로, 보다 상세하게 는, 지속적으로 움직이는 배경에서도 객체를 높은 정확도로 탐지해낼 수 있는 시각신경 회로장치 및 이를 이용 한 객체 탐색 시스템, 방법에 관한 것이다."}
{"patent_id": "10-2012-0008372", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 뇌과학(Brain Science, 腦科學)은 뇌의 신비를 밝혀내서 인간의 물리적, 정신적 기능을 심층적으로 탐구하는 응용학문으로, 수학·물리학·화학·생물학 등 기초과학 분야는 물론, 의학·공학·인지과학 등을 복 합적으로 적용해 뇌의 신비를 밝히고, 이를 통해 인간이 갖는 물리적·정신적 기능성의 전반을 심층적으로 탐구 하는 응용 학문이다. 뇌의 작용원리와 의식현상에 대한 연구를 통해 인간의 정체성을 밝혀내고, 이를 통해 과학·의학·교육·산업· 문화 전반에 근본적이고 실제적인 변혁을 가져오는 것을 목표로 한다. 예를 들어, 인간의 뇌 정보 처리기능을 기계에 적용해 인간의 신경망 같은 신경회로망을 개발, 현재의 컴퓨터보 다 더 능동적인 업무를 수행할 수 있는 장치를 개발하는 등이 이에 해당한다고 할 수 있다. 신경회로망(神經回路網)은 인간의 두뇌나 신경세포의 반응과 유사하게 설계된 회로로, 인간과 같이 사고하는 능 력을 가지는 반도체 칩으로서, 많은 수의 간단한 소자를 통신으로 연결하고, 이를 통해 정보를 표현하고 기억하 도록 만들어졌다. 인간 두뇌의 신경회로인 뉴런(Neuron)의 구조를 그대로 본 뜬 것이며, 이는 인공지능 컴퓨터의 핵심기술로 음성 인식, 문자 인식, 영상 처리, 자연 언어의 이해 등의 분야에서 주로 이용되고, 선진국을 중심으로 연구가 활발 히 진행중이다. 뇌의 정보처리는 뉴런(Neuron)으로 불리우는 비교적 단순한 기능을 수행하는 개개의 세포들이 일정한 제약에 따 라 구성된 연결 망(Network)의 생리적 활성화를 통해 이루어진다. 뇌는 신체의 다른 장기와 마찬가지로 세포들 로 이루어져 있지만, 다른 장기와는 달리 세포들의 연결망이 기능을 형성하는 주요 요소이다 시스템 신경과학(System Neuroscience)은 세포 집단의 활성화의 공간적, 시간적 분포를 이해하고자 하는 신경과 학의 한 분야이며, 그 대표적인 분야가 시각 신경과학이라 할 수 있다. 시각 시스템을 구성하는 망막(Retina), 외슬체(Lateral Geniculat Body), 상구(Superior Colliculus), 시각피질(Visual Cortex)의 세포들의 입력, 출 력 연결 패턴을 이해하고, 세포들에 의한 신호의 접수, 처리, 저장, 변환 방식을 연구함으로써 생물학적 시각이 어떻게 이루어지는지를 규명하는 것이 시각 신경과학의 과제이다. 이를 위해, 한국특허공개번호 제10-2006-0089487호에는 사용자에게 보다 우수한 화질의 영상을 제공할 수 있는 기술이 개시되는데, 이는 도 1을 참조하여 설명하면, 확률 신경회로망 이론을 적용한 영상보상장치의 구성은, 현재 프레임을 구성하는 화소들 중 에러가 발생된 에러화소를 검출하는 에러화소 검출부 및 현재프레임을 학습하여 현재프레임 학습결과를 저장하고 기저장된 이전프레임 학습결과를 이용하여 검출부에 의해 검출된 에 러화소의 화소값을 추정하는 신경회로망부이다. 상기와 같은 구성에 의한 영상보상방법은, 현재프레임을 구성하는 각각의 화소에 대해, 상기 화소의 주변화소들 각각에 대한 주변화소값들의 집합인 주변화소값군과 상기 화소의 화소값을 일대일로 대응시키고, 일대일 대응관 계를 상기 현재프레임 학습결과로서 생성하는 학습단계; 생성된 상기 현재프레임 학습결과를 저장하는 저장단계; 상기 현재프레임을 구성하는 화소들 중 에러가 발생된 에러화소를 검출하는 검출단계; 및 기저장된 이전프레임 학습결과를 이용하여, 검출된 상기 에러화소의 화소값을 추정하는 추정단계;를 포함한다. 이와 같이, 최근, 생체기반의 시각(Vision) 및 시각 신경변화를 이용한 시각장치에 대한 많은 연구가 진행되고 있다. 그러나, 아직 컴퓨터상에서의 시각 알고리즘으로서의 이용에서는 효과적이기는 하지만, 실질적인 이용에 있어 그 대부분이 인간이나 동물의 시각과 같은 정확성이 결여되어 있고, 특히, 야외 조건에서 주간과 야간처럼 밝기 변화가 크고, 움직이는 차량에서 사용하는 것과 같이, 배경이 계속적으로 변화하는 사용환경에서는, 현재 수준 의 컴퓨터 알고리즘이나 산업 기술을 적용하기에는 어려운 등의 문제점이 있었다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국특허공개번호 제10-2006-0089487호"}
{"patent_id": "10-2012-0008372", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예는 전술한 문제점을 해결하기 위하여 창안된 것으로서, 기준치(Offset)를 흑백으로 변환된 영 상에 적용함으로써, 객체와 배경 간의 차이를 높게 함과 동시에, 움직이는 화면에서도 객체를 정확히 탐지 및 파악해낼 수 있는 시각신경 회로장치 및 이를 이용한 객체 탐색 시스템, 방법을 제공하는 것을 목적으로 한다. 본 발명의 실시예는, 기준치가 적용된 영상에 객체와 유사하거나 동일한 형상의 프레임을 설정하고, 영상에서 프레임과 유사하거나 동일한 객체에 대해 가중치를 부여함으로써, 노이즈나 오류가 제거되어 객체 탐지의 정확 성을 극대화시킬 수 있는 시각신경 회로장치 및 이를 이용한 객체 탐색 시스템, 방법을 제공하는 것을 목적으로 한다. 본 발명의 실시예는, 차동 트랜스컨덕턴스 증폭기를 이용함으로써, 기준치가 적용된 입력 전압을 차동 입력으로 하고, 기준치 자체를 외부제어전압으로 설정함으로써, 1차적으로 기준치가 객체와 배경 간에 차이가 발생하도록 하며, 2차적으로 프레임과 동일한 형상에 가중치를 부여하여 객체를 정확하게 탐지해낼 수 있는 시각신경 회로 장치 및 이를 이용한 객체 탐색 시스템, 방법을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2012-0008372", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 목적을 달성하기 위하여 본 발명은 실시예들 중에서, 자극에 의한 시각피질에서의 뉴런 시간 에 따른 반응을 전압으로 구현하고, 상기 전압과 동일한 전압을 출력하는 회로를 구성한 시각신경 회로장치에 있어서, 이미지나 영상 중 적어도 하나에, 상기 이미지나 영상의 배경과 탐색하고자 하는 객체를 구분하기 위한 기준치(Offset)가 적용된 값을 입력으로 하는 트랜스컨덕턴스부; 상기 기준치(Offset)를 설정할 수 있는 외부제 어전압 인가부; 상기 트랜스컨덕턴스부의 출력전압을 미러링(Mirroring)하여 역류를 방지하는 미러링부; 상기 미러링부의 출력전압을 버퍼링하여 피드백되는 전압이 역류하지 않도록 하며, 상기 미러링부의 출력전압에 상기 객체의 패턴과 동일한 프레임에 대한 입력 전압을 증폭시키는 버퍼부; 를 포함하는 시각신경 회로장치를 이용하 여 과제를 해결할 수 있도록 이루어진다. 일 실시예에서, 상기 트랜스컨덕턴스부는 상기 이미지나 영상의 픽셀에, 상기 기준치(Offset) 값이 상기 객체에 음(-)의 값으로 적용된 전압이 차동 입력 전압으로 인가되는 것을 특징으로 하는 시각신경 회로장치를 포함한다. 일 실시예에서, 상기 트랜스컨덕턴스부는 상기 이미지나 영상의 픽셀에, 상기 기준치(Offset) 값이 상기 객체에 는 음(-)의 값으로, 상기 배경에는 양(+)의 값으로 적용된 전압이 차동 입력 전압으로 인가되는 것을 특징으로 하는 시각신경 회로장치를 포함한다. 일 실시예에서, 상기 시각신경 회로장치는 상기 객체와 배경을 구분하기 위한 기준치가 적용된 두 개의 입력 전 압과, 상기 기준치로 설정된 상기 외부제어전압과, 일정 이득을 가지는 차동 트랜스컨덕턴스 증폭기와 등가회로 로 대체가능한 것을 특징으로 하는 시각신경 회로장치를 포함한다. 일 실시예에서, 상기 시각신경 회로장치는 적어도 하나 이상 병렬이나 직렬 중 적어도 하나의 조합으로 연결되 는 것을 특징으로 하는 시각신경 회로장치를 포함한다.일 실시예에서, 상기 차동 트랜스컨덕턴스 증폭기는 BJT(Bipolar Juction Transistor), JFET(Junction Field- Effect Transistor), MOSFET(Metal-Oxide Semiconductor Field-Effect Transistor), GaAs MESFET(Metal Semiconductor FET) 중 적어도 하나 또는 적어도 하나의 조합으로 구성되는 것을 특징으로 하는 시각신경 회로 장치를 포함한다. 실시예들 중에서, 시각신경 회로장치를 이용한 객체 탐색 시스템에 있어서,이미지나 영상 중 적어도 하나에서, 상기 이미지나 영상의 객체를 탐색하기 위해 입력 영상을 흑백 영상으로 변환하는 변환부; 상기 흑백 영상에서 상기 객체와 배경을 구분하기 위한 기준치(Offset)를 적용하는 기준치 적용부; 상기 기준치가 적용된 상기 이미 지나 영상에, 탐색하기 위한 상기 객체의 형상의 프레임을 이용하여, 상기 프레임과 일치하는 형상에 가중치를 부여하는 가중치 적용부; 상기 기준치 및 가중치가 적용된 영상에서 상기 객체를 선별 및 탐지해내는 탐지부; 를 포함하는 시각신경 회로장치를 이용한 객체 탐색 시스템을 이용하여 과제를 해결할 수 있도록 이루어진다. 일 실시예에서, 상기 기준치 적용부는 상기 객체의 탐색의 오류 및 노이즈를 제거하기 위해, 상기 흑백 영상의 픽셀값에 상기 배경은 양(+)의 기준치 값을 적용하고, 상기 객체는 음(-)의 기준치 값을 적용하여 상기 객체와 배경 간의 차이를 발생시키는 것을 특징으로 하는 시각신경 회로장치를 이용한 객체 탐색 시스템을 이용하여 과 제를 해결할 수 있도록 이루어진다. 일 실시예에서, 상기 가중치 적용부는 상기 기준치가 적용된 영상에서, 상기 객체의 형상의 프레임과 일치하는 형상에 가중치를 부여하되, 상기 기준치가 적용된 값에 상기 가중치를 곱하는 연산으로 가중치를 부여하는 것을 특징으로 하는 시각신경 회로장치를 이용한 객체 탐색 시스템을 포함한다. 일 실시예에서, 상기 기준치 적용부와 상기 가중치 적용부는 시각신경처리를 이용하여 각 픽셀에 기준치 (Synaptic Offset)과 가중치(Synaptic Weight)를 부여하여 방향성을 가지도록 하되, 상기 방향성은 적어도 하나 의 수와 방향으로 확장가능한 것을 특징으로 하는 시각신경 회로장치를 이용한 객체 탐색 시스템을 포함한다. 실시예들 중에서, 시각신경 회로장치를 이용한 객체 탐색 방법에 있어서, 미지나 영상 중 적어도 하나를 흑백 영상으로 변환하는 제1 단계; 상기 이미지나 영상의 객체와 배경을 구분하기 위한 기준치(Offset)를, 탐색하고 자 하는 패턴의 형상의 객체에 적용하되, 상기 배경에는 상기 기준치를 적용하지 않는 제2 단계; 상기 객체의 형상과 일치하는 프레임에 가중치를 두어, 상기 기준치가 적용된 영상에 상기 객체가 가중치를 얻을 수 있도록 가중치를 부여하는 제3 단계; 상기 기준치 및 가중치로 강조된 영역인 탐색하고자하는 객체를 탐지하는 제4 단 계; 를 포함하는 시각신경 회로장치를 이용한 객체 탐색 방법을 이용하여 과제를 해결할 수 있도록 이루어진다."}
{"patent_id": "10-2012-0008372", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상에서 설명한 바와 같이, 상기와 같은 구성을 갖는 본 발명의 개시된 기술은 1차적으로 기준치가 객체와 배 경 간에 차이가 발생하도록 차동 트랜스컨덕턴스 증폭기의 입력 전압을 인가하며, 2차적으로 객체와 동일한 프 레임을 설정하고, 프레임과 동일한 형상에 가중치를 부여하여 객체 탐지의 오류율을 0%에 근접하게 만들 수 있 으며, 객체 탐지의 오류로 인해 발생할 수 있는 사고를 미연에 방지할 수 있고, 탐지 오류로 인한 유지 보수 비 용, 시간과 인력 채용 등의 비용을 최소한으로 낮출 수 있으며, 오류로 인해 오작동하는 기기 및 프로그램에 대 한 불신을 완벽히 해소할 수 있어 제조사, 더 나아가 이 제품을 채용하는 각종 회사의 이미지까지 쇄신할 수 있 는 등의 효과를 거둘 수 있다."}
{"patent_id": "10-2012-0008372", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 실시예를 상세하게 설명한다. 이하의 설명에 있어서, 당업자에게 주지 저명한 기술에 대해서는 그 상세한 설명을 생략할 수 있다. 또한, 본 발명의 구성 요소를 설명하는 데 있어서, 동일한 명칭의 구성 요소에 대하여 도면에 따라 다른 참조부 호를 부여할 수도 있으며, 서로 다른 도면임에도 불구하고 동일한 참조부호를 부여할 수도 있다. 그러나, 이와 같은 경우라 하더라도 해당 구성 요소가 실시예에 따라 서로 다른 기능을 갖는다는 것을 의미하거나, 서로 다른 실시예에서 동일한 기능을 갖는다는 것을 의미하는 것은 아니며, 각각의 구성 요소의 기능은 해당 실시예에서의 각각의 구성요소에 대한 설명에 기초하여 판단하여야 할 것이다. 또한, 본 발명의 실시예를 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 요지 를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략할 수 있다. 또한, 본 발명의 구성 요소를 설명하는 데 있어서, 제 1, 제 2, A, B, (a), (b) 등의 용어를 사용할 수 있다. 이러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소의 본 질이나 차례 또는 순서 등이 한정되지 않는다. 어떤 구성 요소가 다른 구성요소에 \"연결\", \"결합\" 또는 \"접속\" 된다고 기재된 경우, 그 구성 요소는 그 다른 구성요소에 직접적으로 연결되거나 접속될 수 있지만, 각 구성 요 소 사이에 또 다른 구성 요소가 \"연결\", \"결합\" 또는 \"접속\"될 수도 있다고 이해되어야 할 것이다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한 복수의 표현을 포함하는 것으로 이해되어야 하고, \"포함 하다\"또는 \"가지다\" 등의 용어는 설시된 특징, 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함을 지정하려는 것이며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이 들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 각 단계들에 있어 식별부호(예를 들어, a, b, c 등)는 설명의 편의를 위하여 사용되는 것으로 식별부호는 각 단 계들의 순서를 설명하는 것이 아니며, 각 단계들은 문맥상 명백하게 특정 순서를 기재하더라도 명기된 순서와 다르게 일어날 수 있다. 즉, 각 단계들은 명기된 순서와 동일하게 일어날 수도 있고 실질적으로 동시에 수행될 수도 있으며 반대의 순서대로 수행될 수도 있다. 이하, 본 발명에 따른 실시예를 첨부된 예시도면을 참고로 하여 상세하게 설명한다. 도 2는 방향성을 갖는 빛을 고양이의 눈에 비추었을 때, 고양이의 대뇌피질 반응을 나타낸 도면이다. Hodgkin-Huxley 형식론의 뉴런, 및 Hubel과 Wiesel의 시각피질 실험에 따르면, 방향성을 갖는 빛을 고양이의 눈 에 비추었을 때, 고양이 대뇌 피질의 뉴런은 특정 방향성을 가지며 특정 방향의 자극에만 반응한다. 도 2에서 좌측 도면은 빛의 모양 또는 방향을 나타내며, 우측 도면은 빛의 모양 또는 방향에 따른 반응의 크기를 나타낸 다. 따라서, 뇌는 독립적으로 특정 방향성에 자극하는 뉴런들의 집합체로 볼 수 있다. 비록, 시각피질의 명확한 모델은 없지만, Hubel 및 Wiesel의 고양이의 선모양 피질에 대한 연구는 간단한 세포 의 기능으로 개념을 확립했다. 이러한 발견은 형질(Character)부터 복잡한 자연계의 이미지까지 사물인식에 대 한 다양한 이론들을 발생시켰다. 이러한 신경생리학에 대한 연구는 생물학적으로 그럴듯한 전기적 실행의 원리들을 소개하였다. 전기적 실행의 하나는 본 발명의 실시예에서 이용되는 Hodgkin 및 Huxley의 뉴런 모델이며, 제안된 생체근원 시각을 전기적으 로 처리하는 실행 가능성을 보여준다. 본 발명의 실시예 또한 도 2에 도시한 바와 같은 Hubel 및 Wiesel에 의한 간단한 세포의 실험결과로부터 발견되었다. 본 발명의 실시예는 간단한 시각세포를 모방함으로써, 시각피질에 유사한 정확성을 얻을 수 있다. 도 3은 자극에 대한 뉴런의 시간에 따른 반응을 전압과 트랜스컨덕턴스로 표현한 도면이다. 즉, 시각피질에 자 극을 가하고, 그에 따른 뉴런의 시간에 따른 반응을 측정하여 전압-트랜스컨덕턴스(Vm-g)로 표현할 수 있다. 트랜스컨덕턴스(Transconductance)란, 트랜스어드미턴스의 실수보로, FET의 게이트 전극과 드레인 전극 사이의 트랜스컨덕턴스인 경우에는, 게이트 전압 Eg, 드래인 전류 ID 사이의 관계를 주는 곡선의 경사로서, gm＝∂ID/ ∂Eg (ED는 일정)로 주어지며, 상호 컨덕턴스라고도 한다. Hodgkin-Huxley(H-H)는 도 3에 도시한 바와 같이 뉴런을 생체 물리학적으로 특징화하는데 광범위하게 사용될 수 있다. H-H 형식론은 특별한 이점을 주지는 않지만, 비동기 자극에 대한 개념은 신경망 컴퓨팅 시스템 또는 신경 망 개념의 주요 요소로 광범위하게 사용된다. 도 4는 본 발명에 따른 트랜스컨덕턴스 신경회로의 기본 구성도 및 이를 구현한 VLSI 설계도, 제작 소자를 도시 한 도이다. 도 4를 참조하면, (a)는 트랜스컨덕턴스 신경회로를 I로 표현한 도이고, (b)는 트랜스컨덕턴스 신경회로를 V로 표현한 도, VLSI 설계도, 제작 소자를 도시한 도이다. (a)와 (b)의 회로는 한 쌍의 NMOS(N Metal Oxide Semiconductor) 트랜지스터 M1 및 M2에 의해 전압이 제어된 선형 컨덕턴스 회로로 제안되었으며, MOS 트랜지스터의 컨덕턴스는 아날로그 회로 설계에서 필수적인 구성요소 중 하나이고, 이러한 회로는 실행 시넵스로부터 뉴런에 이르기까지 다양한 신경망에 응용될 수 있다. (a)를 참조하면, I는 하기 수학식 1에 의해 산출될 수 있다. 수학식 1"}
{"patent_id": "10-2012-0008372", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "따라서, (b)를 참조하면, VBIAS는 PMOS(P Metal Oxide Semiconductor)과 같은 M3에 의해, 다이오드와 같은 구 동을 하도록 바이어스값을 가지며 이루어진다.도 5는 본 발명에 따른 시각신경 회로장치를 도시한 도이다. 도 5를 참조하면, 도 3의 자극에 대한 뉴런의 시간 에 따른 특정 반응과 동일한 전압을 출력하는 회로 구성의 예를 나타낸다. 자극에 대한 뉴런의 시간에 따른 반응과 동일한 전압을 출력하는 회로를 구성할 때, 생물 세포의 특성을 반영할 수 있다. 여기서, 하나의 회로는 하나의 뉴런에 대응한다. 따라서, 본 회로를 수개 병렬 연결하여 칩을 만드는 경우, 뇌와 유사한 기능을 할 수 있다. 다만, 모든 뉴런의 전압 특성에 맞추어 변형하여야 하며, 또한 각각의 뉴런의 연결 특성을 고려하여야 한다. 시각신경 회로장치는 자극에 의한 시각피질에서의 뉴런의 시간에 따른 반응을 전압으로 표현하며, 표현된 전압과 동일한 전압을 출력하되, 두뇌 신경망처럼 뉴런과 뉴런, 또는 뉴런과 센서를 가중치를 가진 연결고리로 시각신경회로를 구성한다. 이를 위해, 본 발명에 따른 시각신경 회로장치는 트랜스컨덕턴스부, 외부제어전압 인가부, 미러 링부, 버퍼부를 포함한다. 트랜스컨덕턴스부는 생물신경세포의 활동상태(Action Potential)과 세포막 이온별 선택적 트랜스컨덕턴스 특성을 반영하여 모방 구현하며, 외부제어전압 인가부는 트랜스컨덕턴스의 산출전류를 추가로 프로그램가 능하도록 트랜스컨덕턴스부에 전압을 인가시키도록 구성된다. 미러링부는 트랜스컨덕턴스부의 출력 전류를 복제하고, 트랜스컨덕턴스부의 출력 전압을 미러링 (Mirroring)하여 역류를 방지하며, 버퍼부는 출력단에서 피드백되는 출력전압을 버퍼링(Buffering)하여 전 압 역류를 방지한다. 도 6은 본 발명에 따른 시각신경 회로장치의 다른 예를 도시한 도이다. 도 6의 회로에서 상부와 하부는 각각 도 3의 Leakage part, Na(나트륨 이온)(또는 K(칼륨 이온)) part에 대응하며, 각각의 Part를 병렬로 추가 연결하여 N 개의 파트로 확장할 수도 있다. 트랜스컨덕턴스부(③)와 미러링부(④)는 상기 도 5와 같다. ① 부분은 버퍼부를 나타낸다. 버퍼부는 회로의 출력단에서 피드백되는 전압이 역류하지 않도록 버퍼링하며, 입 력 전압을 증폭하는 부분이다. ② 부분은 지연부를 나타낸다. 도 3에서 특정 라인에 지연 응답이 나타나는 것과 같은 효과가 나오도록 입력을 지연시키는 역할을 한다. 지연 시간은 파라미터 설정에 따라 조정이 가능하다. 도 6의 시각신경 회로장치는 전압방출부(⑤)를 더 포함할 수 있는데, 도 3의 그래프 그래프에서 피크(peak) 응 답(스파이크 발생부) 후 전압 응답이 떨어지는 현상이 발생하는 것과 같이 전압을 방출하는 역할을 한다. 따라 서, 피크 응답이 발생한 후 도 6의 회로에 다시 전압이 입력되더라도 일정 시간이 지나야지만 다시 피크 응답이 발생할 수 있다. 이것은 세포의 휴지기와 같은 효과를 발생시키기 위한 것이다. 즉, 스파이크 발생 후 휴지기에 는 외부로부터 자극이 와도 반응이 없다. 본 발명에 따른 시각신경 회로장치는 쉐이핑(Shaping)부(⑥)를 더 포함할 수 있는데, 즉 쉐이핑부는 입력 파형 을 쉐이핑하여 출력하는 역할을 하며, 펄스와 같은 형상으로 나타날 수 있도록 한다. 일 실시예에서, 도 5의 시 각신경 회로장치는 전압방출부, 쉐이핑부를 더 구비할 수 있다. 컨덕턴스 요소의 경험적인 수학형식은 수학식 2와 같이 표현되며, 여기서 b는 막피(Membrane) 포텐셜의 S자 결 장(Sigmoid) 함수이다. 그리고 Vm은 막피 포텐셜이며, 전체적으로 능동 포텐셜 및 관련된 이온의 전도로 동적으 로 모델화될 수 있다. 수학식 2"}
{"patent_id": "10-2012-0008372", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수학식 2의 함수적 구성은 컨덕턴스, 곱셈, 덧셈(또는 뺄셈), 및 미분방정식에 의해 제어된다. 수학식 2에서 미 분방정식은 LPF(Low Pass Filter)에 의해 실행될 수 있으며, 지연된 응답을 야기한다. 이러한 관계식으로부터 생물학적 뉴런의 동적 활동이 도 5에 나타낸 바와 같은 막피 포텐셜에 의해 제어된 이온 기반의 컨덕턴스로 전 기적으로 실행될 수 있다. 도 7의 상부도면은 인위적인 시각피질에서의 수직방향 가중치 프레임의 예를 나타낸 도면이다. 도 2에 나타난 바와 같이 오리엔테이션 선택성의 조율 속성(Tuning Propertes)이 시각피질에서의 지각력에 대한 키 역할을 하 는 것으로 여겨지기 때문에 본 발명은 각각 다른 오리엔테이션 입력을 사용하였다. 도 6에 나타낸 바와 같이, 5 x 5시넵스의 가중치로 조율된 피처 맵(feature map)은 간단한 세포의 오리엔테이션 선택성 속성을 모방하기 위 해 부가조정으로 매칭될 수 있다. 시넵스의 가중치는 블랙: 그레이: 화이트 각각에 대해 1:-0.6:0.1의 비율이다. 즉, 중앙의 검은 부분 픽셀의 가중치가 1이며, 회색부분 픽셀의 가중치는 -0.6이고, 백색부분 픽셀의 가중치는 0.1이다. 해당 가중치는 Hubel 및 Wiesel의 실험에서 고양이에게 주는 자극과 같은 효과를 준다. 픽셀 의 크기와 가중치의 크기는 기재된 크기에 한정되는 것은 아니며, 설정에 따라 달라질 수 있다. 또한, 피처 맵 을 입력 영상 전체에 대해 가중하여 뉴런 회로에 입력할 수 있다. 도 7의 하부도면은 다양한 자극에 대한 시각피질의 반응을 나타낸 도면이다. 모의실험의 결과는 도 7의 하부에 도시한 바와 같으며, 조율된 피처 오리엔테이션은 도 2에서 나타낸 Hubel 및 Wiesel의 실험의 결과와 일치하는 결과를 나타내는 것으로 평가된다. 본 발명의 실시예에서, 시각피질의 신경변화 실행의 요소는 전기적으로 프로그램화할 수 있는 MOSFET(Metal Oxide Semiconductor Field Effect Transistor)에기초하여 구현될 수 있다. 그러나, 본 발명은 MOSFET 외에 다 른 종류의 트랜지스터의 사용을 배제하는 것은 아니다. 결과적으로, 도 7의 원리로 뉴런과 연결고리는 구성하는 회로 구성이 생성될 수 있다. 도 8은 가중치 프레임을 적용하여 오토바이 탑승자를 인식하는 실시예이다. 도 8에 도시된 바와 같이, 신경변화 시각신호 처리의 가능성은 버스로부터 카메라를 이용하여 촬영된 이미지 시퀀스로부터 보행자를 검출하는데 적 용될 수 있다. 보행자의 환경은 차량이 움직인 후 각각의 행인들 사이에 크게 다를 수 있다. 따라서, 정확한 검 출 알고리즘이 이와 같이 빠르게 변화되는 환경하에서 정확하게 실행될 필요가 있다. 비교적 고정된 특정 객체를 인식하는 것은, (a)와 같이 사람의 머리와 상체가 가지는 특성 가중치 프레임을 도 로상 영상에 적용하면, (b)와 같이 후면에서도 오토바이의 탑승자가 감지되는 검색 기능을 가진다. 도 9는 가중치 프레임을 방향성 신호에 적용하여 에어백 작동 감지를 인식하는 실시예이다. 도 9에 도시된 바와 같이, 객체감지를 위한 가중치 프레임을 에어백으로 적용하면, 차랑 내 탑승자 감시 영상에서 에어백 작동을 감 시할 수 있다. 비교적 고정된 환경에서의 변화 상태, 예를 들면, 도로의 보행자, 오토바이, 차량, 또는 실내의 출입자의 움직 임과 차량 실내의 탑승자의 움직임, 에어백 작동 등은 변화의 폭이 작은 배경을 활용하는 전후 이미지 시퀀스를 고려할 수 있고, 이처럼 가중치 프레임은 감지하고자 하는 객체의 형상에 따라 달라질 수 있다. 도 10은 가중치의 단순 적용에 따른 대응한계상황을 나타내는 도면이다. 도 10에 도시된 바와 같이, 객체 자체 가 고정된 상황이고, 객체가 계속적으로 변화하며, 조명 여건의 변동도 큰 경우에는, 이미지 시퀀스의 영상 차 이를 이용하기에는 제한적일 수밖에 없다.즉, 도 8의 (a)와 같은 객체 가중치 프레임은 움직이는 또는 변화하는 사람 객체 감지에 효율적이나, 다양한 배 경이 존재하는 경우에는, 단일 영상만으로 처리되는 흑백 영상 자체는 모두 양(Positive)의 값을 가지게 되므로, 도 8의 (b)와 같은 정지처리 영상은 감지 결과가 다르게 나타날 수 있다. 예를 들면, 도 10의 (a)를 보면, 처리 후 흑백 영상과 같이 객제 감지용 가중치 프레임을 정지처리 영상에 단순 적용하면, 사실과 다른 결과가 감지될 수 있다. 즉, 감지하고자 하는 객체와 유사한 패턴의 다른 객체가 노이즈(Noise)로 감지될 수 있는 것이다. 따라서, 상기와 같은 문제를 해결하기 위한 본 발명은, 처리된 흑백 영상의 가중치 프레임을 적용할 때, 객체를 중심으로 기준치를 적용하여 선별력을 높이도록 설계되며, 이는 도 11을 참조하여 설명한다. 도 11은 본 발명에 따른 시각신경 회로장치를 이용한 객체 탐색 시스템을 도시한 블록도이다. 도 11에 도시된 바와 같이, 본 발명에 따른 시각신경 회로장치를 이용한 객체 탐색 시스템은 변환부, 기준치 적용부 , 가중치 적용부, 탐지부를 포함한다. 변환부는 입력된 이미지 영상을 흑백 영상으로 변환시키며, 기준치 적용부는 변환부에 의해 변환된 처 리 흑백영상의 픽셀에 기준치(Offset)를 적용하도록 구비되며, 가중치 적용부의 가중치 적용방법은 전술한 방법으로 실행될 수 있고, 이는 중복되므로 생략하기로 한다. 탐지부는 시각신경 뉴런 회로에 가중치가 적용된 값을 입력하며, 시각신경회로를 통해 강조된 영역을 탐지 할 수 있고, 이때, 가중치 적용부에 의해 가중치가 적용된 흑백 영상에 대해 수직방향 가중치 프레임과 같 은 방법으로, 탐지하고자 하는 객체와 유사한 형상의 프레임을 가중할 수도 있다. 도 12는 본 발명에 따른 시각신경 회로장치의 원리도이다. 도 12에 도시된 바와 같이, 일정 길이(W: Width)에 대해 양(+)과 음(-)의 기준치(k: Offset)를 적용할 수 있다. 즉, 가중치를 적용하기 전에, 탐지하고자 하는 객체의 배경이 되는 픽셀값에는 +k 의 기준치(Offest)를 적용하 고, 탐지하고자 하는 객체에는 -k 의 기준치(Offset)를 적용하여, 흑백이 된 영상에 탐지하려는 객체를 부각시 킬 수 있는 것이다. 이는, 본 발명의 출원인이 출원한 시각신경 회로장치 및 그 시각신경 회로장치를 이용한 객체탐색방법보다 강화 된 탐지방법이며, 이를 통해 배경이 계속적으로 변화하는 상황에서도 객체를 가중치 프레임에서 발생했던 노이 즈가 없이 탐색할 수 있는 것이다. 예를 들면, 배경은 + 값을 적용하고, 객체인 패턴은 - 값을 가지도록 흑백영상에 기준치 값을 적용하며, 가중치 프레임이 적용될 흑백영상 가운데 배경에 대응되는 영역은 픽셀값이 기준치를 더하고, 객체에 대응되는 영역은 픽셀값에서 기준치를 뺀 후, 가중치 프레임을 적용한다. 배경이 탐색하고자 하는 패턴에 비해 상대적으로 높은 값을 가지게 되므로, 즉, 배경에 + 값을 적용하고, 탐색 하고자 하는 패턴에 - 값을 적용하여 그 둘의 차이는 더욱 벌어지게 되므로, 배경과 패턴인 객체의 차이로 인해 선별력이 높아질 수 밖에 없는 것이다. 기준치 값은 영상과 패턴 등의 종류에 따라 달라질 수 있는데, 예를 들면, 기준치 값은 흑백 영상의 각 픽셀값 의 평균으로 정할 수도 있다. 따라서, 이상적인(Ideal) 알고리즘 상에서만 아니라, 인간이나 동물의 시각과 같은 정확성을 가지면서도, 계속 적으로 변화하는 영상에서도 가중치 프레임을 적용하기 전에 기준치(Offset)를 적용하여 노이즈 및 오류가 없도 록 정확하게 객체를 탐색해낼 수 있다. 도 13은 본 발명에 따른 시각신경 회로장치에 기준치를 적용한 실시예이다. 도 13에 도시된 바와 같이, 트랜스 컨덕턴스 신경회로에 기준치인 k 값을 변동시키면서, VLSI를 프로그램할 수 있다. 트랜스컨덕턴스의 입력값(Vin+, Vin-)이 각각 양의 값과 음의 값인 기준치가 되는 경우, 흑백 영상에서 배경과 패턴이 정확히 선별될 수 있다.즉, k값은 도 5를 참조하면, 외부제어전압인가부의 vc값으로, 외부제어전압은 변동이 가능한 값이고, 이러 한 기준치가 설정된 경우, 차동 트랜스컨덕턴스 증폭기인 시각신경 회로장치의 입력전압 Vin+, Vin-의 값의 차 가 커지게 되고, 그 차이만큼 증폭되어 출력되므로, 객체와 배경의 구분은 더욱 커질 수 있으며, 흑백영상에서 배경과 패턴이 정확히 선별될 수 있다. 차동 트랜스컨덕턴스 증폭기는 BJT(Bipolar Juction Transistor), JFET(Junction Field-Effect Transistor), MOSFET(Metal-Oxide Semiconductor Field-Effect Transistor), GaAs MESFET(Metal Semiconductor FET) 중 적 어도 하나 또는 적어도 하나의 조합으로 구성될 수 있다. FET으로 실현한 차동 증폭기는 매우 작은 입력 바이어스 전류와 매우 높은 입력 저항의 장점을 제공하며, BJT로 실현한 차동 증폭기는 FET으로 실현한 것보다 작은 입력 옵셋 전압과 넓은 대역폭을 제공하며, GaAs는 가장 넓 은 대역폭을 제공하는데, 구현될 객체탐색의 특성에 따라 다양하게 설정가능하며, 이에 한정되지 않음은 자명하 다 할 것이다. 이러한 차동 트랜스컨덕턴스 증폭기는 병렬 또는 직렬로 적어도 하나 이상 연결될 수 있으며, 이는 다양하게 변 경 및 변형이 가능함은 자명하다 할 것이다. 도 14는 본 발명에 따른 기준치 적용을 포함한 운전석 안전벨트 감지용 가중치 프레임의 실시예이다. 도 14에 도시된 바와 같이, F는 객체이고, B는 배경이라고 할 때, 객체에 적용되는 기준치 및 가중치와, 배경에 적용되 는 가중치는 하기 수학식 3과 같다. 수학식 3"}
{"patent_id": "10-2012-0008372", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "상기 수학식 3을 보면 알 수 있듯이, 배경(B)에는 입력값(input)에 가중치(weight)만 적용이 되었지만, 탐지 및 탐색하고자 하는 패턴인 객체(F)에는 입력값(input)에 가중치를 곱하기 전에, 오프셋(offset)값을 뺀 것을 알 수 있다. 여기서, 배경(B)에도 하기 수학식 4와 같이 오프셋 값을 더하여 그 차이를 더욱 넓게 할 수도 있다. 수학식 4"}
{"patent_id": "10-2012-0008372", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 5, "content": "도 15는 도 14의 프레임으로 전방 탑승자의 안전벨트 착용감지 실시예를 나타낸 도면이다. 도 15에 도시된 바와 같이, 입력영상 및 흑백영상으로부터 기준치(Offset) 적용되어 객체를 탐색한 실시예를 볼 수 있다. 즉, 도 14의 안전벨트 프레임의 객체(F)에 기준치를 빼고 가중치를 곱했고, 배경(B)에는 가중치를 곱하거나, 기 준치를 더하여 가중치를 곱했으므로, 그 차이는 더욱 벌어지게 되고, 좌측의 입력영상이 우측의 입력영상과 같이 변환되어, 객체인 안전벨트가 흰색으로 탐지된 것을 볼 수 있다. 따라서, 조수석 안전벨트 가중치 프레임을 통해 전방 탑승자 모두, 즉 운전석과 조수석의 안전벨트 착용이 모두 감지된 것을 알 수 있고, 이러한 간단한 프레임과 기준치 적용만으로도 구현성 및 정확성이 높은 객체탐색을 실 현할 수 있게 된다. 도 16은 본 발명에 따른 시각신경 회로장치를 이용한 객체 탐색 방법을 도시한 흐름도이다. 도 16에 도시된 바 와 같이, 본 발명에 따른 시각신경 회로장치를 이용한 객체 탐색 방법은 입력된 영상을 흑백 영상으로 변환하면 서 시작한다(S10). 흑백 영상의 픽셀에 가중치를 부여하는 단계는 하기의 단계(S20, S30)로 이루어진다. 즉, 흑백 영상의 픽셀값에 객체와 배경이 구분될 수 있도록 기준치(Offset)값을 적용한 후(S20), 객체의 형상과 같은 프레임으로 객체를 탐지할 수 있도록, 탐지하고자 객체 특성 형상 프레임을 출력 영상에 가중치를 적용한 다(S30). 변환된 흑백영상에 대해, 도 6과 같은 시각신경처리를 모방하도록, 각 픽셀에 가중치(Synaptic Weight)를 부여 하여 방향성을 갖도록 할 수 있고, 가중치는 변환된 흑백 영상과 가중치 프레임을 곱하는 연산을 통해 부여될 수 있다. 즉, 변환된 흑백영상에서 그레이 이미지에 방향성을 가져서 시각신경 회로장치에 입력될 수 있도록, 픽셀에 가 중치를 부여할 수 있다. 또한, 가중치 방향은 설정에 따라 다양한 수로 확장될 수 있는데, 이때 가중치가 적용된 흑백 영상이 시각신경 회로에 입력될 수 있도록, 탐지하고자 하는 개체와 유사한 형상의 프레임을 출력 영상에 가중할 수 있다. 이러한 과정은 수직방향 가중치의 프레임에서 중간의 검은 부분에는 가중치 1을 부여하고, 회색 부분은 가중치 -0.6을 부여하며, 백색 부분은 가중치 0.1을 부여함으로써 수행될 수 있으며, 이러한 수치는 예시일 뿐, 다양한 방법으로 가중치가 부여될 수 있음은 자명하다 할 것이다. 이때, 가중치가 적용된 이미지를 시각신경회로에 입력하면, 오리엔테이션 특색들이 추출될 수 있으며, 이 경우, 추출될 다른 오리엔테이션 각들의 수는 추출될 타입에 따라 다를 수 있다. 예를 들면, 차량 또는 인조물의 많은 일직선은 에지(Edges)를 갖는 경향이 있는 반면, 보행자와 같은 생물학적 대상체는 오리엔테이션 피처 추출물에 이용되는 것보다 미리 규정된 특징들이 많지 않다. 여기서, 프레임은 보행자를 찾기 위한 프레임으로, 인간의 상체와 유사한 형상으로 선택될 수 있고, 도로에 위 치한 인간을 찾기 위한 프레임의 경우, 프레임보다 위/아래로 확장된 프레임이 될 수 있다. 따라서, 기준치가 적용된 개체 특성 프레임을 적용하기 위해서는, 처리 영상의 기준치 변환을 적용하고, 탐지하 고자 하는 객체의 특성 형상을 가중 처리하여 출력 영상으로 생성할 수 있다. 마지막으로, 강조된 영역을 탐지하게 되면, 입력 영상에서 탐색하고자 하는 영역을 높은 정확도를 가지고 선별 해낼 수 있게 된다(S40). 도 17은 본 발명에 따른 시각신경 회로장치를 이용한 객체 탐색 방법으로 보행자를 탐색한 실시예이다. 도 17에 도시된 바와 같이, 머리와 상체(Torso)로 객체의 특성 가중치를 사용하며, 정지 영상 단위 분석으로 시각회로장 치 또는 객체 감지 시스템 등을 적용함에 따라 복잡한 배경이 있는 이미지에도 적용할 수 있다. 즉, 차량이 이동함에 따라 차량에서 촬영하는 이미지의 배경은 계속적으로 변하게 되고, 초당 프레임 수는 차량 의 속도에 따라 증가하므로, 배경의 영향을 감소시키기 위한 이미지 시퀀스와 같은 경우에는 제한이 발생한다. 따라서, 기준치 적용을 처리된 흑백영상에 적용하고, 강조된 영역을 탐지하면, 예상 불가능한 조명의 급변 상황 과 제한적인 정지 영상에서도 보행자를 감지할 수 있게 된다. 시각신경회로를 통한 특정 객체 이미지는, 인간의 상체 토르소(Upper Torso)의 형판을 사용할 수 있는데, 간단 한 트레이닝의 수단으로 시각신경 회로에서 형판을 사용하는 것이며, 이는 인간의 다른 신체부위, 예를 들면, 얼굴이나 다리를 사용할 수도 있다.또한, 입력되는 영상에서 보여지는 모든 보행자를 검색할 필요는 없으며, 카메라에 근접한 보행자부터 일정 범 위의 수의 보행자만 검색하도록 구현될 수도 있다. 보행자 검출의 응용을 위해, 특히, 차량에 대해, 예를 들면 달리는 경로에 근접한 보행자 검색이 요구될 수도 있고, 시각으로 보이는 영역을 가로질러 움직이는 보행자를 검색할 수도 있다. 생체 시각들은 이미지를 전체로 처리하기보다는, 사물에 의해 보다 경계되는 것으로 정의되는데, 이를 이용하여 생체 근원의 신경변화 시각은 시각피질의 원시적 기능을 모방함으로써, 보행자를 검출할 수 있는 방법으로 제한 되었으며, 신경망 검출기를 다양한 객체 형태에 적용하는 실시예로 삽입되었다. 이를 통해, 버스에서 상업적으로 이용될 수 있는 카메라에 의해 획득된 이미지, 승용차의 카 블랙박스 이미지로 부터 도로상의 보행자나 이륜차 탑승자, 차량 내 탑승자의 신변 안전 장치를 검출하는 것이 실현 가능함을 입증 하였다. 본 출원은 1차적으로 기준치가 객체와 배경 간에 차이가 발생하도록 차동 트랜스컨덕턴스 증폭기의 입력 전압을 인가하며, 2차적으로 객체와 동일한 프레임을 설정하고, 프레임과 동일한 형상에 가중치를 부여하여 객체 탐지 의 오류율을 0%에 근접하게 만들 수 있으며, 자극에 의한 시각피질에서의 뉴런 시간에 따른 반응을 전압으로 표 현하고, 표현된 전압과 동일한 전압을 출력하는 회로와 뉴런과 뉴런 사이의 연결고리(Synapse) 망의 병렬 구조 체계로 인간의 시각 신경에 가장 근접한 시각신경회로를 제공할 수 있다. 이와 같은 시스템을 차량에 적용하는 경우, 차량 탑승자의 안전 벨트 착용 상태 등 탑승 상황을 인식할 수 있어 사고 발생시, 신속하고 효율적인 구조 서비스를 가능케하고, 주/야간 차량 주변의 보행자를 탐지할 수 있게 됨 으로써, 차량 시스템의 운행 효율을 높일 수 있으며, 이러한 시스템은 인지하고자 하는 객체에 따른 프레임을 다양화하는 경우, 차량에 한정되지 않고 각종 객체를 탐지하는 장비, 시스템에 적용가능함은 자명하다 할 것이다. 이상에서, 본 발명의 실시예를 구성하는 모든 구성 요소들이 하나로 결합하거나 결합하여 동작하는 것으로 기재 되어 있다고 해서, 본 발명이 반드시 이러한 실시예에 한정되는 것은 아니다. 즉, 본 발명의 목적 범위 안에서 라면, 그 모든 구성 요소들이 하나 이상으로 선택적으로 결합하여 동작할 수도 있다. 또한, 그 모든 구성 요소 들이 각각 하나의 독립적인 하드웨어로 구현될 수 있지만, 각 구성 요소들의 그 일부 또는 전부가 선택적으로 조합되어 하나 또는 복수 개의 하드웨어에서 조합된 일부 또는 전부의 기능을 수행하는 프로그램 모듈을 갖는 컴퓨터 프로그램으로서 구현될 수도 있다. 또한, 이와 같은 컴퓨터 프로그램은 USB 메모리, CD 디스크, 플래쉬 메모리 등과 같은 컴퓨터가 읽을 수 있는 저장매체(Computer Readable Media)에 저장되어 컴퓨터에 의하여 읽혀 지고 실행됨으로써, 본 발명의 실시예를 구현할 수 있다. 컴퓨터 프로그램의 저장매체로서는 자기 기록매체, 광 기록매체, 캐리어 웨이브 매체 등이 포함될 수 있다. 또한, 기술적이거나 과학적인 용어를 포함한 모든 용어들은, 상세한 설명에서 다르게 정의되지 않는 한, 본 발 명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 갖는다. 사 전에 정의된 용어와 같이 일반적으로 사용되는 용어들은 관련 기술의 문맥상의 의미와 일치하는 것으로 해석되 어야 하며, 본 발명에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가 능할 것이다. 또한, 본 발명에 개시된 실시예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이며, 이러한 실시예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 따라서, 본 발명의 보호 범위는 청구범위에 의하여 해석되어야 하며, 그와 균등한 범위 내에 있는 모든 기술 사상은 본 발명의 권 리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2012-0008372", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래 기술에 따른 확률 신경회로망 이론을 적용한 영상보상장치의 개략도이다. 도 2는 방향성을 갖는 빛을 고양이의 눈에 비추었을 때, 고양이의 대뇌피질 반응을 나타낸 도면이다. 도 3은 자극에 대한 뉴런의 시간에 따른 반응을 전압대비 트랜스컨덕턴스로 표현한 도면이다. 도 4는 본 발명의 트랜스컨덕턴스 신경회로의 기본 구성도 및 이를 구현하기 위한 설계도, VLSI로 구현된 소자 의 실시예이다. 도 5는 본 발명에 따른 시각신경 회로장치를 설명하는 회로도이다.도 6은 본 발명에 따른 시각신경 회로장치의 다른 예를 도시한 도이다. 도 7의 상부 도면은 인위적인 시각피질에서의 수직방향 가중치 프레임의 예를 나타낸 도면이고, 하부 도면은 다 양한 자극에 대한 시각피질의 반응을 나타낸 도면이다. 도 8은 가중치 프레임을 적용하여 오토바이 탑승자를 인식하는 실시예이다. 도 9는 가중치 프레임을 방향성 신호에 적용하여 에어백 작동 감지를 인식하는 실시예이다. 도 10은 가중치의 단순 적용에 따른 대응한계상황을 나타내는 도면이다. 도 11은 본 발명에 따른 시각신경 회로장치를 이용한 객체 탐색 시스템을 도시한 블록도이다. 도 12는 본 발명에 따른 시각신경 회로장치의 원리도이다. 도 13은 본 발명에 따른 시각신경 회로장치에 기준치를 적용한 실시예이다. 도 14는 본 발명에 따른 기준치 적용을 포함한 운전석 안전벨트 감지용 가중치 프레임의 실시예이다. 도 15는 도 14의 프레임으로 전방 탑승자의 안전벨트 착용감지 실시예를 나타낸 도면이다. 도 16은 본 발명에 따른 시각신경 회로장치를 이용한 객체 탐색 방법을 도시한 흐름도이다. 도 17은 본 발명에 따른 시각신경 회로장치를 이용한 객체 탐색 방법으로 보행자를 탐색한 실시예이다."}
