{"patent_id": "10-2022-0126498", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0047178", "출원번호": "10-2022-0126498", "발명의 명칭": "AIoT 기반 첨단 복합소재 사출성형 제조 데이터 최적화를 위한 통합관리 시스템 및 방법", "출원인": "(주)사이버테크프랜드", "발명자": "이재형"}}
{"patent_id": "10-2022-0126498", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "각종 사출공정 변수를 측정하기 위한 센서부(101)와 외부신호에 따라 공정변수를 제어할 수 있는 제어부(102)가포함된 사출제조장비들인 제1내지 제N사출제조장비(110, 120, 130)(140, 150, 160);상기 제1내지 제N사출제조장비(중소기업)(110, 120, 130)(140, 150, 160)들 각각의 이기종 장비의 제조데이터를수집하여 사출성형 제조 데이터 통합관리 시스템 서버(300)로 전송하는 산업사물 인터넷(IIOT)들(210, 220,230, 240, 250. 260); 및 상기 산업사물 인터넷(IIOT)들(210, 220, 230, 240, 250. 260)에서 전송된 상기 제1내지 제N사출제조장비(110,120, 130)(140, 150, 160)들 각각의 이기종 장비의 제조데이터를 수집하여 사출기기 자동 제어를 위한 최적화분석을 통한 첨단 복합소재 사출 환경에서의 고도화된 사출제조 제어 플랫폼 구축하는 사출성형 제조 데이터 통합관리 시스템 서버(300);를 포함하여 구성됨을 특징으로 하는 AIoT 기반 첨단 복합소재 사출성형 제조 데이터최적화를 위한 통합관리 시스템."}
{"patent_id": "10-2022-0126498", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 첨단 복합소재를 사용한 첨단부품 제조 사출성형 환경에서 제조데이터인 금형 내부 압력과 온도, 사출 설비에서 발생하는 실행 데이터, 주변 설비에서 발생하는 시계열 데이터를 IIoT으로 수집하여 제조 빅데이터 환 경을 구성하고 이를 AI 분석하여 원격 자동제어가 되는 고도화된 제조 현장관리를 위하여 제조 AI 분석 및 스마 (뒷면에 계속)"}
{"patent_id": "10-2022-0126498", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 AIoT 기반 첨단 복합소재 사출성형 제조 데이터 최적화 시스템에 관한 것으로, 더욱 상세하게는 첨단 복합소재를 사용한 첨단부품 제조 사출성형 환경에서 제조데이터인 금형 내부 압력과 온도, 사출설비에서 발생 하는 실행 데이터, 주변 설비에서 발생하는 시계열 데이터를 IIoT으로 수집하여 제조 빅데이터 환경을 구성하고 이를 AI 분석하며, 원격 자동제어가 되는 고도화된 제조 현장관리를 위하여 제조 AI 분석 및 스마트공장 ICT 기 술과 데이터 플랫폼, IoT와 연계되어 원격 자동제어가 가능하게 하는 금형 내부 제조데이터 수집 및 분석 시스 템, 첨단 복합소재용 사출 제조 최적화 방법을 위한 AIoT 기반 첨단 복합소재 사출성형 제조 데이터 최적화를 위한 통합관리 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0126498", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "4차 산업혁명이라는 키워드를 중심으로 산업현장에서는 디지털화 추세가 거세지고 있다. 특히 생산설비의 규모 가 커지고 원격제어 기술이 보편화되면서 제조현장의 수많은 생산설비들로부터 쏟아지는 데이터를 효율적으로 수집.분석하여 생산성 향상에 기여하는 최적의 공정조건을 도출하고 그 공정조건에 맞춰 생산설비를 자동으로 원격 제어하는 통합관리 시스템에 대한 기술이 주목을 받고 있다. 최근에는 사물인터넷(IoT) 기술의 확산으로 인터넷(통신망)을 통해 각종 센서와 디바이스가 연결되어 디바이스 들 사이의 상호 정보교환이나 관련 데이터 매칭(Matching)이 용이해짐에 따라 다양한 분야에서 특화된 서비스를 제공하기 위한 플랫폼(Platform) 서비스가 관심의 대상이 되고 있다. 특히 산업분야에 특화된 IIoT(Industrial Internet of Things)의 기술개발이 활기를 띄면서 IIoT에 인공지능(AI) 기술이 접목된 AIoT(Artificial Intelligence of Things)(지능형 사물인터넷, 사물지능융합기술) 플랫폼 기술의 개발열기도 점차 고조되는 추세 이다. 이러한 움직임은 제조산업의 핵심이라 할 수 있는 사출성형기 분야에서도 활발하게 나타나고 있으며, 통합제어 를 위한 제조설비들 사이의 정보교환 데이터량이 급격히 증가하면서 생산성 향상과 품질제고를 위해 데이터 처 리의 효율성과 안정적이고 지능적인 통신망 운용의 중요성이 더욱 부각되고 있는 상황이다. 그러한 상황에 맞추어 특허 제10-2021-0056235호(선행특허 1)에는 인공지능(AI) 기반의 사출성형시스템 및 성형 조건 생성방법이 개시되어 있는데, 위 선행특허 1에는 사출성형기에 성형조건 생성장치를 부착하고, 그 성형조 건 생성장치를 통해 사출성형기의 생산제품이 목표로 하는 성형품질을 유지하고 있는지 여부를 판단하여 외란에 의해 성형품질이 유지되지 않는 경우에는 목표치 데이터를 추종하도록 성형조건을 변경하는 기술사항이 예시되 어 있다.그러나 위 선행특허 1은 사출성형기에 부착된 성형조건 생성장치를 통해 성형조건의 제어가 이루어진다는 점에 서 어느 정도의 순기능을 기대할 수 있으나, 각 사출성형기에 별개의 성형조건 생성장치를 부착해야 하는 구조 이고 각 성형조건 생성장치마다 인공지능(AI) 학습을 지원하기 위한 데이터베이스, 학습알고리즘 등의 정보처리 자원(IT자원)을 구비할 수밖에 없기 때문에, 다수의 사출성형기를 구비한 대규모의 공장에서는 정보처리 자원 (IT자원)의 운용효율성이 저해될 뿐만 아니라 그 설치비용의 증가를 피할 수 없다는 구조적인 문제점을 안고 있 었다. 또한, 등록특허 제10-2264066호(선행특허 2)에는 인공지능(AI)과 이미지 분석에 의한 사출기 스마트 제어시스템 및 그 운용방법이 개시되어 있는데, 위 선행특허 2에는 사출성형기로 생산한 제품의 외형(촬영 이미지)을 학습 된 인공지능(AI)으로 검사하여 규격을 초과하는 불량이 연속 발생되거나 불량품의 누적 발생횟수가 기준값 이상 으로 확인될 경우, 사출성형기 주변의 외부환경 변수를 순차 검출하고 인공지능으로 분석하여 기설정된 성형조 건 변수를 순차적으로 조정한다는 기술사항이 개시되어 있다. 그러나 위 선행특허 2도 사출성형기를 통해 생산한 제품의 영상이미지를 기준 이미지와 대비하는데 AI 학습기법 을 적용하여 최종 제품의 품질에 영향을 미치는 성형조건을 조정하는 기술만 예시되어 있을 뿐, 사출성형기마다 별도의 성형조건 변경장치를 부착하는 구조를 벗어나지 못하고 있어, 다수의 사출성형기를 운영하는 환경에서 효율적인 통합관리가 여전히 미흡하다는 평가를 받을 수밖에 없었다. 특히 사출성형 산업은 소재를 부품으로, 부품을 제품으로 구현하기 위한 중요한 뿌리 산업 기술인데, 플라스틱 사출성형 산업은 \"제조업의 제조업\"으로 불리며 대량생산을 지원하는 대한민국의 핵심 뿌리산업(Root Industr y)이며 이에 대한 혁신 활동이 지속적으로 진행되고 있다. 완제품의 품질과 디자인은 물론 제품의 생산시간 단축, 생산원가 절감, 품질 균일화 등 전.후방 파급효과가 매 우 크고 중요도가 높은 기반산업이며 풍력발전, 전기차, 배터리, 우주 항공부품 등 첨단 제조업의 근간이라 할 것이다. 한국 금형 기술의 수준은 프레스 금형이나 플라스틱 사출성형에서 선진국과 동등한 정도에 이르렀으나, 이들 품 목의 부가가치가 점차 줄어들고 있는 위협에 처해 있으며 중국 저가 부품과의 경쟁도 치열하여 수요 산업의 변 화에 능동적으로 대응할 수 있는 첨단 고부가가치 금형 기술의 개발이 절실하다. 또한 최근 전기차 배터리케이스, 전기 자동차 내 플라스틱 동력 전달 장치, 풍력발전용 날개 등 사출 제품의 강 도와 열 배출, 두께 등 높은 수준의 기술 제품의 중요성이 대두되어 해당 강도 및 물성에 대해 첨단 복합소재에 해당하는 분석 기술이 필요하고, 각종 첨단부품에서 요구되는 물성을 위해 사용되는 글라스파이버, 카본파이버 등 기존과는 다른 첨단 복합소재를 사용한 사출성형은 각 제조 방법 복잡도가 매우 높아 기존 제조와는 차이가 존재한다. 그리고 제조 현장에서 현재 상황에 따라 숙련된 기술자의 노하우 기반으로 제조 설정치를 구성하여 제조하는 실 태이고 이를 평가하기 위한 제조데이터가 전무하다. 게다가 다양한 환경적 변화요소를 관리해야 하고 빈번한 작업 변경에 따른 설비 세팅 시간 증가에 따라 공정 레시피 관리가 부실하다. 이에 금형 내측의 제조데이터와 설비 데이터가 상호 연계 분석되어야 하며 이를 기반으로 스마트공장 솔루션을 고도화하여 고부가가치가 포함된 제조 솔루션을 제공하여야 하며, 첨단 복합소재 금형 내의 압력, 온도 변화에 대한 수집 시스템과 주변 사출기기 연계분석 솔루션은 현재까지 제시되지 않은 문제가 있다. 대기업의 경우 데이터 수집 및 분석과 AI 학습을 통해 생산 효율을 극대화할 수 있다는 점은 알려져 이에 대한 인력, 비용투자를 늘린 상황이지만, 대부분의 중소, 중견기업들은 초기 투자비용 및 성과불신 등의 이유로 적극 적인 투자를 하지 못하는 상황이다. 그에 따라 중소, 중견기업 실정에 맞는 시스템 개선이 절실하며 특히, 열악한 중소, 중견 뿌리산업의 제조기업 은 국내 대다수를 차지하고 있음에도 아직 ICT 미적용 상태가 많아, 국내 제조업 전반의 경쟁력 강화를 위한 고 도화된 AI기반 제조 분석 시스템 솔루션 필요성이 절실히 요구된다 할 것이다. 선행기술문헌 특허문헌 (특허문헌 0001) 특허문헌 1 : 대한민국 공개특허 제10-2021-0056235호 (특허문헌 0002) 특허문헌 2 : 대한민국 등록특허 제10-2264066호"}
{"patent_id": "10-2022-0126498", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명은 상기와 같은 종래 기술의 제반 단점과 문제점을 해결하기 위한 것으로, 첨단 복합소재를 사 용한 첨단부품 제조 사출성형 환경에서 제조데이터인 금형 내부 압력과 온도, 사출설비에서 발생하는 실행 데이 터, 주변 설비에서 발생하는 시계열 데이터를 IIoT으로 수집하여 제조 빅데이터 환경을 구성하고 이를 AI 분석 하여 원격 자동제어가 되는 고도화된 제조 현장관리를 위하여 제조 AI 분석 및 스마트공장 ICT 기술과 데이터 플랫폼, IoT와 연계되어 원격 자동제어가 가능하게 하는 금형 내부 제조데이터 수집 및 분석 시스템, 첨단 복합 소재용 사출 제조 최적화 방법을 위한 AIoT 기반 첨단 복합소재 사출성형 제조 데이터 최적화를 위한 통합관리 시스템 및 방법을 제공하는데 목적이 있다."}
{"patent_id": "10-2022-0126498", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위하여 본 발명은 각종 사출공정 변수를 측정하기 위한 센서부와 외부신호에 따라 공정변수를 제어할 수 있는 제어부가 포함된 사출제조장비들인 제1내지 제N사출제조장비(110, 120, 130)(140, 150, 160); 상기 제1내지 제N사출제조장비(중소기업)(110, 120, 130)(140, 150, 160)들 각각의 이기 종 장비의 제조데이터인 금형 내부 압력과 온도, 사출설비에서 발생하는 실행 데이터, 주변 설비에서 발생하는 데이터를 수집하여 사출성형 제조 데이터 통합관리 시스템 서버로 전송하는 산업사물 인터넷(IIOT)들(210, 220, 230, 240, 250. 260); 및 상기 산업사물 인터넷(IIOT)들(210, 220, 230, 240, 250. 260)에서 전송된 상기 제1내지 제N사출제조장비(110, 120, 130)(140, 150, 160)들 각각의 이기종 장비의 제조데이터인 금형 내부 압력 과 온도, 사출설비에서 발생하는 실행 데이터, 주변 설비에서 발생하는 시계열 데이터를 수집하여 하위 금형 내 부 제조데이터 수집 분석하여 사출기기 자동 제어를 위한 최적화 분석을 통한 첨단 복합소재 사출 환경에서의 고도화된 사출제조 제어 플랫폼 구축하고, 수집 분석과 데이터 분석에 기반한 설비 자동제어 연계를 위해 Web, MQTT 기반 데이터 전달이 가능하도록 구성된 각각의 상기 산업사물 인터넷(IIOT)들(210, 220, 230, 240, 250. 260)를 상기 제1내지 제N사출제조장비(110, 120, 130)(140, 150, 160) 각각의 최적화 알고리즘 및 첨단 복합소 재 사출 현장관리 솔루션을 제공하는 사출성형 제조 데이터 통합관리 시스템 서버;를 포함하여 구성됨을 특징으로 하는 AIoT 기반 첨단 복합소재 사출성형 제조 데이터 최적화를 위한 통합관리 시스템을 제공한다. 여기서 제1내지 제N사출제조장비(110, 120, 130)(140, 150, 160)는, 중소기업에 속하는 기업의 사출제조장비인 제1내지 제3사출제조장비(110, 120, 130)와, 중견기업에 속하는 기업의 사출제조장비인 제4내지 제N사출제조장 비(중견기업)(140, 150, 160)로 구성됨을 특징으로 한다. 그리고 산업사물 인터넷(IIOT)들(210, 220, 230, 240, 250. 260)은 0.5 ~ 50ms 단위의 데이터 샘플링 주기를 가지고 두 개 이상의 다채널 처리가 가능하도록 구성되어 복수의 특수 사출기기(진공, 가압, 질소)를 대상으로 하여서는 Web 기반 RESTful API를 적용하여 즉각적인 설비 제어가 가능하도록 된 것을 특징으로 한다. 한편 사출성형 제조 데이터 통합관리 시스템 서버는 제조데이터 저장 및 분산처리 플랫폼이 구축도어 오픈 소스 데이터를 활용하여 상기 알고리즘 및 첨단 복합소재 사출 현장관리 솔루션 제공을 위한 인공지능(AI) 모델 이 도출되면 저장된 데이터를 기반으로 첨단 복합소재 사출 성형 환경에서 인공지능(AI) 분석 기반으로 구체화 된 공정 품질 분석과, 특수 사출 제어 알고리즘 분석서비스 모델을 도출하여 제공하는 것을 특징으로 한다. 여기서 AIoT 기반 첨단 복합소재 사출성형 제조 데이터 최적화를 위한 통합관리 시스템은, 유무선 인터넷망으로 산업사물 인터넷(IIOT)들(210, 220, 230, 240, 250. 260)과 사출성형 제조 데이터 통합관리 시스템 서버 간 통신을 제공하는 통신망과, 상기 사출성형 제조 데이터 통합관리 시스템 서버에 구축된 AIoT 기반 첨단 복합소재 사출성형 제조 데이터가 별도로 구축되는 클라우드를 더 포함하여 구성됨을 특징으로 한다. 그리고 상기한 목적을 달성하기 위하여 본 발명은 사출성형 제조 데이터 통합관리 시스템 서버에 구성된 통신부에서 통신망을 통해 산업사물 인터넷(IIOT)들(210, 220, 230, 240, 250. 260)로부터 제1내지 제N사출제조장비(110, 120, 130)(140, 150, 160)들 각각의 이기종 장비의 제조데이터인 금형 내부 압력과 온도, 사출설비에서 발생하는 실행 데이터, 주변 설비에서 발생하는 시계열 데이터가 수신되면, 상기 사출성형 제조 데이터 통합관리 시스템 서버의 제조 데이터 수집부에서 해당 데이터를 수집하는 단계(S110); 상기사출성형 제조 데이터 통합관리 시스템 서버의 제조 데이터 제조사별 분류부에서는 수집된 데이터를 제조사별로 분류하는 단계(S120); 상기 사출성형 제조 데이터 통합관리 시스템 서버의 제조사별 이기종 사 출성형/주변기기 데이터 분석부는 상기 제조 데이터 제조사별 분류부에서 분류된 제조사별 이기종 사 출성형/주변기기 데이터를 분석하는 단계(S130); 상기 사출성형 제조 데이터 통합관리 시스템 서버의 제조 사별 이기종 사출성형/주변기기 상관관계 분석부는 제조사별 이기종 사출성형/주변기기 데이터 분석부 에서 분석한 이기종의 사출성형/주변기기 데이터의 상관관계를 분석하는 단계(S140); 상기 사출성형 제조 데이터 통합관리 시스템 서버의 사출성형/주변기기 유효인자 도출부는 상기 제조사별 이기종 사출성 형/주변기기 상관관계 분석부에서 분석한 상관관계에 따라 사출성형/주변기기의 유효인자를 도출하는 단계 (S150); 및 상기 사출성형 제조 데이터 통합관리 시스템 서버의 제조사별 원격 자동제어 및 사출 제조조건 도출부는 상기 사출성형/주변기기 유효인자 도출부에서 도출된 유효인자에 따라 제조사별 원격 자동 제어 및 사출 제조조건 도출하는 단계(S160);를 포함하여 이루어지는 것을 특징으로 하는 AIoT 기반 첨단 복합 소재 사출성형 제조 데이터 최적화를 위한 통합관리 방법을 제공한다. 여기서 사출성형 제조 데이터 통합관리 시스템 서버의 제조사별 원격 자동제어 및 사출 제조조건 도출부 는 상기 사출성형/주변기기 유효인자 도출부에서 도출된 유효인자에 따라 제조사별 원격 자동제어 및 사출 제조조건 도출하는 단계(S160)에서 도출된 데이터를 제공한 제조사들과의 공유를 위하여 사출성형 제조 데 이터 통합관리 시스템 서버의 데이터베이스나 클라우드에 구축하여 제공하는 단계(S170)를 더 포함하여 이루어지는 것을 특징으로 한다."}
{"patent_id": "10-2022-0126498", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 다음과 같은 효과가 있다. 첫째, 첨단 복합소재를 사용한 첨단부품 제조 사출성형 환경에서 제조데이터인 금형 내부 압력과 온도, 사출설 비(사출 성형기 등)에서 발생하는 실행 데이터, 주변 설비에서 발생하는 시계열 데이터를 IIoT으로 수집하여 제 조 빅데이터 환경을 구성하고 이를 AI 분석하고 원격 자동제어가 되는 고도화된 솔루션을 제공할 수 있다. 둘째, 제조 현장에서 현재 상황에 따라 숙련된 기술자의 노하우 기반으로 제조 설정치를 구성하여 제조하는 실 태이고 이를 평가하기 위한 제조데이터가 전무했으며,게다가 다양한 환경적 변화요소를 관리해야 하고 빈번한 작업 변경에 따른 설비 세팅 시간 증가에 따라 공정 레시피 관리가 부실했던 중소, 중견 기업에 대하여 금형 내 측의 제조데이터와 설비 데이터가 상호 연계 분석하여 이를 기반으로 스마트공장 솔루션을 고도화하여 고부가가 치가 포함된 제조 솔루션을 제공할 수 있다. 셋째, 대기업 보다는 중소, 중견 기업을 포함하는 국내 제조업 전반의 경쟁력 강화를 위한 고도화된 AI기반 제 조 분석 시스템 솔루션을 제공할 수 있다"}
{"patent_id": "10-2022-0126498", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 바람직한 실시 예를 첨부된 도면에 의하여 상세히 설명하면 다음과 같다. 아울러, 본 발명에서 사용되는 용어는 가능한 한 현재 널리 사용되는 일반적인 용어를 선택하였으나, 특정한 경 우는 출원인이 임의로 선정한 용어도 있으며 이 경우는 해당되는 발명의 설명부분에서 상세히 그 의미를 기재하 였으므로, 단순한 용어의 명칭이 아닌 용어가 가지는 의미로서 본 발명을 파악하여야 함을 밝혀두고자 한다. 또한 실시예를 설명함에 있어서 본 발명이 속하는 기술 분야에 익히 알려져 있고, 본 발명과 직접적으로 관련이 없는 기술 내용에 대해서는 설명을 생략한다. 이는 불필요한 설명을 생략함으로써 본 발명의 요지를 흐리지 않 고 더욱 명확히 전달하기 위함이다. 도 1은 본 발명에 따른 AIoT 기반 첨단 복합소재 사출성형 제조 데이터 최적화를 위한 통합관리 시스템의 플랫 폼을 설명하기 위한 도면이다. 본 발명에 따른 AIoT 기반 첨단 복합소재 사출성형 제조 데이터 최적화를 위한 통합관리 시스템의 플랫폼은 도 1에 나타낸 바와 같은데, 기본적으로는 첨단 복합소재를 사용한 첨단부품 제조 사출성형 환경에서 제조데이터인 금형 내부 압력과 온도, 사출설비(사출 성형기 등)에서 발생하는 실행 데이터, 주변 설비에서 발생하는 시계열 데이터를 IIoT으로 수집하여 제조 빅데이터 환경을 구성하고 이를 AI 분석하고 원격 자동제어가 되는 고도화된 제조 현장관리를 위한 것으로, 제조 AI 분석 및 스마트공장 ICT 기술과 데이터 플랫폼, IoT와 연계되어 원격 자 동제어가 가능하게 하는 금형 내부 제조데이터 수집 및 분석 시스템, 첨단 복합소재용 사출 제조 최적화 방법에 대한 개발이 필요하므로 이를 실시간 시계열 데이터 수집, 분석 가능한 제조데이터 플랫폼 개발, 금형 내부 제 조데이터 수집 및 사출설비 데이터 수집, 제어 가능한 IIoT 개발, 제조 빅데이터를 분석하여 피드백을 수행하는 최적화 알고리즘 개발 및 첨단 복합소재 사출 현장관리 솔루션 고도화를 포함하여 이루어진다. 이를 보다 상세히 설명하면 본 발명은 중소, 중견기업 사출현장에 적합하도록 클라우드 연계된 제조데이터 플랫 폼 구축하기 위해 Edge Cluster와 IIoT를 개발하고 하위 금형 내부 제조데이터 수집 분석 시스템, 사출기기 자 동 제어시스템과 연계하여 최적화 분석을 통한 첨단 복합소재 사출 환경에서의 고도화된 사출제조 제어시스템을 구축한다. 이를 위하여 전사 정보 공유 체계 고도화/사출 공정 분석 고도화를 통해 사출현장의 기존 문제점이었 던 휴먼에러, 관리 미숙, 미흡한 불량 원인 관리를 해결할 수 있다. 에지 클러스터(Edge Cluster)는 Local 영 역에서 시계열 데이터를 끊김 없이 받을 수 있도록 설계하기 위해 클라우드 통합(Cloud Orchestration) 기술인 K8S를 활용하고 모든 Process는 Docker 단위로 가상화하여 데이터 플랫폼 구축한다. 그리고 금형 내부 제조데이터 수집 분석과 데이터 분석 기반 설비 자동제어 연계를 위해 IIoT를 개발하고 실시 간 데이터 수집 시스템 및 설비 제어시스템과 데이터 플랫폼을 연계할 수 있는 플랫폼 커넥터로서 활용한다. 한편 IIoT는 내부에 데이터 수집 및 적재를 위한 Agent를 보유하고 데이터 전처리가 수행할 수 있는 컴퓨팅 기 능을 포함한 것으로 개발하여 플랫폼의 데이터 분산처리능력을 고도화할 수 있다. 그리고 Web, MQTT 기반 데이터 전달이 가능하도록 구성하여 사용자의 편의성 및 실시간성, 데이터 흐름 변화 유 연성 등을 확보하도록 구성하고, 금형 내부 제조데이터 수집 분석 시스템은 플랫폼과 연계될 수 있도록 IIoT를 플랫폼 커넥터로써 활용하며 0.5 ~ 50ms 단위의 데이터 샘플링 주기를 가지고 두 개 이상의 다채널 처리가 가능 하도록 구성한다. 또한 사출기기 자동 제어 시스템도 IIoT를 플랫폼 커넥터로써 활용하며 최소 3개의 특수 사 출기기(진공, 가압, 질소)를 대상으로 Web 기반 RESTful API를 적용하여 즉각적인 설비 제어가 가능하도록 구성 한다. 그리고 기본적으로 IIoT, Edge Cluster, 제조데이터 수집 시스템을 통해 제조데이터 저장 및 분산처리 플랫폼을 구축하고, 오픈소스 데이터 등을 활용하여 인공지능(AI) 모델이 도출되면, 저장된 데이터를 기반으로 첨단 복합 소재 사출 성형 환경에서 AI 분석 기반으로 구체화 된 공정 품질 분석 시스템, 특수 사출 제어 알고리즘 분석서 비스 모델을 도출할 수 있다. 도 2는 본 발명에 따른 AIoT 기반 첨단 복합소재 사출성형 제조 데이터 최적화를 위한 통합관리 시스템에서 AIoT 기반 사출성형 주변기기 데이터 수집 및 원격 자동제어 서비스를 위한 스마트 공장 개념을 설명하기 위한 도면이다. 본 발명에 따른 AIoT 기반 첨단 복합소재 사출성형 제조 데이터 최적화를 위한 통합관리 시스템에서 AIoT 기반 사출성형 주변기기 데이터 수집 및 원격 자동제어 서비스를 위한 스마트 공장 개념은 도 2에 나타낸 바와 같은 데, 다양한 제조 장비를 제어하고 발생하는 데이터를 수집하기 위해서 AIoT 기술을 활용하여 원격 자동제어 및 제조 세팅을 관리하는 서비스 기술개발을 통한 차별성 확보가 필요하다. 이를 위하여 제조 과정에서 사용자의 Know-How에 의해 표준 세팅 관리되는 일반적인 SCADA(Supervisory Control And Data Acquisition)와는 다르게 제조 AI 분석을 기반으로 원격 자동제어 및 제조 세팅 관리 서비스 기술을 확보하게 되는데, 본 발명 출원인의 등록특허 10-2379259호(AIoT 기반 사출제조 설비의 통합관리 시스템 및 그 운용방법)를 통해 제조설비 데이터를 취득할 수 있는 IoT는 제작되었으며, 제어를 위해 장비별 Agent, 원격 제어를 위한 API 및 프로토콜 변환 모듈 등이 포함된다. 본 특허에서는 선 등록특허에 추가하여 제조데이터의 특성에 따라 관리형 데이터인 Event 데이터 처리와 분석을 위한 시계열 데이터 처리 형태로 분리하여 별도 처리 구성을 통해 데이터의 시장 효율성과 클라우드 활용을 통 한 독창성 확보하고자 한다. 도 3은 본 발명에 따른 AIoT 기반 첨단 복합소재 사출성형 제조 데이터 최적화를 위한 통합관리 시스템에서 사 출성형 제조 AI 분석 알고리즘 서비스를 예시적으로 설명하기 위한 도면이다. 본 발명에 따른 AIoT 기반 첨단 복합소재 사출성형 제조 데이터 최적화를 위한 통합관리 시스템에서 사출성형 제조 AI 분석 알고리즘 서비스는 도 3에 나타낸 바와 같은데, 금형내압 데이터 활용한 사출성형 특화 제조 AI 분석 알고리즘 개발을 통해 독창성 확보해야 한다. 이때, 중소, 중견기업의 제조개선을 위한 데이터 수집 솔루 션은 존재하나 사출성형 조건에 대한 분석을 겸한 솔루션은 현장에서 활용되지 못하는 실정인데, 금형 내에서 측정되는 제조데이터가 가장 품질과 직결된 공정변수 정보이며 이는 플라스틱이 사출기와 금형 내부에서 열, 유 동, 압력, 냉각에 의하여 변화하며 금형 내압(Cavity Pressure)의 프로파일에 모든 성형 이력이 저장되고, 이 데이터를 활용하면 성형품의 무게, 형상, 치수 변화, 플래쉬, 싱크마크 등 사출성형의 대표적인 품질문제와 상 관관계가 크므로, 금형 내압 데이터 및 기타 사출 주변기기 데이터를 통합하고 이를 활용하여 사출성형 산업에 특화된 알고리즘 개발을 통하여 이상 상황을 예측하고 대응할 수 있는 최적화 모델 개발에 적용할 수 있다. 즉 사출데이터를 추출하고, 데이터 전처리 후 AI를 활용한 최적 사출 제조조건을 도출할 수 있다. 도 4는 본 발명에 따른 AIoT 기반 첨단 복합소재 사출성형 제조 데이터 최적화를 위한 통합관리 시스템에서 이 용되는 사출제조 설비 데이터 수집 및 제어통합 시스템의 실시예이다. 본 발명에 따른 AIoT 기반 첨단 복합소재 사출성형 제조 데이터 최적화를 위한 통합관리 시스템에서 이용되는 사출제조 설비 데이터 수집 및 제어통합 시스템은 도 4에 나타낸 바와 같은데, 센서나 제어수단 등과 관련된 기 존 사출성형기의 하드웨어 자원은 최대한 활용하면서도 특화된 솔루션을 통해 IT자원의 효율적 기능배분이 이루 어지도록 구성한 것을 특징으로 한다. 이러한 통합관리 시스템은 사출설비인 사출성형기, 에지 클러스터, MQTT(Message Queuing Telemetry Transport) 브로커, 관제서버 및 클라우드 서버를 주요 구성으로 포함하고, 있다. 이때 사출성형기 에는 각종 사출공정 변수를 측정하기 위한 센서부와 외부신호에 따라 공정변수를 제어할 수 있는 제어 부가 구비된다. 그리고 사출성형기와 에지 클러스터는 유선 또는 근거리통신망을 통해 연결되어 있으며, 에지 클러스터, MQTT브로커, 관제서버 및 클라우드 서버는 인터넷 프로토콜을 이용하 여 정보교환이 가능하도록 기능적으로 연결된다. 또한, 도 4에는 구체적으로 도시되어 있지 않지만, 클라우드 서버에는 데이터베이스가 구성되어 해당 데이터베이스에 저장된 누적데이터를 기반으로 기계학습을 통해 최 적모델의 도출을 지원하는 인공지능(AI) 알고리즘이 구비되어 있고, 관제서버에는 생산현장에 설치된 다수 의 사출성형기들을 전체적으로 모니터링할 수 있는 통합 대시보드를 구비하고 있는 것이 그 기술적 특징이 라 할 수 있다. 일반적으로 IoT(Internet of Things) 기술은 센서, 유.무선 통신 및 네트워크 인프라, 서버, HMI(Human Machine Interface) 기술 등을 활용하여 디바이스들 사이에 데이터를 주고받을 수 있도록 지원하는 것을 전제로 한다. 특히 산업현장에 적용되는 IIoT(Industrial Internet of Things)에서는 제조장비로부터 데이터를 수집하 고, 수집된 데이터는 통신망을 통해 서버로 전송되어 데이터 처리과정을 거쳐 의미 있는 출력변수를 도출한 후, 그 출력변수를 활용하여 공정조건을 제어하고 있는데, 최근에는 산업현장의 설비규모가 커지고 원격제어기술이 보편화되면서 제조업체들은 보다 통합적이고 포괄적인 자동화설비에 관심을 갖게 되었고, 그러한 관심은 IIoT에 대한 기술표준을 제정하거나 오픈소스 기반의 다양한 API(Application Programming Interface)의 발표를 촉진 시키는 원동력이 되고 있다.그러한 기술발전 트랜드에 부응하여 도 4에 나타난 본 발명의 통합관리 시스템은 IT자원(Resource)의 기능을 효 율적으로 배분하고, 사용자 친화적인 HMI(Human Machine Interface) 솔루션을 채택함과 동시에 인공지능(AI) 학 습기술의 접목을 통해 보다 지능화된 통합관리 시스템을 제안하는 것이다. 이때, 도 4에 나타낸 사출성형기의 센서부는 다수의 센서들이 구비되어 캐비티, 코어, 핫러너 등의 온 도, 금형의 내부압력, 분사속도, 금형의 온도기울기나 호퍼에 탑재된 성형재료의 습도 등과 같은 공정변수를 측 정하는 기능을 담당하고, 제어부는 관제서버의 제어명령에 따라 가온, 냉각, 승압, 감압, 가속, 감속, 가습, 제습 등의 작동이 이루어지도록 관련 구동수단을 제어하는 기능을 담당한다. 이러한 센서부와 제어 부는 기존의 하드웨어 자원을 최대한 활용할 수 있고, 제어수단 및 센서의 수나 종류도 필요에 따라 공지 의 범용수단을 적절히 선택할 수 있기 때문에 그 기술구성에 특별한 어려움은 없을 것이다. 그리고 에이전트부에는 하나의 에이전트만을 구비할 수도 있지만, 바람직하게는 공정변수와 제어대상의 특 성이나 개수를 고려하여 복수의 에이전트(21, 22)를 구비한 구조로 설계한다. 예를 들어 에이전트 1은 성형조건 에이전트, 에이전트 2는 온도조절 에이전트, 에이전트 3은 풀 프루프(Pool-Proof) 에이전트 등으로 지정하여 그 특성에 맞는 기능을 구현하도록 설계하는 것이 바람직할 것이다. 이러한 복수의 에이전트들은 모듈형태로 제작 하여 개별 에이전트의 기능에 대한 취사선택이 가능하도록 라즈베리파이 기반의 컴퓨터(PC)와 같이 필요에 따라 분해.조립을 지원하는 방식의 구조로 설계하는 것이 바람직할 것이다. 한편 도 5는 첨단 복합소재 활용 예를 나타낸 도면으로, 전기차를 포함하는 차량의 경량화를 위한 복합소재를 도시하고 있다. 각종 첨단부품에서 요구되는 물성을 위해서는 글라스파이버, 카본파이버 등 기존과는 다른 첨 단 복합소재를 사용하게 되고, 기존과는 다른 첨단 복합소재를 사용한 사출성형은 각 제조 방법 복잡도가 매우 높아 기존 제조와는 차이가 존재하게 된다. 제조 현장에서는 현재 상황에 따라 숙련된 기술자의 노하우 기반으로 제조 설정치를 구성하여 제조하는 실태이 고, 이를 평가하기 위한 제조데이터는 아직까지는 전무한 상태이다. 게다가 다양한 환경적 변화요소를 관리해야 하고 빈번한 작업 변경에 따른 설비 세팅 시간 증가에 따라 공정 레시피 관리가 중, 소기업의 경우에는 부실하 기 쉽다. 금형 내측의 제조데이터와 설비 데이터가 상호 연계 분석되어야 하며 이를 기반으로 스마트공장 솔루 션을 고도화하여 고부가가치가 포함된 제조 솔루션을 제공하여야 한다. 첨단 복합소재 금형 내의 압력, 온도 변화에 대한 수집 시스템과 주변 사출기기 연계분석 솔루션은 현재까지 제 시되지 않고 있으며, 대기업의 경우 중소, 중견 기업에 비해 데이터 수집 및 분석과 AI 학습을 통해 생산 효율 을 극대화할 수 있음에 반해, 대부분의 중소, 중견기업들은 초기 투자비용 및 성과불신 등의 이유로 적극적인 투자를 하지 못하는 상황이므로, 중소, 중견기업 실정에 맞는 시스템 개선이 절실하며, 특히, 열악한 중소, 중 견 뿌리산업의 제조기업은 국내 대다수를 차지하고 있음에도 아직 ICT 미적용 상태가 많아, 국내 제조업 전반의 경쟁력 강화를 위한 고도화된 AI기반 제조 분석 시스템 솔루션 필요성이 절실히 요구되므로 본 발명은 해당 솔 루션을 제공하고자 하는 것이다. 도 6은 본 발명에 따른 본 발명에 따른 AIoT 기반 첨단 복합소재 사출성형 제조 데이터 최적화를 위한 통합관리 시스템의 실시예를 설명하기 위한 블록 구성도이다. 본 발명에 따른 본 발명에 따른 AIoT 기반 첨단 복합소재 사출성형 제조 데이터 최적화를 위한 통합관리 시스템 은 도 6에 나타낸 바와 같이, 제1내지 제3사출제조장비(중소기업)(110, 120, 130), 제4내지 제N사출제조장비(중 견기업)(140, 150, 160), 제1내지 제3사출제조장비(중소기업)(110, 120, 130)와 제4내지 제N사출제조장비(중견 기업)(140, 150, 160)에 각각 전기적으로 연결된 산업사물 인터넷(IIOT)들(210, 220, 230, 240, 250. 260)과 사출성형 제조 데이터 통합관리 시스템 서버 및 통신망을 포함하고, 클라우드를 더 포함할 수 있다. 제1내지 제3사출제조장비(중소기업)(110, 120, 130)는 도 4에 도시된 사출성형기와 같은 각종 사출공정 변 수를 측정하기 위한 센서부와 외부신호에 따라 공정변수를 제어할 수 있는 제어부가 포함된 사출제조 장비들로, 서로 다른 이기종의 장비 여러대일 수 있으며, 중소기업에 속하는 기업의 사출제조장비이다. 제4내지 제N사출제조장비(중견기업)(140, 150, 160)는 도 4에 도시된 사출성형기와 같은 각종 사출공정 변 수를 측정하기 위한 센서부와 외부신호에 따라 공정변수를 제어할 수 있는 제어부가 포함된 사출제조 장비들로, 서로 다른 이기종의 장비 여러대일 수 있으며, 중견기업에 속하는 기업의 사출제조장비이다. 산업사물 인터넷(IIOT)들(210, 220, 230, 240, 250. 260)은 각각 제1내지 제3사출제조장비(중소기업)(110, 120, 130)와 제4내지 제N사출제조장비(중견기업)(140, 150, 160)들 각각의 이기종 장비의 제조데이터인 금형 내 부 압력과 온도, 사출설비(사출 성형기 등)에서 발생하는 실행 데이터, 주변 설비에서 발생하는 시계열 데이터 를 수집하여 사출성형 제조 데이터 통합관리 시스템 서버로 전송하고, 사출성형 제조 데이터 통합관리 시 스템 서버에서는 각각의 산업사물 인터넷(IIOT)들(210, 220, 230, 240, 250. 260)로 각각의 제1내지 제3 사출제조장비(중소기업)(110, 120, 130)와 제4내지 제N사출제조장비(중견기업)(140, 150, 160)들로 최적화 알고 리즘 및 첨단 복합소재 사출 현장관리 솔루션을 제공한다. 사출성형 제조 데이터 통합관리 시스템 서버는 산업사물 인터넷(IIOT)들(210, 220, 230, 240, 250. 260) 에서 전송된 제1내지 제3사출제조장비(중소기업)(110, 120, 130)와 제4내지 제N사출제조장비(중견기업)(140, 150, 160)들 각각의 이기종 장비의 제조데이터인 금형 내부 압력과 온도, 사출설비(사출 성형기 등)에서 발생하 는 실행 데이터, 주변 설비에서 발생하는 시계열 데이터를 수집하여 하위 금형 내부 제조데이터 수집 분석, 사 출기기 자동 제어를 위한 최적화 분석을 통한 첨단 복합소재 사출 환경에서의 고도화된 사출제조 제어 플랫폼 구축하고, 수집 분석과 데이터 분석에 기반한 설비 자동제어 연계를 위해 Web, MQTT 기반 데이터 전달이 가능하 도록 구성된 각각의 산업사물 인터넷(IIOT)들(210, 220, 230, 240, 250. 260)를 통해 최적화 알고리즘 및 첨단 복합소재 사출 현장관리 솔루션을 제공한다. 그에 따라 사용자의 편의성 및 실시간성, 데이터 흐름 변화 유연성 등을 확보함은 물론 0.5 ~ 50ms 단위의 데이 터 샘플링 주기를 가지고 두 개 이상의 다채널 처리가 가능하도록 구성된 산업사물 인터넷(IIOT)들(210, 220, 230, 240, 250. 260)를 통해 최소 3개의 특수 사출기기(진공, 가압, 질소)를 대상으로 하여서는 Web 기반 RESTful API를 적용하여 즉각적인 설비 제어가 가능하도록 하였다. 또한 앞에서 설명한 IIoT, Edge Cluster 등을 통해 제조데이터 저장 및 분산처리 플랫폼을 구축하고, 오픈소스 데이터 등을 활용하여 인공지능(AI) 모델이 도출됨에 따라 저장된 데이터를 기반으로 첨단 복합소재 사출 성형 환경에서 AI 분석 기반으로 구체화 된 공정 품질 분석 시스템, 특수 사출 제어 알고리즘 분석서비스 모델을 도 출하여 제공하게 된다. 이에 대하여는 첨부된 도 7을 통해 보다 상세히 설명하기로 한다. 통신망은 유무선 인터넷망으로 데이터 통신이 가능하다면 특별히 한정할 필요는 없는 통신망으로 산업사물 인터넷(IIOT)들(210, 220, 230, 240, 250. 260)과 사출성형 제조 데이터 통합관리 시스템 서버간 통신을 제공한다. 클라우드는 사출성형 제조 데이터 통합관리 시스템 서버에 구축된 AIoT 기반 첨단 복합소재 사출성형 제조 데이터가 별도로 구축되거나, 사출성형 제조 데이터 통합관리 시스템 서버가 클라우드로 구축될 수 있다, 도 7은 도 6에 나타낸 사출성형 제조 데이터 통합관리 시스템 서버의 실시예를 설명하기 위한 블록 구성도이다. 본 발명에 따른 본 발명에 따른 AIoT 기반 첨단 복합소재 사출성형 제조 데이터 최적화를 위한 통합관리 시스템 에서의 사출성형 제조 데이터 통합관리 시스템 서버는 도 7에 나타낸 바와 같이, 통신부, 제조 데이터 수 집부, 제조 데이터 제조사별 분류부, 제조사별 이기종 사출성형/주변기기 데이터 분석부, 제조 사별 이기종 사출성형/주변기기 상관관계 분석부, 사출성형/주변기기 유효인자 도출부, 제조사별 원 격 자동제어 및 사출 제조조건 도출부, 제1 데이터베이스, 제2 데이터베이스 및 제어부를 포함하여 구성되고, 인터페이스부를 더 포함하여 구성될 수 있다. 통신부는 통신망을 통해 산업사물 인터넷(IIOT)들(210, 220, 230, 240, 250. 260)과 사출성형 제조 데이터 통합관리 시스템 서버간 통신을 지원한다. 제조 데이터 수집부는 통신부를 통해 수신된 산업사물 인터넷(IIOT)들(210, 220, 230, 240, 250. 260)으로부터의 제1내지 제3사출제조장비(중소기업)(110, 120, 130)와 제4내지 제N사출제조장비(중견기업)(140, 150, 160)들 각각의 이기종 장비의 제조데이터인 금형 내부 압력과 온도, 사출설비(사출 성형기 등)에서 발생하 는 실행 데이터, 주변 설비에서 발생하는 시계열 데이터를 수집한다. 제조 데이터 제조사별 분류부는 제조 데이터 수집부로부터 수집된 제1내지 제3사출제조장비(중소기업)(110, 120, 130)와 제4내지 제N사출제조장비(중견기업)(140, 150, 160)들 각각의 제 조 데이터를 제조사별로 분류한다. 제조사별 이기종 사출성형/주변기기 데이터 분석부는 제조 데이터 제조사별 분류부에서 분류된 제조 사별 이기종 사출성형/주변기기 데이터를 분석한다. 즉 하나의 제조사로부터도 이기종의 사출성형/주변기기 데이터가 수집 및 분류될 수 있으므로 이를 각각 분석한다. 이때, 수집된 사출 공정 데이터를 활용하여 제조에 영향을 미치는 변수를 분석하여 원자재 변수, 제어 가능한 변수 등의 변수로 분류하여 데이터를 정의하는데 이 용된다. 그리고 이상치 감지(Anomaly detection)를 위한 인공지능 예측모델에 적합하도록 사출 제조 기기별, 주변 기기별, IoT센서 등으로부터 수집되는 설비/공정 상태에 영향을 미치는 공정변수와 설비/공정 상태변수를 분석한다. 제조사별 이기종 사출성형/주변기기 상관관계 분석부는 제조사별 이기종 사출성형/주변기기 데이터 분석부 에서 분석한 이기종의 사출성형/주변기기 데이터의 상관관계를 분석한다. 즉 금형 내에서 측정되는 제조데이터가 가장 품질과 직결된 공정변수 정보인데, 이는 플라스틱이 사출기와 금형 내부에서 열, 유동, 압력, 냉각에 의하여 변화하며 금형 내압(Cavity Pressure)의 프로파일에 모든 성형 이력이 저장되어 있고 이 데이터를 활용하면 성형품의 무게, 형상, 치수 변화, 플래쉬, 싱크마크 등 사출성형의 대표적 인 품질문제와 상관관계가 크므로 정의된 변수와 데이터를 바탕으로 상관관계 분석을 통하여 최적 제조 조건을 도출하기 위하여 후속 연구를 진행할 수 있게 된다. 이때, 이와 같이 센싱된 사출성형 시계열 데이터 분석 방 법론을 연구하게 된다. 즉 세계적 수준의 논문 스터디를 통한 사출성형 분야 산업에 활용된 사례, 최근까지 연 구된 사례를 파악하여 정리하게 되는데, 수집된 데이터에 대한 정의와 상관관계 분석을 통한 탐색적 데이터 분 석을 통한 신뢰성 분석이 필요하므로 먼저 오픈소스 데이터를 활용하여 다양한 실험을 통하여 사출성형에 적합 한 분석방법론 스터디 및 구현을 통한 인공지능 모델 개발할 수 있게 된다. 그리고 실제 사출성형 업종의 데이 터와 AI 오픈소스 데이터(UCI : Machine Learning Repository 등)를 활용하여 이상 징후를 예측할 수 있는 인 공지능 알고리즘 프로토타입 모델에 대한 평가가 가능하다. 사출성형/주변기기 유효인자 도출부는 제조사별 이기종 사출성형/주변기기 상관관계 분석부에서 분석 한 상관관계에 따라 상관관계 분석기반 주요 유효인자를 도출한다. 이때, 현실적용을 위한 인공지능 알고리즘 개발 위하여 사출성형기 대여 등을 통하여 불량품에 대한 이미지 데이터, 센싱 데이터 등을 수집할 수 있는 환 경을 참여기관 즉 데이터를 제공한 제조사들과의 협업을 통하여 도출할 수도 있다. 또한 도출된 유효인자에 따 라 취득된 사출기 제어 변수를 데이터 공유를 위하여 네트워크 서버 시스템을 사출성형 제조 데이터 통합관리 시스템 서버나 클라우드에 구축하는데도 이용된다. 이때 알고리즘 모델 검증의 경우 시계열 데이터를 Train and Test set으로 나누고 5-Fold 교차검증을 하는 방식으로 진행할 수 있으며, 성능지표의 경우 Accuracy(Accuracy = (TP+TN)/(TP+TN+FP+FN)), ROC curve, AUC 등을 활용하고 제품 불량 발생 예측률을 90% 목 표로 하여 세계적인 수준의 제품 이상감지 발생 예측율에 의해 불량 발생을 세계적인 수준으로 낮출 수 있다. 제조사별 원격 자동제어 및 사출 제조조건 도출부는 사출성형/주변기기 유효인자 도출부에서 도출된 유효인자에 따라 제조사별 원격 자동제어 및 사출 제조조건 도출한다. 이와 같이 도출된 제조사별 원격 자동제어 및 사출 제조조건 데이터는 제1내지 제3사출제조장비(중소기업)(110, 120, 130)와 제4내지 제N사출제조장비(중견기업)(140, 150, 160)로부터 데이터를 제공한 제조사들과의 공유를 위하여 사출성형 제조 데이터 통합관리 시스템 서버의 데이터베이스나 클라우드에 구축하여 제 공할 수 있다. 제1 데이터베이스는 제조사별 이기종의 사출성형기기/사출주변기기 정보가 저장된다. 제2 데이터베이스는 제조사별 이기종의 사출성형기기/사출주변기기에서 수집된 데이터, 분류된 데이터, 분 석된 데이터, 상관관계 분서 데이터, 유효인자 및 원격 자동제어 및 사출 제조조건 등이 저장된다. 이를 위한 각각의 수집 데이터 저장부, 분류 데이터 저장부, 분석 데이터 저장부, 상관관계 분석 데이터 저장부, 유효인자 저장부 및 원격 자동제어 및 사출 제조조건 저장부가 구성될 수 있다. 제어부는통신부, 제조 데이터 수집부, 제조 데이터 제조사별 분류부, 제조사별 이기종 사 출성형/주변기기 데이터 분석부, 제조사별 이기종 사출성형/주변기기 상관관계 분석부, 사출성형/주 변기기 유효인자 도출부, 제조사별 원격 자동제어 및 사출 제조조건 도출부, 제1 데이터베이스 및 제2 데이터베이스를 제어한다, 인터페이스부는 사출성형 제조 데이터 통합관리 시스템 서버에 대한 관리자의 접속 등을 위한 것으로, 모니터, 키보드, 프린터 등이 연결된다. 도 8은 본 발명에 따른 본 발명에 따른 AIoT 기반 첨단 복합소재 사출성형 제조 데이터 최적화를 위한 통합관리 방법의 실시예를 설명하기 위한 흐름도이다.본 발명에 따른 본 발명에 따른 AIoT 기반 첨단 복합소재 사출성형 제조 데이터 최적화를 위한 통합관리 방법의 실시예는 도 8에 나타낸 바와 같이, 사출성형 제조 데이터 통합관리 시스템 서버에서는 제1내지 제3사출제 조장비(중소기업)(110, 120, 130)와 제4내지 제N사출제조장비(중견기업)(140, 150, 160)들 각각의 이기종 장비 들의 성형기기나 주변기기의 정보를 수집하여 저장한다(S100). 그리고 사출성형 제조 데이터 통합관리 시스템 서버의 통신부에서는 통신망을 통해 산업사물 인 터넷(IIOT)들(210, 220, 230, 240, 250. 260)로부터 제1내지 제3사출제조장비(중소기업)(110, 120, 130)와 제4 내지 제N사출제조장비(중견기업)(140, 150, 160)들 각각의 이기종 장비의 제조데이터인 금형 내부 압력과 온도, 사출설비(사출 성형기 등)에서 발생하는 실행 데이터, 주변 설비에서 발생하는 시계열 데이터를 전송받고, 제조 데이터 수집부는 전송된 데이터를 수집한다(S110). 사출성형 제조 데이터 통합관리 시스템 서버의 제조 데이터 제조사별 분류부는 제조 데이터 수집부 로부터 수집된 제1내지 제3사출제조장비(중소기업)(110, 120, 130)와 제4내지 제N사출제조장비(중견기 업)(140, 150, 160)들 각각의 제조 데이터를 제조사별로 분류한다(S120). 사출성형 제조 데이터 통합관리 시스템 서버의 제조사별 이기종 사출성형/주변기기 데이터 분석부는 제조 데이터 제조사별 분류부에서 분류된 제조사별 이기종 사출성형/주변기기 데이터를 분석한다(S130). 이때, 하나의 제조사로부터도 이기종의 사출성형/주변기기 데이터가 수집 및 분류될 수 있으므로 이를 각각 분 석하는데, 수집된 사출 공정 데이터를 활용하여 제조에 영향을 미치는 변수를 분석하여 원자재 변수, 제어 가능 한 변수 등의 변수로 분류하여 데이터를 정의하는데 이용된다. 그리고 이상치 감지(Anomaly detection)를 위한 인공지능 예측모델에 적합하도록 사출 제조 기기별, 주변 기기별, IoT센서 등으로부터 수집되는 설비/공정 상태 에 영향을 미치는 공정변수와 설비/공정 상태변수를 분석한다. 사출성형 제조 데이터 통합관리 시스템 서버의 제조사별 이기종 사출성형/주변기기 상관관계 분석부 는 제조사별 이기종 사출성형/주변기기 데이터 분석부에서 분석한 이기종의 사출성형/주변기기 데이터의 상관관계를 분석한다(S140). 사출성형 제조 데이터 통합관리 시스템 서버의 사출성형/주변기기 유효인자 도출부는 제조사별 이기 종 사출성형/주변기기 상관관계 분석부에서 분석한 상관관계에 따라 사출성형/주변기기의 유효인자를 도출 한다(S150). 사출성형 제조 데이터 통합관리 시스템 서버의 제조사별 원격 자동제어 및 사출 제조조건 도출부는 사출성형/주변기기 유효인자 도출부에서 도출된 유효인자에 따라 제조사별 원격 자동제어 및 사출 제조조 건 도출한다(S160). 이와 같이 도출된 제조사별 원격 자동제어 및 사출 제조조건 데이터 역시 제1내지 제3사출 제조장비(중소기업)(110, 120, 130)와 제4내지 제N사출제조장비(중견기업)(140, 150, 160)로부터 데이터를 제공 한 제조사들과의 공유를 위하여 사출성형 제조 데이터 통합관리 시스템 서버의 데이터베이스나 클라 우드에 구축하여 제공할 수 있다(S170). 이상과 같은 예로 본 발명을 설명하였으나, 본 발명은 반드시 이러한 예들에 국한되는 것이 아니고, 본 발명의 기술사상을 벗어나지 않는 범위 내에서 다양하게 변형 실시될 수 있다. 따라서 본 발명에 개시된 예들은 본 발 명의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이고, 이러한 예들에 의하여 본 발명의 기술 사 상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2022-0126498", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 AIoT 기반 첨단 복합소재 사출성형 제조 데이터 최적화를 위한 통합관리 시스템의 플랫 폼을 설명하기 위한 도면, 도 2는 본 발명에 따른 AIoT 기반 첨단 복합소재 사출성형 제조 데이터 최적화를 위한 통합관리 시스템에서 AIoT 기반 사출성형 주변기기 데이터 수집 및 원격 자동제어 서비스를 위한 스마트 공장 개념을 설명하기 위한 도면, 도 3은 본 발명에 따른 AIoT 기반 첨단 복합소재 사출성형 제조 데이터 최적화를 위한 통합관리 시스템에서 사 출성형 제조 AI 분석 알고리즘 서비스를 예시 적으로 설명하기 위한 도면, 도 4는 본 발명에 따른 AIoT 기반 첨단 복합소재 사출성형 제조 데이터 최적화를 위한 통합관리 시스템에서 이 용되는 사출제조 설비 데이터 수집 및 제어통합 시스템의 실시예, 도 5는 첨단 복합소재의 예를 나타낸 도면, 도 6은 본 발명에 따른 본 발명에 따른 AIoT 기반 첨단 복합소재 사출성형 제조 데이터 최적화를 위한 통합관리 시스템의 실시예를 설명하기 위한 블록 구성도, 도 7은 도 6에 나타낸 사출성형 제조 데이터 통합관리 시스템 서버의 실시예를 설명하기 위한 블록 구성도이다. 도 8은 본 발명에 따른 본 발명에 따른 AIoT 기반 첨단 복합소재 사출성형 제조 데이터 최적화를 위한 통합관리방법의 실시예를 설명하기 위한 흐름도이다."}
