{"patent_id": "10-2023-0030300", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0137196", "출원번호": "10-2023-0030300", "발명의 명칭": "화장품 종류별로 제품의 인기순위 및 선호도를 평가하는 인기순위 및 선호도 평가서버 및 그", "출원인": "김정인", "발명자": "김정인"}}
{"patent_id": "10-2023-0030300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "화장품의 종류별로 화장품 제품을 분류하여 등록하는 화장품제품 등록부;등록된 상기 화장품 제품에 대응하는 소비자의 리뷰(review)정보, 평가정보, 설문에 대한 응답정보 중의 적어도하나를 포함하는 반응정보를 수집하는 반응정보 수집부;수집되는 상기 반응정보에 대하여, 화장품의 종류별로 리뷰 수 및 평가수준의 정도에 따라 화장품 제품을 분류하는 화장품제품 분류부; 및분류된 상기 화장품 제품의 리뷰 수 및 평가수준의 정도에 따라 인기순위 및 선호도를 평가하는 인기순위 평가부;를 포함하는 것을 특징으로 하는, 화장품 종류별로 제품의 인기순위 및 선호도를 평가하는 인기순위 및 선호도평가서버."}
{"patent_id": "10-2023-0030300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,고객단말로부터 사용중인 화장품 제품에 대한 제품영상을 포함하는 제품정보를 수신하는 제품정보 수신부; 및상기 제품정보에 대응하는 화장품 제품에 대하여, 상기 고객단말에 대응하는 고객의 반응정보와 수집되는 상기반응정보를 비교하는 반응정보 비교부;를 더 포함하는 것을 특징으로 하는, 화장품 종류별로 제품의 인기순위 및 선호도를 평가하는 인기순위 및 선호도 평가서버."}
{"patent_id": "10-2023-0030300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 고객단말로부터 안면영상을 수신하는 안면영상 수신부;수신되는 상기 안면영상을 수신시점과 함께 저장하는 안면영상 저장부;상기 안면영상 저장부에 기 저장된 안면영상과 상기 안면영상 수신부를 통해 현재 수신되는 안면영상을 비교하며, 비교되는 안면영상들 사이의 피부상태의 변화율을 분석하는 변화율 분석부; 및분석되는 상기 변화율을 상기 고객단말로부터 수신되는 평가정보에 반영하는 변화율 반영부;를 더 포함하는 것을 특징으로 하는, 화장품 종류별로 제품의 인기순위 및 선호도를 평가하는 인기순위 및 선호도 평가서버."}
{"patent_id": "10-2023-0030300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "인기순위 및 선호도 평가서버에 의해 수행되는 인기순위 및 선호도 평가방법에 있어서,화장품의 종류별로 화장품 제품을 분류하여 등록하는 단계;등록된 상기 화장품 제품에 대응하는 소비자의 리뷰정보, 평가정보, 설문에 대한 응답정보 중의 적어도 하나를포함하는 반응정보를 수집하는 단계;수집되는 상기 반응정보에 대하여, 화장품의 종류별로 리뷰 수 및 평가수준의 정도에 따라 화장품 제품을 분류하는 단계; 및분류된 상기 화장품 제품의 리뷰 수 및 평가수준의 정도에 따라 인기순위 및 선호도를 평가하는 단계;공개특허 10-2024-0137196-3-를 포함하는 것을 특징으로 하는, 화장품 종류별로 제품의 인기순위 및 선호도를 평가하는 인기순위 및 선호도평가방법."}
{"patent_id": "10-2023-0030300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,고객단말로부터 사용중인 화장품 제품에 대한 제품영상을 포함하는 제품정보를 수신하는 단계; 및상기 제품정보에 대응하는 화장품 제품에 대하여, 상기 고객단말에 대응하는 고객의 반응정보와 수집되는 상기반응정보를 비교하는 단계;를 더 포함하는 것을 특징으로 하는, 화장품 종류별로 제품의 인기순위 및 선호도를 평가하는 인기순위 및 선호도 평가방법."}
{"patent_id": "10-2023-0030300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 고객단말로부터 안면영상을 수신하는 단계;수신되는 상기 안면영상을 수신시점과 함께 저장하는 단계;기 저장된 안면영상과 현재 수신되는 상기 안면영상을 비교하며, 비교되는 안면영상들 사이의 피부상태의 변화율을 분석하는 단계; 및분석되는 상기 변화율을 상기 고객단말로부터 수신되는 평가정보에 반영하는 단계;를 더 포함하는 것을 특징으로 하는, 화장품 종류별로 제품의 인기순위 및 선호도를 평가하는 인기순위 및 선호도 평가방법."}
{"patent_id": "10-2023-0030300", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "화장품 종류별로 제품의 인기순위 및 선호도를 평가하는 인기순위 및 선호도 평가서버 및 그 인기순위 및 선호도 평가방법이 개시된다. 본 발명에 따른 인기순위 및 선호도 평가서버는, 화장품의 종류별로 화장품 제품을 분류하 여 등록하는 화장품제품 등록부; 등록된 화장품 제품에 대응하는 소비자의 리뷰(review)정보, 평가정보, 설문에 대한 응답정보 중의 적어도 하나를 포함하는 반응정보를 수집하는 반응정보 수집부; 수집되는 반응정보에 대하여, 화장품의 종류별로 리뷰 수 및 평가수준의 정도에 따라 화장품 제품을 분류하는 화장품제품 분류부; 및 분류된 화장품 제품의 리뷰 수 및 평가수준의 정도에 따라 인기순위 및 선호도를 평가하는 인기순위 평가부;를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0030300", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인기순위 및 선호도 평가서버 및 그 인기순위 및 선호도 평가방법에 관한 것으로서, 보다 상세하게는 화장품 종류별로 제품의 인기순위 및 선호도를 평가함으로써 고객이 다양한 종류의 화장품에 대하여 타인들의 반응을 참고하여 자신이 사용하고자 하는 화장품 제품을 선택할 수 있도록 지원할 수 있는, 화장품 종류별로 제 품의 인기순위 및 선호도를 평가하는 인기순위 평가서버 및 그 인기순위 및 선호도 평가방법에 관한 것이다."}
{"patent_id": "10-2023-0030300", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "화장품은 사용자의 미적인 욕구를 충족시키기 위한 제품으로, 역사적으로도 오랜 기간 동안 사용되어 왔다. 특 히, 최근에는 미세먼지, 자외선 등의 환경문제에 대응하여 사용자의 피부 건강을 증진시키기 위한 다양한 제품 들이 개발되면서 여성들뿐만 아니라 남성들에게도 각광을 받고 있다. 한편, 화장품은 화장용도, 화장부위 등에 따라 다양한 제조사에 의해 제조된 화장품 제품이 존재하며, 또한 동 일한 제조사에 의해 제조된 화장품 제품이라도 브랜드(brand), 함유된 성분 및 그 함량 등에 따라 다양한 종류 가 있을 수 있다. 그런데, 이와 같이 화장품은 다양한 종류의 화장품 제품이 있기 때문에 일반적인 고객은 특정의 화장용도, 화장 부위에 대한 화장품 제품을 선택하고자 할 경우에 어떠한 화장품 제품을 선택할지 바로 결정하지 못하고 상당한 시간을 망설이게 되는 문제점이 있다. 선행기술문헌 특허문헌(특허문헌 0001) 공개특허공보 제10-1998-0024052호 (공개일자: 1998.07.06)"}
{"patent_id": "10-2023-0030300", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제점을 해결하기 위하여 창안된 것으로서, 화장품 종류별로 제품의 인기순위 및 선호도를 평가함으로써 고객이 다양한 종류의 화장품에 대하여 타인들의 반응을 참고하여 자신이 사용하고자 하는 화장품 제품을 선택할 수 있도록 지원할 수 있는, 화장품 종류별로 제품의 인기순위 및 선호도를 평가하는 인기순위 평 가서버 및 그 인기순위 및 선호도 평가방법을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2023-0030300", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 목적을 달성하기 위한 본 발명의 일 측면에 따른, 화장품 종류별로 제품의 인기순위 및 선호도를 평가하 는 인기순위 및 선호도 평가서버는, 화장품의 종류별로 화장품 제품을 분류하여 등록하는 화장품제품 등록부; 등록된 상기 화장품 제품에 대응하는 소비자의 리뷰(review)정보, 평가정보, 설문에 대한 응답정보 중의 적어도 하나를 포함하는 반응정보를 수집하는 반응정보 수집부; 수집되는 상기 반응정보에 대하여, 화장품의 종류별로 리뷰 수 및 평가수준의 정도에 따라 화장품 제품을 분류하는 화장품제품 분류부; 및 분류된 상기 화장품 제품의 리뷰 수 및 평가수준의 정도에 따라 인기순위 및 선호도를 평가하는 인기순위 평가부;를 포함하는 것을 특징으 로 한다. 전술한 인기순위 및 선호도 평가서버는, 고객단말로부터 사용중인 화장품 제품에 대한 제품영상을 포함하는 제 품정보를 수신하는 제품정보 수신부; 및 상기 제품정보에 대응하는 화장품 제품에 대하여, 상기 고객단말에 대 응하는 고객의 반응정보와 수집되는 상기 반응정보를 비교하는 반응정보 비교부;를 더 포함할 수 있다. 전술한 인기순위 및 선호도 평가서버는, 상기 고객단말로부터 안면영상을 수신하는 안면영상 수신부; 수신되는 상기 안면영상을 수신시점과 함께 저장하는 안면영상 저장부; 상기 안면영상 저장부에 기 저장된 안면영상과 상 기 안면영상 수신부를 통해 현재 수신되는 안면영상을 비교하며, 비교되는 안면영상들 사이의 피부상태의 변화 율을 분석하는 변화율 분석부; 및 분석되는 상기 변화율을 상기 고객단말로부터 수신되는 평가정보에 반영하는 변화율 반영부;를 더 포함할 수도 있다. 전술한 목적을 달성하기 위한 본 발명의 일 측면에 따른, 화장품 종류별로 제품의 인기순위 및 선호도를 평가하 는 인기순위 및 선호도 평가방법은, 인기순위 및 선호도 평가서버에 의해 수행되는 인기순위 및 선호도 평가방 법에 있어서, 화장품의 종류별로 화장품 제품을 분류하여 등록하는 단계; 등록된 상기 화장품 제품에 대응하는 소비자의 리뷰정보, 평가정보, 설문에 대한 응답정보 중의 적어도 하나를 포함하는 반응정보를 수집하는 단계; 수집되는 상기 반응정보에 대하여, 화장품의 종류별로 리뷰 수 및 평가수준의 정도에 따라 화장품 제품을 분류 하는 단계; 및 분류된 상기 화장품 제품의 리뷰 수 및 평가수준의 정도에 따라 인기순위 및 선호도를 평가하는 단계;를 포함하는 것을 특징으로 한다. 전술한 인기순위 및 선호도 평가방법은, 고객단말로부터 사용중인 화장품 제품에 대한 제품영상을 포함하는 제 품정보를 수신하는 단계; 및 상기 제품정보에 대응하는 화장품 제품에 대하여, 상기 고객단말에 대응하는 고객 의 반응정보와 수집되는 상기 반응정보를 비교하는 단계;를 더 포함할 수 있다. 전술한 인기순위 및 선호도 평가방법은, 상기 고객단말로부터 안면영상을 수신하는 단계; 수신되는 상기 안면영 상을 수신시점과 함께 저장하는 단계; 기 저장된 안면영상과 현재 수신되는 상기 안면영상을 비교하며, 비교되 는 안면영상들 사이의 피부상태의 변화율을 분석하는 단계; 및 분석되는 상기 변화율을 상기 고객단말로부터 수 신되는 평가정보에 반영하는 단계;를 더 포함할 수도 있다."}
{"patent_id": "10-2023-0030300", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 화장품 종류별로 제품의 인기순위 및 선호도를 평가함으로써 고객이 다양한 종류의 화장품에 대하여 타인들의 반응을 참고하여 자신이 사용하고자 하는 화장품 제품을 선택할 수 있도록 지원할 수 있게 된 다."}
{"patent_id": "10-2023-0030300", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 일부 실시 예들을 예시적인 도면을 통해 설명한다. 각 도면의 구성요소들에 참조부호를 기재함 에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 부호로 표시한다. 또한, 본 발명의 실시 예를 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 실시 예에 대한 이해를 방해한다고 판단되는 경우에는 그 상세한 설명은 생략한다. 또한, 본 발명의 실시 예의 구성 요소를 설명하는 데 있어서, 제1, 제2, A, B, (a), (b) 등의 용어를 사용할 수 있다. 이러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소 의 본질이나 차례 또는 순서 등이 한정되지 않는다. 어떤 구성 요소가 다른 구성요소에 \"연결\", \"결합\" 또는 \" 접속\"된다고 기재된 경우, 그 구성 요소는 그 다른 구성요소에 직접적으로 연결, 결합 또는 접속될 수 있지만, 그 구성 요소와 그 다른 구성요소 사이에 또 다른 구성 요소가 \"연결\", \"결합\" 또는 \"접속\"될 수도 있다고 이해 되어야 할 것이다. 도 1은 본 발명의 실시예에 따른 화장품 종류별로 제품의 인기순위 및 선호도를 평가하는 인기순위 및 선호도 평가서버가 적용되는 시스템을 나타낸 도면이다. 도 1을 참조하면, 본 발명의 실시예에 따른 화장품 종류별로 제품의 인기순위 및 선호도를 평가하는 인기순위 및 선호도 평가서버(이하, '인기순위 및 선호도 평가서버'라고도 한다)는 네트워크를 통하여 고객단말 , 쇼핑몰 서버, 제조업체 서버 등과 연결될 수 있다. 여기서, 네트워크는 인터넷뿐만 아니라 CDMA(Code Division Multiple Access), WCDMA(Wideband CDMA), LTE(Long Term Evolution), 5G(5th Generation) 등의 이동통신망을 포함하는 광의의 개념으로 정의한다. 또한, 고객단말은 현재의 피부상태 판단 서비스를 제공받고자 하는 고객의 단말기로서, 네트워크 통신이 가 능한 컴퓨터뿐만 아니라 노트북, 스마트 폰(smart phone) 등의 이동통신단말을 포함한다. 여기서, 고객은 현재의 피부상태 판단 서비스를 제공하는 대상으로서, 특정 화장품 제품에 대한 리뷰(review)정 보, 평가정보 등의 수집대상으로서의 '사용자'와 구분한다. 쇼핑몰 서버는 다양한 종류의 화장품 제품을 판매하는 백화점, 판매매장, 중개업자 등에 각각 대응하는 서 버이며, 제조업체 서버는 화장품 제품을 제조하는 다양한 화장품 제조업체의 서버로서, 각각 판매 또는 제 조되는 화장품에 대한 제품소개, 사용자의 리뷰정보 또는 평가정보의 수집, 설문조사 및 그에 대한 응답정보의 집계 등을 수행할 수 있다. 여기서, 리뷰정보는 사용자가 사용한 화장품 제품에 대한 사용자 의견으로서, 댓글 의 형식으로 이루어질 수 있다. 또한, 평가정보는 사용자가 사용한 화장품 제품에 대하여 사용자가 직접적으로 평가한 점수, 별의 개수 등으로 이루어질 수 있다. 인기순위 및 선호도 평가서버는 쇼핑몰 서버 및 제조업체 서버로부터 판매 또는 제조되는 각각의 화장품 제품에 대한 제조사, 브랜드(brand), 성분, 효과 등의 정보를 수집하며, 각각의 화장품 제품에 대응하여사용자들이 작성한 리뷰정보 및 평가정보를 수집할 수 있다. 또한, 인기순위 및 선호도 평가서버는 고객단말로부터 고객의 안면영상, 고객이 사용하는 화장품 제품 에 대한 제품영상을 포함하는 제품정보, 고객이 사용하는 화장품 제품에 대한 평가정보 등을 수신하며, 고객의 현재의 피부상태와 시간의 경과에 따른 고객의 피부상태의 변화정도를 판단할 수 있다. 이때, 인기순위 및 선호도 평가서버는 도 2에 도시한 바와 같이, 여드름, 모공, 기미, 주름, 건조상태 등 의 피부항목에 따라 다양한 단계로 분류된 피부타입의 분류체계와, 얼굴형, 이마, 눈, 코, 광대, 턱 등의 크기, 넓이, 높낮이, 피부색상 등에 따라 다양한 단계로 분류된 메이크업의 분류체계를 데이터베이스로 저장하며, 고 객단말로부터 수신되는 고객의 안면영상에 대응하여 고객의 피부타입이 어느 단계의 분류체계에 속하는지 그리고 고객의 안면영상에 대응하는 메이크업 스타일을 분석하고, 고객의 피부타입에 최적인 화장품 제품, 고객 이 선호하는 연예인 등과 피부타입을 유사하게 하기 위한 메이크업 스타일 등을 판단할 수 있다. 또한, 인기순위 및 선호도 평가서버는 고객이 사용하는 화장품 제품과 동일한 화장품 제품을 사용하는 사 용자들의 해당 화장품 제품에 대한 리뷰정보, 평가정보, 설문에 대한 응답정보 등의 반응정보 중 고객의 피부타 입과 동일 또는 유사한 피부타입의 사용자들의 반응정보에 기반하여, 고객이 현재 사용하고 있는 화장품 제품에 대한 효과를 예측할 수 있다. 또한, 인기순위 및 선호도 평가서버는 시간의 경과에 따라 고객의 안면영상에서 여드름, 모공, 기미, 주름, 건조상태 등이 어느 정도로 변화하였는지를 분석하며, 분석되는 변화정도를 고객단말에 제공함으로써, 고객이 자신의 피부상태의 변화정도를 일간, 주간, 월간 등의 일정한 시간간격의 단위로 인식하 고 관리할 수 있도록 할 수 있다. 또한, 인기순위 및 선호도 평가서버는 고객이 사용한 화장품 제품에 대한 제품정보, 해당 화장품 제품에 대한 고객의 만족이나 불만, 추천 등의 고객의견 또는 평가정보를 포함하는 반응정보와, 해당 화장품 제품에 대 하여 네트워크를 통해 수집한 사용자의 반응정보를 비교할 수 있다. 또한, 인기순위 및 선호도 평가서버는 다양한 종류의 화장품 제품에 대한 사용자들의 리뷰정보, 평가정보, 설문에 대한 응답정보 등의 반응정보에 대하여 리뷰 수, 평가수준의 정도 등에 따라 화장품 종류별로 인기순위 및 선호도를 평가할 수 있다. 또한, 인기순위 및 선호도 평가서버는 고객이 사용하는 화장품 제품에 대한 성분 및 효과가 고객의 피부타 입과 일치하는지를 판단하며, 고객의 피부타입과 유사한 피부타입의 사용자들이 선호하는 화장품 제품 또는 고 객의 피부타입에 가장 좋은 성분을 포함하는 화장품 제품 등을 분석하고, 분석된 결과를 고객에게 피드백 (feedback) 정보로 제공할 수 있다. 이 경우, 인기순위 및 선호도 평가서버는 인공지능 알고리즘을 이용하여 고객으로부터 수신되는 안면영상, 제품정보 등을 학습하며, 학습되는 안면영상, 제품정보 등을 기존의 분류체계 데이터베이스에 반영하고, 전술한 바와 같이 피부타입의 분석, 메이크업 스타일의 분석, 화장품 제품에 대한 반응정보의 비교 등을 수행할 수 있 다. 이와 같은 방식의 인공지능 알고리즘은 공지된 인공지능 알고리즘을 응용할 수 있으며, 여기서는 구체적인 방법은 그 설명을 생략한다. 도 3은 본 발명의 실시예에 따른 인기순위 및 선호도 평가서버의 구성을 개략적으로 도시한 도면이다. 도 3을 참조하면, 본 발명의 실시예에 따른 인기순위 및 선호도 평가서버는 화장품제품 등록부, 성분 효과 저장부, 피부타입 저장부, 화장성분 저장부, 메이크업 저장부, 안면영상 수신부 , 안면영상 저장부, 지정기간 수신부, 안면영상 추출부, 제품정보 수신부, 반응정보 수집부, 반응정보 저장부, 반응정보 반영부, 화장위치 수신부, 화장품제품 분류부, 인기순위 평가부, 화장품제품 추출부, 안면정보 분석부, 피부항목 분석부, 피부타입 검색 부, 화장성분 검색부, 피부타입 판단부, 메이크업 검색부, 메이크업 판단부, 변화율 분석부, 변화율 반영부, 변화정보 제공부, 반응정보 추출부, 반응정보 비교부, 반응 정보 그룹화부, 화장품효과 예측부, 그룹 검색부, 그룹내 분류부, 화장품제품 추천부 및 메이크업 추천부를 포함할 수 있다. 화장품제품 등록부는 화장품의 종류별로 화장품 제품을 분류하여 등록한다. 이때, 화장품제품 등록부(10 2)는 설정된 주기로 네트워크를 통해 다양한 화장품 제품을 판매 또는 제조하는 쇼핑몰 서버 및 제조업 체 서버를 조회하며, 각각의 쇼핑몰 서버 또는 제조업체 서버로부터 새로 출시 또는 판매되는 화장품 제품을 조회하여 기존의 등록된 화장품 제품을 갱신할 수 있다. 화장품은 종류별로 다양하게 분류될 수 있다. 예를 들어, 기본적으로 사용되는 화장품의 종류로는 기초화장품, 메이크업 화장품, 모발 화장품, 방향 화장품(향수), 바디 화장품, 기능성 화장품, 네일 화장품 등으로 분류될 수 있다. 또한, 기초화장품은 세안용 화장품, 화장수, 로션(유액), 크림, 에센스, 팩, 마스크 등으로 분류될 수 있으며, 메이크업 화장품은 베이스 메이크업(메이크업 베이스, 파운데이션, 파우더 등), 포인트 메이크업(립스 틱, 아이섀도우 등)으로 분류될 수 있다. 또한, 모발 화장품은 세정(샴푸, 린스), 트리트먼트(헤어크림, 헤어팩, 헤어코트 등), 정발(헤어오일, 헤어로션, 스프레이, 젤 등), 퍼머넌트웨이브로션, 염색제, 육모, 제모 등으로 분류될 수 있으며, 방향 화장품은 퍼퓸(15~30%), 오데퍼퓸(9~12%), 오데토일렛(6~8%), 오데코롱(3~5%), 샤워코롱(1~3%)로 분류될 수 있다. 또한, 바디 화장품은 세정(비누, 바디클렌저 등), 보습(바디로션, 오일, 바 디크림, 핸드크림 등), 각질제거(바디스크럽, 바디솔트 등), 선탠제, 체취방지제 등으로 분류될 수 있으며, 기 능성 화장품은 미백화장품(알부틴, 코직산, 비타민C, AHA 등), 주름개선 화장품(레티놀, 아데노신, 항산화제 등), 자외선차단 화장품(산란제, 흡수제 등)으로 분류될 수 있고, 네일 화장품은 큐티클 리부버(큐티클 오일), 플리시, 안티셉틱(손소독 화장품), 젤글루 등으로 분류될 수 있다. 그러나, 여기에 기재된 화장품의 종류 및 각 각의 화장품 종류에 대응하는 화장품 제품의 분류는 발명의 이해를 돕기 위한 예시일 뿐이며, 화장품제품 등록 부는 동일한 화장품 종류에 대해서 제조사, 브랜드, 함유된 성분 및 함유량 등에 따라 다양한 화장품 제품 을 분류하여 등록할 수도 있다. 성분효과 저장부는 화장품제품 등록부에 등록된 각각의 화장품 제품에 대응하는 성분 및 효과를 분류 하여 저장한다. 즉, 동일한 종류의 화장품이라도 제조사, 브랜드 등에 따라 각각의 화장품 제품의 성분 및 효과 는 다를 수 있으며, 또한 동일한 제조사 및 브랜드인 경우에도 함유된 성분의 함량 및 효과에 따라 복수의 화장 품 제품이 있을 수 있다. 이 경우, 성분효과 저장부는 각각의 화장품 제품에 대응하는 성분 및 효과를 분 류하여 저장한다. 피부타입 저장부는 여드름, 모공, 기미, 주름, 건조상태를 포함하는 피부항목에 따라 피부타입을 분류하여 저장한다. 이때, 피부타입 저장부는 얼굴의 범위 내에서 여드름, 모공, 기미, 주름, 건조 등의 각각의 피 부항목이 차지하는 범위에 따라 피부타입을 다양하게 분류하여 저장할 수 있다. 예를 들어, 피부타입 저장부 는 얼굴의 범위 내에서 여드름의 피부항목이 차지하는 비율이 0~20%, 20~40%, 40~60%, 60~80%, 80~100%인 지에 따라 피부타입을 복수의 단계로 분류하여 저장할 수 있다. 또한, 피부타입 저장부는 피부 내의 수분 의 함량에 따라 건조상태의 피부항목을 0~20%, 20~40%, 40~60%, 60~80%, 80~100%의 다섯 단계로 분류하여 저장 할 수 있다. 이와 같이, 피부타입 저장부는 여드름, 모공, 기미, 주름, 건조 등의 각각의 피부항목의 개수, 각각의 피부항목이 분류된 단계의 수 등에 기반하여 다양한 수의 피부타입을 분류하여 저장할 수 있다. 예를 들어, 전술한 예와 같이 각각의 피부항목의 개수가 5개이며, 각각의 항목이 모두 5개의 단계로 분류된 경 우, 피부타입 저장부는 5x5x5x5x5=3,125개의 피부타입을 분류하여 저장할 수 있다. 그러나, 여기에 기재하 는 분류된 피부타입의 개수는 발명의 이해를 돕기 위한 예일 뿐이며, 피부타입 저장부는 다양한 개수의 피 부타입을 분류하여 저장할 수 있다. 화장성분 저장부는 피부타입 저장부에 저장된 각각의 피부타입에 대응하여, 요구되는 화장성분을 저 장한다. 예를 들어, 화장성분 저장부는 여드름이 20~40%인 피부타입의 경우에 해당 여드름을 제거하기 위 해 필요한 화장성분을 저장할 수 있다. 또한, 화장성분 저장부는 복수의 피부항목이 복합적으로 섞인 피부 타입의 경우에 각각의 피부항목들 사이의 비율에 따라, 각각의 피부항목에 대응하여 필요한 화장성분들의 비율 을 함께 저장할 수도 있다. 예를 들어, 화장성분 저장부는 여드름이 20~40%이며, 기미가 40~60%인 피부타 입에 대응하여 여드름 제거를 위해 필요한 화장성분 대비 기미 제거를 위해 필요한 화장성분이 1:2 내지 1:3인 화장성분의 비율을 함께 저장할 수 있다. 메이크업 저장부는 얼굴형, 피부색상, 피부명도, 피부타입, 화장위치를 포함하는 항목에 따라 바람직한 메 이크업 스타일을 분류하여 저장한다. 이때, 메이크업 저장부는 고객의 얼굴형, 피부색상 및 피부명도를 각 각 복수의 얼굴형상, 복수의 피부색상 및 복수의 피부명도로 분류하며, 분류된 각각의 얼굴형상, 피부색상 및 피부명도에 따라 서로 다른 메이크업 스타일을 저장할 수 있다. 또한, 메이크업 저장부는 고객의 안면영상 으로부터 분석된 이마, 눈, 코, 광대, 턱 등의 굴곡, 넓이, 높낮이 등의 각각의 단계에 따라 서로 다른 메이크 업 스타일을 분류하여 저장할 수 있다. 또한, 메이크업 저장부는 피부타입 저장부에 분류되어 저장된 각각의 피부타입에 대응하여 서로 다른 메이크업 스타일을 분류하여 저장할 수 있다. 또한, 메이크업 저장부 는 얼굴 중의 메이크업을 수행하는 눈, 코, 눈썹, 뺨 등의 위치에 따라 서로 다른 메이크업 스타일을 분류 하여 저장할 수도 있다. 이때, 메이크업 저장부는 얼굴형, 피부색상 및 피부명도의 각각의 분류된 단계 수와, 메이크업 위치의 종류와, 피부타입 저장부에 분류되어 저장된 피부타입의 수에 따라 메이크업 스타일 의 분류쳬계를 분류하여 저장할 수 있다. 예를 들어, 메이크업 저장부는 얼굴형, 피부색상 및 피부명도의 각각의 분류된 단계 수가 3단계이며, 메이크업 위치의 종류가 3개이고, 피부타입 저장부에 분류되어 저장 된 피부타입의 수가 125개인 경우, 3x3x3x3x125=10,125개의 메이크업 스타일의 분류체계로 분류하여 저장할 수 있다. 안면영상 수신부는 네트워크를 통하여 고객단말로부터 안면영상을 수신한다. 이때, 고객단말 은 본 발명의 실시예에 따른 메이크업 추천서버로부터 제공된 어플리케이션을 설치하고 있으며, 설치된 어 플리케이션을 이용하여 도 4에 도시한 바와 같이, 고객단말의 카메라(도시하지 않음)를 통해 안면영상을 촬 영할 수 있다. 안면영상 저장부는 안면영상 수신부를 통해 수신되는 안면영상을 그 수신시점과 함께 저장한다. 이때, 안면영상 저장부는 안면영상 수신부를 통해 수신되는 안면영상이 이하에서 설명하는 방법에 따 라 그 피부타입이 검색되면, 검색되는 피부타입을 함께 저장할 수도 있다. 이 경우, 안면영상 저장부는 고 객별로 안면영상, 수신시점 및 피부타입을 매칭시켜 저장하는 것이 바람직하다. 지정기간 수신부는 고객단말로부터 지정기간을 수신할 수 있다. 즉, 고객단말은 설치된 어플리케 이션을 이용하여 일일, 일주일, 한달 등의 지정기간을 설정할 수 있으며, 이 경우, 지정기간 수신부는 고 객단말에 의해 설정된 지정기간을 수신한다. 안면영상 추출부는 안면영상 저장부에 저장된 안면영상 중 현재로부터 지정기간에 대응하는 수신시점 의 안면영상을 추출한다. 즉, 안면영상 추출부는 안면영상 저장부에 저장된 고객의 안면영상 중 현재 의 시점으로부터 역으로 고객단말에 의해 설정된 지정기간 내의 고객의 안면영상을 추출한다. 제품정보 수신부는 고객단말로부터 고객이 사용하는 화장품 제품에 대한 제품영상을 포함하는 제품정 보를 수신한다. 이때, 제품정보 수신부는 도 5에 도시한 바와 같이, 화장품의 바코드, 식별코드 등을 포함 하는 제품식별정보를 제품영상으로 수신할 수 있다. 이 경우, 제품정보 수신부는 고객단말로부터 고객 이 현재 사용하고 있는 화장품의 제품에 대한 제품영상을 수신하는 것이 바람직하다. 반응정보 수집부는 화장품제품 등록부에 등록된 각각의 화장품 제품에 대응하여 사용자의 리뷰정보 및 평가정보 중의 적어도 하나를 포함하는 반응정보를 수집한다. 이때, 반응정보 수집부는 네트워크를 통해 설정된 주기로 쇼핑몰 서버 및 제조업체 서버를 조회하며, 쇼핑몰 서버 및 제조업체 서버(4 0)에 각각의 화장품 제품에 대응하여 등록된 사용자의 리뷰정보 또는 평가정보를 수집할 수 있다. 또한, 반응정 보 수집부는 고객단말로부터 수신되는 제품영상에 대응하여, 해당 제품영상에 대응하는 화장품 제품에 대한 설문을 제공하고, 고객단말로부터 해당 설문에 대한 응답정보를 반응정보로 수집할 수 있다. 이 경우, 응답정보는 화장품 제품에 대한 리뷰정보 또는 평가정보를 포함할 수 있다. 반응정보 저장부는 반응정보 수집부를 통해 수집되는 반응정보를 화장품 제품에 대응하여 저장한다. 이때, 반응정보 저장부는 각각의 화장품 제품에 대응하여 리뷰정보와 평가정보를 분류하여 저장할 수 있다. 반응정보 반영부는 주기적으로 수집되는 각각의 화장품 제품에 대한 반응정보를 반응정보 저장부에 저장된 반응정보에 반영한다. 이때, 반응정보 반영부는 반응정보 저장부에 저장된 각각의 화장품 종 류별 화장품 제품들의 리뷰정보의 수, 평가정보의 평균값을 산출하며, 새롭게 수집되는 반응정보를 기 산출된 리뷰정보의 수, 평가정보의 평균값에 반영하여 갱신할 수 있다. 화장위치 수신부는 고객단말로부터 고객이 화장을 실행하고자 하는 화장위치를 수신한다. 즉, 고객단 말은 설치된 어플리케이션을 이용하여 눈 화장, 뺨 화장 등의 특정 메뉴를 선택할 수 있으며, 화장위치 수 신부는 고객단말에 의해 선택된 선택메뉴에 대응하여 화장위치를 수신할 수 있다. 화장품제품 분류부는 반응정보 수집부에 의해 수집되는 반응정보에 대하여, 화장품의 종류별로 각각 의 화장품 제품의 리뷰정보의 수와 평가수준의 정도에 따라 각각의 화장품 제품을 분류한다. 이때, 화장품제품 분류부는 동일한 화장품 종류 내의 다양한 화장품 제품에 대하여 리뷰정보의 수가 많은 순서에 따라 화장 품 제품을 분류하거나, 평가정보가 높은 순서로부터 각각의 화장품 제품을 분류할 수 있다. 또한, 화장품제품 분류부는 화장품 제품에 대한 각각의 리뷰정보에서 긍정과 부정으로 각각 설정된 키워드를 검색하며, 검색 되는 키워드들의 수가 긍정인지 또는 부정인지를 평가하여 평가점수에 반영할 수도 있다.인기순위 평가부는 화장품제품 분류부에 의해 분류된 화장품 제품의 리뷰정보의 수 및 평가수준의 정 도에 따라 각각의 화장품 제품에 대한 인기순위 및 선호도를 평가한다. 이때, 인기순위 평가부는 각각의 화장품 제품에 대응하는 리뷰정보의 수와 해당 리뷰정보에 긍정의 키워드가 많은지 또는 부정의 키워드가 많은 지에 따라 서로 다른 가중치를 부여하며, 각각의 화장품 제품에 대한 평가점수의 평균값에 리뷰정보의 수에 따 라 가중치가 반영된 종합점수를 산출하고, 그에 따라 각각의 화장품 제품을 종합점수가 높은 순서로부터 나열하 여 인기순위 및 선호도를 평가할 수 있다. 화장품제품 추출부는 화장품제품 등록부에 등록된 화장품 제품 중 화장위치 수신부에 의해 수신 되는 화장위치에 대응하는 화장품 종류의 화장품 제품을 추출한다. 이때, 화장품제품 추출부는 화장품제품 등록부에 등록된 다양한 종류의 화장품에서 화장위치 수신부에 의해 수신되는 화장위치에 따라 동일 한 화장품의 종류이지만 제조사, 브랜드, 함유된 성분 또는 함량 등이 서로 다른 다양한 화장품 제품들을 추출 할 수 있다. 안면정보 분석부는 고객단말로부터 수신되는 안면영상에 대하여 얼굴형, 피부색상, 피부명도 등을 포 함하는 안면정보를 분석한다. 이때, 안면정보 분석부는 고객단말로부터 수신되는 안면영상에 대하여 도 6에 도시한 바와 같이, 얼굴형, 눈, 코, 입 등의 특징점을 분석하며, 분석되는 특정점에 기반하여 고객의 안 면영상의 얼굴형 대비 눈, 코, 입, 눈썹 등의 비율과 각각의 위치 등을 분석할 수 있다. 또한, 안면정보 분석부 는 판단되는 얼굴형과, 눈, 코, 입, 눈썹 등의 크기, 위치 등에 기반하여 안면에서의 공간비율을 분석할 수 있다. 또한, 안면정보 분석부는 영상으로부터 깊이 정보를 분석하는 알고리즘을 이용하여 안면영상 내 에 굴곡이 발생할 수 있는 코와 뺨의 경계위치, 코의 높낮이, 이마, 광대, 아래턱, 양쪽 턱 등의 넓이, 높낮이 등을 분석할 수 있다. 안면영상으로부터 얼굴형과, 눈, 코, 입, 눈썹 등의 크기 및 위치, 안면에서의 공간비율 등을 판단하는 방법은 공지된 안면 인식기술을 이용할 수 있으며, 그 기술적 내용은 발명의 논지를 벗어나는 것 이므로, 여기서는 그 상세한 설명을 생략한다. 또한, 영상으로부터 깊이 정보를 분석하는 알고리즘은 공지된 기 술을 이용할 수 있으며, 그 기술적 내용은 발명의 논지를 벗어나는 것이므로, 여기서는 그 구체적인 설명을 생 략한다. 또한, 안면정보 분석부는 고객단말로부터 수신되는 안면영상에 대한 색 좌표값을 조회하며, 조회되는 색 좌표값에 기반하여 안면영상의 피부색상과 피부명도를 분석할 수 있다. 피부항목 분석부는 고객단말로부터 수신되는 안면영상에 대하여 여드름, 모공, 기미, 주름상태를 포함 하는 피부항목을 분석한다. 이때, 피부항목 분석부는 도 7에 도시한 바와 같이, 안면영상의 얼굴형 대비 여드름, 기미, 주름 등이 차지하는 비율을 분석할 수 있다. 또한, 피부항목 분석부는 얼굴형 대비 모공의 크기를 분석할 수 있으며, 안면영상의 색 좌표값에 기반하여 수분이 어느 정도 함유되었는지를 판단하여 건조상 태를 분석할 수 있다. 피부타입 검색부는 피부타입 저장부에 저장된 피부타입 중 고객단말로부터 수신되는 안면영상에 대응하는 피부타입을 검색한다. 이때, 피부타입 검색부는 피부항목 분석부에 의해 분석되는 여드름, 모공, 기미, 주름, 건조상태 등의 각각의 항목에 기반하여 안면영상의 피부상태를 판단하고, 피부타입 저장부 로부터 대응하는 피부타입을 검색할 수 있다. 또한, 피부타입 검색부는 고객의 안면영상의 얼굴형, 눈, 코, 입, 눈썹 등의 안면에 대한 비율 및 위치, 및 안면에서의 공간비율에 기반하여, 안면영상에 대응하는 안면 내에서 여드름, 모공, 기미, 주름, 건조상태 등의 각각의 항목이 차지하는 비율을 판단하며, 판단되는 각 각의 항목에 대한 비율을 종합하여 해당 안면영상에 대한 피부상태를 판단하고, 그에 대응하는 피부타입을 검색 할 수도 있다. 화장성분 검색부는 화장성분 저장부에 저장된 각각의 피부타입에 대응하는 화장성분 중 피부타입 검 색부에 의해 검색되는 피부타입의 화장성분을 검색한다. 즉, 화장성분 검색부는 피부타입 저장부 에 저장된 각각의 피부타입에 대응하여 저장된 화장성분 중 수신되는 안면영상에 해당하는 피부타입의 화 장성분을 검색한다. 피부타입 판단부는 피부타입 검색부에 의해 검색되는 피부타입을 고객단말에 대응하는 고객의 현 재의 피부타입으로 판단한다. 즉, 고객단말에 대응하는 고객의 피부타입은 사용하는 화장품 제품에 의해 변 화될 수 있으므로, 피부타입 판단부는 고객단말로부터 현재 수신되는 안면영상에 대응하여 고객의 현 재의 피부상태를 판단한다. 메이크업 검색부는 메이크업 저장부에 저장된 메이크업 스타일 중 고객단말로부터 수신되는 안면 영상 및 피부타입 검색부에 의해 검색되는 피부타입에 대응하는 메이크업 스타일을 검색한다. 이때, 메이 크업 검색부는 고객이 실행하고자 하는 화장위치에 따라 메이크업 스타일을 검색할 수 있다. 예를 들어,고객이 뺨의 메이크업을 실행하고자 하는 경우, 메이크업 검색부는 피부타입 검색부에 의해 검색되는 안면영상 중의 뺨의 피부타입에 대응하는 메이크업 스타일을 검색할 수 있다. 한편, 메이크업 검색부는 고객단말로부터 고객이 원하는 연예인, 모델, 인플루엔서(influencer) 등의 기준인물에 대한 안면이미지를 수신할 수 있다. 이 경우, 메이크업 검색부는 기준인물 안면이미지에 대응 하는 메이크업 스타일을 검색하며, 고객의 안면영상에 대응하는 메이크업 스타일과 기준인물의 안면이미지에 대 응하는 메이크업 스타일의 차이에 기반하여 고객이 희망하는 메이크업 스타일을 판단할 수 있다. 예를 들어, 고 객의 안면영상에 대응하는 메이크업 스타일이 전체 100단계로 분류된 메이크업 스타일 중 50번째 단계에 해당하 며, 기준인물의 안면이미지에 대응하는 메이크업 스타일이 20번째 단계에 해당한다면, 메이크업 검색부는 고객이 해당하는 단계로부터 기준인물에 해당하는 단계의 방향으로 이동할 수 있는 메이크업 스타일을 검색할 수 있다. 다만, 여기서는 메이크업 스타일의 분류체계가 순차적으로 분류된 것으로 설명하였지만, 메이크업 스 타일의 분류체계는 피부타입, 얼굴형, 피부색상, 피부명도, 굴곡, 높낮이 등의 각각의 단계에 따라 복합적으로 분류되는 것으로서, 각각의 항목은 순차적인 분류가 가능하더라도 각각의 항목을 종합한 전체적인 메이크업 스 타일의 분류체계는 순차적으로 나열할 수 없다. 메이크업 판단부는 메이크업 검색부에 의해 검색되는 메이크업 스타일을 고객단말에 대응하는 고 객의 현재의 메이크업 스타일로 판단한다. 이때, 메이크업 스타일은 고객의 피부상태에 따라 달라질 수 있으며, 고객의 피부상태는 고객이 사용하는 화장품 제품에 따라 변화될 수 있으므로, 메이크업 판단부는 고객단말 로부터 현재 수신되는 안면영상에 대응하여 고객의 현재의 메이크업 스타일을 판단한다. 여기서, 메이크업 판단부는 현재의 고객의 피부상태에 따라 가장 바람직한 메이크업 스타일을 판단할 수 있다. 변화율 분석부는 안면영상 저장부에 기 저장된 안면영상과, 안면영상 수신부를 통해 현재 수신 되는 안면영상을 비교한다. 이때, 변화율 분석부는 고객에 의해 지정된 지정기간에 기반하여 현재로부터 지정기간 이전의 안면영상과, 현재의 안면영상을 비교할 수 있다. 이 경우, 변화율 분석부는 이전의 안면 영상과 현재의 안면영상을 비교하여 여드름, 모공, 기미, 주름, 건조상태 등의 피부상태의 변화율을 분석할 수 있다. 즉, 변화율 분석부는 안면영상 저장부에 기 저장된 안면영상에 대응하는 피부타입과, 안면영상 수신 부를 통해 현재 수신되는 안면영상에 대응하는 피부타입을 비교한다. 또한, 변화율 분석부는 비교되 는 피부타입들 사이의 변화상태의 변화율을 분석한다. 예를 들어, 변화율 분석부는 일주일 전의 안면영상 에 대응하는 피부타입과 현재의 안면영상에 대응하는 피부타입을 비교하며, 일주일 전의 안면영상의 여드름의 비율 대비 현재의 안면영상의 여드름의 비율이 어느 정도 개선 또는 악화되었는지를 분석할 수 있다. 이때, 변 화율 분석부는 지정기간 수신부를 통해 수신되는 지정기간에 대응하여, 현재의 안면영상의 피부타입 과 이전의 안면영상의 피부타입의 변화율을 분석할 수 있다. 변화율 반영부는 변화율 분석부에 의해 분석되는 변화율을 고객단말로부터 수신되는 평가정보에 반영한다. 이때, 변화율 반영부는 고객이 직접 작성한 평가정보에 대하여, 변화율의 정도에 따라 서로 다 른 가중치를 부여하고, 부여된 가중치를 평가정보에 승산할 수 있다. 변화정보 제공부는 변화율 분석부에 의해 분석되는 피부상태의 변화율을 고객단말에 제공한다. 이때, 변화정보 제공부는 기 저장된 안면영상의 수신시점과 고객단말로부터 현재 수신되는 안면영상의 수신시점 사이의 시간간격에 대해, 변화율 분석부에 의해 분석되는 피부상태의 변화율을 고객단말에 제공할 수 있다. 즉, 변화정보 제공부는 이전의 안면영상과 현재의 안면영상 사이의 시간간격 사이에 피부 상태가 어느 정도 변화하였는지에 대한 피부상태의 변화율을 고객단말에 제공할 수 있다. 또한, 변화정보 제공 부는 고객에 의해 지정된 지정기간에 따라, 변화율 분석부에 의해 분석되는 피부상태의 변화율을 주 기적으로 고객단말에 제공할 수 있다. 이를 통해, 고객은 지정된 지정기간의 시간간격 단위로 피부타입이 어느 정도 개선 또는 악화되었는지를 주기적으로 파악할 수 있게 된다. 반응정보 추출부는 반응정보 수집부를 통해 수집되는 반응정보 중 고객의 피부타입과 동일 또는 유사 한 피부타입의 사용자들로부터 수집된 반응정보를 추출한다. 즉, 반응정보 추출부는 반응정보 수집부(12 2)에 의해 수집되는 다양한 화장품 제품에 대한 리뷰정보 및 평가정보 중에서 고객단말에 대응하는 고객과 동일 또는 유사한 피부타입의 사용자들이 작성한 리뷰정보 및 평가정보를 추출한다. 또한, 반응정보 추출부는 반응정보 수집부를 통해 수집되는 반응정보 중 고객이 현재 사용하고 있는 화장품 제품에 대한 반응정보를 추출할 수도 있다. 즉, 반응정보 추출부는 반응정보 수집부에 의해수집되는 다양한 화장품 제품에 대한 리뷰정보 및 평가정보 중에서 고객이 현재 사용하고 있는 화장품 제품과 동일한 화장품 제품에 대한 리뷰정보 및 평가정보를 추출할 수 있다. 반응정보 비교부는 반응정보 수집부를 통해 수집되는 반응정보 중 고객의 피부타입과 동일 또는 유사 한 피부타입의 사용자들로부터 수집된 반응정보와, 반응정보 수집부를 통해 수집되는 반응정보 중 고객이 현재 사용하고 있는 화장품 제품에 대한 반응정보를 비교한다. 즉, 반응정보 비교부는 고객과 피부타입이 동일 또는 유사한 사용자들에 의해 작성된 반응정보와, 고객과 동일한 화장품 제품을 사용한 사용자들이 작성한 반응정보를 비교한다. 또한, 반응정보 비교부는 고객이 사용하는 화장품 제품에 대한 고객의 리뷰정보, 평가정보, 응답정보 등의 반응정보와, 반응정보 수집부를 통해 수집되는 해당 화장품 제품에 대한 사용자들의 리뷰정보, 평가정보, 응답정보 등의 반응정보를 비교한다. 반응정보 그룹화부는 반응정보 수집부를 통해 수집되는 반응정보를 다양한 그룹으로 그룹핑한다. 이 때, 반응정보 그룹화부는 각각의 화장품 제품에 대하여 수집되는 반응정보를 피부타입 및 평가수준에 따라 복수의 그룹으로 그룹화할 수 있다. 또한, 반응정보 그룹화부는 반응정보 수집부를 통해 수집되는 반 응정보를 동일한 화장품 제품에 대한 반응정보, 동일 또는 유사한 피부타입의 사용자들에 의해 작성된 반응정보, 동일 또는 유사한 성분 및 효과를 갖는 화장품 제품에 대한 반응정보 등으로 그룹화할 수 있다. 그러 나, 반응정보 그룹화부가 반응정보 수집부에 의해 수집되는 반응정보를 그룹화하는 방법은 기재된 방 법에 한정되지 않으며, 다양한 방법으로 그룹화할 수도 있다. 화장품효과 예측부는 반응정보 그룹화부에 의해 그룹화된 복수의 그룹 중 고객단말로부터 수신되 는 안면영상 및 제품정보에 대응하는 그룹을 추출하며, 추출되는 그룹에 기반하여 고객단말에 대응하는 고 객이 사용하는 화장품 제품에 대한 효과를 예측한다. 이때, 화장품효과 예측부는 고객이 사용하는 화장품 제품과 동일한 화장품 제품을 사용하는 사용자들의 해당 화장품 제품에 대한 리뷰정보, 평가정보, 설문에 대한 응답정보 등의 반응정보에 기반하여, 해당 화장품 제품에 대한 효과를 예측할 수 있다. 또한, 화장품효과 예측 부는 고객의 피부타입과 동일 또는 유사한 피부타입을 가지며, 고객이 사용하는 화장품 제품과 동일한 화 장품 제품을 사용하는 사용자들의 해당 화장품 제품에 대한 리뷰정보, 평가정보, 설문에 대한 응답정보 등의 반 응정보를 함께 조합하여 고객의 해당 화장품 제품의 사용에 대한 효과를 예측할 수도 있다. 이때, 화장품효과 예측부는 고객이 사용하는 화장품 제품에 대한 다른 사용자들의 리뷰정보의 수, 다른 사 용자들의 리뷰정보가 긍정인지 또는 부정인지, 해당 화장품 제품에 대한 다른 사용자들의 평가점수 등을 종합하 여 고객이 사용하는 화장품 제품에 대한 효과를 예측할 수 있다. 그룹 검색부는 반응정보 그룹화부에 의해 그룹화된 복수의 그룹 중 고객의 피부타입에 대응하는 그룹 을 검색한다. 즉, 그룹 검색부는 고객단말에 대응하는 고객의 피부타입이 속하는 그룹을 검색한다. 이 때, 그룹 검색부는 복수의 그룹 중 고객이 사용하는 화장품 제품과 동일한 화장품 제품을 사용하는 사용자 들의 반응정보에 해당하는 그룹을 검색할 수도 있다. 또한, 그룹 검색부는 고객의 피부타입과 동일 또는 유사한 피부타입의 사용자들 중 고객이 사용하는 화장품 제품과 동일한 사용자들의 반응정보에 해당하는 그룹을 검색할 수도 있다. 그룹내 분류부는 그룹 검색부에 의해 검색되는 그룹 내의 각각의 화장품 제품을 평가수준이 가장 높 은 순서로부터 순차적으로 분류한다. 예를 들어, 고객의 피부타입과 동일 또는 유사한 피부타입을 갖는 사용자 들의 반응정보에 해당하는 그룹이 검색되는 경우, 해당 그룹 내에는 다양한 화장품 제품들이 있을 수 있다. 이 경우, 그룹내 분류부는 각각의 화장품 제품을 평가수준이 높은 순서로부터 순차적으로 분류한다. 이때, 그 룹내 분류부는 검색된 그룹에 속하는 각각의 화장품 제품에 대하여 리뷰정보, 평가점수 등을 종합하여 평 가수준을 계산하며, 계산되는 평가수준에 따라 각각의 화장품 제품을 순차적으로 분류할 수 있다. 화장품제품 추천부는 화장성분 저장부에 저장된 화장성분 중 피부타입 검색부에 의해 검색되는 고객의 피부타입에 대응하는 화장성분을 포함하는 화장품 제품을 고객단말에 추천할 수 있다. 또한, 화장품 제품 추천부는 고객의 피부타입이 속하는 그룹 내의 각각의 화장품 제품 중 평가수준이 가장 높은 화장품 제품을 고객단말에 추천할 수 있다. 메이크업 추천부는 메이크업 검색부에 의해 검색되는 메이크업 스타일을 네트워크를 통하여 고객 단말에 추천한다. 이때, 메이크업 추천부는 고객의 얼굴형, 피부색상, 피부타입 저장부에 분류된 피부타입의 개수, 고객이 실행하고자 하는 메이크업의 위치 등에 따라 다양한 종류의 메이크업 스타일 중 고객의 피부타입과 동일 또는 유사한 피부타입에 대응하는 메이크업 스타일을 고객단말에 추천할 수 있다. 이를 통해, 본 발명의 실시예에 따른 인기순위 및 선호도 평가서버는 고객의 얼굴형, 눈, 코, 입, 뺨 등의 각각의 얼굴부위 등의 피부색상 및 피부상태 등에 따라 최적의 맞춤형 메이크업 스타일을 추천할 수 있다. 도 8은 본 발명의 실시예에 따른 인기순위 및 선호도 평가방법을 나타낸 흐름도이다. 본 발명의 실시예에 따른 피부상태 판단방법은 도 1에 나타낸 인기순위 및 선호도 평가서버에 의해 수행될 수 있다. 도 1 내지 도 8을 참조하면, 인기순위 및 선호도 평가서버는 화장품의 종류별로 화장품 제품을 분류하여 등록한다(S101). 이때, 인기순위 및 선호도 평가서버는 설정된 주기로 네트워크를 통해 다양한 화장품 제품을 판매 또는 제조하는 쇼핑몰 서버 및 제조업체 서버를 조회하며, 각각의 쇼핑몰 서버 또는 제조업체 서버로부터 새로 출시 또는 판매되는 화장품 제품을 조회하여 기존의 등록된 화장품 제품을 갱신 할 수 있다. 화장품은 종류별로 다양하게 분류될 수 있다. 예를 들어, 기본적으로 사용되는 화장품의 종류로는 기초화장품, 메이크업 화장품, 모발 화장품, 방향 화장품(향수), 바디 화장품, 기능성 화장품, 네일 화장품 등으로 분류될 수 있다. 또한, 기초화장품은 세안용 화장품, 화장수, 로션(유액), 크림, 에센스, 팩, 마스크 등으로 분류될 수 있으며, 메이크업 화장품은 베이스 메이크업(메이크업 베이스, 파운데이션, 파우더 등), 포인트 메이크업(립스 틱, 아이섀도우 등)으로 분류될 수 있다. 또한, 모발 화장품은 세정(샴푸, 린스), 트리트먼트(헤어크림, 헤어팩, 헤어코트 등), 정발(헤어오일, 헤어로션, 스프레이, 젤 등), 퍼머넌트웨이브로션, 염색제, 육모, 제모 등으로 분류될 수 있으며, 방향 화장품은 퍼퓸(15~30%), 오데퍼퓸(9~12%), 오데토일렛(6~8%), 오데코롱(3~5%), 샤워코롱(1~3%)로 분류될 수 있다. 또한, 바디 화장품은 세정(비누, 바디클렌저 등), 보습(바디로션, 오일, 바 디크림, 핸드크림 등), 각질제거(바디스크럽, 바디솔트 등), 선탠제, 체취방지제 등으로 분류될 수 있으며, 기 능성 화장품은 미백화장품(알부틴, 코직산, 비타민C, AHA 등), 주름개선 화장품(레티놀, 아데노신, 항산화제 등), 자외선차단 화장품(산란제, 흡수제 등)으로 분류될 수 있고, 네일 화장품은 큐티클 리부버(큐티클 오일), 플리시, 안티셉틱(손소독 화장품), 젤글루 등으로 분류될 수 있다. 그러나, 여기에 기재된 화장품의 종류 및 각 각의 화장품 종류에 대응하는 화장품 제품의 분류는 발명의 이해를 돕기 위한 예시일 뿐이며, 화장품제품 등록 부는 동일한 화장품 종류에 대해서 제조사, 브랜드, 함유된 성분 및 함유량 등에 따라 다양한 화장품 제품 을 분류하여 등록할 수도 있다. 인기순위 및 선호도 평가서버는 등록된 각각의 화장품 제품에 대응하여 사용자의 리뷰정보 및 평가정보 중 의 적어도 하나를 포함하는 반응정보를 수집한다(S103). 이때, 인기순위 및 선호도 평가서버는 네트워크 를 통해 설정된 주기로 쇼핑몰 서버 및 제조업체 서버를 조회하며, 쇼핑몰 서버 및 제조업체 서버에 각각의 화장품 제품에 대응하여 등록된 사용자의 리뷰정보 또는 평가정보를 수집할 수 있다. 또한, 인기순위 및 선호도 평가서버는 고객단말로부터 수신되는 제품정보에 대응하여, 해당 제품영상에 대응 하는 화장품 제품에 대한 설문을 제공하고, 고객단말로부터 해당 설문에 대한 응답정보를 반응정보로 수집 할 수 있다. 이 경우, 응답정보는 화장품 제품에 대한 리뷰정보 또는 평가정보를 포함할 수 있다. 인기순위 및 선호도 평가서버는 수집되는 반응정보에 대하여, 화장품의 종류별로 각각의 화장품 제품의 리 뷰정보의 수와 평가수준의 정도에 따라 각각의 화장품 제품을 분류한다(S105). 이때, 인기순위 및 선호도 평가 서버는 동일한 화장품 종류 내의 다양한 화장품 제품에 대하여 리뷰정보의 수가 많은 순서에 따라 화장품 제품을 분류하거나, 평가정보가 높은 순서로부터 각각의 화장품 제품을 분류할 수 있다. 또한, 인기순위 및 선 호도 평가서버는 화장품 제품에 대한 각각의 리뷰정보에서 긍정과 부정으로 각각 설정된 키워드를 검색하 며, 검색되는 키워드들의 수가 긍정인지 또는 부정인지를 평가하여 평가점수에 반영할 수도 있다. 인기순위 및 선호도 평가서버는 분류된 화장품 제품의 리뷰정보의 수 및 평가수준의 정도에 따라 각각의 화장품 제품에 대한 인기순위 및 선호도를 평가한다(S107). 이때, 인기순위 및 선호도 평가서버는 각각의 화장품 제품에 대응하는 리뷰정보의 수와 해당 리뷰정보에 긍정의 키워드가 많은지 또는 부정의 키워드가 많은 지에 따라 서로 다른 가중치를 부여하며, 각각의 화장품 제품에 대한 평가점수의 평균값에 리뷰정보의 수에 따 라 가중치가 반영된 종합점수를 산출하고, 그에 따라 각각의 화장품 제품을 종합점수가 높은 순서로부터 나열하 여 인기순위 및 선호도를 평가할 수 있다. 인기순위 및 선호도 평가서버는 네트워크를 통하여 고객단말로부터 안면영상을 수신한다(S109). 이때, 고객단말은 본 발명의 실시예에 따른 메이크업 추천서버로부터 제공된 어플리케이션을 설치하고 있으며, 설치된 어플리케이션을 이용하여 고객단말의 카메라(도시하지 않음)를 통해 안면영상을 촬영할 수있다. 인기순위 및 선호도 평가서버는 고객단말로부터 수신되는 안면영상을 그 수신시점과 함께 저장한다 (S111). 이때, 인기순위 및 선호도 평가서버는 고객단말로부터 수신되는 안면영상의 피부타입이 검색 되면, 검색되는 피부타입을 함께 저장할 수도 있다. 이 경우, 인기순위 및 선호도 평가서버는 고객별로 안 면영상, 수신시점 및 피부타입을 매칭시켜 저장하는 것이 바람직하다. 인기순위 및 선호도 평가서버는 고객단말로부터 고객이 사용하는 화장품 제품에 대한 제품영상을 포함 하는 제품정보를 수신한다(S113). 이때, 인기순위 및 선호도 평가서버는 화장품의 바코드, 식별코드 등을 포함하는 제품식별정보를 제품영상으로 수신할 수 있다. 이 경우, 인기순위 및 선호도 평가서버는 고객단 말로부터 고객이 현재 사용하고 있는 화장품의 제품에 대한 제품영상을 수신하는 것이 바람직하다. 인기순위 및 선호도 평가서버는 네트워크를 통해 수집되는 반응정보 중 고객의 피부타입과 동일 또는 유사한 피부타입의 사용자들로부터 수집된 반응정보와, 네트워크를 통해 수집되는 반응정보 중 고객이 현재 사용하고 있는 화장품 제품에 대한 반응정보를 비교한다. 즉, 인기순위 및 선호도 평가서버는 고객과 피부 타입이 동일 또는 유사한 사용자들에 의해 작성된 반응정보와, 고객과 동일한 화장품 제품을 사용한 사용자들이 작성한 반응정보를 비교한다. 또한, 인기순위 및 선호도 평가서버는 고객이 사용하는 화장품 제품에 대한 고객의 리뷰정보, 평가정보, 응답정보 등의 반응정보와, 네트워크를 통해 수집되는 해당 화장품 제품에 대한 사용자들의 리뷰정보, 평가 정보, 응답정보 등의 반응정보를 비교한다(S115). 이를 통해, 본 발명의 실시예에 따른 인기순위 및 선호도 평가서버는 고객이 사용하고 있는 화장품 제품에 대하여, 고객의 반응정보와 사용자들의 반응정보를 비교하고, 고객이 그에 따른 다른 사용자들의 반응정보를 참 고할 수 있도록 한다. 인기순위 및 선호도 평가서버는 기 저장된 안면영상과, 고객단말로부터 현재 수신되는 안면영상을 비 교한다(S117). 이때, 인기순위 및 선호도 평가서버는 고객에 의해 지정된 지정기간에 기반하여 현재로부터 지정기간 이전의 안면영상과, 현재의 안면영상을 비교할 수 있다. 이 경우, 인기순위 및 선호도 평가서버 는 이전의 안면영상과 현재의 안면영상을 비교하여 여드름, 모공, 기미, 주름, 건조상태 등의 피부상태의 변화 율을 분석할 수 있다. 즉, 인기순위 및 선호도 평가서버는 기 저장된 안면영상에 대응하는 피부타입과, 고객단말로부터 현재 수신되는 안면영상에 대응하는 피부타입을 비교한다. 또한, 인기순위 및 선호도 평가서버는 비교되는 피부 타입들 사이의 변화상태의 변화율을 분석한다. 예를 들어, 인기순위 및 선호도 평가서버는 일주일 전의 안 면영상에 대응하는 피부타입과 현재의 안면영상에 대응하는 피부타입을 비교하며, 일주일 전의 안면영상의 여드 름의 비율 대비 현재의 안면영상의 여드름의 비율이 어느 정도 개선 또는 악화되었는지를 분석할 수 있다. 이때, 인기순위 및 선호도 평가서버는 고객단말로부터 수신되는 지정기간에 대응하여, 현재의 안면영 상의 피부타입과 이전의 안면영상의 피부타입의 변화율을 분석할 수 있다. 인기순위 및 선호도 평가서버는 분석되는 피부상태의 변화율을 고객단말로부터 수신되는 반응정보에 반영한다(S119). 이때, 인기순위 및 선호도 평가서버는 고객이 직접 작성한 평가정보에 대하여, 변화율의 정도에 따라 서로 다른 가중치를 부여하고, 부여된 가중치를 평가정보에 승산할 수 있다. 이를 통해, 고객은 자신이 현재 사용하고 있는 화장품 제품에 대한 자신의 느낌과 실제적으로 피부상태의 변화 정도를 비교할 수 있게 되며, 그에 따라 고객의 사용 중인 화장품 제품의 반응정보에 실질적인 상태변화의 효과 를 반영하여 정확한 반응정보를 생성할 수 있게 된다. 또한, 인기순위 및 선호도 평가서버는 화장품 제품의 사용 및 그 효과, 메이크업 스타일의 변화 등에 따라 변화되는 고객의 피부상태를 피드백하여 지속적으로 제공할 수 있으며, 그에 따라 고객은 화장품 제품이나 메이 크업 스타일의 변화에 따른 자신의 피부상태의 변화를 지속적으로 확인할 수 있게 된다. 또한, 인기순위 및 선 호도 평가서버는 인공지능 알고리즘을 이용하여 고객이 사용하는 화장품 제품, 이용하는 메이크업 스타일, 피부상태 등을 지속적으로 학습할 뿐만 아니라 인공지능 알고리즘을 개선하여 지속적으로 추천 알고리즘을 변화 시킬 수 있게 된다. 이상에서 본 발명에 따른 실시예들이 설명되었으나, 이는 예시적인 것에 불과하며, 당해 분야에서 통상적 지식 을 가진 자라면 이로부터 다양한 변형 및 균등한 범위의 실시예가 가능하다는 점을 이해할 것이다. 따라서, 본발명의 보호 범위는 다음의 특허청구범위뿐만 아니라 이와 균등한 것들에 의해 정해져야 한다."}
{"patent_id": "10-2023-0030300", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 화장품 종류별로 제품의 인기순위 및 선호도를 평가하는 인기순위 및 선호도 평가서버가 적용되는 시스템을 나타낸 도면이다. 도 2는 도 1의 인기순위 및 선호도 평가서버가 인공지능 알고리즘을 이용하여 다양한 화장품 종류별로 제품의 인기순위 및 선호도를 평가하는 방식을 설명하기 위하여 도시한 도면이다. 도 3은 본 발명의 실시예에 따른, 화장품 종류별로 제품의 인기순위 및 선호도를 평가하는 인기순위 및 선호도 평가서버의 구성을 개략적으로 도시한 도면이다. 도 4는 고객단말에 의해 촬영되는 안면영상의 예를 나타낸 도면이다. 도 5는 고객단말에 의해 촬영되는 제품영상의 예를 나타낸 도면이다. 도 6은 안면영상에 대응하여 얼굴형, 눈, 코, 입 등의 안면정보를 분석하는 예를 설명하기 위하여 도시한 도면 이다. 도 7은 안면영상에 대응하여 여드름, 모공, 기미, 주름, 건조 등을 분석하는 예를 설명하기 위하여 도시한 도면 이다. 도 8은 본 발명의 실시예에 따른 인기순위 및 선호도 평가방법을 나타낸 흐름도이다."}
