{"patent_id": "10-2019-0082091", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0006159", "출원번호": "10-2019-0082091", "발명의 명칭": "습도 데이터를 활용한 지하주차장의 단계별 차수공법", "출원인": "삼창엔지니어링", "발명자": "윤영순"}}
{"patent_id": "10-2019-0082091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "지하주차장의 차수공법에 있어서,기 선정된 부위 또는 선택한 부위의 습도를 측정하는 습도 측정단계;측정된 습도 데이터를 수집, 분석 및 제공하는 데이터 수집단계; 및상기 습도 데이터에 따라 선택적 및 단계적으로 차수를 진행하는 방수처리 단계; 를 포함하며,상기 습도 측정단계는 측정하고자 하는 부위에 150 내지 200 mm의 깊이의 홀(hole)을 한 개 이상 천공하고 상기천공된 홀(hole)에 프로브를 삽입하여 습도를 측정하며, 상기 방수처리 단계는 상기 홀(hole)에 급결 방수액을 우선 주입하고 이후 완결 방수액을 주입하여 차수하는 것을 특징으로 하는 지하주차장의 차수공법."}
{"patent_id": "10-2019-0082091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,기 선정된 부위 또는 선택한 부위의 온도를 측정하는 온도 측정단계; 를 더 포함하며, 측정된 온도 데이터와 상기 습도 데이터를 기초로 지하주차장의 하자 상태를 확인한 후 방수처리 단계를 진행하는 것을 특징으로 하는 지하주차장의 차수공법."}
{"patent_id": "10-2019-0082091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,트렌치로부터 수분의 이동을 차단하는 차수벽 설치단계; 를 더 포함하며, 상기 홀은 상기 트렌치 또는 차수벽으로부터 200mm 이상 이격시켜 복수 개마련하되, 상기 트렌치 또는 차수벽에서 가까운 순서대로 1차로 130 내지 180 mm 깊이의 홀에 급결 방수액을 삽입하며, 2차로 180 내지 220 mm 깊이의 홀에 완결 방수액을 삽입하되, 상기 급결 방수액은 주입한 후 10분 이내 경화되도록, 완결 방수액은 주입한후 24시간 이내 경화되도록 하는 것을 특징으로 하는 지하주차장의 차수공법."}
{"patent_id": "10-2019-0082091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2항에 있어서,상기 데이터 수집단계는 상기 온도 데이터 및 습도 데이터를 수집하여 머신 러닝 또는 딥 러닝의 인공지능 기술을 이용하여 하자 발생의 시기 및 부위를 예측하고 이와 같이 예측된 정보를 사용자에게 제공하며, 이때 상기예측된 정보를 사용자에게 알람하기 위해 별도의 정보 알람단계; 를 더 포함하는 것을 특징으로 하는 지하주차장의 차수공법."}
{"patent_id": "10-2019-0082091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1항에 있어서,상기 방수처리 단계는 액체상태의 급결 또는 완결 방수액을 상기 홀에 주입하여 응고 시키되, 시간이 경과되면공개특허 10-2021-0006159-3-서 주입된 상기 방수액이 크랙, 균열 또는 틈 사이로 스며든 후 응고됨에 따라 응고 후 상기 홀의 상부에 별도의 추가 방수액 또는 마감부재를 도포하거나 주입하는 것을 특징으로 하는 지하주차장의 차수공법."}
{"patent_id": "10-2019-0082091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항에 있어서,상기 지하주차장 바닥에 균열이 있는 경우 상기 홀은 상기 균열을 따라 소정 크기 이격 시키며 마련하고, 필요시 상기 홀의 깊이와 직경은 하자 발생의 정도, 균열의 크기에 따라 선택할 수 있으며, 균열의 시작점에서 멀어질수록 상기 홀의 깊이와 직경을 상대적으로 작게 마련하는 것을 특징으로 하는 지하주차장의 차수공법."}
{"patent_id": "10-2019-0082091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 4항에 있어서,사용자는 휴대용 단말 또는 태블릿을 통해 상기 정보를 제공받을 수 있으며, 경우에 따라서는 지하주차장에 마련한 비콘, 지그비 및 NFC 중 적어도 어느 하나 이상의 근거리 통신 수단을 이용하여 사용자가 일정 반경 범위이내에 들어오면 자동으로 상태 정보를 송신 및 수신할 수 있는 것을 특징으로 하는 지하주차장의 차수공법."}
{"patent_id": "10-2019-0082091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1항에 있어서,상기 홀에 수분이 형성된 경우 석션(suction)기를 통해 흡입하거나 공기를 뿜어서 상기 홀 내부 수분을 밀어 토출 시킨 후 방수처리 또는 습도 측정을 진행하는 것을 특징으로 하는 지하주차장의 차수공법."}
{"patent_id": "10-2019-0082091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 3항에 있어서,상기 홀에 수분이 형성된 경우 아크릴계 또는 우레탄계의 수지(resin)을 주입하여 방수층에 존재하는 수분을 배출하되, 상기 트렌치 또는 차수벽에서 가까운 순서에 따라 3차의 홀에 상기 수지를 주입하는 것을 특징으로 하는 지하주차장의 차수공법."}
{"patent_id": "10-2019-0082091", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 지하주차장의 차수공법은 기 선정된 부위 또는 선택한 부위의 습도를 측정하는 습도 측정단계, 측정된 습도 데이터를 수집, 분석 및 제공하는 데이터 수집단계 및 상기 습도 데이터에 따라 선택적 및 단계적으 로 차수를 진행하는 방수처리 단계를 포함하며, 상기 습도 측정단계는 측정하고자 하는 부위에 150 내지 200 mm 의 깊이의 홀(hole)을 한 개 이상 천공하고 상기 천공된 홀(hole)에 프로브를 삽입하여 습도를 측정하며, 상기 방수처리 단계는 상기 홀(hole)에 급결 방수액을 우선 주입하고 이후 완결 방수액을 주입하여 차수하는 것을 특 징으로 한다."}
{"patent_id": "10-2019-0082091", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 지하주차장의 차수공법에 관한 것으로, 보다 상세하게는 누수(漏水)의 하자가 있는 지하주차장의 차 수를 위해 습도를 측정하고 측정된 습도 데이터에 따라 단계적으로 차수공법을 진행함으로써 효과적으로 지하주 차장의 누수를 방지할 수 있는 지하주차장의 차수공법에 관한 것이다."}
{"patent_id": "10-2019-0082091", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 지하주차장은 표면에서부터 누름 콘크리트층, 방수층 및 매트 콘크리트층이 순차적으로 형성되고, 누름 콘크리트층 상부 표면에는 우레탄 또는 에폭시 재질의 방수재가 추가로 도포되어 수분의 유입을 차단한다. 또한, 지하주차장은 지표면보다 아래에 위치하므로 지하주차장으로 유입되는 외부의 수분을 차단하기 위한 방수 시스템이 필수적이고 이를 위해 지하주차장의 가장자리를 따라 트렌치를 포함하는 배수부가 마련되어 빗물 등의 수분 유입을 차단한다. 그런데, 트렌치가 형성된 지하주차장의 바닥은 시간이 지남에 따라 지하주차장 표면의 우레탄 또는 에폭시 재질 의 표면이 갈라지거나 탈락되는데, 이것은 지하주차장의 트렌치에 고인 수분이, 지하주차장 바닥으로 흡수되어 내측으로 이동하며 온도의 변화에 따라 동결되거나 융해되며 발생하는 부피의 변화로 인한 것이다. 즉, 기존의 지하주차장의 차수장치 및 공법은 표면에 방수재를 도포하고 매트 콘크리트층과 누름 콘크리트층 사 이에 방수층을 마련함으로써 표면에서의 수분유입과 지하에서 지상으로 유입되는 수분만을 차단 할 수 있었다. 따라서, 기존의 지하주차장의 차수장치 및 공법은 트렌치가 설치된 부위의 수분이 매트 콘크리트층과 누름 콘크 리트층 사이의 방수층을 따라 내측으로 유입되는 것을 차단할 수 없으며, 이에 따라 수분이 상부로 이동하면서 표면의 방수재 등을 탈락시키거나 내부에서 동결되거나 융해됨으로써 균열이나 부식이 발생하는 문제점을 막을 수 없다. 이러한 문제점을 해결하기 위해 본 출원인에 의한 특허 등록번호 제10-1696908호 \"지하주차장의 차수 공법\"에 따라 트렌치로부터 별도의 차수벽(차수부, 차수부재)를 마련함으로써 종래의 기술보다 우수한 차수, 방수 효과 를 얻을 수 있었으나 이후 시간이 경과하면서 표면의 균열이나 하자가 발생하며 다시 수분이 바닥재나 코팅부위 아래에서 축적되어 바닥의 변색, 들뜸, 기포 발생, 부착 불량 등의 문제를 야기하게 되었다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개번호 제20-2008-0005071 (2008.10.30. 공개)"}
{"patent_id": "10-2019-0082091", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 바와 같은 문제점을 해결하기 위해 제안된 것으로 지하주차장의 습도를 측정하고 측정된 데이 터에 따라 단계별로 차수공법을 진행함으로써 우수한 차수 효과를 얻을 수 있으며 기존에 설치된 지하주차장에 서도 본 발명에 따른 차수공법을 용이하게 시공할 수 있도록 한다."}
{"patent_id": "10-2019-0082091", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 목적을 달성하기 위해, 본 발명에 따른 지하주차장의 차수공법은 기 선정된 부위 또는 선택한 부위의 습 도를 측정하는 습도 측정단계, 측정된 습도 데이터를 수집, 분석 및 제공하는 데이터 수집단계 및 상기 습도 데 이터에 따라 선택적 및 단계적으로 차수를 진행하는 방수처리 단계를 포함하며, 상기 습도 측정단계는 측정하고 자 하는 부위에 150 내지 200 mm의 깊이의 홀(hole)을 한 개 이상 천공하고 상기 천공된 홀(hole)에 프로브를 삽입하여 습도를 측정하며, 상기 방수처리 단계는 상기 홀(hole)에 급결 방수액을 우선 주입하고 이후 완결 방 수액을 주입하여 차수하는 것을 특징으로 한다. 또한, 기 선정된 부위 또는 선택한 부위의 온도를 측정하는 온도 측정단계; 를 더 포함하며, 측정된 온도 데이 터와 상기 습도 데이터를 기초로 지하주차장의 하자 상태를 확인한 후 방수처리 단계를 진행하는 것을 특징으로 한다. 또한, 트렌치로부터 수분의 이동을 차단하는 차수벽 설치단계를 더 포함하며, 상기 홀은 상기 트렌치 또는 차수 벽으로부터 200mm 이상 이격시켜 복수 개마련하되, 상기 트렌치 또는 차수벽에서 가까운 순서대로 1차로 130 내 지 180 mm 깊이의 홀에 급결 방수액을 삽입하며, 2차로 180 내지 220 mm 깊이의 홀에 완결 방수액을 삽입하되, 상기 급결 방수액은 주입한 후 10분 이내 경화되도록, 완결 방수액은 주입한 후 24시간 이내 경화되도록 하는 것을 특징으로 한다. 또한, 상기 데이터 수집단계는 상기 온도 데이터 및 습도 데이터를 수집하여 머신 러닝 또는 딥 러닝의 인공지 능 기술을 이용하여 하자 발생의 시기 및 부위를 예측하고 이와 같이 예측된 정보를 사용자에게 제공하며, 이때상기 예측된 정보를 사용자에게 알람하기 위해 별도의 정보 알람단계를 더 포함하는 것을 특징으로 한다. 또한, 상기 방수처리 단계는 액체상태의 급결 또는 완결 방수액을 상기 홀에 주입하여 응고 시키되, 시간이 경 과되면서 주입된 상기 방수액이 크랙, 균열 또는 틈 사이로 스며든 후 응고됨에 따라 응고 후 상기 홀의 상부에 별도의 추가 방수액 또는 마감부재를 도포하거나 주입하는 것을 특징으로 한다. 또한, 상기 지하주차장 바닥에 균열이 있는 경우 상기 홀은 상기 균열을 따라 소정 크기 이격 시키며 마련하고, 필요 시 상기 홀의 깊이와 직경은 하자 발생의 정도, 균열의 크기에 따라 선택할 수 있으며, 균열의 시작점에서 멀어질수록 상기 홀의 깊이와 직경을 상대적으로 작게 마련하는 것을 특징으로 한다. 또한, 사용자는 휴대용 단말 또는 태블릿을 통해 상기 정보를 제공받을 수 있으며, 경우에 따라서는 지하주차장 에 마련한 비콘, 지그비 및 NFC 중 적어도 어느 하나 이상의 근거리 통신 수단을 이용하여 사용자가 일정 반경 범위 이내에 들어오면 자동으로 상태 정보를 송신 및 수신할 수 있는 것을 특징으로 한다. 또한, 상기 습도 측정단계 시 천공한 상기 홀에 수분이 형성된 경우 석션(suction)기를 통해 흡입하거나 공기를 뿜어서 상기 홀 내부 수분을 밀어 토출 시킨 후 방수처리 또는 습도 측정을 진행하는 것을 특징으로 한다."}
{"patent_id": "10-2019-0082091", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기한 바와 같이 구성된 본 발명에 따른 지하주차장의 차수공법은 다음과 같은 효과가 있다. 첫째, 습도 데이 터를 활용하여 단계적으로 차수 공법을 진행함에 따라 트렌치로부터 스며드는 수분을 신속하고 효과적으로 차단 하여 지하주차장의 방수효과를 증가시킨다. 둘째, 기존에 설치되어 있는 지하주차장에도 본 발명에 따른 차수공 법을 이용할 수 있다."}
{"patent_id": "10-2019-0082091", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하면서 본 발명의 실시예에 따른 지하주차장의 차수공법에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시 할 수 있도록 상세히 설명하기로 한다. 본 발명은 여기 에서 설명하는 실시예로 한정되지 않으며, 여러 가지 상이한 형태로 구현될 수 있다. 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 동일 또는 유사한 구성요소에 대해서는 동일한 참조부호를 붙이도록 한다. 또한, 차수, 방수는 동일한 의미로 사용될 수 있으며 이에 따른 효과는 지하주차장에서 발생하는 누수, 흠결 등의 모든 하자를 해결하기 위한 것으로 해석하 면 될 것이다. 본 발명에 따른 지하주차장은 표면에서부터 누름 콘크리트층, 방수층, 매트 콘크리트층이 순서대로 적층된다. 상기 매트 콘크리트층은 상기 지하주차장의 기초를 형성하며 자체하중 및 자동차 등의 동적 하중 을 견디기 위해 철근이 배근 되어 형성 될 수 있다. 또한, 프리캐스트 콘크리트로 제작될 수도 있으며, 상기 지 하주차장을 지지하기 위해 일정 크기 이상의 강도를 고강도 콘크리트로 마련될 수 있다. 상기 매트 콘크리트층의 상부에는 방수층이 형성되는데, 상기 방수층은 액체 방수재를 도포하고, 건조시킴으로써 형성될 수 있다. 또한, 필름 형태의 차단 막, 차단 부재 등을 상기 매트 콘크리트층의 표면 에 덮어 씌우는 형상으로 마련할 수도 있으며, 경우에 따라서는 액체 방수재 및 필름을 동시에 설치할 수도 있 다. 상기 방수층이 형성되면, 그 위에 누름 콘크리트층이 형성된다. 상기 누름 콘크리트층은 상기 매트 콘크리트층에 비해 강도가 약한 콘크리트로 마련될 수 있으며, 철근이 생략될 수 있다. 또한, 상기 누름 콘 크리트층은 모르타르(mortar) 즉, 시멘트와 모래를 물로 혼합하여 반죽한 재질로 마련될 수 있다. 상기 누름 콘크리트층은 상기 매트 콘크리트층과 동일하지 않은 재질로 마련될 수 있으며, 상기 방수층 을 보호하며, 상기 지하주차장의 표면을 이동하는 차량 및 사람의 하중을 견딜 수 있도록 마련될 수 있다. 또한, 지하주차장은 배수를 위한 트렌치가 형성된다. 상기 트렌치는 상기 지하주차장의 가장자리를 따 라, 벽체 내지 기둥으로부터 일정거리 이격되어 마련된다. 벽체는 상기 지하주차장 내지는 구조물의 하중을 견 디기 위해, 일정 크기 이상의 강도를 가진 콘크리트와 철근으로 마련되며, 상기 트렌치와는 일정거리 이격 되어야 한다. 상기 지하주차장의 수분이 상기 트렌치를 통해 배수되기 위해 상기 지하주차장의 안쪽에서부터 상기 트렌치 방향으로 갈수록 경사가 기울어지는 형태로 마련될 수 있다. 또한, 지하주차장의 표면에 수분의 배출을 용 이하게 하기 위한 배수로 내지 가이드 홈이 마련되고 상기 가이드 홈 내지 배수로를 통해 지하주차장의 표면에 고인 수분이 상기 트렌치로 유입되도록 할 수 있다. 상기 트렌치는 스틸 그레이팅과 상기 스틸 그레이팅이 고정되도록 트렌치 결속부를 가지며, 내 부의 공간은 상기 스틸 그레이팅을 통해 유입된 수분이 배수되도록 'U' 자형의 배수로를 가질 수 있다. 이와 같이 지하주차장은 배수를 위한 트렌치가 마련되는데 상기 트렌치 내부에 고여있는 수분 또는 주위에 마련되는 수분이 오히려 지하주차장의 표면을 따라서 또는 표면 아래에 스며들면서 지하주차장의 누수 하자를 발생하므로 이에 대한 차단이 필요한 것이다. 종래 지하주차장의 방수, 차수공법 및 도 1에 도시된 바와 같이 본 발명의 출원인에 의해 개시된 지하주차장의 차수 공법은 습도와 상관없이 트렌치로부터 유입되는 수분의 이동 경로를 차단하는 것이 기술의 특징이다. 이를 위해 별도의 차수벽 등의 차수부재를 사용하고 있는데 이 경우 하자 보수가 필요한 부위를 정확히 발견하기 어 렵고, 실제로 하자 보수를 진행하더라도 우수한 차수 효과를 얻지 못하는 문제점이 발생할 수 있는 것이다. 이에 따라 본 발명에 따른 지하주차장의 차수공법은 기 선정된 부위 또는 선택한 부위의 습도를 측정하는 습도 측정단계, 측정된 습도 데이터를 수집, 분석 및 제공하는 데이터 수집단계 및 상기 습도 데이터에 따라 선택적 및 단계적으로 차수를 진행하는 방수처리 단계를 포함한다. 따라서 본 발명은 지하주차장의 습도를 측정하되 기 설정해 놓은 장소나 부위 또는 사용자 및 관리자가 관찰하 여 하자가 발생 예상되거나 일부 하자가 발생한 부위를 선택하여 습도를 측정하며, 이렇게 측정된 데이터를 활 용하여 차수, 방수하는 것에 특징이 있다. 즉, 다양한 방법에 의해 습도를 측정하고 보수가 필요한 부위에 차수 공법을 진행하며, 습도 데이터에 따라 순 차적, 차등적으로 차수 공법을 진행할 수 있으므로 효과적이고 경제적인 차수가 가능한 것이다. 예컨대, 측정된습도가 상대적으로 높은 경우에는 심화된 차수공법을 진행하던지 신속히 차수될 수 있도록 하고, 측정된 습도가 상대적으로 낮은 경우에는 좀 더 천천히 차수가 될 수 있도록 차등하여 진행이 가능한 것이다. 상기 습도 측정단계는 측정하고자 하는 부위에 150 내지 200 mm의 깊이의 홀(hole, 130)을 한 개 이상 천공하고 상기 천공된 홀(hole)에 프로브(probe)를 삽입하여 습도를 측정한다. 상기 홀 내지 천공부는 서로 일정거 리를 유지하며 마련할 수 있으며 바람직하게는 수분의 이동경로를 따라 시공함으로써 수분의 이동을 효과적으로 센싱하여 차단할 수 있도록 한다. 상기 프로브는 그 용어에 한정되어 해석하는 것이 아니며, 습도를 측정, 탐침할 수 있는 모든 도구, 수단이 이 용될 수 있으며, 바람직하게는 본 발명에 따라 별도의 센서를 상기 홀에 삽입하여 측정하고 측정된 상기 데이터 를 전송 받을 수 있다. 습도를 측정하는 방법은 상술한 바와 같이 복수의 홀에 별도의 측정, 탐침 설비를 이용할 수 있으며 그 밖 에 습도계, 온도계, 온도측정 설비 등을 이용하여 습도 및 수분의 양을 측정할 수 있다. 이때 육안에 의한 관찰, 센서에 의한 관찰 등을 모두 병행할 수 있으며, 필요 시 주기적인 체크와 확인을 진행할 수 있다. 도 2는 본 발명에 따라 습도를 측정하기 위한 천공부 또는 홀의 위치, 크기 및 깊이 등을 보여주는 단면 사시도로서 도시된 바와 같이 상기 트렌치로부터 일정 거리 이격되거나 상기 차수벽으로부터 소정크기 (w1) 이격되어 순서대로 마련할 수 있다. 따라서, 상기 천공부는 라인을 따라서 마련될 수 있으며 크랙이 나 균열을 따라 불규칙적인 곡선을 따라 마련될 수도 있다. 상기 천공부의 깊이(h2)는 상기 누름 콘크리트층과 방수층 그리고 매트 콘크리트층의 일부를 천공하여 마련하며 바람직하게는 150 내지 250 mm의 깊이로 마련하고, 천공 된 상기 홀에 프로브를 삽입하여 일 정 기간 동안 습도를 측정할 수 있도록 한다. 물론, 상기 천공부는 습도 측정 이후 차수가 필요한 경우 방수액을 급결, 완결로 나뉘어 순차적으로 주입 하는 차수부의 공간 역할을 하게 된다. 또한, 상기 천공부의 천공 시 홀의 직경, 깊이에 따라 적합한 천공 장비를 마련할 수 있으며, 이러한 장비 및 천공에 관한 정보는 저장, 가공되어 활용될 수 있다. 도 2에 도시된 바와 같이 일정 크기 이격하여 상기 천공부를 복수로 마련할 수 있으며 주로, 크랙이나 균 열을 따라 수분이 이동하므로 도시된 것과 같은 크랙(c)이 있다면 상기 크랙 위에 습도측정 및 차수를 위한 천 공부를 크랙을 따라 마련할 수도 있다. 상기 방수처리 단계는 상기 홀(hole, 130)에 급결 방수액을 우선 주입하고 이후 완결 방수액을 주입하여 차수 한다. 즉, 수분의 이동을 방지하기 위한 방수액을 단순히 균열부 또는 크랙이나 홀에 주입하는 것이 아니라 습 도측정 이후 수집된 데이터를 기준으로 순차적으로 급결과 완결로 구분하여 처리하는 것이다. 상기 방수액은 하나의 천공부(홀, 130)에 주입하되 급결 방수액 주입 후 일정 시간 경과 후 완결 방수액을 주입 할 수도 있으며 바람직하게는 복수의 상기 천공부에서 측정된 습도 데이터를 기준으로 차등하여 우선 순위를 나 눈 후 습도가 더 높은 부위(천공부)에 급결 방수액을 먼저 주입하고, 이후 습도가 낮은 부위(천공부)에 완결 방 수액을 주입함으로써 보다 효과적이고 경제적인 차수를 진행할 수 있다.상기 급결 방수액은 주입 후 10분 이내에서 경화가 이뤄지며, 상기 완결 방수액은 주입 후 24시간 이내에서 경 화가 이뤄진다. 따라서, 방수가 필요한 천공부에 상기 방수액(310, 330)을 주입하면서 상기 천공부 내부에 차수부가 마련되고 균열이나 크랙을 따라 상기 액체 방수액이 스며들면서 효과적이고 우수한 차수, 방수 효과를 얻을 수 있다. 또한, 신속하게 누수를 차단하기 위한 급결 방수액이 응고 경화된 후, 완결 방수액을 통해 완벽한 차수, 방수기 능을 얻게 되며, 상기 방수액의 경화 속도, 주입 시간은 하자 보수가 필요한 환경의 성격이나 종류, 사용자의 선택에 따라 조절할 수 있다. 또한, 필요 시 급결 방수액과 완결 방수액을 혼용하거나 그 순서를 변경하거나 그 주입 시간을 다양하게 변경하여 실시할 수도 있다. 도 3은 본 발명인 습도 데이터를 활용한 지하주차장의 차수공법의 구성부 및 개념에 대한 블록도이다. 도시된 바와 같이 습도 측정부, 측정을 위한 프로브, 상기 프로브를 삽입하여 측정하기 위한 천공부, 상기 습도 측정 데이터를 송신, 수신하는 서버와 상기 데이터를 활용하는 데이터 베이스부, 상기 데 이터를 사용자가 확인할 수 있는 사용자 단말이 마련된다. 또한, 상기 습도 데이터를 측정하기 위한 습도 측정부 또는 천공부는 이후 급결 방수액 또는 완결 방수액을 주 입하여 차수하는 차수부, 급결 방수부, 완결 방수부의 기능을 수행할 수 있다. 또한, 상기 습도 측정단계 시 천공한 상기 홀에 수분이 형성된 경우 석션(suction)기를 통해 흡입하거나 공기를 뿜어서 상기 홀 내부 수분을 밀어 토출 시킨 후 방수처리 또는 습도 측정을 진행할 수 있다. 물론, 상기 홀 내 에 형성된 수분을 제거하는 방법은 다양하게 변경되거나 수정될 수 있으며, 위 설명된 내용으로 한정되지 않는 다. 또한, 상기 홀에 수분이 형성된 경우 아크릴계 또는 우레탄계의 수지(resin)을 주입하여 방수층에 존재하는 수 분을 배출하되, 상기 트렌치 또는 차수벽에서 가까운 순서에 따라 3차의 홀에 상기 수지를 주입하는 것을 특징 으로 한다. 참고로, 도 3에서 점선으로 표시한 것은 이격되어 마련되거나 정보, 데이터의 흐름을 보여주는 것이며, 실선으 로 표시한 것은 물리적으로 연결되거나 함께 활용될 수 있음을 보여준다. 물론, 본 발명의 구성은 추가되거나 가감, 변경될 수 있으며 그 용어의 이름에 한정되지 않고 동일하거나 유사한 기능을 수행하는 구성을 포함한다. 도 4는 본 발명에 따른 지하주차장 차수공법의 순서도로서, 균열부위 또는 하자발생 부위를 탐색하는 단계 (S100), 습도측정을 위한 천공부(홀)을 형성하는 단계(S200), 습도측정 데이터를 수집, 활용하는 단계(S300), 하자가 발생했거나 차수가 필요한지 확인하는 단계(S400), 급결 방수액을 주입하는 단계(S500), 완결 방수액을 주입하는 단계(S600), 경화 단계(S700) 및 마무리, 마감 단계(S800)을 포함한다. 따라서, 사용자 및 관리자는 하자가 발생한 위치 또는 발생이 예정되는 위치의 습도를 측정하고 측정된 습도 데 이터를 기준으로 순차적, 차등적으로 급결, 완결 방수액을 주입함으로써 신속하게 차수공법을 진행하는 것이다. 이때, 상기 공법의 순서는 경우에 따라서 생략되거나 변경될 수 있으며 추가 공법이 포함될 수도 있다. 예컨대, 앞서 설명한 바와 같이 온도를 측정하는 단계를 더 포함할 수 있으며, 방수액 주입 단계를 변경, 생략할 수 있 으며, 습도측정을 위한 부위를 기 지정하거나 추후 선택할 수도 있으며, 차수를 위한 방수액을 습도 측정을 위 한 천공부에 주입하거나 또는 별도의 차수를 위한 공간을 추가로 마련하여 방수처리 할 수도 있다. 도 5는 본 발명에 따른 지하주차장 차수공법의 순서 및 실제 적용한 현장의 사진으로서, (a)는 습도 측정을 위 해 마련한 천공부에 관한 사진이며, 하자가 있는 경우 사진과 같이 홀 저면에 수분이 고여있는 것을 알 수 있다. 또한, (b)는 습도측정을 위해 프로브(탐침설비)를 상기 천공부에 주입하는 것을 보여주는 사진으로서 상 기 프로브는 습도 센서의 기능을 수행한다. (c)는 일정 기간 습도 측정 후 습도 데이터가 상기 습도 측정부에 전송되어 수집되는 것을 보여주며, (e)는 측정되어 전송된 데이터를 확인하는 단말기의 디스플레이부의 화면 정 보이다. 또한, (d)는 추가로 온도 데이터를 수집하기 위한 온도 측정과정을 보여주는 사진이며, (f)는 습도 측 정 후 하자보수가 필요한 상기 천공부에 방수액을 급결, 완결로 차등하여 주입하는 과정을 보여주는 것이다. 본 발명에 따른 지하주차장의 차수공법은 상술한 바와 같이 기 선정된 부위 또는 선택한 부위의 온도를 측정하 는 온도 측정단계를 더 포함하며, 측정된 온도 데이터와 상기 습도 데이터를 기초로 지하주차장의 하자 상태를 확인한 후 방수처리 단계를 진행할 수 있다. 습도는 온도와 밀접한 관계가 있으며, 이후 방수액의 응고 및 경화시간에도 중요한 요인이므로 습도 데이터 측 정 이외에 온도 데이터를 추가로 측정하는 과정을 마련하여 보다 정확하고 효과적인 방수, 차수 공법을 진행할 수 있는 것이다."}
{"patent_id": "10-2019-0082091", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "또한, 본 발명에 따른 지하주차장 차수공법은 트렌치로부터 수분의 이동을 차단하는 차수벽 설치단계를 더 포함할 수 있으며, 상기 천공부(홀, 130)는 바람직하게는 상기 트렌치 또는 차수벽으로부터 200mm 이상 이격시켜 복수로 마련한다. 또한, 하자가 발생하여 차수공법을 진행하는 경우 상기 트렌치 또는 차수벽에서 가까운 순서대로, 1차 로 130 내지 180 mm 깊이의 홀에 급결 방수액을 삽입하고, 2차로 180 내지 220 mm 깊이의 홀에 완결 방수액을 삽입하되, 상기 급결 방수액은 주입한 후 10분 이내 경화되도록, 완결 방수액은 주입한 후 24시간 이내 경화되 도록 한다. 또한, 상기 데이터 수집단계는 상기 온도 데이터 및 습도 데이터를 수집하여 머신 러닝 또는 딥 러닝의 인공지 능 기술을 이용하여 하자 발생의 시기 및 부위를 예측하고 이와 같이 예측된 정보를 사용자에게 제공하며, 이때 상기 예측된 정보를 사용자에게 알람 하기 위해 별도의 정보 알람 단계를 더 포함할 수 있다. 또한, 상기 방수처리 단계는 액체상태의 급결 또는 완결 방수액을 상기 홀에 주입하여 응고 시키되, 시간이 경 과되면서 주입된 상기 방수액이 크랙, 균열 또는 틈 사이로 스며든 후 응고됨에 따라 응고 후 상기 홀의 상부에 별도의 추가 방수액 또는 마감부재를 도포하거나 주입할 수 있다. 즉, 방수액이 틈새로 스며들면서 경화되면 홀 표면이 지하주차장 표면과 나란하지 않아 고르지 않게 되므로 이를 위해 별도의 추가 마감과정을 포함하는 것이다. 상기 지하주차장 바닥에 균열이 있는 경우 상기 홀은 상기 균열을 따라 소정 크기 이격 시켜 마련하고, 필 요 시 상기 홀의 깊이와 직경은 하자 발생의 정도, 균열의 크기에 따라 선택할 수 있으며, 균열의 시작점에서 멀어질수록 상기 홀의 깊이와 직경을 상대적으로 작게 마련할 수 있다. 따라서, 상기 천공부 내지 홀의 깊이는 순차적으로 차등시켜 마련할 수 있으며, 예컨대, 트렌치로부터 가 까운 곳에서 멀어질수록 그 깊이를 조금씩 줄이거나 그 직경을 조금씩 작게 마련함으로써 보다 효과적인 방수기능을 획득할 수 있다. 사용자는 휴대용 단말 또는 태블릿을 통해 습도, 온도 등 하자 보수 전과 보수 이후의 지하주차장 관련 정보를 제공받을 수 있으며, 경우에 따라서는 지하주차장에 마련한 비콘, 지그비 및 NFC 중 적어도 어느 하나 이상의 근거리 통신 수단을 이용하여 사용자가 일정 반경 범위 이내에 들어오면 자동으로 지하주차장의 상태 정보를 송 신 및 수신할 수 있다. 또한, 지하주차장의 상태, 환경 및 하자 보수에 대한 정보 데이터를 주기적으로 알람 받을 수 있다. 또한, 상기 차수부를 형성하는 방수액은 아크릴계 수지, 액체 상태의 우레탄 실란트로 마련할 수 있으며, 주입 후 경화됨으로서 인접 부재와의 밀착성이 우수하고 틈새나 유격 없이 차수성능을 얻을 수 있다. 경우에 따라서 상기 차수부는 미리 제작된 원통형의 부재를 제작하여 상기 천공부의 중공부에 삽입 내지 끼워 넣음으로써 마련할 수도 있다. 이때 상기 차수부는 틈새나 유격의 발생을 최소화 하기 위해 상 기 천공부의 중공부 크기와 동일하게 제작하거나 상기 차수부를 삽입한 후 밀폐 및 차폐를 위해 별도 의 실란트를 주입할 수 있다. 또한, 액체 및 고체의 차수부재를 동시에 사용하여 우수한 차수 효과를 얻기 위해 기 제작된 원통형의 차수부 (고체)를 삽입하기 전에 액체 상태의 방수액을 주입한 후 기 제작된 원통형의 부재를 삽입함으로써 우수한 차수, 방수 성능을 얻을 수 있다. 따라서, 작은 균열, 크랙에는 액체 방수액이 침투하여 차수 효과를 획득하고 그 밖에 고체로 기 성형 제작된 차수부가 이를 지지하면서 견고한 차수기능을 수행할 수 있다. 또한, 상기 천공부에 주입되는 방수액 또는 차수부재는 경우에 따라서 온도나 압력 조건에 따라 부피가 팽 창하거나 수축하는 소재를 사용할 수 있으며, 경화 후 이탈되거나 균열되는 것을 방지하고 겨울철 염화칼슘에 의한 탈리 현상을 방지하기 위해 염소이온 또는 칼슘이온과의 결합이 가능한 성분을 포함할 수도 있다. 앞서 설명한 바와 같이 지하주차장의 습도를 측정하거나 방수액을 주입하기 위해 복수의 천공부(홀, 130)를 마 련하고, 상기 천공부를 마련하도록 지하주차장 바닥을 커팅 또는 천공하는 단계에서 커팅이나 천공에 의한 마찰 과 소음을 줄이기 위해 수분(윤활재)을 제공하게 되므로, 상기 지하주차장 바닥을 커팅 또는 천공하는 단계 이 후에, 수분을 건조시키는 단계를 더 포함 할 수 있으며, 경우에 따라서는 수분을 빠른 시간 내에 건조하기 위해 수분을 흡수하는 단계를 포함할 수 있다. 상기 천공부의 천공을 위해 석재용 드릴이 사용될 수 있으며, 직경은 18 내지 30 mm로 마련되고, 상기 천 공부(홀, 130)가 형성된 후에는 흡입장치나 에어 콤프레샤 등을 이용하여 부스러기, 파편, 먼지 등을 제거할 수 있다. 또한, 습도를 측정하기 위해 상기 천공부에 삽입한 프로브가 외부로부터의 충격이나 오염 그리고 습 도의 영향을 받지 않도록 상기 프로브를 상기 천공부에 삽입한 후 뚜껑을 덮거나 밀봉할 수 있다. 또 한, 바람직하게는 밀봉 후 3일을 기다린 후 후 표면온도와 표면습도, 콘크리트 내부습도를 모두 종합하여 습도 를 측정할 수 있다. 상기 차수벽, 차수부, 방수액은 에폭시 또는 우레탄 재질의 액체 방수재를 사용하여 빈 공간에 주입하 여 건조시킬 수 있으며, 재질은 상술한 재료로 한정되지 않고, 상기 방수액을 주입한 후, 신속히 응고시키기 위 해, 시공현장의 온도를 높이거나, 온풍을 제공할 수 있다. 또한, 상기 액체 방수액을 주입하기 전에 응고제, 경화제를 함께 주입할 수도 있다. 즉, 상기 액상의 우레탄 방 수재를 신속하게 경화시기키 위한 경화제로 이소시아네이트로 TDI, 변성 TDI, MDI, C-MDI, 변성 MDI, P-MDI, HMDI, TMDI, NDI, IPDI, XDI, HDI 내지 TODI 중 어느 하나 이상이 사용될 수 있다. 이상 본 발명에 따른 습도 데이터를 활용한 지하주차장의 단계별 차수공법에 대하여 상술하였다. 본 발명의 사 상 및 범위는 이러한 특정 실시예에 한정되는 것이 아니라, 본 발명의 요지를 변경하지 않는 범위 내에서 다양 하게 수정 및 변형이 가능하다는 것을 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자라면 이해할 것이다. 따라서, 이상에서 기술한 실시예들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 발명의 범주 를 완전하게 알려주기 위해 제공되는 것이므로, 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 하며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 산업상 이용가능성 본 발명에 따른 지하주차장의 차수공법은 지하주차장의 습도를 측정하고 측정된 데이터에 따라 단계별로 차수공 법을 진행함으로써 우수한 차수 효과를 얻을 수 있는 지하주차장의 차수공법에 이용될 수 있다."}
{"patent_id": "10-2019-0082091", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래 기술에 따른 차수벽이 마련된 지하주차장에 관한 단면 사시도, 도 2는 본 발명에 따른 지하주차장의 차수공법이 시공된 지하주차장에 관한 단면 사시도, 도 3은 본 발명에 따른 지하주차장의 차수공법에 관한 구성 블록도, 도 4는 본 발명에 따른 지하주차장의 차수공법의 순서도, 도 5a, 5b, 5c, 5d, 5e 및 5f는 본 발명에 따른 지하주차장의 차수공법의 진행과정에 대한 설명 사진이다."}
