{"patent_id": "10-2020-0095429", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0015202", "출원번호": "10-2020-0095429", "발명의 명칭": "렌즈 큐브, 콘택트렌즈 버츄얼 피팅 시스템 및 이를 이용한 콘택트렌즈 버츄얼 피팅 방법", "출원인": "주식회사 비즈닉스", "발명자": "장세진"}}
{"patent_id": "10-2020-0095429", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "매장 내 배치되는 콘택트렌즈를 수용하는 복수 개의 렌즈 큐브(40)가 배치되고 사용자의 ID 정보가 수신 가능한콘택트렌즈 전시 스탠드(20)와, 상기 콘택트렌즈 전시 스탠드(20)로부터의 상기 ID 정보를 수신하여 상기 ID 정보에 대응하여 저장된 ID 연계정보 및 컨택트 렌즈 정보를 송출 가능한 서버(30)를 포함하고, 상기 콘택트렌즈 전시 스탠드(20)는 상기 컨택트 렌즈 정보 중 선택된 셀렉션 컨택트 렌즈 정보를 상기 서버(30)로 전송하고, 상기 콘택트렌즈 전시 스탠드(20)로부터 상기 셀렉션 컨택트 렌즈 정보와 상기 ID 연계 정보에 포함되는 상기사용자 컨택트 렌즈 미착용 이미지 정보 및 사용자의 상기 사전 설정 컨택트 렌즈 착용 이미지 정보에기초하여, 상기 서버(30)에서 복수의 연산을 통하여 이미지 학습을 통한 상기 셀렉션 컨택트 렌즈에 대한 사용자의 가상 피팅 이미지가 생성되고, 상기 렌즈 큐브(40)은:내부에 콘택트렌즈를 수용할 수 있고 상기 콘택트렌즈 전시 스탠드(20)에 배치 가능한 렌즈 하우징(410)과, 상기 렌즈 하우징(410)에 배치되는 콘택트렌즈 측으로 광출사 가능한 렌즈 큐브 광원부(440)을 포함하는 것을특징으로 하는 콘택트렌즈 버츄얼 피팅 시스템(1)."}
{"patent_id": "10-2020-0095429", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서, 상기 콘택트렌즈 전시 스탠드(20)는:오프라인 매장에 배치되고 사전 설정 경사도를 갖는 스탠드 하우징(21)과,상기 스탠드 하우징(21)이 일측에 배치되어 내부 공간을 형성하는 스탠드 커버(23)와, 상기 스탠드 커버(23)와 상기 스탠드 하우징(21)의 내부 공간에 배치되고 상기 렌즈 큐브(40)과 접속되어 전기적 소통이 이루어지고, 상기 렌즈 큐브(40)에 전기적 신호를 인가하는 스탠드 터치 패널(25)과,상기 서버(30)에서 복수의 연산을 통하여 이미지 학습을 통해 생성된 사용자의 가상 피팅 이미지를 화상 표시하는 스탠드 디스플레이(271)를 포함하는 스탠드 출력부(27)와,사용자의 ID 정보가 입력되는 스탠드 입력부(29)와,적어도 상기 서버(30)와 통신을 이루는 스탠드 통신부(28)와,사용자 ID 정보를 저장하고, 상기 서버(30)로부터 송출되는 컨택트 렌즈 정보를 저장하는 스탠드 저장부(24)와,상기 스탠드 터치 패널(25)을 통하여 상기 렌즈 큐브(40) 측에 큐브 제어 신호를 인가하고 상기 렌즈 큐브(40)측으로부터 상기 컨택트 렌즈 정보 중 선택된 셀렉션 컨택트 렌즈 정보를 전달받고, 상기 사용자 ID 정보 및 상기 셀렉션 컨택트 렌즈 정보를 상기 서버(30)로 전송하여 상기 서버(30)에서 복수의 연산을 통하여 이미지 학습을 통하여 상기 셀렉션 컨택트 렌즈 정보에 대하여 생성된 사용자의 가상 피팅 이미지를 수신하도록 상기 스탠드 통신부(28)에 통신 제어 신호를 인가하는 스탠드 제어부(22)를 포함하고, 상기 렌즈 큐브(40)는:사용자의 선택 동작에 의하여 변화된 신호를 발생하는 렌즈 큐브 스위치(460)상기 스탠드렌즈 큐브 스위치(460)와 전기적으로 소통되고, 상기 스탠드 터치 패널(25) 측과 접속 가능한 렌즈공개특허 10-2022-0015202-3-큐브 접속부(450)를 포함하는 것을 특징으로 하는 콘택트렌즈 버츄얼 피팅 시스템(1)."}
{"patent_id": "10-2020-0095429", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 렌즈 큐브 광원부(440)는:상기 렌즈 큐브 하우징(410)의 내부에 배치되는 렌즈 큐브 기판(420)의 적어도 일부에 배치되는 렌즈 큐브 광원(441)와,상기 렌즈 큐브 광원(441)의 상측으로 상기 렌즈 큐브 하우징 커버 바디 렌즈 안착부(4115)의 하단에 배치되어상기 렌즈 큐브 광원(441)으로부터 생성되는 빛을 상기 렌즈 큐브 하우징 커버 바디 렌즈 안착부(4115) 측으로전달하는 렌즈 큐브 광전달부(443)를 포함하는 것을 특징으로 하는 콘택트렌즈 버츄얼 피팅 시스템(1)."}
{"patent_id": "10-2020-0095429", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서, 상기 렌즈 큐브 기판(420)은:상기 렌즈 큐브 광원(441)이 배치되는 렌즈 큐브 광원 기판(421)와,상기 렌즈 큐브 접속부(450)와 전기적으로 연결되는 렌즈 큐브 메인 기판(423)와,상기 렌즈 큐브 광원 기판(421)와 상기 렌즈 큐브 메인 기판(423)를 연결하는 렌즈 큐브 기판 연결부(425)를 포함하는 것을 특징으로 하는 콘택트렌즈 버츄얼 피팅 시스템(1)."}
{"patent_id": "10-2020-0095429", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 2항에 있어서, 상기 렌즈 큐브(40)는 상기 렌즈 큐브 하우징(410)을 탄성 지지하는 렌즈 큐브 탄성부(430)를 더 포함하고, 상기 렌즈 큐브 스위치(460)는, 상기 렌즈 큐브 탄성부(430)가 가압되어 상기 렌즈 큐브 하우징(410)의 위치 변동이 발생하는 경우 신호 변화를 생성하는 것을 특징으로 하는 콘택트렌즈 버츄얼 피팅 시스템(1)."}
{"patent_id": "10-2020-0095429", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5항에 있어서, 상기 렌즈 큐브 탄성부(430)는:상기 렌즈 큐브 하우징(410) 측에 가동 가능하게 수용 배치되는 렌즈 큐브 탄성체(431)와, 상기 렌즈 큐브 하우징(410) 측으로 상기 렌즈 큐브 탄성체(431) 측의 반대편에 일단이 상기 렌즈 큐브 탄성체(431)와 접촉 가능하게 형성되는 렌즈 큐브 탄성 지지부(433)를 포함하는 것을 특징으로 하는 콘택트렌즈 버츄얼 피팅 시스템(1)."}
{"patent_id": "10-2020-0095429", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 5항에 있어서, 상기 렌즈 큐브 하우징(410)은:상기 콘택트렌즈 전시 스탠드(20)에 위치하는 렌즈 큐브 하우징 바디(413)과, 공개특허 10-2022-0015202-4-상기 렌즈 큐브 하우징 바디(413)의 상단 측에 상대 가동 가능하게 배치되는 렌즈 큐브 하우징 커버(411)를 포함하는 것을 특징으로 하는 콘택트렌즈 버츄얼 피팅 시스템(1)."}
{"patent_id": "10-2020-0095429", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7항에 있어서, 상기 렌즈 큐브 하우징 바디(413)는:상기 콘택트렌즈 전시 스탠드(20) 측에 위치 안착되는 렌즈 큐브 하우징 바디 베이스(4133)와상기 렌즈 큐브 하우징 바디 베이스(4133)의 일단에 연장 형성되어 상기 렌즈 큐브 하우징 커버(411)와 함께 내부 공간을 형성하는 렌즈 큐브 하우징 바디 메인부(4131)를 포함하는 것을 특징으로 하는 콘택트렌즈 버츄얼 피팅 시스템(1)."}
{"patent_id": "10-2020-0095429", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7항에 있어서, 상기 렌즈 큐브 하우징 커버(411)는:외부에 노출 배치되는 렌즈 큐브 하우징 커버 바디(4111)와, 상기 렌즈 큐브 하우징 커버 바디(4111)의 하단에 연장 형성되는 렌즈 큐브 하우징 커버 바디 연장부(4113)와,콘택트렌즈가 안착 배치 가능하고, 상기 렌즈 큐브 하우징 커버 바디(4111)를 통하여 외부로 시각적으로 노출되도록 상기 렌즈 큐브 하우징 커버 바디(4111)가 형성하는 내측 공간에 배치되는 렌즈 큐브 하우징 커버 바디 렌즈 안착부(4115)를 포함하는 것을 특징으로 하는 콘택트렌즈 버츄얼 피팅 시스템(1)."}
{"patent_id": "10-2020-0095429", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 7항에 있어서, 상기 렌즈 큐브 스위치(460)는:상기 렌즈 큐브 하우징 바디(413) 측에 배치되고 상기 렌즈 큐브 접속부(450)와 전기적으로 연결되는 렌즈 큐브고정 스위치(461)와, 상기 렌즈 큐브 하우징 커버(411) 측에 배치되고 상기 렌즈 큐브 고정 스위치(461)와 접촉 단속 가능한 렌즈 큐브 가동 스위치(463)을 포함하는 것을 특징으로 하는 콘택트렌즈 버츄얼 피팅 시스템(1)."}
{"patent_id": "10-2020-0095429", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10항에 있어서, 상기 렌즈 큐브 접속부(450)는:상기 렌즈 큐브 고정 스위치(461) 측과 연결되는 렌즈 큐브 이너 접속부(451)와, 상기 스탠드 터치 패널(25)과 접속되는 렌즈 큐브 아우터 접속부(453)와,상기 렌즈 큐브 이너 접속부(451)와 상기 렌즈 큐브 아우터 접속부(453)을 연결하는 렌즈 큐브 연결 접속부(455)를 포함하는 것을 특징으로 하는 콘택트렌즈 버츄얼 피팅 시스템(1)."}
{"patent_id": "10-2020-0095429", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "공개특허 10-2022-0015202-5-제 7항에 있어서, 상기 콘택트렌즈 전시 스탠드(20)는 상기 스탠드 하우징(21)의 내부에 배치되는 렌즈 큐브 홀더 베이스(51)을포함하고, 상기 렌즈 큐브(40)는 상기 렌즈 큐브 홀더 베이스(51)와 대응하여 위치 고정되는 렌즈 큐브 홀더 베이스 대응부(53)를 포함하는 것을 특징으로 하는 콘택트렌즈 버츄얼 피팅 시스템(1)."}
{"patent_id": "10-2020-0095429", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12항에 있어서, 상기 렌즈 큐브 홀더 베이스(51)는 자성체 및 마그네트 중의 하나를 포함하고, 상기 렌즈 큐브 홀더 베이스 대응부(53)는 자성체 및 마그네트 중의 다른 하나를 포함하고, 상기 렌즈 큐브 하우징 바디(413)에 배치되는 것을 특징으로 하는 콘택트렌즈 버츄얼 피팅 시스템(1)."}
{"patent_id": "10-2020-0095429", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 12항에 있어서, 상기 스탠드 렌즈 포지션 홀더(211,211a)는 상기 렌즈 큐브 하우징 바디(413)의 저면에 미끄럼 방지 패드를 포함하는 것을 특징으로 하는 콘택트렌즈 버츄얼 피팅 시스템(1)."}
{"patent_id": "10-2020-0095429", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 1항에 있어서, 상기 콘택트렌즈 전시 스탠드(20)는:상기 서버(30)에서 복수의 연산을 통하여 이미지 학습을 통해 생성된 사용자의 가상 피팅 이미지를 화상 표시하는 스탠드 디스플레이(271)를 포함하는 스탠드 출력부(27)와,사용자의 ID 정보가 입력되는 스탠드 입력부(29)와,상기 서버(30) 및 상기 렌즈 큐브(40)와 통신을 이루는 스탠드 통신부(28)와,사용자 ID 정보를 저장하고, 상기 서버(30)로부터 송출되는 컨택트 렌즈 정보를 저장하는 스탠드 저장부(24)와,상기 스탠드 통신부(28)를 통하여 상기 렌즈 큐브(40) 측에 큐브 제어 신호를 인가하고 상기 렌즈 큐브(40) 측으로부터 상기 컨택트 렌즈 정보 중 선택된 셀렉션 컨택트 렌즈 정보를 전달받고, 상기 사용자 ID 정보 및 상기셀렉션 컨택트 렌즈 정보를 상기 서버(30)로 전송하여 상기 서버(30)에서 복수의 연산을 통하여 이미지 학습을통하여 상기 셀렉션 컨택트 렌즈 정보에 대하여 생성된 사용자의 가상 피팅 이미지를 수신하도록 상기 스탠드통신부(28)에 통신 제어 신호를 인가하는 스탠드 제어부(22)를 포함하고, 상기 렌즈 큐브(40)는:사용자의 선택 동작에 의하여 변화된 신호를 발생하는 렌즈 큐브 스위치(460)와, 상기 렌즈 큐브 스위치(460)의 신호를 입력받는 렌즈 큐브 제어부(44)와, 상기 렌즈 큐브 제어부(33)의 통신 제어 신호에 따라 상기 스탠드 통신부(28)와 신호 전달을 이루는 렌즈 큐브통신부(48)를 포함하는 것을 특징으로 하는 콘택트렌즈 버츄얼 피팅 시스템(1)."}
{"patent_id": "10-2020-0095429", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15항에 있어서, 공개특허 10-2022-0015202-6-사용자가 렌즈 큐브 스위치(460)를 가동시키는 경우, 상기 렌즈 큐브 제어부(44)는 상기 렌즈 큐브 통신부(48)를 통하여 사용자가 선택한 렌즈 큐브(40)에 대한 셀렉션 정보를 전달하는 것을 특징으로 하는 콘택트렌즈 버츄얼 피팅 시스템(1)."}
{"patent_id": "10-2020-0095429", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 10항에 있어서, 상기 서버(30)에서 사용자의 ID 정보에 연계되는 ID 연계 정보 및 사용자에 대하여 추천되는 레커멘드 콘택트렌즈 정보(개인별 또는 순위별)를 포함하는 콘택트렌즈 정보가 상기 콘택트렌즈 전시 스탠드(20)로 전달하고, 상기 콘택트렌즈 전시 스탠드(20)는 상기 레커멘드 콘택트렌즈 정보에 대응하는 렌즈 큐브(40)로 정보를 전달하고, 상기 레커멘드 콘택트렌즈 정보에 대응하는 렌즈 큐브(40)의 상기 렌즈 큐브 제어부(44)는 상기 콘택트렌즈 전시 스탠드(20)로부터 상기 렌즈 큐브 통신부(48)를 통하여 상기 레커멘드 콘택트렌즈 정보를 전달받는 것을 특징으로 하는 콘택트렌즈 버츄얼 피팅 시스템(1)."}
{"patent_id": "10-2020-0095429", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 17항에 있어서, 상기 레커멘드 콘택트렌즈 정보에 대응하는 렌즈 큐브(40)의 상기 렌즈 큐브 제어부(44)는 상기 렌즈 큐브 광원부(440)에 광출력 제어 신호를 인가하는 것을 특징으로 하는 콘택트렌즈 버츄얼 피팅 시스템(1)."}
{"patent_id": "10-2020-0095429", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "매장 내 배치되고 사용자의 ID 정보가 수신 가능한 콘택트렌즈 전시 스탠드(20)에 배치되고 콘택트렌즈를 수용하는 렌즈 큐브로서,상기 콘택트렌즈 전시 스탠드(20)로부터의 상기 ID 정보를 수신하여 상기 ID 정보에 대응하여 저장된 ID 연계정보 및 컨택트 렌즈 정보를 송출 가능한 서버(30)를 포함하고, 상기 콘택트렌즈 전시 스탠드(20)는 상기 컨택트 렌즈 정보 중 선택된 셀렉션 컨택트 렌즈 정보를 상기 서버(30)로 전송하고, 상기 콘택트렌즈 전시 스탠드(20)로부터 상기 셀렉션 컨택트 렌즈 정보와 상기 ID 연계 정보에 포함되는 상기 사용자 컨택트 렌즈 미착용 이미지 정보 및 사용자의 상기 사전 설정 컨택트 렌즈 착용 이미지 정보에 기초하여, 상기 서버(30)에서 복수의연산을 통하여 이미지 학습을 통한 상기 셀렉션 컨택트 렌즈에 대한 사용자의 가상 피팅 이미지가 생성되는 경우, 내부에 콘택트렌즈를 수용할 수 있고 상기 콘택트렌즈 전시 스탠드(20)에 배치 가능한 렌즈 하우징(410)과, 상기 렌즈 하우징(410)에 배치되는 콘택트렌즈 측으로 광출사 가능한 렌즈 큐브 광원부(440)을 포함하는 것을특징으로 하는 렌즈 큐브(40)."}
{"patent_id": "10-2020-0095429", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 매장 내 배치되는 콘택트렌즈를 수용하는 복수 개의 렌즈 큐브가 배치되고 사용자의 ID 정보가 수 신 가능한 콘택트렌즈 전시 스탠드와, 상기 콘택트렌즈 전시 스탠드로부터의 상기 ID 정보를 수신하여 상기 ID 정보에 대응하여 저장된 ID 연계 정보 및 컨택트 렌즈 정보를 송출 가능한 서버를 포함하고, 상기 (뒷면에 계속)"}
{"patent_id": "10-2020-0095429", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 렌즈 큐브, 콘택트렌즈 전시 스탠드, 콘택트렌즈 버츄얼 피팅 시스템 및 이를 이용한 콘택트렌즈 버 츄얼 피팅 방법에 관한 것으로, 더욱 상세하게는 이미지 학습을 통하여 사용자가 선택 내지 추천된 콘택트렌즈 에 대한 착용 이미지를 생성하는 콘택트렌즈 버츄얼 피팅 시스템 및 이를 이용한 콘택트렌즈 버츄얼 피팅 방법 및 렌즈 큐브, 콘택트렌즈 전시 스탠드에 관한 것이다."}
{"patent_id": "10-2020-0095429", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "콘택트렌즈는 안구의 전면에 밀착시켜서 시력을 교정 내지 향상시키도록 하는 렌즈이다. 콘택트렌즈는 의학적 용도는 물론, 직업상 안경이 흐리거나 위험한 경우에 사용되며, 미용상으로 안경의 사용을 원하지 않는 경우나, 의안을 보기 좋게 하기 위하여 사용된다. 이러한 콘택트렌즈는 시선과 렌즈의 광축이 일치하므로 수차가 없을 뿐만 아니라, 좌우의 굴절도가 달라서 망막 상의 크기에 차이가 없어 물체가 이중으로 보이거나 일그러져 보이는 일이 없으므로 시야가 넓으며, 시력이 좋 아지는 점 등으로 인해 널리 사용되고 있다. 최근에는 렌즈에 다양한 컬라를 코팅 등의 방법으로 구현한 컬라 콘택트렌즈가 인기를 모으고 있다. 이러한 콘택트렌즈의 종류 증가로 인해, 콘택트렌즈를 판매하는 안경점 등에서는 진열 공간을 확보하여 다양한 종류의 콘택트렌즈를 소비자가 쉽게 볼 수 있도록 진열하고 있다. 그런데 콘택트렌즈는 선전이나 판매 등을 위해서 전시할 경우, 콘택트렌즈의 특성상 보관에 어려움이 따를 뿐만 아니라, 여러 가지 컬러를 가진 많은 종류의 콘택트렌즈를 쉽게 볼 수 있도록 하는데 어려움이 있다. 또한 콘택 트렌즈는 샘플 착용이 어려워 판매자가 소비자의 시력을 검사한 후에 소비자의 선택에 따라 시력에 적합한 제품 을 착용과정 없이 판매하게 된다. 따라서 소비자는 착용 상태를 확인하지 못하고 콘택트렌즈를 구매해야 하는 문제점이 있다. 이러한 점을 해결하기 위한 것으로, 등록실용신안공보 제0470737호(2014. 01. 07)에는 콘택트렌즈 드라이 디스 플레이 장치가 개시되어 있다. 상기 공보에 개시되어 있는 장치는, 콘택트렌즈를 수용하는 투명 아크릴 재질의 케이스와, 케이스가 복수 개 고정되는 베이스판을 포함하고, 베이스판에 콘택트렌즈의 제품명칭 및 금액 등을 구매자가 육안으로 확인할 수 있도록 하는 설명부와, 콘택트렌즈를 착용한 착용 사진이 배치되는 예시부가 구비 된다. 그런데 이러한 종래 장치는 콘택트렌즈에 대한 정보를 인쇄된 문자나 사진으로 보여주므로, 콘택트렌즈의 진열 개수가 증가함에 따라 크기가 커지는 단점이 있고, 소비자에게 제공하는 정보가 단순한 한계가 있다. 즉, 단순한 콘택트렌즈의 이미지 정보만으로는 실제 착용자의 착용 후 이미지 간에 간극이 발생할 가능성이 매 우 높다. 뿐만 아니라, 코로나19의 영향으로 비접촉의 영향과 더불어 기존의 감염 위험으로 콘택트렌즈의 착 용 후 구매가 불가하여 구매전 소비자가 생각한 이미지와 구매후 착용한 이미지 간에 상당한 괴리가 발생하였다. 이를 해결하고자 종래 기술의 일환으로 사용자의 안면 이미지에 콘택트렌즈 이미지를 단순 합성하여 착용 이미 지를 출력하는 장치가 개발되었다. 하지만, 이러한 단순 합성 이미지의 경우 단순 출력 이미지와 실제 착용 후 이미지 간에 간극은 여전하다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록실용신안공보 제0470737호 (2014. 01. 07)"}
{"patent_id": "10-2020-0095429", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 것과 같은 종래 기술의 문제점을 해결하기 위한 것으로, 사전에 알려진 콘택트렌즈의 착용 내 지 미착용 이미지와 사용자가 선택한 콘택트렌즈 내지 추천된 콘택트렌즈 정보 등 콘택트렌즈 정보를 이용하여 인공지능 학습 과정을 통하여 새로이 생성된 가상의 버츄얼 착용 이미지를 생성하는 콘택트렌즈 버츄얼 피팅 시 스템 내지 콘택트렌즈 버츄얼 피팅 방법을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2020-0095429", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 바와 같은 목적을 해결하기 위한 본 발명에 따른 콘택트렌즈 버츄얼 피팅 시스템은, 설치된 어플리케이 션을 통하여 사용자의 ID 정보 및 사용자의 사전 설정 콘택트렌즈 착용 이미지 정보를 송출 가능한 사용자 단말 기와, 상기 사용자 단말기로부터의 상기 ID 정보 및 상기 ID 정보에 대응하여 저장된 ID 연계 정보 및 콘택트렌즈 정보를 송출 가능한 서버를 포함하고, 상기 사용자 단말기는 사용자 콘택트렌즈 미착용 이 미지 정보 및 상기 콘택트렌즈 정보 중 선택된 셀렉션 콘택트렌즈 정보를 상기 서버로 전송하고, 상기 사용 자 단말기로부터 상기 사용자 콘택트렌즈 미착용 이미지 정보 및 상기 셀렉션 콘택트렌즈 정보와 상기 ID 연계 정보에 포함되는 사용자의 상기 사전 설정 콘택트렌즈 착용 이미지 정보에 기초하여, 복수의 연산을 통하 여 이미지 학습을 통한 사용자의 가상 피팅 이미지를 생성하는 서버를 포함하는 콘택트렌즈 버츄얼 피팅 시 스템을 제공한다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 서버는: 통신 네트워크를 통하여 상기 사용자 단말기 와 송수신하는 서버 통신부와, 상기 서버 통신부에서 수신된 데이터를 저장하는 서버 저장부와, 상기 서버 통신부 및 상기 서버 저장부를 제어하고, 상기 사용자 단말기로부터 상기 사용자 콘택트렌즈 미착용 이미지 정보 및 상기 셀렉션 콘택트렌즈 정보와 상기 ID 연계 정보에 포함되는 사용 자의 상기 사전 설정 콘택트렌즈 착용 이미지 정보를 영상 처리하고 이미지 학습을 통한 사용자의 가상 피팅 이 미지를 생성하는 서버 제어부를 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 서버 제어부는: 상기 서버 통신부 및 상기 서버 저장부를 제어하는 제어 모듈과, 상기 제어 모듈의 이미지 학습 제어 신호에 따라, 상기 사용자 단말기로부터 상기 사용자 콘택트렌즈 미착용 이미지 정보 및 상기 셀렉션 콘택트렌즈 정보와 상기 ID 연계 정보에 포함되는 사용자의 상기 사전 설정 콘택트렌즈 착용 이미지 정보를 영상 처리하고 이미지 학습을 통한 사용자의 가상 피팅 이미지를 생성하는 AI 모듈를 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 사용자의 상기 사용자 콘택트렌즈 미착용 이미지 정보 및 상기 사전 설정 콘택트렌즈 착용 이미지 정보로부터 안구 영역 이미지를 추출 처리하는 영상 처리 모듈를 포함 할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 제어 모듈은 상기 서버 통신부 및 상기 서버 저 장부를 제어하는 통신 및 저장 신호를 인가하는 통신 저장 제어 모듈과, 상기 AI 모듈의 이미지 학습을 학습 제어 신호를 인가하는 AI 제어 모듈과, 상기 영상 처리 모듈에 영상 처리 제어 신호를 인가하는 영상 처리 제어 모듈을 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 AI 모듈은: 상기 사용자 콘택트렌즈 미착용 이미지 정보 및 사용자의 상기 사전 설정 콘택트렌즈 착용 이미지 정보를 입력받아 복수의 연산을 실행하는 AI 뉴럴 네 트워크 모듈과, 상기 AI 제어 모듈의 학습 제어 신호에 따라 상기 AI 뉴럴 네트워크 모듈에 AI 학습 신호를 인가하는 AI 러닝 모듈을 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 AI 뉴럴 네트워크 모듈은: 적어도 상기 사용자 콘택 트렌즈 미착용 이미지 정보 및 콘택트렌즈 정보의 입력되는 이미지 정보를 이용하여 가중치 적용 가능한 복수의 연산을 통해 해당 콘택트렌즈에 대한 콘택트렌즈 착용 제네러티브 이미지 정보를 생성하는 제네레이터와, 상기 해당 콘택트렌즈 착용 제네러티브 이미지 정보와 사용자의 상기 사전 설정 콘택트렌 즈 착용 이미지 정보를 이용하여 가중치 적용 가능한 복수의 연산을 통해 해당 콘택트렌즈 착용 제네러티브 이 미지 정보가 실제인지 페이크인지 여부를 판단하는 디스크리미네이터를 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 AI 러닝 모듈은 상기 AI 뉴럴 네트워크 모듈 의 상기 제네레이터 및 상기 디스크리미네이터에 학습 제어 신호를 인가하되, 상기 AI 러닝 모듈 이 상기 제네레이터에 제네레이션 학습 제어 신호를 인가하는 경우, 상기 디스크리미네이터 가 입력되는 상기 콘택트렌즈 착용 제네러티브 이미지 정보가 실제인 것으로 판단하도록 상기 AI 러닝 모듈이 상기 제네레이터의 복합 연산 가중치를 조정할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 AI 러닝 모듈은 상기 AI 뉴럴 네트워크 모듈 의 상기 제네레이터 및 상기 디스크리미네이터에 학습 제어 신호를 인가하되, 상기 AI 러닝 모듈 이 상기 디스크리미네이터에 디스크리미네이션 학습 제어 신호를 인가하는 경우, 상기 제네레이터 에서 생성되어 상기 디스크리미네이터에 입력되는 상기 콘택트렌즈 착용 제네러티브 이미지 정 보가 페이크인 것으로 상기 디스크리미네이터가 판단하도록 상기 AI 러닝 모듈이 상기 디스크리미네이터의 복합 연산 가중치를 조정할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 AI 러닝 모듈은 상기 AI 뉴럴 네트워크 모듈 의 상기 제네레이터 및 상기 디스크리미네이터에 학습 제어 신호를 인가하되, 상기 AI 러닝 모듈 이 상기 디스크리미네이터에 디스크리미네이션 학습 제어 신호를 인가하는 경우, 상기 제네레이터 에서 생성되어 상기 디스크리미네이터에 입력되는 상기 콘택트렌즈 착용 제네러티브 이미지 정 보가 페이크인 것으로 상기 디스크리미네이터의 제1디스크리미네이터313131)가 판단하도록 상기 AI 러닝 모듈이 상기 디스크리미네이터의 복합 연산 가중치를 조정하고, 상기 AI 러닝 모듈이 상기 디스크리미네이터에 디스크리미네이션 학습 제어 신호를 인가하는 경우, 상기 제네레이터에서 생 성되어 상기 디스크리미네이터에 입력되는 상기 콘택트렌즈 착용 제네러티브 이미지 정보가 실제인 것으로 상기 디스크리미네이터의 제2디스크리미네이터313132)가 판단하도록 상기 AI 러닝 모듈이 상 기 디스크리미네이터의 복합 연산 가중치를 조정할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 영상 처리 모듈은: 상기 AI 뉴럴 네트워크 모듈 에서의 학습 결과 및 상기 셀렉션 콘택트렌즈 정보를 이용하여, 상기 셀렉션 콘택트렌즈 착용한 사용자의 가상 피팅 이미지를 생성하는 영상 생성 모듈을 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 영상 처리 모듈은: 상기 사용자 콘택트렌즈 미착용 이미지 정보 및 사용자의 상기 사전 설정 콘택트렌즈 착용 이미지 정보 중 안구 영역의 이미지를 추출 가능한 영상 추출 모듈을 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 사용자 단말기는 사용자의 영상 정보를 입력 가능한 단말 카메라를 포함하는 단말 입력부를 포함할 수도 있다. 본 발명의 다른 일면에 따르면, 본 발명은 사용자 단말기에 설치된 어플리케이션을 통하여 사용자의 ID 정 보가 서버로 송출되고 사용자의 ID 정보에 연계된 ID 연계 정보 및 콘택트렌즈 정보를 요청하는 정보 전송 및 정보 요청 단계(S10)와, 상기 서버에서 사용자의 ID 정보에 연계된 ID 연계 정보 및 콘택트렌즈 정보가 상기 사용자 단말기로 송출되는 정보 전송 및 정보 송출 단계(S11)와, 상기 사용자 단말기에 설치된 어 플리케이션을 통하여 사용자의 사전 설정 콘택트렌즈 착용 이미지 및 사용자 콘택트렌즈 미착용 이미지 정보가 취득되는 이미지가 취득 저장되는 사용자 이미지 취득 저장 단계(S13,S15)와, 상기 사용자의 사전 설정 콘택트 렌즈 착용 이미지 및 사용자 콘택트렌즈 미착용 이미지 정보가 상기 서버로 전송되는 사용자 이미지 전송 단계 (S16)와, 상기 콘택트렌즈 정보 중 선택된 셀렉션 콘택트렌즈 정보를 상기 서버로 전송하는 셀렉션 콘택트 렌즈 정보 전송 단계(S17)와, 상기 서버에 수신된 상기 사용자의 사전 설정 콘택트렌즈 착용 이미지 및 사 용자 콘택트렌즈 미착용 이미지 정보가 사용자의 ID 정보에 대응하는 ID 연계 정보로 저장되는 사용자 이미지 서버 저장 단계(S18)와, 상기 사용자의 사전 설정 콘택트렌즈 착용 이미지 및 사용자 콘택트렌즈 미착용 이미지 정보에 기초하여, 복수의 연산을 통하여 이미지 학습을 통한 상기 셀렉션 콘택트렌즈에 대한 사용자의 가상 피 팅 이미지를 생성하는 사용자 이미지 AI 프로세싱 단계(S193)를 구비하는 사용자 착용 이미지 프로세싱 단계 (S19)를 포함하는 콘택트렌즈 버츄얼 피팅 방법을 제공한다. 상기 콘택트렌즈 버츄얼 피팅 방법에 있어서, 상기 사용자 착용 이미지 프로세싱 단계(S19)는, 상기 사용자 이 미지 AI 프로세싱 단계(S193)의 실행 전에, 사용자의 안구 이미지 정보를 이용하여 보정하는 사용자 이미지 보 정 단계(S191)를 더 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 방법에 있어서, 상기 사용자 이미지 보정 단계(S191)는: 상기 서버의 서버 제 어부에 구비되어, 서버의 서버 통신부 및 서버 저장부를 제어하는 제어 모듈의 영상 처리 모듈에 사용자의 상기 사용자 콘택트렌즈 미착용 이미지 정보 및 상기 사전 설정 콘택트렌즈 착용 이미지 정보가 입력되는 이미지 정보 입력 단계(S1911)와, 상기 영상 처리 모듈의 영상 추출 모듈에서 상기 사용자 콘택트렌즈 미착용 이미지 정보 및 사용자의 상기 사전 설정 콘택트렌즈 착용 이미지 정보 중 안구 영역 의 이미지를 추출하는 대상 이미지 추출 단계(S1913)와, 상기 영상 처리 모듈의 영상 추출 모듈에서 상기 사전 설정 콘택트렌즈 착용 이미지 정보 중 안구 영역의 이미지를 보정하는 대상 이미지 보정 단계(S191 5)를 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 방법에 있어서, 상기 대상 이미지 추출 단계(S1913)는: 상기 사용자 콘택트렌즈 미착용 이미지 정보 및 사용자의 상기 사전 설정 콘택트렌즈 착용 이미지 정보 중 안구 영역의 스크레라 (sclera;공막(鞏膜)) 영역의 이미지를 추출하는 대상 이미지 스크레라 추출 단계(S19131)와, 상기 사용자 콘택트렌즈 미착용 이미지 정보 및 사용자의 상기 사전 설정 콘택트렌즈 착용 이미지 정보 중 안구 영역의 퓨플 아 이리스(pupil, iris;동공(瞳孔), 홍채(虹彩)) 영역의 이미지를 추출하는 대상 이미지 퓨플 아이리스 추출 단계 (S19133)을 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 방법에 있어서, 상기 대상 이미지 보정 단계(S1915)는: 상기 대상 이미지 스크레 라 추출 단계(S19131)에서 추출된 상기 대상 이미지 스크레라(sclera;공막(鞏膜)) 영역 확인 단계(S19151)과, 상기 대상 이미지 스크레라(sclera;공막(鞏膜)) 영역의 이미지 정보를 이용하여 색 보정 데이터를 확인하는 대 상 이미지 스크레라 보정 산출 단계(S19153)과, 상기 대상 이미지 스크레라 보정 산출 단계(S19153)에서 확인된 색 보정 데이터를 이용하여, 상기 대상 이미지 퓨플 아이리스(pupil, iris;동공(瞳孔), 홍채(虹彩)) 영역의 이 미지 정보 및 상기 대상 이미지 스크레라(sclera;공막(鞏膜)) 영역의 이미지 정보를 보정하는 대상 이미지 보정 를 추출하는 대상 이미지 보정 실행 단계(S19155)를 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 방법에 있어서, 상기 사용자 이미지 AI 프로세싱 단계(S193)는: 상기 사용자의 사 전 설정 콘택트렌즈 착용 이미지 및 사용자 콘택트렌즈 미착용 이미지 정보를 입력 확인하는 이미지 데이터 입 력 확인 단계(S1931)와, 상기 사용자 콘택트렌즈 미착용 이미지 정보 및 사전 설정 콘택트렌즈 정보를 이용하여, 복수의 연산을 통하여 사용자의 사전 설정 콘택트렌즈를 착용한 착용 제네레이팅 이미지를 생성하는 착용 제네레이팅 이미지 생성 단계(S1933)와, 상기 서버 측의 AI 뉴럴 네트워크 모듈의 제네레이터 및 디스크리미네티어가, 상기 사용자의 사전 설정 콘택트렌즈 착용 이미지 및 상기 착용 제네레 이팅 이미지를 이용하여 복수의 연산을 통해 이미지 학습되는 이미지 러닝 단계(S1935)와, 상기 이미지 러닝 단 계(S1935)에서 학습된 AI 뉴럴 네트워크 모듈의 제네레이터를 통하여 적어도 상기 사용자 콘택트 렌즈 미착용 이미지 정보 및 콘택트렌즈 정보의 입력되는 이미지 정보를 이용하여 가중치 적용 가능한 복수의 연산을 통해 다른 콘택트렌즈에 대한 콘택트렌즈 착용 제네러티브 이미지 정보가 생성되는 피팅 이미지 출력 단 계(S1937)를 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 방법에 있어서, 상기 이미지 러닝 단계(S1935)는: 상기 제어 모듈의 AI 러닝 모듈에 구비되는 AI 러닝 모듈이 상기 디스크리미네이터에 학습 제어 신호를 인가하여, 상 기 제네레이터에서 생성되어 상기 디스크리미네이터에 입력되는 상기 콘택트렌즈 착용 제네러티 브 이미지 정보와 상기 사용자의 사전 설정 콘택트렌즈 착용 이미지를 비교하여 상기 콘택트렌즈 착용 제네러티 브 이미지 정보가 페이크인 것으로 상기 디스크리미네이터가 판단하도록 상기 AI 러닝 모듈이 상 기 디스크리미네이터의 복합 연산 가중치를 조정하는 디스크리미네이션 러닝 단계(S19351)과, 상기 제어 모듈의 AI 러닝 모듈에 구비되는 AI 러닝 모듈이 상기 디스크리미네이터에 학습 제어 신호를 인가하여, 상기 디스크리미네이터가 입력되는 상기 콘택트렌즈 착용 제네러티브 이미지 정보가 실제인 것으로 판단하도록 상기 AI 러닝 모듈이 상기 제네레이터의 복합 연산 가중치를 조정하는 제네네이션 러닝 단계(S19353)를 포함할 수도 있다. 본 발명의 다른 일면에 따르면, 본 발명은 매장 내 배치되는 콘택트렌즈를 수용하는 복수 개의 렌즈 큐브가 배 치되고 사용자의 ID 정보가 수신 가능한 콘택트렌즈 전시 스탠드와, 상기 콘택트렌즈 전시 스탠드로부 터의 상기 ID 정보를 수신하여 상기 ID 정보에 대응하여 저장된 ID 연계 정보 및 콘택트렌즈 정보를 송출 가능 한 서버를 포함하고, 상기 콘택트렌즈 전시 스탠드는 상기 콘택트렌즈 정보 중 선택된 셀렉션 콘택트렌 즈 정보를 상기 서버로 전송하고, 상기 콘택트렌즈 전시 스탠드로부터 상기 셀렉션 콘택트렌즈 정보와 상기 ID 연계 정보에 포함되는 상기 사용자 콘택트렌즈 미착용 이미지 정보 및 사용자의 상기 사전 설정 콘택트 렌즈 착용 이미지 정보에 기초하여, 상기 서버에서 복수의 연산을 통하여 이미지 학습을 통한 상기 셀렉션 콘택트렌즈에 대한 사용자의 가상 피팅 이미지가 생성되는 콘택트렌즈 버츄얼 피팅 시스템을 제공한다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 콘택트렌즈 전시 스탠드는: 오프라인 매장에 배치 되고 사전 설정 경사도를 갖는 스탠드 하우징과, 상기 스탠드 하우징이 일측에 배치되어 내부 공간을 형성하는 스탠드 커버와, 상기 스탠드 커버와 상기 스탠드 하우징의 내부 공간에 배치되고 상기 렌 즈 큐브과 접속되어 전기적 소통이 이루어지고, 상기 렌즈 큐브에 전기적 신호를 인가하는 스탠드 터치 패널과, 상기 서버에서 복수의 연산을 통하여 이미지 학습을 통해 생성된 사용자의 가상 피팅 이미지를 화상 표시하는 스탠드 디스플레이를 포함하는 스탠드 출력부와, 사용자의 ID 정보가 입력되는 스탠드 입력부와, 적어도 상기 서버와 통신을 이루는 스탠드 통신부와, 사용자 ID 정보를 저장하고, 상기 서버로부터 송출되는 콘택트렌즈 정보를 저장하는 스탠드 저장부와, 상기 스탠드 터치 패널을 통하 여 상기 렌즈 큐브 측에 블록 제어 신호를 인가하고 상기 렌즈 큐브 측으로부터 상기 콘택트렌즈 정보 중 선택된 셀렉션 콘택트렌즈 정보를 전달받고, 상기 사용자 ID 정보 및 상기 셀렉션 콘택트렌즈 정보를 상기서버로 전송하여 상기 서버에서 복수의 연산을 통하여 이미지 학습을 통하여 상기 셀렉션 콘택트렌즈 정보에 대하여 생성된 사용자의 가상 피팅 이미지를 수신하도록 상기 스탠드 통신부에 통신 제어 신호를 인 가하는 스탠드 제어부를 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 서버는: 통신 네트워크를 통하여 상기 콘택트렌즈 전시 스탠드와 송수신하는 서버 통신부와, 상기 서버 통신부에서 수신된 데이터를 저장하는 서버 저장부와, 상기 서버 통신부 및 상기 서버 저장부를 제어하고, 상기 콘택트렌즈 전시 스탠드로 부터 상기 사용자 콘택트렌즈 미착용 이미지 정보 및 상기 셀렉션 콘택트렌즈 정보와 상기 ID 연계 정보에 포함 되는 사용자의 상기 사전 설정 콘택트렌즈 착용 이미지 정보를 영상 처리하고 이미지 학습을 통한 사용자의 가 상 피팅 이미지를 생성하는 서버 제어부를 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 서버 제어부는: 상기 서버 통신부 및 상기 서 버 저장부를 제어하는 제어 모듈과, 상기 제어 모듈의 이미지 학습 제어 신호에 따라, 상기 사용 자 콘택트렌즈 미착용 이미지 정보 및 상기 셀렉션 콘택트렌즈 정보와 상기 ID 연계 정보에 포함되는 사용자의 상기 사전 설정 콘택트렌즈 착용 이미지 정보를 영상 처리하고 이미지 학습을 통한 사용자의 가상 피팅 이미지 를 생성하는 AI 모듈를 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 사용자의 상기 사용자 콘택트렌즈 미착용 이미지 정보 및 상 기 사전 설정 콘택트렌즈 착용 이미지 정보로부터 안구 영역 이미지를 추출 처리하는 영상 처리 모듈를 포 함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 제어 모듈은 상기 서버 통신부 및 상기 서버 저장부를 제어하는 통신 및 저장 신호를 인가하는 통신 저장 제어 모듈과, 상기 AI 모듈의 이미 지 학습을 학습 제어 신호를 인가하는 AI 제어 모듈과, 상기 영상 처리 모듈에 영상 처리 제어 신호 를 인가하는 영상 처리 제어 모듈을 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 AI 모듈은: 상기 사용자 콘택트렌즈 미착용 이미 지 정보 및 사용자의 상기 사전 설정 콘택트렌즈 착용 이미지 정보를 입력받아 복수의 연산을 실행하는 AI 뉴럴 네트워크 모듈과, 상기 AI 제어 모듈의 학습 제어 신호에 따라 상기 AI 뉴럴 네트워크 모듈 에 AI 학습 신호를 인가하는 AI 러닝 모듈을 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 AI 뉴럴 네트워크 모듈은: 적어도 상기 사용자 콘택트렌즈 미착용 이미지 정보 및 콘택트렌즈 정보의 입력되는 이미지 정보를 이용하여 가중치 적용 가능한 복 수의 연산을 통해 해당 콘택트렌즈에 대한 콘택트렌즈 착용 제네러티브 이미지 정보를 생성하는 제네레이터 와, 상기 해당 콘택트렌즈 착용 제네러티브 이미지 정보와 사용자의 상기 사전 설정 콘택트렌즈 착용 이 미지 정보를 이용하여 가중치 적용 가능한 복수의 연산을 통해 해당 콘택트렌즈 착용 제네러티브 이미지 정보가 실제인지 페이크인지 여부를 판단하는 디스크리미네이터를 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 AI 러닝 모듈은 상기 AI 뉴럴 네트워크 모듈 의 상기 제네레이터 및 상기 디스크리미네이터에 학습 제어 신호를 인가하되, 상기 AI 러 닝 모듈이 상기 제네레이터에 제네레이션 학습 제어 신호를 인가하는 경우, 상기 디스크리미네이 터가 입력되는 상기 콘택트렌즈 착용 제네러티브 이미지 정보가 실제인 것으로 판단하도록 상기 AI 러닝 모듈이 상기 제네레이터의 복합 연산 가중치를 조정할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 AI 러닝 모듈은 상기 AI 뉴럴 네트워크 모듈 의 상기 제네레이터 및 상기 디스크리미네이터에 학습 제어 신호를 인가하되, 상기 AI 러 닝 모듈이 상기 디스크리미네이터에 디스크리미네이션 학습 제어 신호를 인가하는 경우, 상기 제 네레이터에서 생성되어 상기 디스크리미네이터에 입력되는 상기 콘택트렌즈 착용 제네러티브 이 미지 정보가 페이크인 것으로 상기 디스크리미네이터가 판단하도록 상기 AI 러닝 모듈이 상기 디 스크리미네이터의 복합 연산 가중치를 조정할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 AI 러닝 모듈은 상기 AI 뉴럴 네트워크 모듈 의 상기 제네레이터 및 상기 디스크리미네이터에 학습 제어 신호를 인가하되, 상기 AI 러 닝 모듈이 상기 디스크리미네이터에 디스크리미네이션 학습 제어 신호를 인가하는 경우, 상기 제 네레이터에서 생성되어 상기 디스크리미네이터에 입력되는 상기 콘택트렌즈 착용 제네러티브 이 미지 정보가 페이크인 것으로 상기 디스크리미네이터의 제1디스크리미네이터313131)가 판단하도록 상기AI 러닝 모듈이 상기 디스크리미네이터의 복합 연산 가중치를 조정하고, 상기 AI 러닝 모듈(313 3)이 상기 디스크리미네이터에 디스크리미네이션 학습 제어 신호를 인가하는 경우, 상기 제네레이터 에서 생성되어 상기 디스크리미네이터에 입력되는 상기 콘택트렌즈 착용 제네러티브 이미지 정 보가 실제인 것으로 상기 디스크리미네이터의 제2디스크리미네이터313132)가 판단하도록 상기 AI 러닝 모듈이 상기 디스크리미네이터의 복합 연산 가중치를 조정할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 영상 처리 모듈은: 상기 AI 뉴럴 네트워크 모듈 에서의 학습 결과 및 상기 셀렉션 콘택트렌즈 정보를 이용하여, 상기 셀렉션 콘택트렌즈 착용한 사용자의 가상 피팅 이미지를 생성하는 영상 생성 모듈을 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 영상 처리 모듈은: 상기 사용자 콘택트렌즈 미착 용 이미지 정보 및 사용자의 상기 사전 설정 콘택트렌즈 착용 이미지 정보 중 안구 영역의 이미지를 추출 가능 한 영상 추출 모듈을 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 설치된 어플리케이션을 통하여 적어도 사용자의 ID 정보를 송출 가능한 사용자 단말기가 더 구비되고, 상기 콘택트렌즈 전시 스탠드의 스탠드 통신부는 스탠 드 무선 단말 통신부를 포함하고, 상기 스탠드 무선 단말 통신부는 상기 사용자 단말기를 통하여 상기 사용자의 ID 정보를 상기 서버와 통신 상태를 형성할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 스탠드 입력부는 사용자의 사전 설정 콘택트렌즈 착용 이미지 정보 또는 사용자 콘택트렌즈 미착용 이미지 정보를 입력하는 스탠드 광학 입력부를 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 콘택트렌즈 전시 스탠드는 상기 복수 개의 렌즈 큐 브의 미끄러짐을 방지하는 렌즈 큐브 홀더가 더 구비될 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 렌즈 큐브 홀더는: 상기 스탠드 하우징과 상기 스탠드 커버가 형성하는 내부 공간으로 상기 스탠드 하우징과의 사이에 상기 스탠드 터치 패널이 배치되도록 위치하는 렌즈 큐브 홀더 베이스와, 상기 렌즈 큐브의 하단에 배치되는 렌즈 큐브 홀더 베이스 대응부를 구비하고, 상기 렌즈 큐브 홀더 베이스와 상기 렌즈 큐브 홀더 베이스 대응부 중 적어도 하나는 자석일 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 콘택트렌즈 전시 스탠드는 상기 스탠드 하우징(2 1)과 상기 스탠드 커버 사이에 배치되어 양자 간의 사이 간격을 형성하는 스탠드 스페이서를 포함할 수 도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 스탠드 스페이서는 상기 복수 개의 렌즈 큐브 의 관통 배치를 허용하는 스탠드 스페이서 관통구가 구비될 수도 있다. 본 발명의 또 다른 일면에 따르면, 매장 내 배치되는 콘택트렌즈를 수용하는 복수 개의 렌즈 큐브이 배치되는 콘택트렌즈 전시 스탠드로부터 사용자의 ID 정보가 서버로 송출되고, 사용자의 ID 정보에 연계된 ID 연 계 정보 및 콘택트렌즈 정보를 요청하는 정보 전송 및 정보 요청 단계(S20)와, 상기 서버에서 사용자의 ID 정보에 연계된 ID 연계 정보 및 콘택트렌즈 정보가 상기 콘택트렌즈 전시 스탠드로 송출되는 정보 전송 및 정보 송출 단계(S21)와, 상기 콘택트렌즈 정보를 상기 콘택트렌즈 전시 스탠드의 스탠드 출력부의 스탠 드 디스플레이에 화상 표시하는 렌즈 정보 디스플레이 단계(S22)와, 사용자에 의하여 상기 렌즈 큐브 를 통하여 사용자가 선택한 콘택트렌즈 정보가 입력되는 렌즈 셀렉션 단계(S23)와, 상기 렌즈 셀렉션 단계(S2 3)에서 선택된 상기 셀렉션 콘택트렌즈에 대한 정보가 상기 서버로 전송되는 셀렉션 렌즈 정보 전송 단계 (S24)와, 상기 사용자의 사전 설정 콘택트렌즈 착용 이미지 및 사용자 콘택트렌즈 미착용 이미지 정보에 기초 하여, 복수의 연산을 통하여 이미지 학습을 통한 상기 셀렉션 콘택트렌즈에 대한 사용자의 가상 피팅 이미지를 생성하는 사용자 이미지 AI 프로세싱 단계(S193)를 구비하는 ID 셀렉션 렌즈 착용안 이미지 생성 단계(S19)와, 상기 사용자 착용 이미지 프로세싱 단계(S19)에서 생성된 상기 셀렉션 콘택트렌즈에 대한 사용자의 가상 피팅 이미지를 상기 콘택트렌즈 스탠드로 전송하는 셀렉션 콘택트렌즈 착용 이미지 전송 단계(S25)와, 상기 콘택 트렌즈 전시 스탠드에서 상기 사용자의 가상 피팅 이미지를 화상 표시하는 셀렉션 콘택트렌즈 착용 이미지 출력 단계(S26)를 포함하는 콘택트렌즈 버츄얼 피팅 방법을 제공한다. 상기 콘택트렌즈 버츄얼 피팅 방법에 있어서, 적어도 사용자의 ID 정보를 송출 가능한 사용자 단말기가 더 구비되고, 상기 사용자의 ID 정보는 상기 사용자 단말기에서 상기 콘택트렌즈 전시 스탠드로 전달되는ID 정보 전송 단계(S20-1)를 포함할 수도 있다. 본 발명의 다른 일면에 따르면, 본 발명은 매장 내 배치되는 콘택트렌즈를 수용하는 복수 개의 렌즈 큐브이 배 치되는 콘택트렌즈 전시 스탠드로부터 사용자의 ID 정보가 서버로 송출되고, 사용자의 ID 정보에 연계 된 ID 연계 정보 및 콘택트렌즈 정보를 요청하는 정보 전송 및 정보 요청 단계(S20)와, 상기 서버에서 사용 자의 ID 정보에 연계되는 ID 연계 정보 및 사용자에 대하여 추천되는 레커멘드 콘택트렌즈 정보를 포함하는 콘 택트렌즈 정보를 확인하는 ID 연계 정보 확인 및 콘택트렌즈 정보 확인 단계(S21a)와, 상기 사용자의 사전 설정 콘택트렌즈 착용 이미지 및 사용자 콘택트렌즈 미착용 이미지 정보와 레커멘드 콘택트렌즈 정보에 기초하여, 복 수의 연산을 통하여 이미지 학습을 통한 상기 레커멘드 콘택트렌즈에 대한 사용자의 가상 피팅 이미지를 생성하 는 사용자 이미지 AI 프로세싱 단계(S193)를 구비하는 ID 레커멘드 렌즈 착용안 이미지 생성 단계(S19a)와, 상 기 서버에서 사용자의 ID 정보에 연계되는 ID 연계 정보, 사용자에 대하여 추천되는 레커멘드 콘택트렌즈 정보(개인별 또는 순위별)를 포함하는 콘택트렌즈 정보 및 ID 레커멘드 콘택트렌즈 착용안 이미지를 상기 콘택 트렌즈 전시 스탠드로 송출되는 정보 전송 및 정보 송출 단계(S21a)와, 상기 콘택트렌즈 전시 스탠드에 서 상기 사용자의 가상 피팅 이미지를 화상 표시하는 셀렉션 콘택트렌즈 착용 이미지 출력 단계(S21b)를 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 방법에 있어서, 상기 레커멘드 콘택트렌즈 정보를 포함하는 콘택트렌즈 정보를 상 기 콘택트렌즈 전시 스탠드의 스탠드 출력부의 스탠드 디스플레이에 화상 표시하는 렌즈 정보 디 스플레이 단계(S22a)와, 사용자에 의하여 상기 렌즈 큐브를 통하여 사용자가 선택한 콘택트렌즈 정보가 입 력되는 렌즈 셀렉션 단계(S23)와, 상기 렌즈 셀렉션 단계(S23)에서 선택된 상기 셀렉션 콘택트렌즈에 대한 정보 가 상기 서버로 전송되는 셀렉션 렌즈 정보 전송 단계(S24)와, 상기 사용자의 사전 설정 콘택트렌즈 착용 이미지 및 사용자 콘택트렌즈 미착용 이미지 정보에 기초하여, 복수의 연산을 통하여 이미지 학습을 통한 상기 셀렉션 콘택트렌즈에 대한 사용자의 가상 피팅 이미지를 생성하는 사용자 이미지 AI 프로세싱 단계(S193)를 구 비하는 사용자 착용 이미지 프로세싱 단계(S19)와, 상기 사용자 착용 이미지 프로세싱 단계(S19)에서 생성된 상 기 셀렉션 콘택트렌즈에 대한 사용자의 가상 피팅 이미지를 상기 콘택트렌즈 스탠드로 전송하는 셀렉션 콘 택트렌즈 착용 이미지 전송 단계(S25)와, 상기 콘택트렌즈 전시 스탠드에서 상기 사용자의 가상 피팅 이미 지를 화상 표시하는 셀렉션 콘택트렌즈 착용 이미지 출력 단계(S26)를 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 방법에 있어서, 적어도 사용자의 ID 정보를 송출 가능한 사용자 단말기가 더 구비되고, 상기 사용자의 ID 정보는 상기 사용자 단말기에서 상기 콘택트렌즈 전시 스탠드로 전달되는 ID 정보 전송 단계(S20-1)를 포함할 수도 있다. 본 발명의 또 다른 일면에 따르면, 본 발명은 매장 내 배치되는 콘택트렌즈 전시 스탠드로서, 콘택트렌즈를 수 용하는 복수 개의 렌즈 큐브이 배치되고 사용자의 ID 정보가 수신 가능하고, 상기 ID 정보에 대응하여 저장된 ID 연계 정보 및 콘택트렌즈 정보를 송출 가능한 서버와 연계되어, 상기 콘택트렌즈 정보 중 선택된 셀렉션 콘택트렌즈 정보를 상기 서버로 전송하고, 상기 셀렉션 콘택트렌즈 정보와 상기 ID 연계 정보에 포함되는 상기 사용자 콘택트렌즈 미착용 이미지 정보 및 사용자의 상기 사전 설정 콘택트렌즈 착용 이미지 정보에 기초 하여, 상기 서버에서 복수의 연산을 통하여 이미지 학습을 통한 상기 셀렉션 콘택트렌즈에 대하여 생성된 사용자의 가상 피팅 이미지를 수신하여 화상 표시 가능한 콘택트렌즈 전시 스탠드을 제공한다. 본 발명의 또 다른 일면에 따르면, 본 발명은 매장 내 배치되는 콘택트렌즈를 수용하는 복수 개의 렌즈 큐브 가 배치되고 사용자의 ID 정보가 수신 가능한 콘택트렌즈 전시 스탠드와, 상기 콘택트렌즈 전시 스탠드 로부터의 상기 ID 정보를 수신하여 상기 ID 정보에 대응하여 저장된 ID 연계 정보 및 콘택트렌즈 정보를 송 출 가능한 서버를 포함하고, 상기 콘택트렌즈 전시 스탠드는 상기 콘택트렌즈 정보 중 선택된 셀렉션 콘택트렌즈 정보를 상기 서버로 전송하고, 상기 콘택트렌즈 전시 스탠드로부터 상기 셀렉션 콘택트렌즈 정보와 상기 ID 연계 정보에 포함되는 상기 사용자 콘택트렌즈 미착용 이미지 정보 및 사용자의 상기 사전 설정 콘택트렌즈 착용 이미지 정보에 기초하여, 상기 서버에서 복수의 연산을 통하여 이미지 학습을 통한 상기 셀렉션 콘택트렌즈에 대한 사용자의 가상 피팅 이미지가 생성되고, 상기 렌즈 큐브은: 내부에 콘택트렌즈를 수용할 수 있고 상기 콘택트렌즈 전시 스탠드에 배치 가능한 렌즈 하우징과, 상기 렌즈 하우징에 배치되는 콘택트렌즈 측으로 광출사 가능한 렌즈 큐브 광원부을 포함하는 것을 특징으로 하는 콘택트렌즈 버츄얼 피팅 시스템을 제공한다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 콘택트렌즈 전시 스탠드는: 오프라인 매장에 배치 되고 사전 설정 경사도를 갖는 스탠드 하우징과, 상기 스탠드 하우징이 일측에 배치되어 내부 공간을 형성하는 스탠드 커버와, 상기 스탠드 커버와 상기 스탠드 하우징의 내부 공간에 배치되고 상기 렌 즈 큐브과 접속되어 전기적 소통이 이루어지고, 상기 렌즈 큐브에 전기적 신호를 인가하는 스탠드 터치 패널과, 상기 서버에서 복수의 연산을 통하여 이미지 학습을 통해 생성된 사용자의 가상 피팅 이미지를 화상 표시하는 스탠드 디스플레이를 포함하는 스탠드 출력부와, 사용자의 ID 정보가 입력되는 스탠드 입력부와, 적어도 상기 서버와 통신을 이루는 스탠드 통신부와, 사용자 ID 정보를 저장하고, 상기 서버로부터 송출되는 콘택트렌즈 정보를 저장하는 스탠드 저장부와, 상기 스탠드 터치 패널을 통하 여 상기 렌즈 큐브 측에 큐브 제어 신호를 인가하고 상기 렌즈 큐브 측으로부터 상기 콘택트렌즈 정보 중 선택된 셀렉션 콘택트렌즈 정보를 전달받고, 상기 사용자 ID 정보 및 상기 셀렉션 콘택트렌즈 정보를 상기 서버로 전송하여 상기 서버에서 복수의 연산을 통하여 이미지 학습을 통하여 상기 셀렉션 콘택트렌즈 정보에 대하여 생성된 사용자의 가상 피팅 이미지를 수신하도록 상기 스탠드 통신부에 통신 제어 신호를 인 가하는 스탠드 제어부를 포함하고, 상기 렌즈 큐브는: 사용자의 선택 동작에 의하여 변화된 신호를 발 생하는 렌즈 큐브 스위치와, 상기 스탠드렌즈 큐브 스위치와 전기적으로 소통되고, 상기 스탠드 터치 패널 측과 접속 가능한 렌즈 큐브 접속부를 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 렌즈 큐브 광원부는: 상기 렌즈 큐브 하우징(41 0)의 내부에 배치되는 렌즈 큐브 기판의 적어도 일부에 배치되는 렌즈 큐브 광원와, 상기 렌즈 큐브 광원의 상측으로 상기 렌즈 큐브 하우징 커버 바디 렌즈 안착부의 하단에 배치되어 상기 렌즈 큐브 광원으로부터 생성되는 빛을 상기 렌즈 큐브 하우징 커버 바디 렌즈 안착부 측으로 전달하는 렌즈 큐브 광전달부를 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 렌즈 큐브 기판은: 상기 렌즈 큐브 광원이 배치되는 렌즈 큐브 광원 기판와, 상기 렌즈 큐브 접속부와 전기적으로 연결되는 렌즈 큐브 메인 기 판와, 상기 렌즈 큐브 광원 기판와 상기 렌즈 큐브 메인 기판를 연결하는 렌즈 큐브 기판 연결 부를 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 렌즈 큐브는 상기 렌즈 큐브 하우징을 탄성 지지하는 렌즈 큐브 탄성부를 더 포함하고, 상기 렌즈 큐브 스위치는, 상기 렌즈 큐브 탄성부가 가압되어 상기 렌즈 큐브 하우징의 위치 변 동이 발생하는 경우 신호 변화를 생성할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 렌즈 큐브 탄성부는: 상기 렌즈 큐브 하우징 측에 가동 가능하게 수용 배치되는 렌즈 큐브 탄성체와, 상기 렌즈 큐브 하우징 측으로 상기 렌즈 큐 브 탄성체 측의 반대편에 일단이 상기 렌즈 큐브 탄성체와 접촉 가능하게 형성되는 렌즈 큐브 탄성 지지부를 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 렌즈 큐브 하우징은: 상기 콘택트렌즈 전시 스탠 드에 위치하는 렌즈 큐브 하우징 바디과, 상기 렌즈 큐브 하우징 바디의 상단 측에 상대 가동 가 능하게 배치되는 렌즈 큐브 하우징 커버를 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 렌즈 큐브 하우징 바디는: 상기 콘택트렌즈 전시 스탠드 측에 위치 안착되는 렌즈 큐브 하우징 바디 베이스와, 상기 렌즈 큐브 하우징 바디 베이스 의 일단에 연장 형성되어 상기 렌즈 큐브 하우징 커버와 함께 내부 공간을 형성하는 렌즈 큐브 하우 징 바디 메인부를 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 렌즈 큐브 하우징 커버는: 외부에 노출 배치되는 렌즈 큐브 하우징 커버 바디와, 상기 렌즈 큐브 하우징 커버 바디의 하단에 연장 형성되는 렌즈 큐 브 하우징 커버 바디 연장부와, 콘택트렌즈가 안착 배치 가능하고, 상기 렌즈 큐브 하우징 커버 바디 를 통하여 외부로 시각적으로 노출되도록 상기 렌즈 큐브 하우징 커버 바디가 형성하는 내측 공간 에 배치되는 렌즈 큐브 하우징 커버 바디 렌즈 안착부를 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 렌즈 큐브 스위치는: 상기 렌즈 큐브 하우징 바디 측에 배치되고 상기 렌즈 큐브 접속부와 전기적으로 연결되는 렌즈 큐브 고정 스위치와, 상기 렌즈 큐브 하우징 커버 측에 배치되고 상기 렌즈 큐브 고정 스위치와 접촉 단속 가능한 렌즈 큐브 가 동 스위치을 포함할 수도 있다.상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 렌즈 큐브 접속부는: 상기 렌즈 큐브 고정 스위치 측과 연결되는 렌즈 큐브 이너 접속부와, 상기 스탠드 터치 패널과 접속되는 렌즈 큐브 아우터 접속부와, 상기 렌즈 큐브 이너 접속부와 상기 렌즈 큐브 아우터 접속부을 연결하는 렌즈 큐브 연결 접속부를 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 콘택트렌즈 전시 스탠드는 상기 스탠드 하우징(2 1)의 내부에 배치되는 렌즈 큐브 홀더 베이스을 포함하고, 상기 렌즈 큐브는 상기 렌즈 큐브 홀더 베이 스와 대응하여 위치 고정되는 렌즈 큐브 홀더 베이스 대응부를 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 렌즈 큐브 홀더 베이스는 자성체 및 마그네트 중의 하나를 포함하고, 상기 렌즈 큐브 홀더 베이스 대응부는 자성체 및 마그네트 중의 다른 하나를 포함하고, 상기 렌즈 큐브 하우징 바디에 배치될 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 스탠드 렌즈 포지션 홀더(211,211a)는 상기 렌즈 큐브 하우징 바디의 저면에 미끄럼 방지 패드를 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 콘택트렌즈 전시 스탠드는: 상기 서버에서 복 수의 연산을 통하여 이미지 학습을 통해 생성된 사용자의 가상 피팅 이미지를 화상 표시하는 스탠드 디스플레이 를 포함하는 스탠드 출력부와, 사용자의 ID 정보가 입력되는 스탠드 입력부와, 상기 서버 및 상기 렌즈 큐브와 통신을 이루는 스탠드 통신부와, 사용자 ID 정보를 저장하고, 상기 서버로부터 송출되는 콘택트렌즈 정보를 저장하는 스탠드 저장부와, 상기 스탠드 통신부를 통하여 상기 렌즈 큐브 측에 큐브 제어 신호를 인가하고 상기 렌즈 큐브 측으로부터 상기 콘택트렌즈 정보 중 선택된 셀렉션 콘택트렌즈 정보를 전달받고, 상기 사용자 ID 정보 및 상기 셀렉션 콘택트렌즈 정보를 상기 서버로 전송하 여 상기 서버에서 복수의 연산을 통하여 이미지 학습을 통하여 상기 셀렉션 콘택트렌즈 정보에 대하여 생성 된 사용자의 가상 피팅 이미지를 수신하도록 상기 스탠드 통신부에 통신 제어 신호를 인가하는 스탠드 제어 부를 포함하고, 상기 렌즈 큐브는: 사용자의 선택 동작에 의하여 변화된 신호를 발생하는 렌즈 큐브 스 위치와, 상기 렌즈 큐브 스위치의 신호를 입력받는 렌즈 큐브 제어부와, 상기 렌즈 큐브 제어부 의 통신 제어 신호에 따라 상기 스탠드 통신부와 신호 전달을 이루는 렌즈 큐브 통신부를 포함할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 사용자가 렌즈 큐브 스위치를 가동시키는 경우, 상기 렌즈 큐브 제어부는 상기 렌즈 큐브 통신부를 통하여 사용자가 선택한 렌즈 큐브에 대한 셀렉션 정 보를 전달할 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 서버에서 사용자의 ID 정보에 연계되는 ID 연계 정 보 및 사용자에 대하여 추천되는 레커멘드 콘택트렌즈 정보를 포함하는 콘택트렌즈 정보가 상기 콘택트렌즈 전 시 스탠드로 전달하고, 상기 콘택트렌즈 전시 스탠드는 상기 레커멘드 콘택트렌즈 정보에 대응하는 렌 즈 큐브로 정보를 전달하고, 상기 레커멘드 콘택트렌즈 정보에 대응하는 렌즈 큐브의 상기 렌즈 큐브 제어부는 상기 콘택트렌즈 전시 스탠드로부터 상기 렌즈 큐브 통신부를 통하여 상기 레커멘드 콘택 트렌즈 정보를 전달받을 수도 있다. 상기 콘택트렌즈 버츄얼 피팅 시스템에 있어서, 상기 레커멘드 콘택트렌즈 정보에 대응하는 렌즈 큐브의 상기 렌즈 큐브 제어부는 상기 렌즈 큐브 광원부에 광출력 제어 신호를 인가할 수도 있다. 본 발명의 또 다른 일면에 따르면, 매장 내 배치되고 사용자의 ID 정보가 수신 가능한 콘택트렌즈 전시 스탠드 에 배치되고 콘택트렌즈를 수용하는 렌즈 큐브로서, 상기 콘택트렌즈 전시 스탠드로부터의 상기 ID 정 보를 수신하여 상기 ID 정보에 대응하여 저장된 ID 연계 정보 및 콘택트렌즈 정보를 송출 가능한 서버를 포 함하고, 상기 콘택트렌즈 전시 스탠드는 상기 콘택트렌즈 정보 중 선택된 셀렉션 콘택트렌즈 정보를 상기 서버로 전송하고, 상기 콘택트렌즈 전시 스탠드로부터 상기 셀렉션 콘택트렌즈 정보와 상기 ID 연계 정 보에 포함되는 상기 사용자 콘택트렌즈 미착용 이미지 정보 및 사용자의 상기 사전 설정 콘택트렌즈 착용 이미 지 정보에 기초하여, 상기 서버에서 복수의 연산을 통하여 이미지 학습을 통한 상기 셀렉션 콘택트렌즈에 대한 사용자의 가상 피팅 이미지가 생성되는 경우, 내부에 콘택트렌즈를 수용할 수 있고 상기 콘택트렌즈 전시 스탠드에 배치 가능한 렌즈 하우징과, 상기 렌즈 하우징에 배치되는 콘택트렌즈 측으로 광출사 가능한 렌즈 큐브 광원부을 포함하는 것을 특징으로 하는 렌즈 큐브을 제공한다."}
{"patent_id": "10-2020-0095429", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 콘택트렌즈 버츄얼 피팅 시스템 및 콘택트렌즈 버츄얼 피팅 방법은 사용자의 사전 설정된 콘택 트렌즈 착용 이미지와 사용자의 비착용 이미지와 더불어 사용자의 선택한 셀렉션 콘택트렌즈 내지 추천된 레커 멘드 콘택트렌즈 등을 포함하는 콘택트렌즈 정보를 이용하여, 인공 지능의 학습 과정을 거쳐 사용자의 선택한 셀렉션 콘택트렌즈 내지 추천된 레커멘드 콘택트렌즈 등을 착용한 해당 콘택트렌즈에 대한 콘택트렌즈 착용 제 네러티브 이미지 정보를 생성할 수 있다. 본 발명에 따른 콘택트렌즈 버츄얼 피팅 시스템 및 콘택트렌즈 버츄얼 피팅 방법은 이미지 러닝 단계를 통하여 학습 과정으로 사용자의 홍채 내지 각막 두께 등의 차이에 의한 실제 착용 이미지와의 이질감을 제거 내지 최소 화시킬 수 있는 이미지 정보를 생성 출력할 수 있다. 본 발명에 따른 콘택트렌즈 버츄얼 피팅 시스템 및 콘택트렌즈 버츄얼 피팅 방법은 안구 영역의 이미지에서 스 크레라 영역의 픽셀의 RGB 값을 이용하여 색보정 데이터를 생성하고 이를 스크레라 영역 및 퓨플 아이리스 영역 에 보정하여 촬용 환경 차이로 인한 이미지 오차 내지 편차를 보정함으로써 보다 정확한 이미지 생성 과정을 실 행할 수 있다. 본 발명에 따른 콘택트렌즈 버츄얼 피팅 시스템 및 콘택트렌즈 버츄얼 피팅 방법과 콘택트렌즈 전시 스탠드는 오프라인 매장에서 매장 방문자에게 보다 정확한 착용 이미지를 제공하여 제품 선택에 도움을 제공하여 매장 내 에서의 매장 방문자마다 소요되는 시간을 최소화하고 제품 매출을 증진시키며 실제 착용모습과의 괴리를 최소화 시켜 제품 구매자에게 예측 가능성을 제공하여 매장의 신뢰성 높일 수도 있다. 본 발명에 따른 콘택트렌즈 버츄얼 피팅 시스템 및 콘택트렌즈 버츄얼 피팅 방법과 콘택트렌즈 전시 스탠드 및 렌즈 큐브는 오프라인 매장에서 매장 방문자에게 선택되는 셀렉션 콘택트렌즈에 대한 광원 표시를 통하여 선택 하는 제품에 대한 매칭으로 오프라인 매장에서의 제품 선택 편의성을 제공할 수도 있다."}
{"patent_id": "10-2020-0095429", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 본 발명에 따른 콘택트렌즈 진열장치를 도면을 참조하여 설명하기로 한다. 도면에 나타낸 것과 같이, 본 발명의 일실시예에 따른 콘택트렌즈 버츄얼 피팅 시스템은 하나 이상의 사용자 단말기와, 서버를 포함하고, 경우에 따라 후술되는 내용에서는 하나 이상의 오프라인 매장에 배치되는 하나 이상의 콘택트렌즈 전시 스탠드를 포함할 수도 있다. 본 발명의 하나 이상의 사용자 단말기, 즉 사용자 단말기는 별도의 전용 단말기일 수도 있으나, 스마트 폰과 같이 전용 어플리케이션 설치가 가능한 고객 소유 단말기일 수도 있고, 경우에 따라 웹페이지 등을 통하여 서버에 접속 가능한 PC 단말기, 노트북 단말기, 태블릿으로 구현될 수도 있는 등 다양한 선택이 가능하다. 사용자 단말기는 설치된 어플리케이션을 통하여 사용자의 ID 정보 및 사용자의 사전 설정 콘택트렌즈 착용 이미지 정보를 송출 가능하다. 여기서, 사용자 ID 정보는 사용자의 개별 인식이 가능한 정보로서, 개인 정보 보호 등의 요소를 고려하여 구체적인 설계 사양마다 개별 취사될 수 있거나 경우에 따라 별도의 개인 비식별화 과정이 탑재되는 구성을 취할 수도 있는 등 다양한 구성이 가능하다. 또한, 여기서 사용자의 사전 설정 콘택트 렌즈 착용 이미지 정보가 사용자 단말기에서 서버로 전송될 수 있는데, 여기서 사전 설정 콘택트렌즈는 해당 콘택트렌즈 상품 정보가 알려진 콘택트렌즈를 지칭하는 것으로, 사용자의 사전 설정 콘택트렌즈 착용 이미 지 정보는 해당 제품 정보가 존재하여 확인 가능한 콘택트렌즈를 사용자가 착용한 상태의 착용 이미지 정보를 지칭한다. 이러한 사용자의 사전 설정 콘택트렌즈 착용 이미지 정보는 사용자 단말기에 저장된 이미지 정 보를 포함하고, 사용자 단말기가 별도의 광학 입력부, 즉 카메라를 통하여 촬영 취득되는 촬용 이미지 정보 를 포함할 수 있다. 즉, 사용자 단말기는 단말 입력부를 포함하는데, 단말 입력부는 사용자의 영 상 정보를 입력 가능한 단말 카메라를 포함한다. 보다 구체적으로, 사용자 단말기는 단말 제어부와, 단말 입력부와, 단말 출력부와, 단말 통신 부를 포함한다. 단말 입력부는 사용자 단말기를 통하여 사용자의 ID 정보를 입력하기 위한 입력부로서 스마트폰으로 구 현되는 사용자 단말기의 경우 터치 입력 가능한 터치 입력부로 구현될 수 있고, 사용자 단말기의 단말 출력부는 디스플레이로 구현될 수 있는데, 단말 입력부와 단말 출력부는 터치 스크린과 같이 일체 화 모듈로 구현될 수도 있다. 단말 입력부는 키보드 등의 정보 입력 수단이 있을 수도 있고, 음성 정보 및 음향 정보를 입력하는 마이크 를 포함할 수도 있고, 앞서 기술한 바와 같이, 단말 입력부는 사용자의 영상 정보를 입력 가능한 단말 카메라를 포함할 수도 있다. 단말 출력부는 터치 스크린으로 구현되는 디스플레이와 같은 단말 광학 출력부 이외에 음성 내지 음향 을 출력하는 스피커와 같은 단말 음향 출력부를 포함할 수도 있다. 단말 통신부는 네트워크를 통하여 서버와 통신 가능한 단말 서버 통신부를 포함할 수 있고, 경우 에 따라 오프라인 매장의 콘택트렌즈 전시 스탠드와 통신하기 위한 단말기 스탠드 통신부를 포함할 수 도 있다. 단말기 스탠드 통신부는 단말 스탠드 무선 근거리 통신부 내지 단말 스탠드 유선 근거리 통신부 를 포함할 수도 있으며, 단말 스캔드 무선 근거리 통신부로 구현되는 경우 와이파이 다이렉트 내지 블루투스 등 무선 통신 프로토콜 방식을 이용할 수도 있는 등 사용자의 ID 정보 및 사용자의 사전 설정 콘택트렌즈 착용 이 미지 정보를 전달 가능한 범위에서 다양한 선택이 가능하다. 단말 제어부는 단말 입력부 및 단말 통신부 및 단말 출력부와 전기적 소통을 이루고, 이들에 입력 제어 신호 내지 통신 제어 신호를 인가하여 각각의 구성요소들의 동작을 제어하는데, 단말 제어부의 제어 과정을 통하여 사용자 ID 정보 및 사용자의 사전 설정 착용 이미지 정보의 입력, 전송 및 후술되는 피팅 이미지의 수신 내지 콘택트렌즈 정보 등을 수신하고 출력 제어할 수 있다. 서버는 콘택트렌즈에 대한 콘택트렌즈 정보 관련 데이터와 사용자 관련 데이터를 포함하는 다양한 정보가 저장, 이용 및 송수신할 수 있다. 본 실시예에서의 서버는 사용자 단말기로부터의 ID 정보 및 ID 정보 에 대응하여 저장된 ID 연계 정보 및 콘택트렌즈 정보를 송출 가능하고, 하기되는 복수의 연산을 통한 이미지 학습으로 다른 콘택트렌즈를 사용자가 착용한 가상의 피팅 이미지를 생성하고 이를 전송, 송출할 수도 있다. 즉, 본 발명의 일실시예에 따른 사용자 단말기는 사용자 콘택트렌즈 미착용 이미지 정보 및 콘택트렌즈 정 보 중 선택된 셀렉션 콘택트렌즈 정보를 서버로 전송하고, 서버는 사용자 단말기로부터 사용자 콘 택트렌즈 미착용 이미지 정보 및 셀렉션 콘택트렌즈 정보와 ID 연계 정보에 포함되는 사용자의 사전 설정 콘택 트렌즈 착용 이미지 정보를 수신하고 이들 정보에 기초하여, 복수의 연산을 통하여 이미지 학습을 통한 사용자 의 가상 피팅 이미지를 생성한다. 여기서, 셀렉션 콘택트렌즈는 사용자가 사용자 단말기에 전달된 콘택트 렌즈 정보 중 사용자가 선택한 콘택트렌즈를 지칭한다. 보다 구체적으로, 서버는 서버 통신부와, 서버 저장부와, 서버 제어부를 포함한다. 서버 통신부는 통신 네트워크를 통하여 사용자 단말기와 송수신한다. 본 실시예에서의 콘택트렌즈 버 츄얼 피팅 시스템의 사용자 단말기도 앞서 기술한 바와 같이 단말기 통신부를 포함하고 단말기 통신 부는 서버와 통신하는데, 서버의 서버 통신부가 단말기 통신부와 통신 네트워크를 통하여 사용자 단말기와 송수신한다. 서버의 서버 통신부는 다양한 소프트웨어 프로그램 및/또는 메모리 부에 저장되어 있는 명령어 세트를 실행하여 본 발명에 소요되는 여러 기능을 수행하는, 중앙처리장치, 사용자 I/F, 운영체제(미도시) 및 각종 필요 데이터를 저장하는 메모리, 외부 통신포트, 인쇄장치 I/F 등을 포함하는 하드웨어와 이를 구동하는 소프트웨어의 집합체 형태로 독자적인 기기나 범용 처리장치의 일부로 구현될 수도 있고, 여기서 사용되는 통신, 통신망 내지 통신 네트워크는 예를 들어, 셀룰러 통신 프로토콜로서, 예를 들어 LTE, LTE-A, 5G, WCDMA, CDMA, UMTS, Wibro, GSM 중 적어도 하나를 포함할 수 있고, 통신 네트워크는 유선 및 무선 등과 같은 통신 유형을 가리지 않고 구성될 수 있으며, 단거리 통신망(PAN;Personal Area Network), 근거 리 통신망(LAN;Local Area Network), 도시권 통신망(MAN;Metropolitan Area Network_, 광역 통신망(WAN;Wide Area Network) 등 다양한 통신망으로 구현될 수 있고, 통신, 통신망, 통신 네트워크는 공지의 월드와이드웹 (WWW;World Wide Web)일 수도 있고, 적외선(Infrared Data Association;IrDA) 또는 블루투스(Bluetooth) 내지 저전력 블루투스(Bluetooth Lowenergy)와 RF 무선 통신을 다양한 통신 방법을 포함한다. 서버 저장부는 서버 통신부에서 수신된 데이터를 저장하고, 서버 제어부는 서버 통신부 및 서 버 저장부를 제어한다. 서버 제어부는 사용자 단말기로부터 사용자 콘택트렌즈 미착용 이미지 정 보 및 셀렉션 콘택트렌즈 정보와 ID 연계 정보에 포함되는 사용자의 사전 설정 콘택트렌즈 착용 이미지 정보를 영상 처리하고 이미지 학습을 통한 사용자의 가상 피팅 이미지를 생성한다. 보다 구체적으로, 서버 제어부는 제어 모듈과, AI 모듈를 포함한다. 이러한 각각의 구성은 실제 물리적 개별 요소로 형성될 수도 있고 통합 칩 형태로 이루어지데 기능적 개별 요소로 형성될 수도 있는 등 설 계 사양에 따라 다양한 선택이 가능하다. 제어 모듈은 서버 통신부 및 서버 저장부를 제어하는데 제어 모듈은 서버 통신부에 서버 통신 제어 신호를 그리고 서버 저장부에 서버 저장 제어 신호를 인가하여 각각의 모듈의 동작 제어를 실행한다. AI 모듈은 제어 모듈의 이미지 학습 제어 신호에 따라 가동하는데, AI 모듈은 이미지 정보를 영 상 처리하고, 가상의 피팅 이미지를 생성한다. 보다 구체적으로, AI 모듈은 사용자 단말기로부터 사 용자 콘택트렌즈 미착용 이미지 정보 및 셀렉션 콘택트렌즈 정보와 ID 연계 정보에 포함되는 사용자의 사전 설 정 콘택트렌즈 착용 이미지 정보를 영상 처리한다. 또한, AI 모듈은 제어 모듈의 학습 제어 신호에 따라 영상처리된 이미지 정보를 이용하여 이미지 학습을 통한 사용자의 가상 피팅 이미지를 생성한다. 서버 제어부는 영상 처리 모듈를 포함하는데, 영상 처리 모듈는 사용자의 사용자 콘택트렌즈 미 착용 이미지 정보 및 사전 설정 콘택트렌즈 착용 이미지 정보로부터 안구 영역 이미지를 추출 처리할 수 있다. 보다 구체적으로, 제어 모듈은 통신 저장 제어 모듈과, AI 제어 모듈과, 영상 처리 제어 모듈 을 포함한다. 통신 저장 제어 모듈는 서버 통신부 및 서버 저장부를 제어하는 통신 및 저장 신호를 인가하여, 서버 통신부를 통한 사용자 단말기와의 데이터 송수신을 이룬다. AI 제어 모듈은 AI 모듈 의 이미지 학습을 학습 제어 신호를 인가하여 AI 모듈의 이미지 학습 동작 구현을 실행한다. 영상 처리 제어 모듈은 영상 처리 모듈에 영상 처리 제어 신호를 인가한다. 영상 처리 모듈은 영상을 생성하는 영상 생성 모듈를 포함하는데, 영상 처리 제어 모듈로부터 의 영상 처리 제어 신호를 입력받는 영상 처리 모듈의 영상 생성 모듈은 AI 뉴럴 네트워크 모듈 에서의 학습 결과 및 셀렉션 콘택트렌즈 정보를 이용하여, 셀렉션 콘택트렌즈를 착용한 사용자의 가상 피 팅 이미지를 생성한다. 경우에 따라, 영상 처리 모듈은 영상 생성 모듈 이외에 영상 추출 모듈을 더 포함할 수도 있 다. 즉, 영상 처리 모듈은 영상 추출 모듈을 포함하는데, 영상 추출 모듈은 사용자 콘택트렌 즈 미착용 이미지 정보 및 사용자의 사전 설정 콘택트렌즈 착용 이미지 정보 중 안구 영역의 이미지를 추출 가 능하다. 영상 추출 모듈은 사용자의 콘택트렌즈 착용 이미지 또는 사용자의 콘택트렌즈 미착용 이미지 중 중요 영역, 즉 안구의 영역만을 추출하여 연산 부하를 최소화하고 이를 통하여 연산 속도의 증진 불필요한 이미지 연산 과정을 제거하여 운영 비용의 최소화를 이룰 수도 있다. 이러한 이미지 추출 내지 이미지 촬영 시 환경 차이로 인한 이미지 편차를 보정하기 위한 별도의 영상 보정 모 듈을 포함할 수도 있는데, 이러한 보정 기능이 영상 추출 모듈 내지 영상 생성 모듈에 일체화될 수도 있 는 등 설계 사양에 따라 다양한 변형이 가능하다. 영상 보정 모듈은 추출된 이미지를 보정하거나 최종적 으로 학습 출력된 이미지를 일부 보정할 수도 있는 등 다양한 기능 수행이 가능하다. 영상 보정 모듈은 후술되는 본 발명의 일실시예에 따른 콘택트렌즈 버츄얼 피팅 방법의 변형예의 사용자 착용 이미지 프로세싱 단 계(S19)의 사용자 이미지 보정 단계(S191)를 실행할 수도 있는데, 사용자 이미지 보정 단계(S191)는 사용자 이 미지 AI 프로세싱 단계(S193)의 실행 전에, 사용자의 안구 이미지 정보를 이용하여 보정할 수도 있다. AI 모듈은 AI 뉴럴 네트워크 모듈이외에 AI 러닝 모듈를 포함하는데, AI 러닝 모듈은 AI 제어 모듈의 학습 제어 신호에 따라 AI 뉴럴 네트워크 모듈에 AI 학습 신호를 인가하는데, AI 러닝 모듈은 본 실시예에서 별도의 학습 제어 신호를 인가하는 구성으로 취하였으나 경우에 따라 AI 제어 모듈에 학습 제어 신호 인가 기능이 통합되는 구성을 취할 수도 있는 등 설계 사양에 따라 다양한 구성이 가능하다. 한편, AI 제어 모듈은 앞서 기술한 바와 같이, 제어 모듈의 이미지 학습 제어 신호에 따라 가동되어 이미지 정보를 영상 처리하고, 가상의 피팅 이미지를 생성하도록 하는데, AI 제어 모듈의 제어 신호에 따 라 작동하는 AI 모듈은 사용자 단말기로부터 사용자 콘택트렌즈 미착용 이미지 정보 및 셀렉션 콘택트 렌즈 정보와 ID 연계 정보에 포함되는 사용자의 사전 설정 콘택트렌즈 착용 이미지 정보를 영상 처리하는데, 이 러한 영상 처리는 인공 지능 학습을 통하여 이루어진다. 즉, 사용자 ID 정보 및 렌즈 데이터 및 ID 연계 정보에 포함되는 사용자의 사전 설정 콘택트렌즈 착용 이미지 정보를 이용하여, 머신 러닝 내지 인공지능 학습을 통한 입력 저장된 인공 지능 알고리즘 내지 머신 러닝 알고 리즘, 예를 들어 CNN(convolution Neural Network) 등의 딥러닝 신경회로망을 이용하여, 사용자 ID 정보 내 나 이, 홍채 색상 등과 같은 사용자 ID 연계 정보를 활용한 인공지능학습을 통해 새로운 콘택트렌즈에 대한 사용자 의 버츄얼 피팅 이미지를 생성할 수 있다. AI 뉴럴 네트워크 모듈은 AI 뉴럴 네트워크 모듈에서의 학습 결과 및 셀렉션 콘택트렌즈 정보를 이 용하여 셀렉션 콘택트렌즈 착용한 사용자의 가상 피팅 이미지를 생성하고 출력 가능하도록 전달 가능한 범위에 서 다양한 선택이 가능한데, 본 실시예에서는 GAN(생성적 적대 신경망, Generative Adversarial Networks)를 활용하는 경우를 중심으로 설명하나, 본 발명은 이에 국한되지 않고 다양한 신경망 구조의 다양한 선택이 가능 하다. 본 발명의 일실시예로 사용되는 생성적 적대 신경망(Generative Adversarial Networks)는 두 개 내지 복수 개의 네트워크로 구성된 심층 신경망 구조의 일환으로, 하나의 네트워크가 적어도 다른 네트워크와 적대적인, 달리 표현하면 상호 대립적인 목적 수행을 위하여 가동되는 구조의 신경망 구조를 지칭한다. 영상 처리 모듈은 영상을 생성하는 영상 생성 모듈를 포함하는데, 영상 처리 제어 모듈로부터 의 영상 처리 제어 신호를 입력받는 영상 처리 모듈의 영상 생성 모듈은 AI 뉴럴네트워크 모듈 에서의 학습된 학습 정보를 이용하는데, 본 발명의 일실시예에 따른 AI 뉴럴네트워크 모듈은 제네 레이터와 디스크리미네티어를 포함한다. 보다 구체적으로, 도 21에는 본 발명 AI 뉴럴 네트워크 모듈의 일예가 도시되는데, 도면 부호 31311로 지 시되는 구성의 직사각형 도형은 계층을 형상화하기 위해 예시적으로 도시된 것으로 본 발명이 이에 국한되는 것 은 아니다. 본 발명 AI 뉴럴 네트워크 모듈은 도 21에 도시된 바와 같이 제네레이터와, 디스크리 미네이터를 포함하되, 제네레이터는 적어도 사용자 콘택트렌즈 미착용 이미지 정보 및 콘택트렌 즈 정보의 입력되는 이미지 정보를 이용하여 가중치 적용 가능한 복수의 연산을 통해 해당 콘택트렌즈에 대한 콘택트렌즈 착용 제네러티브 이미지 정보를 생성하고, 디스크리미네이터는 해당 콘택트렌즈 착용 제네러 티브 이미지 정보와 사용자의 사전 설정 콘택트렌즈 착용 이미지 정보를 이용하여 가중치 적용 가능한 복수의 연산을 통해 해당 콘택트렌즈 착용 제네러티브 이미지 정보가 실제인지 페이크인지 여부를 판단하고 손실함수의 값을 최소화 하는 방향으로 가중치 또는 매개변수를 조정하여 소정의 학습 기능을 실행한다. 즉, 제네레이터와, 디스크리미네이터는 서로 경쟁적 관계에서 서로 대립적인 목적 달성을 위한 학습 과정을 수행하게 되고, 이를 통하여 각각의 학습 기능의 증진을 통한 최종적인 제네레이터에서 생 성되는 제네러티브 이미지 정보를 실제와 구별이 어려울 정도의 이미지 생성을 이루도록 한다. 본 실시예에서, 제네레이터와 디스크리미네이터는 딥러닝 신경망을 구현함에 있어, 각각 복수의 계층적 (hierarchy) 구조에 비선형 활성 함수(non-linear activation function) 구조로 역전파(Backpropagation) 원리 를 이용하여 설계되는데, 복수의 층의 뉴런의 출력값에 가중치(weights) 내지 매개변수(parameters)의 프로덕트 를 다음 층의 뉴런의 입력값으로 사용하고 이러한 입력값에 비선형 함수로서의 활성 함수(Activation functio n)를 적용시켜 최적의 가중치를 찾는 학습 과정을 실행하며, 가중치는 초기 랜덤 선정되나 손실 함수(Loss fuction)을 최소화시키는 방향, 즉 손실 함수 값이 역전파를 통해 각 층의 가중치에 전달되는 방식으로 업데이 트될 수 있고, 이러한 학습 과정에 있어 경쟁 대립적 목적 달성을 이룰 수도 있다. 본 발명의 제네레이터는 적어도 사용자 콘택트렌즈 미착용 이미지 정보 및 콘택트렌즈 정보의 입력되는 이미지 정보를 이용하여 가중치 적용 가능한 복수의 연산을 통해 해당 콘택트렌즈에 대한 콘택트렌즈 착용 제네 러티브 이미지 정보를 생성하고, 디스크리미네이터는 해당 콘택트렌즈 착용 제네러티브 이미지 정보와 사용자의 사전 설정 콘택트렌즈 착용 이미지 정보를 이용하여 가중치 적용 가능한 복수의 연산을 통해 해당 콘 택트렌즈 착용 제네러티브 이미지 정보가 실제인지 페이크인지 여부를 판단한다. 즉, 제네레이터는 사 용자 콘택트렌즈 미착용 이미지 정보 및 콘택트렌즈 정보의 입력되는 이미지 정보로부터 가능한 실제와 구별이 어려운 해당 콘택트렌즈에 대한 콘택트렌즈 착용 제네러티브 이미지 정보를 생성하고, 반대로 디스크리미네이터 는 해당 콘택트렌즈 착용 제네러티브 이미지 정보와 사용자의 사전 설정 콘택트렌즈 착용 이미지 정보를 이용하여 가능한 높은 확률로 실제 이미지가 아닌 생성된 이미지로서의 페이크 여부를 판단하도록 한다. 보다 구체적으로, AI 러닝 모듈은 AI 뉴럴 네트워크 모듈에 구비되는 제네레이터를 학습하 도록, AI 뉴럴 네트워크 모듈에 구비되는 제네레이터 및 디스크리미네이터에 학습 제어 신 호를 인가하되, AI 러닝 모듈이 제네레이터에 제네레이션 학습 제어 신호를 인가하는 경우, 디스 크리미네이터는 소정의 학습 과정을 실행하게 된다. 이때 AI 러닝 모듈은 제네레이터의 복합 연산 가중치를 조정하는데, 이러한 복합 연산 가중치 내지 매개변수의 조정은 디스크리미네이터가 입력되는 콘택트렌즈 착용 제네러티브 이미지 정보가 실제인 것으로 판단하도록 하는 방향으로 결정되어 제네레 이터가 가능한 실제의 이미지에 가깝도록 생성하여 디스크리미네이터가 페이크를 구별 못하도록 학습된다. 또한, AI 러닝 모듈은 AI 뉴럴 네트워크 모듈에 구비되는 디스크리미네이터를 학습하도록 AI 뉴럴 네트워크 모듈에 구비되는 제네레이터 및 디스크리미네이터에 학습 제어 신호를 인가하되, AI 러닝 모듈이 디스크리미네이터에 디스크리미네이션 학습 제어 신호를 인가하는 경우, 디스크리미네이터가 제네레이터에서 생성되어 디스크리미네이터에 입력되는 콘택트 렌즈 착용 제네러티브 이미지 정보가 페이크인 것으로 판단하도록, 디스크리미네이터의 복합 연산 가중 치를 AI 러닝 모듈이 조정함으로써, 디스크리미네이터가 페이크를 예를 들어 100%에 가깝도록 선 별 가능하도록 학습시킨다. 이하에서는 도면을 참조하여 본 발명의 콘택트렌즈 버츄얼 피팅 시스템을 통한 콘택트렌즈 버츄얼 피팅 방법 을 설명한다. 본 발명의 일실시예에 따른 콘택트렌즈 버츄얼 피팅 방법은 정보 전송 및 정보 요청 단계(S10)와, 정보 전송 및 정보 송출 단계(S11)와, 사용자 이미지 취득 저장 단계(S13,S15)와, 사용자 이미지 전송 단계(S16)와, 셀렉션 콘택트렌즈 정보 전송 단계(S17)와, 사용자 이미지 서버 저장 단계(S18)와, 사용자 착용 이미지 프로세싱 단계 (S19)를 포함한다. 먼저, 정보 전송 및 정보 요청 단계(S10)에서는 사용자 단말기에 설치된 어플리케이션을 통하여 사용자의 ID 정보가 서버로 송출되고, 사용자의 ID 정보에 연계된 ID 연계 정보 및 콘택트렌즈 정보가 요청된다. 즉, 정보 전송 및 정보 요청 단계(S10)에서 사용자 단말기에 설치된 어플리케이션을 통하여 사용자 단말기 는 사용자 ID 정보를 포함하는 사용자 단말 코드를 제공할 수 있는데, 사용자 ID 정보는 사용자의 아이디, 나이, 홍채 색상 등을 포함할 수 있고, 경우에 따라 나이, 성명, 주소, 전화번호 등의 보다 구체적인 개인 정보 를 포함할 수도 있고, 사용자 ID 정보 들은 사용자 ID 정보와 연계되어 사용자 ID 연계 정보로 서버 측에 저장될 수도 있는데, 이들은 개인정보 누출로 인한 개인정보 보호 위반의 위험성을 방지하도록 암호화되어 저장 되거나 사용자 편의성을 제공하는 정도의 최소한의 데이터 피처로 구성될 수 있다. 즉, 도면에 도시된 바와 같이, 사용자의 사용자 단말기에서 어플리케이션을 실행하는 화면이 도시되는데, 사용자의 사용자 ID 정보를 통하여 서버에 접속될 수 있다. 또한, 사용자 ID 연계 정보는 사용자에 의하여 그동안 선택되거나 구매되거나 사용자 리뷰 등이 검토된 콘택트 렌즈 정보를 포함할 수 있으며 이러한 정보는 서버에 저장될 수 있다. 정보 전송 및 정보 송출 단계(S11)에서 상기 서버는 사용자의 ID 정보에 연계된 ID 연계 정보 및 콘택트렌 즈 정보가 사용자 단말기로 송출되는데, 정보 전송 및 정보 송출 단계(S11)에서 서버는 사용자 단말기 로부터 입력된 사용자의 ID 정보에 대응하는 사용자 ID 연계 정보를 확인하여 전달 송출하고, 이와 동시에 콘택트렌즈 정보, 즉 최신 업데이트된 콘택트렌즈 제품에 대한 정보를 전송한다. 이때, 콘택트렌즈 정보에는 사용자 ID 연계 정보에 관련되어 빅데이터 처리된 맞춤형 콘택트렌즈 정보, 즉 사용자의 리뷰, 선택 내지 구매 정보와 사용자 ID를 반영하여 연령, 성별, 계절, 날씨 등의 피쳐들을 고려하여 빅데이터 처리되어 추천되는 레 커멘드 콘택트렌즈 정보를 포함할 수도 있다. 도면에 도시된 바와 같이, 서버에서 전달 송출된 사용자 ID 연계 정보와 콘택트렌즈 제품에 대한 정보는 사용자 단말기의 단말 출력부의 디스플레이 화면에 표시될 수 있는데, 신제품의 콘택트렌즈 제품의 정보가 표시되거나 사용자의 사용 후기 등이 표시될 수 있다. 그런 후, 사용자 이미지 취득 저장 단계(S13,S15)가 실행되는데, 사용자 이미지 취득 저장 단계(S13,S15)에서는 사용자 단말기에 설치된 어플리케이션을 통하여 사용자의 사전 설정 콘택트렌즈 착용 이미지 및 사용자 콘 택트렌즈 미착용 이미지 정보가 취득되는 이미지가 취득 저장되며, 사용자 이미지 취득 저장 단계(S13,S15)는 사용자 이미지 취득 단계(S13)와 사용자 이미지 저장 단계(S15)를 포함할 수 있는데, 사용자 이미지가 이미 사 용자 단말기의 단말 저장부에 저장되는 경우 별도의 사용자 이미지 저장 단계를 요하지 않을 수도 있는 등 설계 사양에 따라 다양한 변형이 가능하다. 그런 후, 사용자 이미지 전송 단계(S16)가 실행되는데, 사용자 이미지 전송 단계(S16)에서는 사용자 단말기(1 0)로부터 사용자의 사전 설정 콘택트렌즈 착용 이미지 및 사용자 콘택트렌즈 미착용 이미지 정보가 서버로 전송된다. 여기서, 사용자의 사전 설정 콘택트렌즈 착용 이미지는 사용자가 이미 구매 내지 착용하고 있는 콘 택트렌즈를 착용한 상태에서 촬영된 이미지 정보를 지칭하는 것으로, 해당 콘택트렌즈의 정보, 즉 어떠한 콘택 트렌즈를 착용하고 찍은 것인지 확인하기 위한 제품명 내지 모델명 등의 제품 정보가 동시에 전송될 수 있다. 예를 들어, 도면에 도시된 바와 같이, 촬영 내지 저장된 사용자의 사용자 착용 이미지 내지 미착용 이미지는 서 버로 전송되고, 이러한 이미지 정보는 사용자 ID 연계 정보의 형태로 저장될 수 있으며, 이는 사용자 단말 기의 어플리케이션에서도 확인 가능하다. 사용자 이미지 전송 단계(S16)가 실행된 후, 셀렉션 콘택트렌즈 정보 전송 단계(S17)가 실행되는데, 사용자 단 말기의 어플리케이션에 표시된 콘택트렌즈 정보 중, 사용자가 선택한 콘택트렌즈에 대한 정보, 즉 셀렉션 콘택트렌즈 정보가 서버로 전송된다. 즉, 사용자 단말기에서 선택된 셀렉션 콘택트렌즈 정보는 도면에 도시된 바와 같이, 예를 들어 'M007 버거디 브라운'과 같이 선택되고 해당 제품의 선택 정보가 셀렉션 콘택트렌 즈 정보로 서버 측으로 전송된다. 셀렉션 콘택트렌즈 정보 전송 단계(S17)에서 서버가 사용자 단말기 측으로부터 콘택트렌즈 정보 중 선 택된 셀렉션 콘택트렌즈 정보를 수신한 후 서버는 해당 정보를 서버에 저장하는 사용자 이미지 서버 저 장 단계(S18)가 실행되는데, 사용자 이미지 서버 저장 단계(S18)에서 서버에 수신된 사용자의 사전 설정 콘 택트렌즈 착용 이미지 및 사용자 콘택트렌즈 미착용 이미지 정보가 사용자의 ID 정보에 대응하는 ID 연계 정보 로 저장된다. 이 과정에서 상기한 바와 같이 개인 정보 보호를 위한 개인에 대한 비식별화 과정을 추가될 수도 있는 등 설계 사양에 따라 다양한 구성이 가능하다. 그런 후, 사용자 착용 이미지 프로세싱 단계(S19)가 실행되는데, 서버는 사용자가 선택한 셀렉션 콘택트렌 즈를 사용자가 착용한 상태의 버츄얼 피팅 이미지를 생성한다. 즉, 사용자 착용 이미지 프로세싱 단계(S19)는 사용자 이미지 AI 프로세싱 단계(S193)를 포함하는데, 사용자 이미지 AI 프로세싱 단계(S193)에서 서버는 복수의 연산을 통하여 이미지 학습을 통한 상기 셀렉션 콘택트렌즈에 대한 사용자의 가상 피팅 이미지를 생성하 는데, 이러한 생성 과정은 사용자의 사전 설정 콘택트렌즈 착용 이미지 및 사용자 콘택트렌즈 미착용 이미지 정 보에 기초한다. 한편, 경우에 따라 본 발명의 일실시예에 따른 콘택트렌즈 버츄얼 피팅 방법의 변형예의 사용자 착용 이미지 프 로세싱 단계(S19)는 사용자 이미지 보정 단계(S191)를 포함할 수 있는데, 사용자 이미지 보정 단계(S191)는 사 용자 이미지 AI 프로세싱 단계(S193)의 실행 전에, 사용자의 안구 이미지 정보를 이용하여 보정하는 사용자 이 미지 보정 단계(S191)를 더 포함할 수도 있는데, 이러한 보정 과정은 별도의 영상 처리 모듈의 영상 보정 모듈에서 실행될 수도 있고, 다른 영상 추출 모듈 내지 영상 생성 모듈에서 일체로 기능 실행될 수도 있 는 등 다양한 변형이 가능하며 본 실시예에서는 영상 보정 모듈이 보정 실행하는 경우를 중심으로 설명하다. 즉, 사용자가 촬영하여 전송하는 전송 이미지의 화상 조건이 상이하여 정확한 이미지 학습에 영향을 최소화하기 위한 보정 과정이 더 실행될 수 있는데, 본 발명의 일실시예에 따른 사용자 이미지 보정 단계(S191)는 이미지 정보 입력 단계(S1911)와, 대상 이미지 추출 단계(S1913)와, 대상 이미지 보정 단계(S1915)를 포함할 수 있다. 먼저, 이미지 정보 입력 단계(S1911)에서 서버의 서버 제어부에 구비되어, 서버의 서버 통신부 및 서버 저장부를 제어하는 제어 모듈의 영상 처리 모듈에 사용자의 사용자 콘택트렌즈 미착용 이미지 정보 및 사전 설정 콘택트렌즈 착용 이미지 정보가 입력된다. 그런 후, 대상 이미지 추출 단계(S1913)에서는 영상 처리 모듈의 영상 추출 모듈에서 사용자 콘택트 렌즈 미착용 이미지 정보 및 사용자의 사전 설정 콘택트렌즈 착용 이미지 정보 중 안구 영역의 이미지가 추출된 다. 즉, 도면에서와 같이 안면 전체의 이미지 중 안구 영역을 확인하고 해당 안구 영역을 대상 이미지로 선택 하고 대상 영역의 대상 이미지를 추출한다. 보다 구체적으로, 대상 이미지 추출 단계(S1913)는 대상 이미지 스크레라 추출 단계(S19131)와, 대상 이미지 퓨 플 아이리스 추출 단계(S19133)를 포함한다. 대상 이미지 스크레라 추출 단계(S19131)에서 사용자 콘택트렌즈 미착용 이미지 정보 및 사용자의 사전 설정 콘택트렌즈 착용 이미지 정보 중 안구 영역의 스크레라(sclera;공막 (鞏膜)) 영역의 이미지를 추출하는데, 대상 이미지는 취득되는 촬영 기기로서의 카메라 내지 주변 조도의 상황 에 따라 다양한 촬영 조건의 차이로 인하여 촬영 이미지 간에 색상 차이가 발생할 여지가 높다. 따라서, 본 발 명의 일실시예에서의 사용자 콘택트렌즈 미착용 이미지 정보 및 사용자의 사전 설정 콘택트렌즈 착용 이미지 정 보 중 안구 영역의 스크레라(sclera;공막(鞏膜)) 영역(Asn, Asw)의 이미지를 추출한다. 이는 소위 눈의 흰자, 즉 백색 영역으로 이를 추출하여 이를 통한 색상의 보정을 통하여 나머지 눈동자 내지 홍채 영역의 색상의 촬영 상태에 따른 편차를 최소화시킬 수도 있다. 대상 이미지 스크레라 추출 단계(S19131)가 실행된 후, 대상 이미지 퓨플 아이리스 추출 단계(S19133)에서는 사 용자 콘택트렌즈 미착용 이미지 정보 및 사용자의 사전 설정 콘택트렌즈 착용 이미지 정보 중 안구 영역의 퓨플 아이리스(pupil, iris;동공(瞳孔), 홍채(虹彩)) 영역(Apn,Apw)의 이미지를 추출하는 대상 이미지 퓨플 아이리스추출 단계(S19133)을 포함한다. 예를 들어, 도면에는 서로 다른 촬영 환경에서 촬영된 사용자의 사용자 콘택트렌즈 착용 이미지와 사용자 콘택 트렌즈 미착용 이미지가 도시되는데, 안구 영역중 사용자 콘택트렌즈 미착용 이미지 정보 및 사용자의 사전 설 정 콘택트렌즈 착용 이미지 정보 중 안구 영역의 스크레라(sclera;공막(鞏膜)) 영역을 도면 부호 Asw, Asn로 표 시하며, 마찬가지로 사용자 콘택트렌즈 미착용 이미지 정보 및 사용자의 사전 설정 콘택트렌즈 착용 이미지 정 보 중 안구 영역의 퓨플 아이리스(pupil, iris;동공(瞳孔), 홍채(虹彩)) 영역을 도면 부호 Apn,Apw로 표시하고, 각각은 스크레라 영역의 착용 경우와 미착용 경우를 나타내고, 도면 부호 CL은 콘택트렌즈를 지시한다. 이미지가 취득 촬영되는 환경의 차이에 따라 스크레라 영역의 픽셀의 흰색의 RGB 값에 차이가 발생하는데, 이러 한 상황을 고려하여 대상 이미지 보정 단계(S1915)가 실행된다. 즉, 대상 이미지 보정 단계(S1915)에서는 영상 처리 모듈의 영상 추출 모듈에서 사전 설정 콘택트렌즈 착용 이미지 정보 중 안구 영역의 이미지가 보정되는데, 보다 구체적으로 대상 이미지 보정 단계(S1915)는 대상 이미지 스크레라(sclera;공막(鞏膜)) 영역 확인 단계(S19151)와 대상 이미지 스크레라 보정 산출 단계(S19153)와 대상 이미지 보정 실행 단계(S19155)를 포함한다. 대상 이미지 스크레라(sclera;공막(鞏膜)) 영역 확인 단계(S19151)에서는 대상 이미지 스크레라 추출 단계 (S19131)에서 추출된 대상 이미지 스크레라(sclera;공막(鞏膜)) 영역이 확인되고, 대상 이미지 스크레라 보정 산출 단계(S19153)를 실행한다. 즉, 대상 이미지 스크레라 보정 산출 단계(S19153)에서 대상 이미지 스크레라 (sclera;공막(鞏膜)) 영역의 이미지 정보를 이용하여 색 보정 데이터를 확인하는데, 추출된 대상 이미지의 스크 레라 영역의 흰색을 표시하는 RGB값을 이용하여 색 편차를 확인하여 색 보정 데이터를 확인한다. 대상 이미지 스크레라 보정 산출 단계(S19153)에서 확인된 색 보정 데이터를 이용하여 대상 이미지 보정 실행 단계(S19155)가 실행된다. 즉, 대상 이미지 스크레라 보정 산출 단계(S19153)에서 확인된 색 보정 데이터를 이 용하여, 대상 이미지 퓨플 아이리스(pupil, iris;동공(瞳孔), 홍채(虹彩)) 영역의 이미지 정보 및 대상 이미지 스크레라(sclera;공막(鞏膜)) 영역의 이미지 정보를 색 보정 실행할 수 있다. 이와 같은 스크레라 영역의 색편 차를 이용하여 이를 색 보정 데이터로 변환하여 이를 대상 이미지의 동공 내지 홍채 영과 스크레라 영역의 이미 지를 보정하여 보다 정확한 이미지 정보 확인이 가능할 수도 있다. 그런 후, 사용자 착용 이미지 프로세싱 단계(S19)의 사용자 이미지 AI 프로세싱 단계(S193)가 실행되는데, 사용 자 이미지 AI 프로세싱 단계(S193)에서 서버는 복수의 연산을 통하여 이미지 학습을 통한 셀렉션 콘택트렌 즈에 대한 사용자의 가상 피팅 이미지를 생성하는데, 이러한 생성 과정은 사용자의 사전 설정 콘택트렌즈 착용 이미지 및 사용자 콘택트렌즈 미착용 이미지 정보에 기초한다. 보다 구체적으로, 사용자 이미지 AI 프로세싱 단계(S193)는 이미지 데이터 입력 확인 단계(S1931)와 착용 제네 레이팅 이미지 생성 단계(S1933)와, 이미지 러닝 단계(S1935)와, 피팅 이미지 출력 단계(S1937)를 포함한다. 이미지 데이터 입력 확인 단계(S1931)에서는 사용자의 사전 설정 콘택트렌즈 착용 이미지 및 사용자 콘택트렌즈 미착용 이미지 정보를 입력 확인한다. 즉, 서버의 서버 저장부에 저장된 사용자 ID 연계 정보와 사용 자의 사전 설정 콘택트렌즈 착용 이미지 및 사용자 콘택트렌즈 미착용 이미지 정보를 확인한다. 그런 후, 이미지 데이터 입력 확인 단계(S1931)에서 확인된 사용자의 사전 설정 콘택트렌즈 착용 이미지 및 사 용자 콘택트렌즈 미착용 이미지 정보를 이용하여 착용 제네레이팅 이미지 생성 단계(S1933)가 실행된다. 착용 제네레이팅 이미지 생성 단계(S1933)에서는 사용자 콘택트렌즈 미착용 이미지 정보 및 사전 설정 콘택트렌즈 정 보를 이용하여, 복수의 연산을 통하여 사용자의 사전 설정 콘택트렌즈를 착용한 착용 제네레이팅 이미지를 생성 하는데, 이러한 착용 제네레이팅 이미지의 생성은 Ai 뉴럴 네트워크 모듈의 제네레이터에서 이루 어지며 이러한 이미지 생성은 이미지 픽셀의 RGB 값의 조정 및 생성을 통하여 이루어진다. 그런 후, 이미지 러닝 단계(S1935)가 실행되는데, 이미지 러닝 단계(S1935)에서는 서버 측의 AI 뉴럴 네트 워크 모듈의 제네레이터 및 디스크리미네티어가, 사용자의 사전 설정 콘택트렌즈 착용 이 미지 및 상기 착용 제네레이팅 이미지를 이용하여 복수의 연산을 통해 이미지 학습을 실행한다. 보다 구체적으 로, 이미지 러닝 단계(S1935)는 디스크리미네이션 러닝 단계(S19351)과, 제네네이션 러닝 단계(S19353)를 포함 하는데, 디스크리미네이션 러닝 단계(S19351)에서는 제어 모듈의 AI 러닝 모듈에 구비되는 AI 러닝 모듈이 디스크리미네이터에 학습 제어 신호를 인가한다. 이와 같이 디스크리미네이터이 AI 러닝 모듈로부터 학습 제어 신호를 인가받는 경우, 소정의 학습 과정이 실행되는데, 디스크리미네이션 러닝 단계(S19351)에서는 콘택트렌즈 착용 제네러티브 이미지 정보와 사용자의 사전 설정 콘택트렌즈 착용 이미지를 비교하는데, 디스크리미네이터에 입력되는 콘택트렌즈 착용 제네러티브 이미지 정보는 제네레이터에서 생성된다. 이때, 디스크리미네이터가 콘택트렌즈 착 용 제네러티브 이미지 정보를 페이크인 것으로 판단하도록 학습되어 AI 러닝 모듈이 디스크리미네이터 의 복합 연산 가중치를 조정한다. 반면, 제네네이션 러닝 단계(S19353)에서는 제어 모듈의 AI 러닝 모듈에 구비되는 AI 러닝 모듈 이 디스크리미네이터에 학습 제어 신호를 인가하게 된다. 이때, AI 러닝 모듈은 제네레이 터의 복합 연산 가중치를 조정하는데, 이러한 제네레이터의 복합 연산 가중치 조정은 디스크리미 네이터가 입력되는 콘택트렌즈 착용 제네러티브 이미지 정보가 실제인 것으로 판단하도록 하는 방향으로 이루어진다. 이러한 이미지 러닝 단계(S1935)가 실행된 후, 피팅 이미지 출력 단계(S1937)가 실행되는데, 이미지 러닝 단계 (S1935)에서 학습된 AI 뉴럴 네트워크 모듈의 제네레이터를 통하여 적어도 사용자 콘택트렌즈 미 착용 이미지 정보 및 콘택트렌즈 정보의 입력되는 이미지 정보를 이용하여 가중치 적용 가능한 복수의 연산을 통해 다른 콘택트렌즈에 대한 콘택트렌즈 착용 제네러티브 이미지 정보가 생성된다. 즉, 이미지 러닝 단계 (S1935)를 통하여 학습된 제네레이터에 사용자가 선택한 셀렉션 콘택트렌즈 정보와 사용자의 콘택트렌즈 미착용 이미지 정보를 이용하여 사용자가 새로이 선택한 셀렉션 콘택트렌즈 정보를 사용자가 착용한 상태의 가 상 버츄얼 이미지를 생성하는데, 앞서 안구 영역의 이미지를 추출하여 학습시키는 경우 안구 영역에 대한 사용 자의 셀렉션 콘택트렌즈 정보를 착용한 버츄얼 이미지를 사용자의 안면 전체에 합성하는 형태의 이미지 처리 및 출력을 실행할 수도 있다. 한편, 앞선 실시예에서는 사용자 단말기를 통하여 입력되는 사용자의 정보 및 사전 설정 콘택트렌즈 착용 이미지 및 미착용 이미지를 기초로 AI 학습을 통해 사용자가 선택 내지 추천되는 콘택트렌즈에 대한 가상의 버 츄얼 피팅 이미지를 도출하는 시스템 및 이의 방법에 대하여 기술하였으나, 이러한 과정은 본 발명의 콘택트렌 즈 버츄얼 피팅 시스템의 구현은 오프라인 매장을 통하여 이루어질 수도 있다. 즉, 본 발명의 다른 일예에 따 른 콘택트렌즈 버츄얼 피팅 시스템은 앞선 실시예에서와 달리 도 26에 도시된 바와 같은 콘택트렌즈 전시 스 탠드와, 서버를 포함하는데, 경우에 따라 사용자 단말기가 더 구비되는 구성을 취할 수도 있다. 본 발명의 콘택트렌즈 버츄얼 피팅 시스템의 콘택트렌즈 전시 스탠드가 도 26에 도시된 구성을 취할 수도 있으 나, 이는 경사 가동 가능한 구조이거나 고정형 경사 구조를 취하여 도 28 및 도 28에 도시되는 바와 같이 경사 형 구조를 취할 수도 있다. 본 발명은 콘택트렌즈 전시 스탠드를 포함하는데, 본 발명의 매장 내 배치되는 콘택트렌즈 전시 스탠드는, 콘택트렌즈를 수용하는 복수 개의 렌즈 큐브가 배치되고 사용자의 ID 정보가 수신 가능하고, ID 정보에 대응하 여 저장된 ID 연계 정보 및 콘택트렌즈 정보를 송출 가능한 서버와 연계되어, 콘택트렌즈 정보 중 선택된 셀렉션 콘택트렌즈 정보를 서버로 전송하고, 셀렉션 콘택트렌즈 정보와 ID 연계 정보에 포함되는 사용자 콘 택트렌즈 미착용 이미지 정보 및 사용자의 사전 설정 콘택트렌즈 착용 이미지 정보에 기초하여, 서버에서 복수의 연산을 통하여 이미지 학습을 통한 셀렉션 콘택트렌즈에 대하여 생성된 사용자의 가상 피팅 이미지를 수 신하여 콘택트렌즈 전시 스탠드에 화상 표시 가능하다. 즉, 도 26에 도시된 바와 같이, 오프라인 매장(Shop) 내에 배치되는 콘택트렌즈 전시 스탠드가 도시되는데, 매장 내 배치되는 콘택트렌즈 전시 스탠드에는 복수 개의 렌즈 큐브가 배치되고 각각의 렌즈 큐브에는 콘택트렌즈(CL)가 수용될 수 있다. 콘택트렌즈 전시 스탠드는 사용자의 사용자 ID 정보를 수신 가능하다. 콘택트렌즈 전시 스탠드가 사용자의 사용자 ID 정보를 수신하는 방법은, 유선 무선 통신 내지 별도의 입력 부를 통한 입력도 가능하다. 즉, 콘택트렌즈 전시 스탠드에 사용자의 사용자 ID 정보가 전달되는 방식은, 콘택트렌즈 전시 스탠드의 후술되는 스탠드 입력부를 통하여 이루어질 수도 있고, 콘택트렌즈 전시 스 탠드의 스탠드 통신부를 통하여 이루어질 수도 있는 등 다양한 변형이 가능하다. 서버는 앞선 실시예에서와 구체적 구성은 실질적으로 동일한데, 차이점을 중심으로 설명하면, 서버는 콘택트렌즈 전시 스탠드로부터의 사용자 ID 정보를 수신하여 ID 정보에 대응하여 저장된 ID 연계 정보 및 콘택트렌즈 정보를 콘택트렌즈 전시 스탠드로 송출 가능하다. 또한, 콘택트렌즈 전시 스탠드는 콘택트렌즈 정보 중 선택된 셀렉션 콘택트렌즈 정보를 서버로 전송하 고, 서버는 콘택트렌즈 전시 스탠드로부터 셀렉션 콘택트렌즈 정보와 ID 연계 정보에 포함되는 사용자콘택트렌즈 미착용 이미지 정보 및 사용자의 사전 설정 콘택트렌즈 착용 이미지 정보에 기초하여, 서버에서 복수의 연산을 통하여 이미지 학습을 통한 상기 셀렉션 콘택트렌즈에 대한 사용자의 가상 피팅 이미지를 생성한 다. 서버에서의 가상 버츄얼 피팅 이미지의 생성 과정은 앞선 실시예에서의 구조와 동일한바 차이점을 중심으로 설명하면, 앞선 실시예에서와의 차이점은 사용자 ID 정보와 셀렉션 콘택트렌즈 정보를 콘택트렌즈 전시 스탠드 로부터 수신하고, 경우에 따라 사용자 콘택트렌즈 미착용 이미지 정보 및 사용자의 사전 설정 콘택트렌즈 착용 이미지 정보도 콘택트렌즈 전시 스탠드로부터 수신하거나 이미 서버에 저장된 구조를 취할 수도 있는데, 사전에 서버에 저장된 경우에는 사용자 단말기의 어플리케이션으로부터 이미 전송 저장된 경우 일 수도 있고, 콘택트렌즈 전시 스탠드에서 이미 취득 전송되어 저장된 경우일 수도 있는 등 서버에 이 미 저장된 경우에는 사용자 ID 연계 정보로서 서버의 서버 저장부에 저장될 수 있다. 보다 구체적으로, 콘택트렌즈 전시 스탠드는 스탠드 하우징과, 스탠드 커버와, 스탠드 터치 패널 과, 스탠드 출력부와, 스탠드 입력부와, 스탠드 통신부와, 스탠드 저장부와, 스탠드 제어 부를 포함한다. 스탠드 하우징은 오프라인 매장(SHOP)에 배치되고 사전 설정 경사도를 갖는데, 스탠드 하우징은 본 실 시예에서 단순한 박스형 구조를 갖는 것으로 도시되었으나, 경우에 따라 하단에 휠을 구비하여 오프라인 매장 내에서의 위치 이송을 원활하게 하거나, 휠 록을 구비하여 원치 않는 이동을 방지하는 구성을 취할 수도 있는 등 설계 사양에 따라 다양한 변형이 가능하다. 스탠드 하우징은 본 실시예에서 정면부와 평면부의 적어도 일부가 사전 설정된 각도를 갖는 경사 배치 구조 를 취하여 매장 내에서의 공간적 활용성을 극대화시키는 구성을 취할 수도 있다. 스탠드 하우징의 경사 형성된 부분에는 스탠드 커버가 배치되는데, 스탠드 커버는 스탠드 하우징과 맞물리어 내부 공간을 형성하여 다른 구성요소의 수용 배치를 가능하게 한다. 스탠드 커버는 스탠드 하우징이 일측에 배치되어 내부 공간을 형성한다. 보다 구체적으로, 본 실시예 에서 스탠드 커버의 전면에는 복수 개의 구멍이 형성되어 후술되는 렌즈 큐브의 수용 배치를 허용할 수 있 다. 본 실시예에서의 스탠드 커버는 하드한 재질로 형성되는 플레이트 구조를 취할 수도 있으나, 경우에 따라 단순 필름 형태로 구현되어 오프라인 매장에서의 계절별 내지 이벤트성 프로모션 등의 행사 기획에 적절한 대응이 가능하도록 구멍의 위치, 표면의 캐치 프레이즈 등의 다양한 변화가 가능한 구성을 취할 수도 있으며, 또 다른 변형의 예로 스탠드 커버는 복수 개의 구성을 취하여 플레이트와 커버 필름의 복합 구조를 취할 수 도 있는 등 다양한 변형이 가능하다. 경우에 따라 콘택트렌즈 전시 스탠드는 스탠드 커버와 스탠드 하우징 사이에 더 배치되는 구성요소 를 포함할 수 있다. 즉, 콘택트렌즈 전시 스탠드는 스탠드 스페이서를 포함할 수도 있는데, 스탠드 스 페이서는 스탠드 하우징과 스탠드 커버 사이에 배치되어 양자 간의 사이 간격을 형성할 수 있다. 예를 들어, 스탠드 커버가 필름 타입으로 구현되는 경우 충분한 강성을 갖지 못하여 전시 기능에 제약이 수 반될 수 있는바, 스탠드 하우징과 스탠드 커버 사이에 배치되는 스탠드 스페이서를 통하여 스탠드 커버의 위치를 원활하게 유지하여 전시 기능을 원만하게 이루어지도록 할 수도 있다. 한편, 스탠드 스페이서는 본 실시예에서 플레이트 타입으로 구현되었으나, 경우에 따라 복수 개의 블록으로 구현될 수도 있는 등 다양한 변형이 가능한데, 본 실시예에서와 같이 플레이트 타입으로 구현되고 소정의 두께 르를 갖는 경우, 스탠드 스페이서는 스탠드 스페이서 관통구를 구비하여 복수 개의 렌즈 큐브의 관 통 배치를 허용하고 원활한 위치 선정이 가능하도록 배치 자유도를 증진시킬 수 있는데, 스탠드 스페이서 관통 구는 스탠드 커버에 형성되는 스탠드 커버 관통구에 상응하여 형성되는 구조를 취하는 것이 바람 직하다. 스탠드 터치 패널은 스탠드 커버와 스탠드 하우징의 내부 공간에 배치되고 렌즈 큐브과 접속 되어 전기적 소통이 이루어지고, 렌즈 큐브에 전기적 신호를 인가하는데, 스탠드 터치 패널은 본 실시 예에서 렌즈 큐브와 콘택트렌즈 전시 스탠드의 후술되는 스탠드 제어부(22, 도 29 참조)를 연결하는 전 기적 접속체로서의 기능을 수행한다. 스탠드 터치 패널은 복수 개의 매트릭스 배선 구조로 형성되고, 렌즈 큐브 측의 접속 단자 측과 접촉하는 위치에서의 신호 입출력이 가능한 구조를 취할 수 있다. 이와 같은 구성을 통하여, 해당 렌즈 큐브에 대한 정보와 스탠드 터치 패널의 설정 위치값이 스탠드 제어부에 전송되어스탠드 터치 패널에서 특정 위치에 해당 렌즈 큐브가 위치한 것으로 설정되고, 해당 렌즈 큐브로부터의 신 호는 스탠드 터치 패널을 통하여 스탠드 제어부 측으로 전달되고, 스탠드 제어부로부터의 신호는 스탠드 터치 패널을 통하여 해당 렌즈 큐브 측으로 전달될 수 있다. 스탠드 출력부는 서버에서 복수의 연산을 통하여 이미지 학습을 통해 생성된 사용자의 가상 피팅 이미 지를 화상 표시하는 스탠드 디스플레이를 포함한다. 즉, 스탠드 출력부는 하기되는 스탠드 제어부 의 스탠드 출력 제어 신호에 따라 서버로부터 생성된 가상의 콘택트렌즈 버츄얼 피팅 이미지 정보를 화 상 출력할 수 있는데, 스탠드 출력부는 디스플레이 출력 이외에도 음향 출력을 이루는 스탠드 스피커를 더 구비할 수도 있는 등 다양한 변형이 가능하다. 스탠드 입력부는 사용자의 ID 정보가 입력되거나 각각의 렌즈 큐브를 스탠드 제어부 측에 스탠드 터치 패널 상의 위치를 매칭시키기 위한 정보 입력에 사용될 수 있는데, 스탠드 입력부는 통상적인 키보드 내지 마우스 내지 터치 스크린 입력 장치의 형태로 구현될 수도 있고, USB 단자 등의 입력 포트 형태로 구현될 수도 있는 등 다양한 변형이 가능하다. 스탠드 통신부는 적어도 서버와 통신을 이루는데, 정보의 입출력 간의 관점에서 스탠드 입력부와 일부 기능적 중첩 사항이 존재하여 부분적인 통합 구조를 취할 수도 있다. 스탠드 통신부는 서버의 서 버 통신부와의 통신을 네트워크를 통하여 실행할 수도 있고, 경우에 따라 사용자 단말기와의 유무선 통신을 통한 사용자 ID 정보의 입출력 내지 사용자가 선택하여 복수의 연산을 통해 산출된 해당 콘택트렌즈에 대한 콘 택트렌즈 버츄얼 피팅 이미지 등의 전송 기능을 수행할 수도 있는 등 설계 사양에 따라 다양한 변형이 가능하다. 즉, 스탠드 통신부는 스탠드 서버 통신부과 스탠드 근거리 통신부를 포함할 수 있는데, 스탠드 서버 통신부는 서버와의 유선, 무선 내지 유무선 통신을 이룰 수 있고, 스탠드 근거리 통신부는 오프라인 매장 내에서의 다른 기기 예를 들어, 사용자의 사용자 단말기와 통신을 이룰 수 있고, 경우에 따 러 콘택트렌즈 전시 스탠드에 배치되는 복수 개의 렌즈 큐브와의 통신 연결 구조를 형성할 수도 있다. 스탠드 저장부는 사용자 ID 정보를 저장하고, 서버로부터 송출되는 콘택트렌즈 정보를 스탠드 제어부 의 스탠드 저장 제어 신호에 따라 저장하는데, 스탠드 저장부는 서버로부터 전송되는 업데이트되는 콘택트렌즈에 대한 정보를 저장할 수도 있다. 스탠드 제어부는 스탠드 터치 패널을 통하여 렌즈 큐브 측에 블록 제어 신호를 인가하고 렌즈 큐 브 측으로부터 콘택트렌즈 정보 중 선택된 셀렉션 콘택트렌즈 정보를 전달받고, 사용자 ID 정보 및 셀렉 션 콘택트렌즈 정보를 서버로 전송하여 서버에서 복수의 연산을 통하여 이미지 학습을 통하여 셀렉 션 콘택트렌즈 정보에 대하여 생성된 사용자의 가상 피팅 이미지를 수신하도록 스탠드 통신부에 통신 제어 신호를 인가한다. 즉, 스탠드 통신부의 스탠드 서버 통신부는 서버의 서버 통신부와 신호 송 수신을 이루고, 스탠드 통신부의 스탠드 근거리 통신부는 사용자의 사용자 단말기의 단말 통신부 내지 콘택트렌즈 전시 스탠드에 배치되는 복수 개의 렌즈 큐브와의 통신 연결 구조를 형성할 수도 있 다. 본 실시예에서의 서버는 서버 통신부와, 서버 저장부와, 서버 제어부를 포함하며 실질적으로 앞선 실시예에서와 거의 동일하나, 본 실시예에서의 서버 통신부는 통신 네트워크를 통하여 콘택트렌즈 전 시 스탠드와 송수신하고, 서버 제어부는 서버 통신부 및 상기 서버 저장부를 제어하고, 콘택트 렌즈 전시 스탠드로부터 사용자 콘택트렌즈 미착용 이미지 정보 및 셀렉션 콘택트렌즈 정보와, ID 연계 정 보에 포함되는 사용자의 사전 설정 콘택트렌즈 착용 이미지 정보를 영상 처리하고 이미지 학습을 통한 사용자의 가상 피팅 이미지를 생성할 수 있는데, 사용자 콘택트렌즈 미착용 이미지 정보 및 셀렉션 콘택트렌즈 정보와, ID 연계 정보에 포함되는 사용자의 사전 설정 콘택트렌즈 착용 이미지 정보는 앞서 기술한 바와 같이, 콘택트렌 즈 전시 스탠드로부터 전달될 수도 있고, 사용자의 사용자 단말기 내지 사용자 단말기에서 전송되 어 저장된 서버의 저장부로부터 전달받을 수도 있는 등 다양한 구성이 가능하다. 한편, 스탠드 입력부는 스탠드 광학 입력부(291, 도 26 참조)를 포함하는데, 스탠드 광학 입력부는 카 메라로 구현되는데, 카메라로 구현되는 스탠드 광학 입력부는 사용자의 사전 설정 콘택트렌즈 착용 이미지 정보 또는 사용자 콘택트렌즈 미착용 이미지 정보를 입력할 수도 있다. 도면에서 스탠드 입력부는 스탠드 디스플레이 외측에 일체 형성되는 구성으로 도시되었으나, 이는 일예로서 본 발명의 스탠드 광학 입력부 는 이에 국한되지 않고 다양한 변형이 가능하다. 또 한편, 본 발명의 일실시예에 따른 콘택트렌즈 전시 스탠드는 렌즈 큐브 홀더가 더 구비할 수 있는데, 렌즈 큐브 홀더는 복수 개의 렌즈 큐브의 미끄러짐을 방지한다. 본 실시예에 따른 콘택트렌즈 전시 스탠드의 스탠드 하우징과 스탠드 커버가 이루는 정면부는 사전 설정된 각도로 경사 배치되어 오프라인 매장 내에서의 공간 점유를 최소화시키는 구성을 취하는데, 이러한 경사 구조로 인하여 이에 배치되는 렌즈 큐브는 전시 상태에서 미끄러짐이 발생할 가능성이 높은데, 본 발명의 렌즈 큐브 홀더는 렌즈 큐 브의 미끄러짐을 방지하여 원치 않는 위치 이동을 방지할 수도 있다. 본 발명의 일실시예에 따른 렌즈 큐브 홀더는 렌즈 큐브 홀더 베이스와, 렌즈 큐브 홀더 베이스 대응부 를 포함한다. 렌즈 큐브 홀더 베이스는 스탠드 하우징과 스탠드 커버가 형성하는 내부 공간으 로 스탠드 하우징과의 사이에 스탠드 터치 패널이 배치되도록 위치한다. 또한, 렌즈 큐브 홀더 베이스 대응부는 렌즈 큐브의 하단에 배치되는데, 렌즈 큐브 홀더 베이스와 상기 렌즈 큐브 홀더 베이스 대응 부 중 적어도 하나는 자석일 수도 있다. 즉, 렌즈 큐브 홀더 베이스가 자성체인 경우 렌즈 큐브 홀더 베이스 대응부가 자석이고, 렌즈 큐브 홀더 베이스가 자석인 경우 렌즈 큐브 홀더 베이스 대응부가 자성체일 수도 있다. 본 실시예에서는 렌즈 큐브 홀더 베이스 대응부가 자석으로 구현되고 자기력에 의한 흡착력으로 경사 구조에서의 위치 고정을 이루는 구성을 취할 수도 있다. 이하에서는 본 발명의 콘택트렌즈 전시 스탠드를 포함하는 콘택트렌즈 버츄얼 피팅 방법을 제공한다. 콘택트렌 즈 버츄얼 피팅 방법은 콘택트렌즈 전시 스탠드와 서버 간에서 이루어진다는 점에서 차이가 있으나,앞 선 실시예와 거의 유사항 구성을 취하는바, 차이점을 중심으로 설명한다. 콘택트렌즈 버츄얼 피팅 방법은 도 30에 도시된 바와 같이, 정보 전송 및 정보 요청 단계(S20)와, 정보 전송 및 정보 송출 단계(S21)와, 렌즈 정보 디스플레이 단계(S22)와, 렌즈 셀렉션 단계(S23)와, 셀렉션 렌즈 정보 전송 단계(S24)와, 사용자 착용 이미지 프로세싱 단계(S19)와, 셀렉션 콘택트렌즈 착용 이미지 전송 단계(S25)와, 셀 렉션 콘택트렌즈 착용 이미지 출력 단계(S26)를 포함하고, 정보 전송 및 정보 요청 단계(S20)에서는 매장 내 배 치되는 콘택트렌즈를 수용하는 복수 개의 렌즈 큐브가 배치되는 콘택트렌즈 전시 스탠드로부터 사용자의 ID 정보가 서버로 송출되고, 사용자의 ID 정보에 연계된 ID 연계 정보 및 콘택트렌즈 정보를 요청하고, 정보 전송 및 정보 송출 단계(S21)에서는 서버에서 사용자의 ID 정보에 연계된 ID 연계 정보 및 콘택트렌즈 정보 가 콘택트렌즈 전시 스탠드로 송출되고, 렌즈 정보 디스플레이 단계(S22)에서는 콘택트렌즈 정보가 콘택트 렌즈 전시 스탠드의 스탠드 출력부의 스탠드 디스플레이에 화상 표시되고, 렌즈 셀렉션 단계(S2 3)에서는 사용자에 의하여 렌즈 큐브를 통하여 사용자가 선택한 콘택트렌즈 정보가 입력되며, 셀렉션 렌즈 정보 전송 단계(S24)에서는 렌즈 셀렉션 단계(S23)에서 선택된 셀렉션 콘택트렌즈에 대한 정보가 서버로 전 송된다. 또한, ID 셀렉션 렌즈 착용안 이미지 생성 단계(S19)에서는 사용자의 사전 설정 콘택트렌즈 착용 이미지 및 사 용자 콘택트렌즈 미착용 이미지 정보에 기초하여, 복수의 연산을 통하여 이미지 학습을 통한 셀렉션 콘택트렌즈 에 대한 사용자의 가상 피팅 이미지를 생성하는 사용자 이미지 AI 프로세싱 단계(S193)를 구비한다. 여기서, ID 셀렉션 렌즈 착용안 이미지 생성 단계(S19)가 포함하는 사용자 이미지 AI 프로세싱 단계(S193)는 앞선 실시 예에서의 콘택트렌즈 버츄얼 피팅 이미지를 생성하기 위한 단계를 지칭하는 것으로 중복된 설명은 생략한다. 셀렉션 콘택트렌즈 착용 이미지 전송 단계(S25)에서는 ID 셀렉션 렌즈 착용안 이미지 생성 단계(S19)에서 생성 된 셀렉션 콘택트렌즈에 대한 사용자의 가상 피팅 이미지를 콘택트렌즈 스탠드로 전송한다. 그런 후, 셀렉션 콘택트렌즈 착용 이미지 전송 단계(S25)가 종료된 후, 셀렉션 콘택트렌즈 착용 이미지 출력 단 계(S26)가 실행되는데, 셀렉션 콘택트렌즈 착용 이미지 출력 단계(S26)는 콘택트렌즈 전시 스탠드에서 사용 자의 가상 피팅 이미지를 화상 표시하여, 오프라인 매장을 방문한 소비자가 디스플레이되는 사용자에 의하여 선 택된 셀렉션 콘택트렌즈에 대한 가상의 콘택트렌즈 버츄얼 피팅 이미지가 화상 출력되어 오프라인 매장에 방문 한 소비자가 육안으로 보고 선택한 콘택트렌즈에 대하여 제네레이터에서 생성한 버츄얼 착용 이미지를 확인하고 신제품 등의 콘택트렌즈 구매의 편의성을 보다 강화시킬 수도 있다. 한편, 본 실시예에서는 오프라인 매장에 배치되는 콘택트렌즈 전시 스탠드에서 사용자 ID 정보가 콘택트렌 즈 전시 스탠드의 스탠드 입력부를 통하여 직접 입력되는 구성을 취할 수도 있으나, 스탠드 입력부(2 9)를 통한 입력 이외에 앞서 기술한 스탠드 통신부를 이용하여 사용자의 사용자 단말기의 단말 통신부 를 통한 정보 전송 내지 입력이 이루어질 수도 있다. 즉, 본 발명의 콘택트렌즈 버츄얼 피팅 시스템은 콘택트렌즈 전시 스탠드 및 서버 이외에 사용자 단말기를 더 포함할 수도 있고, 이 경우 콘택트렌 즈 버츄얼 피팅 시스템을 통한 콘택트렌즈 버츄얼 피팅 방법은 ID 정보 전송 단계(S20-1)를 포함할 수 있는 데, ID 정보 전송 단계(S20-1)는 정보 전송 및 정보 요청 단계(S20) 전에 실행될 수 있고, ID 정보 전송 단계 (S20-1)에서 사용자의 ID 정보는 사용자 단말기에서 콘택트렌즈 전시 스탠드로 전달된다. 앞선 실시예에서는 오프라인 매장에서 해당 렌즈 블록 내 선택한 셀렉션 콘택트렌즈를 이미지 학습을 통하여 오 프라인 매장을 방문한 사용자 내지 소비자의 안면 이미지에 합성 생성된 가상의 셀렉션 콘택트렌즈 버츄얼 피팅 이미지를 출력하는 경우를 기술하였으나, 본 발명은 이에 국한되지 않고, 사용자의 사용자 단말기 내 어플 리케이션을 가동시켜 오프라인 매장 방문 전 이미 선택한 콘택트렌즈에 대한 정보 등을 확인하여 해당 콘택트렌 즈에 대한 버츄얼 이미지를 생성 출력하는 구성을 취하는 맞춤형 서비스를 제공할 수도 있는 등 다양한 변형이 가능하다. 또한, 앞선 실시예에서는 오프라인 매장에서 해당 렌즈 블록 내 선택한 셀렉션 콘택트렌즈를 이미지 학습을 통 하여 오프라인 매장을 방문한 사용자 내지 소비자의 안면 이미지에 합성 생성된 가상의 셀렉션 콘택트렌즈 버츄 얼 피팅 이미지를 출력하는 경우를 기술하였으나, 본 발명은 이에 국한되지 않고, 사용자의 사용자 단말기 내 어플리케이션을 가동시켜 오프라인 매장 방문 전 이미 선택하거나 확인한 리뷰 내용 내지 타 사용자들의 검 색 데이터 등을 사용자의 ID 연계 정보와 연계시켜 빅데이터 처리하여 해당 사용자에게 추천하는 콘택트렌즈에 대한 정보를 확인하여 해당 콘택트렌즈에 대한 버츄얼 이미지를 생성 출력하는 구성을 취할 수도 있는 등 다양 한 변형이 가능하다. 즉, 도 31에 도시된 바와 같이, 본 발명의 콘택트렌즈 버츄얼 피팅 시스템을 통한 콘택트렌즈 버츄얼 피팅 방법은 정보 전송 및 정보 요청 단계(S20)와, ID 연계 정보 확인 및 콘택트렌즈 정보 확인 단계(S21a)와, ID 레 커멘드 렌즈 착용안 이미지 생성 단계(S19a)와, 정보 전송 및 정보 송출 단계(S21a)를 포함하는데, 정보 전송 및 정보 요청 단계(S20)에서는 매장 내 배치되는 콘택트렌즈를 수용하는 복수 개의 렌즈 큐브가 배치되는 콘택 트렌즈 전시 스탠드로부터 사용자의 ID 정보가 서버로 송출되고, 사용자의 ID 정보에 연계된 ID 연계 정보 및 콘택트렌즈 정보를 요청한다. 정보 전송 및 정보 요청 단계(S20)가 실행 후 ID 연계 정보 확인 및 콘택트렌즈 정보 확인 단계(S21a)가 실행되 며, 이때 서버에서는 사용자의 ID 정보에 연계되는 ID 연계 정보 및 사용자에 대하여 추천되는 레커멘드 콘 택트렌즈 정보(개인별 또는 순위별)를 포함하는 콘택트렌즈 정보 확인이 이루어진다. 그런 후, ID 레커멘드 렌즈 착용안 이미지 생성 단계(S19a)가 이루어지는데, 사용자의 사전 설정 콘택트렌즈 착 용 이미지 및 사용자 콘택트렌즈 미착용 이미지 정보와 레커멘드 콘택트렌즈 정보에 기초하여, 복수의 연산을 통하여 이미지 학습을 통한 상기 레커멘드 콘택트렌즈에 대한 사용자의 가상 피팅 이미지를 생성하는데, 여기서 ID 레커멘드 렌즈 착용안 이미지 생성 단계(S19a)에 포함되는 단계 S193은 앞선 실시예에서의 학습된 AI 모듈을 통한 이미지 생성이라는 점에서 상기 사항으로 대체하며 중복된 설명은 생략한다. ID 레커멘드 렌즈 착용안 이미지 생성 단계(S19a)가 이루어진 후, 정보 전송 및 정보 송출 단계(S21a) 및 셀렉 션 콘택트렌즈 착용 이미지 출력 단계(S21b)가 실시된다. 먼저, 정보 전송 및 정보 송출 단계(S21a)에서는 서버에서 사용자의 ID 정보에 연계되는 ID 연계 정보, 사 용자에 대하여 추천되는 레커멘드 콘택트렌즈 정보(개인별 또는 순위별)를 포함하는 콘택트렌즈 정보 및 ID 레 커멘드 콘택트렌즈 착용안 이미지가 콘택트렌즈 전시 스탠드로 송출된다. 그런 후, ID 레커멘드 콘택트렌즈 착용 이미지 출력 단계(S21b)가 실행되는데, ID 레커멘드 콘택트렌즈 착용 이 미지 출력 단계(S21b)에서는 추천된 레커멘드 콘택트렌즈정보가 콘택트렌즈 전시 스탠드에서 사용자의 가상 피팅 이미지가 콘택트렌즈 전시 스탠드의 스탠드 디스플레이로 화상 표시한다. 이러한화상 표시는 사용자의 사용자 단말기 내 어플리케이션을 통하여 이루어질 수도 있다. ID 레커멘드 콘택트렌즈 착용 이미지 출력 단계(S21b)가 실행된 후 렌즈 정보 디스플레이 단계(S22a)가 실행되 는데, 렌즈 정보 디스플레이 단계(S22a)에서는 레커멘드 콘택트렌즈 정보를 포함하는 콘택트렌즈 정보를 콘택트 렌즈 전시 스탠드의 스탠드 출력부의 스탠드 디스플레이에 화상 표시하여, 오프라인 매장을 방문 한 사용자 내지 소비자가 최신 업데이트된 콘택트렌즈 정보를 화상 확인할 수 있다. 렌즈 정보 디스플레이 단계(S22a)가 실행된 후 렌즈 셀렉션 단계(S23)가 실시되는데, 렌즈 셀렉션 단계(S23)에 서는 사용자에 의하여 렌즈 큐브를 통하여 사용자가 선택한 콘택트렌즈 정보가 입력된다. 렌즈 셀렉션 단계(S23)가 실행된 후, 셀렉션 렌즈 정보 전송 단계(S24)가 실행되는데, 셀렉션 렌즈 정보 전송 단계(S24)에서는 렌즈 셀렉션 단계(S23)에서 선택된 셀렉션 콘택트렌즈에 대한 정보가 서버로 전송된다. 즉, 렌즈 셀렉션 단계(S23)에서 오프라인 매장의 콘택트렌즈 전시 스탠드의 경사면에 배치된 렌즈 큐브(4 0)를 통하여 선택된 콘택트렌즈에 대한 정보는 스탠드 제어부를 통하여 스탠드 통신부를 거쳐 서버(3 0)로 전달된다. 그런 후, ID 셀렉션 렌즈 착용안 이미지 생성 단계(S19)가 실행되는데, ID 셀렉션 렌즈 착용안 이미지 생성 단 계(S19)에서는 사용자의 사전 설정 콘택트렌즈 착용 이미지 및 사용자 콘택트렌즈 미착용 이미지 정보에 기초하 여, 복수의 연산을 통하여 이미지 학습을 통한 셀렉션 콘택트렌즈에 대한 사용자의 가상 피팅 이미지를 생성하 며 이러한 제네레이터와 디스크리미네이터의 이미지 학습을 통하여 생성된 착용 이미지를 생성 과정은 앞서 기 술한 바와 동일하다. 사용자 착용 이미지 프로세싱 단계(S19)가 실행된 후 셀렉션 콘택트렌즈 착용 이미지 전송 단계(S25)가 실시되 는데, 셀렉션 콘택트렌즈 착용 이미지 전송 단계(S25)는 사용자 착용 이미지 프로세싱 단계(S19)에서 생성된 셀 렉션 콘택트렌즈에 대한 사용자의 가상 피팅 이미지를 콘택트렌즈 스탠드로 전송한다. 셀렉션 콘택트렌즈 착용 이미지 전송 단계(S25)가 실행된 후, 셀렉션 콘택트렌즈 착용 이미지 출력 단계(S26)에 서는 콘택트렌즈 전시 스탠드에서 사용자의 가상 피팅 이미지가 화상 표시된다. 이 경우에도, 콘택트렌즈 버츄얼 피팅 시스템은 적어도 사용자의 ID 정보를 송출 가능한 사용자 단말기를 더 구비하고, 콘택트렌즈 버츄얼 피팅 방법은 정보 전송 및 정보 요청 단계(S20)의 실행 전에 사용자 단말기 로부터의 ID 정보 전송 단계(S20-1)가 실행되어, 사용자의 ID 정보는 상기 사용자 단말기에서 콘택트렌 즈 전시 스탠드로 전달될 수도 있다. 또 한편, 본 발명의 콘택트렌즈 버츄얼 피팅 시스템은 콘택트렌즈 전시 스탠드와, 서버를 포함하고, 콘택트렌즈 전시 스탠드는 복수 개의 렌즈 큐브를 포함한다. 앞선 실시예들에서와 같이 본 발명의 또 다른 일실시예에서의 콘택트렌즈 전시 스탠드는 매장 내 배치되는 콘택트렌즈를 수용하는 복수 개의 렌즈 큐브가 배치되고 사용자의 ID 정보가 수신 가능한 콘택트렌즈 전시 스탠드와, 서버는 콘택트렌즈 전시 스탠드로부터의 ID 정보를 수신하고, ID 정보에 대응하여 저장된 ID 연계 정보 및 콘택트렌즈 정보를 송출 가능하다. 이때, 콘택트렌즈 전시 스탠드는 상기 콘택트렌즈 정보 중 선택된 셀렉션 콘택트렌즈 정보 가 서버로 전송되며, 콘택트렌즈 전시 스탠드로부터 셀렉션 콘택트렌즈 정보와 사용자 ID 연계 정보에 포함되는 사용자 콘택트렌즈 미착용 이미지 정보 및 사용자의 사전 설정 콘택트렌즈 착용 이미지 정보에 기초하 여, 서버에서 복수의 연산을 실행하여 이미지 학습을 실시하고, 이러한 이미지 학습의 결과로 셀렉션 콘택 트렌즈에 대한 사용자의 가상 피팅 이미지가 생성됨은 상기한 바와 동일하다. 이때, 렌즈 큐브는 렌즈 큐브 하우징과, 렌즈 큐브 광원부를 포함하고, 렌즈 큐브 하우징은 내부에 콘택트렌즈를 수용할 수 있고 콘택트렌즈 전시 스탠드에 배치 가능하며, 렌즈 큐브 광원부는 렌즈 큐브 하우징에 배치되는 콘택트렌즈 측으로 광출사 가능한 구성을 이룬다. 보다 구체적으로, 렌즈 큐브 하우징은 렌즈 큐브 하우징 바디와 렌즈 큐브 하우징 커버를 포함 한다. 렌즈 큐브 하우징 바디은 콘택트렌즈 전시 스탠드에 안착되어 배치되고, 렌즈 큐브 하우징 커 버는 렌즈 큐브 하우징 바디의 상단 측에 상대 가동 가능하게 배치된다. 렌즈 큐브 하우징 바디는 렌즈 큐브 하우징 바디 베이스와 렌즈 큐브 하우징 바디 메인부를 포함한다. 렌즈 큐브 하우징 바디 베이스는 콘택트렌즈 전시 스탠드 측에 위치 안착되고, 렌즈 큐브 하우징 바디 메인부는 렌즈 큐브 하우징 바디 베이스의 일단에 연장 형성되어 렌즈 큐브 하우징 커버와 함께 내부 공간을 형성한다. 도면에 도시된 바와 같이, 렌즈 큐브 하우징 커버는 렌즈 큐브 하우징 커버 바디와, 렌즈 큐브 하우 징 커버 바디 연장부와, 렌즈 큐브 하우징 커버 바디 렌즈 안착부를 포함한다. 렌즈 큐브 하우징 커버 바디는 외부에 노출 배치되고, 렌즈 큐브 하우징 커버 바디 연장부는 렌즈 큐브 하우징 커버 바디의 하단에 연장 형성되고, 렌즈 큐브 하우징 커버 바디 렌즈 안착부는 콘택 트렌즈가 안착 배치 가능하고, 렌즈 큐브 하우징 커버 바디를 통하여 외부로 시각적으로 노출되도록 렌즈 큐브 하우징 커버 바디가 형성하는 내측 공간에 배치된다. 앞서 기술한 바와 같이, 렌즈 큐브 광원부는 렌즈 큐브 하우징에 배치되는 콘택트렌즈(CL) 측으로 광 출사 가능한 구성을 이루는데, 렌즈 큐브 광원부는 렌즈 큐브 광원와, 렌즈 큐브 광전달부를 포 함한다. 렌즈 큐브 광원는 렌즈 큐브 하우징의 내부에 배치되는 렌즈 큐브 기판의 적어도 일부 에 배치되고, 렌즈 큐브 광전달부는 렌즈 큐브 광원의 상측으로 렌즈 큐브 하우징 커버 바디 렌즈 안 착부의 하단에 배치되어 렌즈 큐브 광원으로부터 생성되는 빛을 렌즈 큐브 하우징 커버 바디 렌즈 안착부 측으로 전달한다. 즉, 렌즈 큐브 광원에서 생성된 빛은 렌즈 큐브 광전달부를 통하여 렌즈 큐브 하우징 커버 바디 렌즈 안착부를 거쳐 이의 윗면에 안착 배치되는 콘택트렌즈 측으로 출사된다. 이때, 렌즈 큐브 하우징 커버 바디 렌즈 안착부는 색상의 왜곡을 방지하도록 투명 재료 내지 적어도 백색광의 출사를 이루도록 하는 재질로 형성되는 것이 바람직하다. 이러한 렌즈 큐브 광원 등이 배치되는 렌즈 큐브 기판은 보다 구체적으로 렌즈 큐브 광원 기판 와, 렌즈 큐브 메인 기판와, 렌즈 큐브 기판 연결부를 포함하는데, 렌즈 큐브 광원 기판는 렌즈 큐브 광원이 일면 상에 배치되고, 렌즈 큐브 메인 기판에는 하기되는 렌즈 큐브 접속부와 전기 적으로 연결된다. 이때, 렌즈 큐브 기판 연결부는 렌즈 큐브 광원 기판와 렌즈 큐브 메인 기판(42 3)를 연결하는데, 렌즈 큐브 기판 연결부는 플렉서블 기판으로 형성될 수도 있고 별도의 배선 구조로 형성 될 수도 있는 등 설계 사양에 따라 다양한 변형이 가능하다. 한편, 본 발명의 렌즈 큐브 하우징은 상대 가동 가능한 구성을 취할 수도 있다. 즉, 렌즈 큐브는 렌 즈 큐브 하우징을 탄성 지지하는 렌즈 큐브 탄성부를 더 포함할 수 있는데, 렌즈 큐브 스위치는, 사용자 내지 매장 방문자의 셀렉션 동작을 감지하여 이에 따른 신호 변화를 생성한다. 즉, 오 프라인 매장(SHOP)에 배치되는 콘택트렌즈 전시 스탠드 상에 배치되는 렌즈 큐브를 선택하여 착용 이미 지를 생성하기 위한 셀렉션 과정이 발생하고 이때 렌즈 큐브 스위치는 셀렉션 신호를 발생하여 렌즈 큐브 로부터 셀렉션 정보가 렌즈 큐브의 렌즈 큐브 제어부로부터 렌즈 큐브 접속부를 통하여 콘택트렌 즈 전시 스탠드를 거쳐 서버로 전송되어 셀렉션 콘택트렌즈에 대한 정보로부터 셀렉션 콘택트렌즈의 버 츄얼 피팅 이미지를 생성 출력 가능하게 한다. 이러한 셀렉션 과정에서 매장 방문 소비자의 선택 동작을 촉각적으로 인지 용이하도록 하기 위해 렌즈 큐브 하 우징의 위치 변동이 발생 가능하도록 렌즈 큐브는 렌즈 큐브 탄성부를 더 포함하는데, 렌즈 큐브 탄성부는 렌즈 큐브 탄성체와, 렌즈 큐브 탄성 지지부를 포함하는데, 렌즈 큐브 탄성체는 렌즈 큐브 하우징 측에 가동 가능하 게 수용 배치되는데, 렌즈 큐브 탄성체는 렌즈 큐브 하우징의 렌즈 큐브 하우징 바디의 렌즈 큐 브 하우징 커버 바디 연장부에 형성되는 렌즈 큐브 탄성체 수용부에 수용 배치된다. 또한, 렌즈 큐브 탄성 지지부는 렌즈 큐브 하우징 측으로 렌즈 큐브 탄성체 측의 반대편에 일단이 렌즈 큐 브 탄성체와 접촉 가능하게 형성되는데, 렌즈 큐브 탄성 지지부는 렌즈 큐브 하우징 바디 베이스 의 일면으로부터 렌즈 큐브 탄성체 수용부에 수용 배치되는 렌즈 큐브 탄성체에 일단이 접촉 가능하게 형성된다. 이와 같은 구성을 통하여, 오프라인 매장 방문자가 진열된 콘택트렌즈 전시 스탠드의 일면 상에 배치되는 렌즈 큐브의 선택 동작시 물리적 위치 변동에 따른 선택감을 제공할 수 있다. 이러한 위치 변동 구조의 경우, 도면에 도시된 바와 같이, 물리적 위치 변동에 따른 셀렉션 동작을 감지하기 위 한 구성요소로 접촉식 구조의 렌즈 큐브 스위치를 더 포함할 수 있다. 렌즈 큐브 스위치는, 사용자 내지 매장 방문자의 셀렉션 동작을 감지하여 이에 따른 신호 변화를 생성한다. 즉, 콘택트렌즈 전시 스탠드 는 스탠드 하우징과, 스탠드 커버와, 스탠드 터치 패널과, 스탠드 디스플레이를 포함하는 스탠드 출력부와, 스탠드 입력부와, 스탠드 통신부와, 스탠드 저장부와, 스탠드 제어부를 포함함은 앞서 기술한 바와 동일하며, 렌즈 큐브는 렌즈 큐브 스위치와 렌즈 큐브 접속부를 포함하는데, 도면 부호 C로 확대 도시된 바와 같이 렌즈 큐브 접속부는 렌즈 큐브 이너 접속부와, 렌즈 큐브 아우터 접속부와, 렌즈 큐브 연결 접속부를 포함한다. 렌즈 큐브 이너 접속부는 렌즈 큐 브 고정 스위치 측과 연결되고, 렌즈 큐브 아우터 접속부는 스탠드 터치 패널와 접속되는데, 예 를 들어 스탠드 터치 패널의 스탠드 터치 패널 터치부(251, 도 36 참조)와 접속되고, 렌즈 큐브 연결 접속 부는 렌즈 큐브 이너 접속부와 렌즈 큐브 아우터 접속부을 연결하는데, 본 실시예에서 렌즈 큐 브 이너 접속부와, 렌즈 큐브 아우터 접속부와, 렌즈 큐브 연결 접속부는 렌즈 큐브 하우징 바 디 베이스에 인서트 사출되는 구조를 중심으로 설명하였으나, 경우에 따라 별도의 배선 구조를 취할 수도 있는 등 다양한 변형이 가능하다. 렌즈 큐브 탄성부가 가압되어 렌즈 큐브 하우징의 위치 변동이 발생하는 경우 신호 변화를 생성하고, 이때 렌즈 큐브 스위치는 사용자의 선택 동작에 의하여 변화된 신호를 발생하는데, 렌즈 큐브 접속부(45 0)는 렌즈 큐브 스위치와 전기적으로 소통되고, 렌즈 큐브 접속부는 스탠드 터치 패널 측과 접속 가능하다. 렌즈 큐즈 스위치는 렌즈 큐브 고정 스위치와, 렌즈 큐브 가동 스위치를 포함한다. 렌즈 큐브 고정 스위치는 렌즈 큐브 하우징 바디 측에 배치되고 렌즈 큐브 접속부와 전기적으로 연결되고, 렌즈 큐브 가동 스위치는 렌즈 큐브 하우징 커버 측에 배치되고 렌즈 큐브 고정 스위치와 접촉 단속 가능하다. 즉, 서로 상대 가동 가능한 렌즈 큐브 하우징 바디 및 렌즈 큐브 하우징 커버의 서 로 마주하는 측에 렌즈 큐브 고정 스위치와, 렌즈 큐브 가동 스위치가 배치되어, 렌즈 큐브 하우징 바디 및 렌즈 큐브 하우징 커버가 상대 운동에 의한 소정의 셀렉션 정보의 신호 변화를 생성할 수 있 다. 본 발명의 일실시예에 따른 렌즈 큐브 홀더는 렌즈 큐브 홀더 베이스와, 렌즈 큐브 홀더 베이스 대응부 를 포함한다. 콘택트렌즈 전시 스탠드는 스탠드 하우징의 내부에 배치되는 렌즈 큐브 홀더 베이스 을 포함하는데, 렌즈 큐브는 렌즈 큐브 홀더 베이스와 대응하여 위치 고정되는 렌즈 큐브 홀더 베 이스 대응부를 포함한다. 이때, 도 35에 도면 부호 B로 확대 도시된 영역에서 도시되는 바와 같이, 렌즈 큐브 홀더 베이스는 자성체 및 마그네트 중의 하나를 포함하고, 렌즈 큐브 홀더 베이스 대응부는 자성체 및 마그네트 중의 다른 하나를 포함하고, 렌즈 큐브 하우징 바디에 배치될 수도 있으며, 이러한 구성은 앞서 기술한 바와 동일하다. 본 발명의 일실시예에 따른 렌즈 큐브 홀더는 자기력에 의한 흡착 구를 종심으로 기술하였으나, 경우에 따 라 마찰력을 이용한 미끄럼 방지 구조를 포함할 수도 있다. 즉, 본 실시예에서의 스탠드 렌즈 포지션 홀더 (211,211a)는 도면의 도면 부호 D로 확대 도시되는 바와 같이, 렌즈 큐브 하우징 바디의 저면에 배치되는 미끄럼 방지 패드를 포함할 수도 있다. 미끄럼 방지 패드로 구현되는 스탠드 렌즈 포지션 홀더(211a)의 재료는 마찰을 일으키는 범위에서 다양한 선택이 가능하다. 또한, 이 경우, 자기 흡착 구조와 미끄럼 방지 패드는 택 일적으로도 또는 선택적으로 또는 모두 구비될 수도 있는 등 설계 사양에 따라 다양한 변형이 가능하다. 앞선 실시예에서 렌즈 큐브 스위치는 접촉식 스위칭 구조를 취하였으나, 본 발명은 이에 국한되지 않고 비 접촉식 스위칭 구조를 형성할 수도 있다. 즉, 도면에 도시된 바와 같이 렌즈 큐브 스위치(460a)가 렌즈 큐브 하우징 커버 바디의 내측에 형성되는 터치 감지 방식의 비접촉 스위치로 구현될 수도 있다. 이 경우, 렌즈 큐브 스위치(460a)는 정전 용량 스위치로 구현될 수도 있고, 특성 상 투명 패널 방식으로 구현될 수도 있 는 등 설계 사양에 따라 다양한 변형이 가능하다. 이때, 렌즈 큐브는 렌즈 큐브 하우징을 탄성 지지 하는 렌즈 큐브 탄성부를 더 포함하고, 탄성적 동작은 실질적 스위칭 동작을 위한 물리적 위치 변동이 아 닌, 단순한 동작 상태의 촉각적 인지를 가능하게 하는 구성을 구현될 수도 있다. 앞선 실시예들에서는 스탠드 터치 패드을 통한 렌즈 큐브의 셀렉션 동작신호의 전달 구조를 기술하였으나, 본 발명은 이러한 구조 이외에 스탠드 터치 패드와 렌즈 큐브 접속부 간의 접속 구조를 배제한 구성을 취 할 수도 있다. 본 실시예에서의 콘택트렌즈 전시 스탠드는 스탠드 출력부와, 스탠드 입력부와, 스탠드 통신부(2 8)와, 스탠드 저장부와, 스탠드 제어부를 포함하는데, 스탠드 출력부는 서버에서 복수의 연산 을 통하여 이미지 학습을 통해 생성된 사용자의 가상 피팅 이미지를 화상 표시하고, 스탠드 입력부는 사용 자의 ID 정보가 입력되고, 스탠드 통신부는 서버 및 렌즈 큐브와 통신을 이루고, 스탠드 저장부는 사용자 ID 정보를 저장하고, 서버로부터 송출되는 콘택트렌즈 정보를 저장하고, 스탠드 제어부 는 스탠드 통신부를 통하여 렌즈 큐브 측에 큐브 제어 신호를 인가하고 렌즈 큐브 측으로부터 콘택 트렌즈 정보 중 선택된 셀렉션 콘택트렌즈 정보를 전달받고, 사용자 ID 정보 및 셀렉션 콘택트렌즈 정보를 서버 로 전송하여 서버에서 복수의 연산을 통하여 이미지 학습을 통하여 셀렉션 콘택트렌즈 정보에 대하여 생성된 사용자의 가상 피팅 이미지를 수신하도록 스탠드 통신부에 통신 제어 신호를 인가한다. 여기서, 렌즈 큐브는 렌즈 큐브 스위치와, 렌즈 큐브 제어부와, 렌즈 큐브 통신부를 포함한다. 렌즈 큐브 스위치는 사용자의 선택 동작에 의하여 변화된 신호를 발생하는데, 렌즈 큐브 스위치는 접 촉식, 비접속식 스위치로 구현될 수 있고, 렌즈 큐브 제어부는 렌즈 큐브 스위치의 신호를 입력받고, 렌즈 큐브 통신부는 렌즈 큐브 제어부의 통신 제어 신호에 따라 스탠드 통신부와 신호 전달을 이룬 다. 이러한 구성을 통하여, 사용자가 렌즈 큐브 스위치를 가동시키는 경우, 렌즈 큐브 제어부는 렌즈 큐브 통신부를 통하여 사용자가 선택한 렌즈 큐브에 대한 셀렉션 정보를 전달한다. 서버에서 사용자의 ID 정보에 연계되는 ID 연계 정보 및 사용자에 대하여 추천되는 레커멘드 콘택트렌즈 정 보를 포함하는 콘택트렌즈 정보가 콘택트렌즈 전시 스탠드로 전달하고, 콘택트렌즈 전시 스탠드는 레커 멘드 콘택트렌즈 정보에 대응하는 렌즈 큐브로 정보를 전달하고, 레커멘드 콘택트렌즈 정보에 대응하는 렌 즈 큐브의 상기 렌즈 큐브 제어부는 콘택트렌즈 전시 스탠드로부터 렌즈 큐브 통신부를 통하여 레커멘드 콘택트렌즈 정보를 전달받는다. 이때, 레커멘드 콘택트렌즈 정보에 대응하는 렌즈 큐브의 렌즈 큐브 제어부는 렌즈 큐브 광원부에 광출력 제어 신호를 인가하여, 오프라인 매장 방문자가 시각적으로 용이하게 인지 가능하게 할 수 있다. 이때, 레커멘드 콘택트렌즈 정보에 대응하는 렌즈 큐브의 렌즈 큐브 제어부에 의하여 인가되는 광출력 제어 신호에 의하여 광출력 기능을 실행하는 렌즈 큐브 광원부는 복 수 개의 색상을 출력 가능한 소자 구성을 취할 수도 있다."}
{"patent_id": "10-2020-0095429", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 콘택트렌즈 버츄얼 피팅 시스템의 개략적인 구성도이다. 도 2는 본 발명의 일실시예에 따른 콘택트렌즈 버츄얼 피팅 시스템의 서버의 구성도이다. 도 3은 본 발명의 일실시예에 따른 콘택트렌즈 버츄얼 피팅 시스템의 서버 제어부의 구성도이다. 도 4는 본 발명의 일실시예에 따른 콘택트렌즈 버츄얼 피팅 시스템의 사용자 단말기의 구성도이다. 도 5 내지 도 7은 본 발명의 일실시예에 따른 콘택트렌즈 버츄얼 피팅 시스템의 제어 모듈, AI 모듈 및 영상 처 리 모듈의 개략적인 구성도이다. 도 8은 본 발명의 일실시예에 따른 콘택트렌즈 버츄얼 피팅 시스템의 콘택트렌즈 버츄얼 피팅 방법의 흐름도이 다. 도 9 내지 도 12는 본 발명의 일실시예에 따른 콘택트렌즈 버츄얼 피팅 시스템의 사용자 단말기의 어플리케이션 의 화상 표시 사항의 개략적인 선도이다. 도 13 내지 도 17은 본 발명의 일실시예에 따른 콘택트렌즈 버츄얼 피팅 시스템의 콘택트렌즈 버츄얼 피팅 방법 의 안구 이미지 중 안구 영역의 추출 및 스크레라 영역과 퓨플 및 아이리스 영역의 대상 이미지 보정 과정을 나 타내는 선도이다. 도 18 내지 도 20은 본 발명의 일실시예에 따른 콘택트렌즈 버츄얼 피팅 시스템의 콘택트렌즈 버츄얼 피팅 방법 의 영상 보정 과정의 흐름도이다. 도 21은 본 발명의 일실시예에 따른 콘택트렌즈 버츄얼 피팅 시스템의 AI 뉴럴 네트워크 모듈의 개략적인 구성 도이다. 도 22 내지 도 25는 본 발명의 일실시예에 따른 콘택트렌즈 버츄얼 피팅 시스템의 콘택트렌즈 버츄얼 피팅 방법 의 이미지 러닝 단계의 흐름도이다. 도 26은 오프라인 매장에 배치된 콘택트렌즈 전시 스탠드의 예시적인 선도이다. 도 27은 오프라인 매장에 배치되는 콘택트렌즈 버츄얼 피팅 시스템의 콘택트렌즈 전시 스탠드의 다른 예시적인 선도이다. 도 28은 도 27의 콘택트렌즈 전시 스탠드의 분해 사시도이다. 도 29는 본 발명의 다른 일실시예에 따른 콘택트렌즈 버츄얼 피팅 시스템의 콘택트렌즈 전시 스탠드의 구성도이 다. 도 30 및 도 31은 본 발명의 다른 일실시예에 따른 콘택트렌즈 버츄얼 피팅 시스템의 따른 제어 흐름도이다. 도 32는 본 발명의 또 다른 일실시예에 따른 콘택트렌즈 버츄얼 피팅 시스템의 콘택트렌즈 전시 스탠드에 배치 되는 렌즈 큐브의 구성도이다. 도 33은 본 발명의 또 다른 일실시예에 따른 콘택트렌즈 버츄얼 피팅 시스템의 콘택트렌즈 전시 스탠드에 배치 되는 렌즈 큐브의 개략적인 단면도이다. 도 34 내지 도 36는 도 33의 세부 부분에 대한 부분 확대 단면도이다. 도 37은 본 발명의 또 다른 일실시예에 따른 콘택트렌즈 버츄얼 피팅 시스템의 콘택트렌즈 전시 스탠드에 배치 되는 렌즈 큐브의 다른 일예의 구성도이다. 도 38는 도 37의 세부 부분에 대한 부분 확대 단면도이다. 도 39는 본 발명의 또 다른 일실시예에 따른 콘택트렌즈 버츄얼 피팅 시스템의 콘택트렌즈 전시 스탠드에 배치 되는 렌즈 큐브의 구성도이다."}
