{"patent_id": "10-2023-0062315", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0013037", "출원번호": "10-2023-0062315", "발명의 명칭": "커스터디 기반의 토큰증권 유통 및 매매 관리시스템 및 그 제어방법", "출원인": "주식회사 인피닛블록", "발명자": "정구태"}}
{"patent_id": "10-2023-0062315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "디지털 자산의 발행 및 유통을 포함하는 이벤트 정보를 공시하기 위한 적어도 하나의 수취자 단말;상기 이벤트 정보에 기초하여 상기 디지털 자산의 매입 또는 매도를 요청하기 위한 적어도 하나의 사용자 단말;상기 요청에 대응하여 상기 디지털 자산의 매입 또는 매도의 승인을 지시하기 위한 적어도 하나의 위탁자 단말;및미리 제공된 디지털 자산의 발행 및 유통 계획서에 기초하여 상기 지시를 검증하고 상기 디지털 자산을 매도하거나 매입하기 위한 수탁자 단말을 포함하는,커스터디 기반의 토큰증권 유통 및 매매 관리시스템."}
{"patent_id": "10-2023-0062315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 적어도 하나의 수취자 단말은 상기 적어도 하나의 사용자 단말로부터 제공된 상기 요청에 포함된 상기 디지털 자산의 종류, 수량과 매입시기 또는 매도시기에 따라 상기 디지털 자산의 매입 또는 매도를 요청하는,커스터디 기반의 토큰증권 유통 및 매매 관리시스템."}
{"patent_id": "10-2023-0062315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서, 상기 적어도 하나의 위탁자 단말은 상기 요청에 대응하여 상기 수탁자 단말에 상기 디지털 자산의 매입 또는 매도의 승인을 지시하는,커스터디 기반의 토큰증권 유통 및 매매 관리시스템."}
{"patent_id": "10-2023-0062315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서, 상기 디지털 자산의 발행 및 유통 계획서는 상기 적어도 하나의 위탁자 단말로부터 미리 생성되어 제공되며 상기 디지털 자산에 대한 위탁자의 발행 권한 및 유통 권한과 상기 디지털 자산의 종류 및 수량과 상기 디지털 자산의 유통량과 유통시기가 기재된 관리계획이 포함되는,커스터디 기반의 토큰증권 유통 및 매매 관리시스템."}
{"patent_id": "10-2023-0062315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서,상기 수탁자 단말은 상기 적어도 하나의 수취자 단말로부터 상기 공시된 이벤트 정보를 실시간으로 제공받고 상기 발행 및 유통 계획서에 기반하여 상기 공시된 이벤트 정보로부터 상기 지시를 검증하는,커스터디 기반의 토큰증권 유통 및 매매 관리시스템."}
{"patent_id": "10-2023-0062315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5 항에 있어서,상기 수탁자 단말은 미리 저장된 검증 로직을 이용하여 상기 발행 및 유통 계획서로부터 상기 발행 권한과 유통권한에 대한 검증을 수행하는,공개특허 10-2024-0013037-3-커스터디 기반의 토큰증권 유통 및 매매 관리시스템."}
{"patent_id": "10-2023-0062315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6 항에 있어서, 상기 수탁자 단말은, 상기 발행 권한과 유통 권한에 대한 검증이 완료되고 상기 요청에 포함된 상기 디지털 자산의 종류와 수량, 매입시기 또는 매도시기가 상기 공시된 이벤트 정보와 상기 발행 및 유통 계획서에 포함된 상기 디지털 자산에 대한 정보와 모두 일치하는 경우 상기 매입시기 또는 매도시기에 상기 종류와 수량에 해당하는 상기 디지털 자산을 매입하거나 매도하는,커스터디 기반의 토큰증권 유통 및 매매 관리시스템."}
{"patent_id": "10-2023-0062315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6 항에 있어서,상기 수탁자 단말은,상기 발행 권한과 유통 권한에 대한 검증이 완료되고 상기 요청에 포함된 상기 디지털 자산의 종류와 수량, 매입시기 또는 매도시기가 상기 공시된 이벤트 정보와 상기 발행 및 유통 계획서에 중 적어도 어느 하나에 포함된상기 디지털 자산에 대한 정보와 일치하지 않는 경우 상기 디지털 자산을 매입하지 않거나 매도하지 않는,커스터디 기반의 토큰증권 유통 및 매매 관리시스템."}
{"patent_id": "10-2023-0062315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6 항에 있어서,상기 수탁자 단말은 상기 발행 권한과 유통 권한에 대한 검증이 완료되지 않은 경우 상기 디지털 자산을 매입하지 않거나 매도하지 않는,커스터디 기반의 토큰증권 유통 및 매매 관리시스템."}
{"patent_id": "10-2023-0062315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "적어도 하나의 수취자 단말에 의해 디지털 자산의 발행 및 유통을 포함하는 이벤트 정보가 공시되는 단계;적어도 하나의 사용자 단말에 의해 상기 이벤트 정보에 기초하여 상기 디지털 자산의 매입 또는 매도를 요청하는 단계; 적어도 하나의 위탁자 단말에 의해 상기 요청에 대응하여 상기 디지털 자산의 매입 또는 매도의 승인을 지시하는 단계; 및수탁자 단말에 의해 미리 제공된 디지털 자산의 발행 및 유통 계획서에 기초하여 상기 지시를 검증하고 상기 디지털 자산을 매도하거나 매입하는 단계를 포함하는,커스터디 기반의 토큰증권 유통 및 매매 관리시스템의 제어방법."}
{"patent_id": "10-2023-0062315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "본 발명의 한 실시예에 따른 커스터디 기반의 토큰증권 유통 및 매매 관리시스템은, 디지털 자산의 발행 및 유통을 포함하는 이벤트 정보를 공시하기 위한 적어도 하나의 수취자 단말, 이벤트 정보에 기초하여 디지털 자산의 매입 또는 매도를 요청하기 위한 적어도 하나의 사용자 단말, 요청에 대응하여 디지털 자산의 매입 또는 매도의 승인을 지시하기 위한 적어도 하나의 위탁자 단말 및 미리 제공된 디지털 자산의 발행 및 유통 계획서에기초하여 지시를 검증하고 디지털 자산을 매도하거나 매입하기 위한 수탁자 단말을 포함할 수 있다."}
{"patent_id": "10-2023-0062315", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 한 실시예에 따른 커스터디 기반의 토큰증권 발행 관리시스템은, 디지털 자산의 발행 및 유통 계획서 를 제공하고 디지털 자산의 발행, 보관, 및 관리를 위탁하는 적어도 하나의 위탁자 단말 및 발행 및 유통 계획서 에 기반하여 위탁자의 디지털 자산에 대한 발행 및 유통 권한을 검증하고 발행 및 유통 계획서에 포함된 관리계 획에 따라 디지털 자산의 발행, 보관, 및 관리를 수행하는 수탁자 단말을 포함한다."}
{"patent_id": "10-2023-0062315", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 커스터디 기반의 토큰증권 유통 및 매매 관리시스템 및 그 제어방법에 관한 것이다."}
{"patent_id": "10-2023-0062315", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 블록체인(blockchain) 기술을 이용함으로써, 중개자 없이 참여자간의 신뢰가 가능하고 위변조가 불가능한 분산 원장(distributed ledger)의 구현이 가능하게 되면서, 암호화폐와 같은 디지털 자산들이 등장하였다. 이러 한 디지털 자산을 대상으로 한 새로운 자산관리 서비스인 디지털 자산 커스터디 서비스가 등장하게 되었다. 디 지털 자산 커스터디 서비스는 블록체인 기반의 디지털 자산을 대상으로 하는 자산 보관 및 관리 서비스로서, 은 행의 수탁업과 유사한 디지털 자산 시장의 인프라 사업을 의미한다. 디지털 자산 시장의 안정화 및 건전한 발전을 위해서는 다양한 제도적, 기술적 보완장치가 요구되며, 이 과정에 서 커스터디 서비스가 산업 인프라 및 게이트웨이 역할을 할 것으로 예상되고 있다. 특히, 커스터디 서비스의 활성화를 통해, 디지털 자산의 제도권 편입이 용이해지고, 디지털 자산 시장에 대한 신뢰도가 보완 및 강화될 수 있으며, 일반 투자자의 기술적 진입장벽이 해소되고, 디지털 자산 거래에 대한 내부통제 강화 및 투명한 공 시 기능이 발휘될 것으로 기대되고 있다."}
{"patent_id": "10-2023-0062315", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 기술적 과제는, 기업과 증권사 또는 거래소 사이에서 커스터디(Custody) 회사에 의 해 코인 등을 포함하는 디지털 자산(또는, 토큰증권)의 유통 및 매매와 관련된 관리를 수행하도록 하여 디지털 자산(또는, 토큰증권)의 거래 및 관리 투명성을 달성하기 위함이다. 본원 발명의 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급되지 않은 또 다른 기술"}
{"patent_id": "10-2023-0062315", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "적 과제들은 아래의 기재로부터 본원 발명의 기술분야에서의 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0062315", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 한 실시예에 따른 커스터디 기반의 토큰증권 유통 및 매매 관리시스템은, 디지털 자산의 발행 및 유 통을 포함하는 이벤트 정보를 공시하기 위한 적어도 하나의 수취자 단말, 이벤트 정보에 기초하여 디지털 자산 의 매입 또는 매도를 요청하기 위한 적어도 하나의 사용자 단말, 요청에 대응하여 디지털 자산의 매입 또는 매 도의 승인을 지시하기 위한 적어도 하나의 위탁자 단말 및 미리 제공된 디지털 자산의 발행 및 유통 계획서에 기초하여 지시를 검증하고 디지털 자산을 매도하거나 매입하기 위한 수탁자 단말을 포함할 수 있다. 또한 본 발명의 한 실시예에 따른 적어도 하나의 수취자 단말은 적어도 하나의 사용자 단말로부터 제공된 요청 에 포함된 디지털 자산의 종류, 수량과 매입시기 또는 매도시기에 따라 디지털 자산의 매입 또는 매도를 요청할 수 있다. 또한 본 발명의 한 실시예에 따른 적어도 하나의 위탁자 단말은 요청에 대응하여 수탁자 단말에 디지털 자산의 매입 또는 매도의 승인을 지시할 수 있다. 또한 본 발명의 한 실시예에 따른 디지털 자산의 발행 및 유통 계획서는 적어도 하나의 위탁자 단말로부터 미리 생성되어 제공되며 디지털 자산에 대한 위탁자의 발행 권한 및 유통 권한과 디지털 자산의 종류 및 수량과 디지 털 자산의 유통량과 유통시기가 기재된 관리계획이 포함될 수 있다. 또한 본 발명의 한 실시예에 따른 수탁자 단말은 적어도 하나의 수취자 단말로부터 공시된 이벤트 정보를 실시 간으로 제공받고 발행 및 유통 계획서에 기반하여 공시된 이벤트 정보로부터 지시를 검증할 수 있다. 또한 본 발명의 한 실시예에 따른 수탁자 단말은 미리 저장된 검증 로직을 이용하여 발행 및 유통 계획서로부터 발행 권한과 유통 권한에 대한 검증을 수행할 수 있다. 또한 본 발명의 한 실시예에 따른 수탁자 단말은, 발행 권한과 유통 권한에 대한 검증이 완료되고 요청에 포함 된 디지털 자산의 종류와 수량, 매입시기 또는 매도시기가 공시된 이벤트 정보와 발행 및 유통 계획서에 포함된 디지털 자산에 대한 정보와 모두 일치하는 경우 매입시기 또는 매도시기에 종류와 수량에 해당하는 디지털 자산 을 매입하거나 매도할 수 있다. 또한 본 발명의 한 실시예에 따른 수탁자 단말은, 발행 권한과 유통 권한에 대한 검증이 완료되고 요청에 포함 된 디지털 자산의 종류와 수량, 매입시기 또는 매도시기가 공시된 이벤트 정보와 발행 및 유통 계획서에 중 적 어도 어느 하나에 포함된 디지털 자산에 대한 정보와 일치하지 않는 경우 디지털 자산을 매입하지 않거나 매도 하지 않을 수 있다. 또한 본 발명의 한 실시예에 따른 수탁자 단말은 발행 권한과 유통 권한에 대한 검증이 완료되지 않은 경우 디 지털 자산을 매입하지 않거나 매도하지 않을 수 있다. 또한 본 발명의 한 실시예에 따른 커스터디 기반의 토큰증권 유통 및 매매 관리시스템의 제어방법은, 적어도 하 나의 수취자 단말에 의해 디지털 자산의 발행 및 유통을 포함하는 이벤트 정보가 공시되는 단계, 적어도 하나의 사용자 단말에 의해 이벤트 정보에 기초하여 디지털 자산의 매입 또는 매도를 요청하는 단계, 적어도 하나의 위 탁자 단말에 의해 요청에 대응하여 디지털 자산의 매입 또는 매도의 승인을 지시하는 단계 및 수탁자 단말에 의 해 미리 제공된 디지털 자산의 발행 및 유통 계획서에 기초하여 지시를 검증하고 디지털 자산을 매도하거나 매 입하는 단계를 포함할 수 있다. 또한, 본 발명의 한 실시예에 따른 커스터디 기반의 토큰증권 유통 및 매매 관리시스템의 제어방법을 실행시키 기 위한 프로그램이 기록된 컴퓨터로 판독가능한 기록매체를 포함할 수 있다.."}
{"patent_id": "10-2023-0062315", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면 커스터디 기반의 토큰증권 유통 및 매매 관리시스템 및 그 제어방법은 기업과 증 권사 또는 거래소 사이에서 커스터디(Custody) 회사에 의해 코인 등을 포함하는 디지털 자산(또는, 토큰증권)의 유통 및 매매와 관련된 관리를 수행하도록 하여 디지털 자산의 거래 및 관리 투명성을 달성할 수 있다."}
{"patent_id": "10-2023-0062315", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본원 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실 시예들을 참조하면 명확해질 것이다. 그러나 본원 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본원 발명의 개시가 완전하도록 하고, 본원 발"}
{"patent_id": "10-2023-0062315", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "명이 속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본원 발명은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지 칭한다. 본 명세서에서, 어떤 부분이 어떤 구성요소를 '포함'한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 본 명세서에서 사용되는 '~부'는 적어도 하나의 기능이나 동작을 처리하는 단위로서, 예를 들어 소프트웨어, FPGA 또는 하드웨어 구성요 소를 의미할 수 있다. '~부'에서 제공하는 기능은 복수의 구성요소에 의해 분리되어 수행되거나, 다른 추가적인 구성요소와 통합될 수도 있다. 본 명세서의 '~부'는 반드시 소프트웨어 또는 하드웨어에 한정되지 않으며, 어드 레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고, 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 이하에서는 도면을 참조하여 본원 발명의 실시예에 대해서 구체적으로 설명하기로 한다. 본 명세서에 기재된 실시예는 본원 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 본원 발명의 사상 을 명확히 설명하기 위한 것이므로, 본원 발명이 본 명세서에 기재된 실시예에 한정되는 것은 아니며, 본원 발 명의 범위는 본원 발명의 사상을 벗어나지 아니하는 수정예 또는 변형예를 포함하는 것으로 해석되어야 한다. 본 명세서에서 사용되는 용어는 본원 발명에서의 기능을 고려하여 가능한 현재 널리 사용되고 있는 일반적인 용 어를 선택하였으나 이는 본원 발명이 속하는 기술 분야에서 통상의 지식을 가진 자의 의도, 판례 또는 새로운 기술의 출현 등에 따라 달라질 수 있다. 다만, 이와 달리 특정한 용어를 임의의 의미로 정의하여 사용하는 경우 에는 그 용어의 의미에 관하여 별도로 기재할 것이다. 따라서 본 명세서에서 사용되는 용어는 단순한 용어의 명 칭이 아닌 그 용어가 가진 실질적인 의미와 본 명세서의 전반에 걸친 내용을 토대로 해석되어야 한다. 본 명세서에 첨부된 도면은 본원 발명을 용이하게 설명하기 위한 것으로 도면에 도시된 형상은 본원 발명의 이 해를 돕기 위하여 필요에 따라 과장되어 표시된 것일 수 있으므로 본원 발명이 도면에 의해 한정되는 것은 아니 다. 본 명세서에서 본원 발명에 관련된 공지의 구성 또는 기능에 대한 구체적인 설명이 본원 발명의 요지를 흐릴 수 있다고 판단되는 경우에 이에 관한 자세한 설명은 필요에 따라 생략하기로 한다.본원 발명의 실시예에 따른 스마트 컨트랙트를 활용한 토큰 출금 거래 수수료 대납 시스템 및 방법은 위탁자 단 말의 토큰 출금 거래 요청 시 커스터디 시스템이 대납 계좌를 통해 토큰 출금 거래에 따른 거래 수수료를 출금 하여 스마트 컨트랙트에 대납하는 서비스를 제공할 수 있다. 본원 발명의 실시예에 따른 스마트 컨트랙트를 활용한 토큰 출금 거래 수수료 대납 시스템 및 방법은 수탁자 단 말에 해당하는 커스터디 시스템과 관련된 스마트 컨트랙트가 위탁자 단말로부터 디지털 자산의 출금 허용 권한 을 위임 받아 디지털 자산 출금을 승인 받고; 커스터디 시스템이 위탁자 단말로부터 디지털 자산의 출금을 요청 받는 경우, 커스터디 시스템의 검증 로직에 의해 디지털 자산의 출금 관련 데이터를 검증하고; 디지털 자산의 출금 관련 데이터가 검증 완료되면, 커스터디 시스템이 커스터디 시스템의 대납 계좌를 통해 거래 수수료를 출 금하여 위탁자 단말 대신 스마트 컨트랙트에 거래 수수료를 대납하고; 스마트 컨트랙트가 대납 계좌를 통해 거 래 수수료를 대납받고, 위탁자 단말이 출금 요청한 디지털 자산과 관련된 토큰 전달을 승인하여 디지털 자산을 수취자 계좌로 전송할 수 있다. 도 1은 본원 발명의 실시예에 따른 스마트 컨트랙트를 활용한 토큰 출금 거래 수수료 대납 시스템의 구성도이다. 도 1을 참조하면, 본원 발명의 실시예에 따른 디지털 자산 커스터디 시스템은 하나 이상의 위 탁자 단말, 하나 이상의 수탁자 단말, 및 수탁자 DB를 포함할 수 있다. 위탁자 단말은 수탁자 단말에 디지털 자산의 보관 및 관리를 위탁하는 위탁자와 관련된 단말일 수 있 다. 위탁자 단말은 예를 들어, 디지털 자산을 보유하고 있는 기업이나 기관, 조직 등의 단체(위탁자)에 소 속된 단말일 수 있다. 위탁자 단말은 예를 들어 데스크탑 PC, 랩탑, 노트북, 스마트폰, 스마트패드 등의 단말기로 제공될 수 있 으나, 이에 한정되지는 않는다. 위탁자 단말은 하나 이상의 관리자 단말, 하나 이상의 신청자 단말 , 및 하나 이상의 승인자 단말을 포함할 수 있다. 관리자 단말, 신청자 단말, 승인자 단말, 수탁자 단말은 유/무선 통신 네트워크를 통해 연 결되어 서로 통신할 수 있다. 관리자 단말은 기업 등의 위탁자가 보유한 디지털 자산의 보관 및 관리를 수 탁자에 위탁하기 위한 오너 계정, 신청자 계정 및 승인자 계정을 수탁자 단말에 요청하는 단말일 수 있다. 신청자 단말은 관리자 단말의 디지털 자산 보관 및 관리 요청에 따라 수탁자 단말에 의해 발급 된 신청자 계정에 접속하여 디지털 자산의 보관, 이전, 출금 등과 같은 디지털 자산 관리를 신청하는 신청자가 사용하는 단말일 수 있다. 본원 발명의 실시예에서, 위탁자가 수탁자에게 위탁하는 대상인 디지털 자산은 비트코인, 이더리움 및 클레이튼 을 포함하는 가상 화폐들 중에서 선택되는 하나 또는 복수개의 가상 화폐를 포함할 수 있다. 승인자 단말은 수탁자 단말에 의해 발급된 승인자 계정에 접속하여 신청자 단말이 신청한 디지 털 자산 관리 신청에 대해 승인을 하는 승인자가 사용하는 단말일 수 있다. 수탁자 단말은 위탁자 단말로부터 디지털 자산의 보관 및 관리를 수탁하여 위탁자 단말로부터 요청 받은 디지털 자산을 보관 및 관리하는 커스터디 서비스를 제공할 수 있다. 수탁자 데이터베이스(DB)는 위탁자 단말로부터 위탁받은 디지털 자산 정보, 오너 계정 정보, 신청자 계정 정보, 승인자 계정 정보, 위탁받은 디지털 자산을 보관하는 디지털 자산 지갑 정보(난수번호에 해당하는 지갑 주소) 등을 저장할 수 있다. 도 2는 본원 발명의 실시예에 따른 스마트 컨트랙트를 활용한 토큰 출금 거래 수수료 대납 방법의 순서도이다. 도 3은 도 2의 단계 S100을 설명하기 위한 개념도이다. 도 2 및 도 3을 참조하면, 먼저 수탁자 단말에 해당하는 커스터디 시스템과 관련된 스마트 컨트랙트가 하나 이상의 위탁자 단말로부터 각각 디지털 자산의 출 금 허용 권한을 위임 받아 디지털 자산(예를 들어, 비트코인, 이더리움, 클레이튼 등의 가상화폐)과 관련된 토 크(ERC-20, ERC-721, ERC-1155 등)의 출금을 승인 받는 단계가 수행될 수 있다(S100). 이때에는 위탁자 단말 에 의해 위탁자가 직접 스마트 컨트랙트에 거래 수수료를 지불할 수 있다.도 4는 도 2의 단계 S200을 설명하기 위한 개념도이다. 도 2 및 도 4를 참조하면, 커스터디 시스템은 위탁 자 단말로부터 디지털 자산의 출금을 요청 받는 경우, 커스터디 시스템의 검증 로직에 의해 디지 털 자산의 출금 관련 데이터를 검증할 수 있다(S200). 도 5는 도 2의 단계 S300을 설명하기 위한 개념도이다. 도 2 및 도 5를 참조하면, 디지털 자산의 출금 관련 데 이터가 검증 완료되면, 커스터디 시스템은 커스터디 시스템의 대납 계좌를 통해 디지털 자산의 거 래와 관련된 수수료인 거래 수수료를 출금하여 위탁자 단말 대신 스마트 컨트랙트에 거래 수수료를 대납할 수 있다(S300). 도 6은 도 2의 단계 S400을 설명하기 위한 개념도이다. 도 2 및 도 6을 참조하면, 스마트 컨트랙트는 커스 터디 시스템으로부터 대납 계좌를 통해 거래 수수료를 대납받고, 위탁자 단말이 출금 요청한 디지 털 자산과 관련된 토큰 전달을 승인하여 해당 디지털 자산을 수취자 단말과 관련된 수취자 계좌로 전송할 수 있다(S400). 본원 발명의 실시예에 의하면, 위탁자 단말에 해당하는 고객 입장에서는 가상 자산의 종류와 거래 상황에 따라 변동되는 거래 수수료의 발생을 고려할 필요 없이 보다 편리하게 디지털 자산을 수취인에게 전달할 수 있다. 또 한, 커스터디 입장에서는 거래 수수료 대납을 통해 고객을 유인할 수 있으며, 고객으로부터 일정 수수료를 받거 나 고객 증대에 따른 광고 등의 부가적인 수입을 얻을 수도 있다. 도 7은 본원 발명의 실시예에 따른 디지털 자산 커스터디 시스템을 구성하는 수탁자 단말의 구성도이다. 도 8은 본원 발명의 실시예에 따른 디지털 자산 커스터디 시스템의 개념도이다. 도 1, 도 7 및 도 8을 참조하면, 수탁자 단말은 오너 계정 생성부, 디지털 자산 지갑 등록부, 신청자 계정 생성부, 승인자 계정 생성부, 승인 요청부, 계정 검증부, 디지털 자산 확인부 , 디지털 자산 관리부 및 제어부를 포함할 수 있다. 오너 계정 생성부는 위탁자 단말의 오너 계정 생성 요청에 따라 오너 계정을 생성하여 위탁자 단말 에 공유할 수 있다. 오너 계정은 위탁자에게 부여되는 계정으로, 오너 계정 생성부에 의해 생성된 오 너 계정은 수탁자 DB에 기록될 수 있다. 디지털 자산 지갑 등록부는 위탁자 단말로부터 요청 받은 디지털 자산을 보관하기 위한 디지털 자산 지갑(멀티시그 지갑)을 등록할 수 있다. 디지털 자산 지갑 등록부는 복수개의 가상 화폐 별로 하나 이상의 디지털 자산 지갑(멀티시그 지갑)을 등록할 수 있다. 디지털 자산 지갑 등록부는 위탁자 단말에서 등록 요청한 제1 디지털 자산 지갑(제1 멀티시그 지갑) 과, 디지털 자산 이력을 통해 검증된 제2 디지털 자산 지갑(제2 멀티시그 지갑)을 포함하는 복수개의 디지털 자 산 지갑(멀티시그 지갑)을 화이트리스트 디지털 자산 지갑으로 등록할 수 있다. 화이트리스트 디지털 자산 지갑으로 등록된 복수개의 디지털 자산 지갑(멀티시그 지갑) 중에서 신청자 계정에 의해 선택 가능한 디지털 자산 지갑(멀티시그 지갑)은 신청자 계정 별로 개별적으로 설정될 수 있다. 신청자 계정 생성부는 오너 계정과 관련된 위탁자 단말의 신청자 계정 생성 요청에 따라 신청자 계정 을 생성하여 위탁자 단말에 공유할 수 있다. 실시예에서, 신청자 계정 생성부는 복수개의 가상 화폐 및 디지털 자산 지갑 별로 각각 신청자 계정을 생 성할 수 있다. 신청자 계정 생성부에 의해 생성된 신청자 계정은 수탁자 DB에 기록될 수 있다. 승인자 계정 생성부는 오너 계정과 관련된 위탁자 단말의 승인자 계정 생성 요청에 따라 다수의 승인 자 계정을 생성하여 위탁자 단말에 공유할 수 있다. 승인자 계정 생성부는 복수개의 가상 화폐 및 디지털 자산 지갑 별로 각각 다수의 승인자 계정을 생성할 수 있다. 승인자 계정 생성부에 의해 생성된 다수의 승인자 계정은 수탁자 DB에 기록될 수 있다. 승인 요청부는 신청자 계정을 통해 디지털 자산 관리 신청을 접수하여 다수의 승인자 계정으로 디지털 자 산 관리 신청에 대한 승인을 요청할 수 있다. 계정 검증부는 디지털 자산 관리 신청에 대한 다수의 승인자 계정에 의한 승인 여부에 따라 디지털 자산 관리 신청에 대한 검증을 수행할 수 있다.디지털 자산 확인부는 디지털 자산 관리 신청과 관련된 디지털 자산 지갑(멀티시그 지갑)에 보관 중인 디 지털 자산을 확인할 수 있다. 디지털 자산 관리부는 계정 검증부 및 디지털 자산 확인부의 검증 및 확인 완료 시, 디지털 자 산 관리 신청에 따른 디지털 자산 관리를 수행할 수 있다. 제어부는 수탁자 단말의 각 구성요소를 제어하여 위탁자 단말의 디지털 자산을 관리하는 서비스를 제 공할 수 있다. 도 7 및 도 8에 도시된 실시예에 의하면, 디지털 자산의 관리를 위한 계정을 신청자 계정과 승인자 계정으로 분 산시켜 디지털 자산의 탈취, 해킹 위험을 줄일 수 있다. 오너 계정 별로 승인자 단말은 하나의 승인자 계정이 부여될 수도 있으나, 오너 계정에 대해 복수개의 승 인자 계정이 부여될 수도 있다. 또한, 승인자 계정은 신청자 계정에 따라 상이하게 설정될 수도 있다. 오너 계정에 대해 복수개의 승인자 계정이 부여되는 경우, 위탁자 단말의 신청자 단말이 신청자 계정 에 접속하여 디지털 자산의 보관, 관리 등을 신청하게 되면, 수탁자 단말은 복수개의 승인자 계정 중 어느 승인자 계정으로 디지털 자산의 보관, 관리 등에 대해 승인을 요청할 것인지를 결정할 수 있다. 일 실시예로, 수탁자 단말은 다수의 승인자 계정 모두를 선택하거나, 혹은 다수의 승인자 계정 중 랜덤으 로 둘 이상의 승인자 계정을 선택하여, 선택된 복수의 승인자 계정으로 디지털 자산의 보관, 관리에 대한 승인 을 요청할 수 있다. 수탁자 단말은 승인 요청부에 의해 출금 신청자로부터 신청자 계정을 통해 디지털 자산 관리 신청(출 금 신청)을 접수하여 다수의 승인자 계정으로 디지털 자산 관리 신청(출금 신청)에 대한 승인을 요청할 수 있다 (S1). 수탁자 단말은 계정 검증부에 의해 디지털 자산 관리 신청에 대한 다수의 승인자 계정(출금 승인권자 계정)에 의한 승인 여부에 따라 디지털 자산 관리 신청에 대한 검증을 수행할 수 있다(S2). 수탁자 DB의 분산 저장부는 디지털 자산 관리에 사용되는 멀티시그 지갑의 서명을 위해 샤미르 키 분 산(Shamir's Key Distribution) 방식으로 다수의 분산키를 분산하여 저장할 수 있다. 다수의 분산키는 수탁자 DB의데이터베이스나 스토리지 등에 각각 분산되어 저장될 수 있다. 수탁자 단말의 계정 검증부는 다수의 승인자 계정 중 설정된 개수 이상의 승인자 계정으로부터 승인 완료시에 디지털 자산 관리 신청을 승인할 수 있다(S2). 실시예에서, 계정 검증부는 다수의 승인자 계정 중 과반 이상의 승인자 계정으로부터 승인 완료시에 디지털 자산 관리 신청을 승인할 수 있다. 수탁자 단말의 디지털 자산 관리부는 다수의 분산키 중 적어도 둘 이상의 분산키를 조합하여 마스터키를 생성할 수 있다(S3). 실시예에서, 디지털 자산 관리부는 다수의 분산키 중 과반 이상 의 분산키를 조합하여 마스터키를 생성할 수 있다. 다수의 분산키는 다수의 승인자 계정과 대응되게 설정될 수도 있지만, 승인자 계정과 무관하게 분산 저장될 수도 있다. 다수의 분산키는 다수의 승인자 계정과 대응되게 설정되는 경우 다수의 승인자 계정 중 디지털 자산 관리 신청에 대해 승인한 승인자 계정들에 대응되는 분산키들에 의해 마스터키가 생성될 수 있다. 다수의 분산키는 승인자 계정과 무관하게 설정되는 경우에는 다수의 분산키 중 둘 이상의 분산키를 기 설정된 규칙 또는 랜덤으로 선택하여 조합하여 마스터키를 생성하거나, 전체 분산키를 모두 조합하여 마스터키를 생성할 수도 있다. 마지막으로, 수탁자 단말은 계정 검증부의 검증 완료 시, 디지털 자산 관리부에 의해 디지털 자 산 관리 신청에 따른 디지털 자산 관리(출금 처리 등)를 수행할 수 있다. 수탁자 단말의 디지털 자산 관리부는 복수개의 분산키를 조합하여 생성되는 마스터키로 멀티 시그 지갑에 서명하여 디지털 자산 관리(출금 처리)를 수행할 수 있다(S4, S5). 수탁자 단말은 예를 들어, 오너 계정에 대해 3개 혹은 그 이상의 승인자 계정이 설정될 경우, 3개 이상의 승인자 계정 중에서 둘 이상의 승인자 계정을 임의로 선택하여 해당 선택된 승인자 계정으로 디지털 자산의 보관, 관리에 대한 승인을 요청할 수 있다. 신청자는 3명 이상의 승인자 중 어느 승인자들에게 디지털 자산에 대한 보관, 관리 승인이 요청될지 알 수 없다. 따라서 신청자가 3명 이상의 승인자 모두와 부정하게 모의를 하기는 어렵기 때문에, 사전 모의에 의한 디 지털 자산의 편취를 방지할 수 있다. 또한, 수탁자 단말은 신청자 계정을 통해 접수한 디지털 자산의 보관, 관리에 대한 신청 정보를 기초로 복 수의 승인자 계정 중 승인 요청을 할 승인자 계정의 개수를 결정할 수도 있다. 예를 들어, 수탁자 단말은 이전 또는 출금 요청 받은 디지털 자산의 규모가 기 설정된 기준 자산 크기를 초과할 경우, 둘 혹은 셋 이상의 승인자 계정으로 승인을 요청하여 모든 승인자 계정을 통해 승인이 될 경우에 만 해당 디지털 자산에 대한 이전 또는 출금 등의 처리를 수행할 수 있다. 이와 달리, 수탁자 단말은 신청자 단말로부터 이전 또는 출금 요청 받은 디지털 자산의 규모가 기 설 정된 기준 자산 크기 이하인 경우, 하나의 승인자 계정으로 승인을 요청하여 해당 하나의 승인자 계정을 통해 승인이 되면 디지털 자산에 대한 이전 또는 출금 등의 처리를 수행할 수 있다. 도 9는 본원 발명의 실시예에 따른 디지털 자산 관리 방법의 신청자 계정 및 승인자 계정을 생성하는 과정을 나 타낸 순서도이다. 도 1, 도 7, 도 8 및 도 9를 참조하면, 위탁자 단말로부터 오너 계정 생성이 요청되면 (S11), 수탁자 단말의 오너 계정 생성부는 위탁자에게 발급할 오너 계정을 생성할 수 있다(S12). 오 너 계정 생성부에 의해 생성된 오너 계정 정보는 위탁자 단말에 공유되고, 수탁자 DB에 기록될 수 있다(S13, S14). 오너 계정 생성 시에 디지털 자산 지갑 등록부는 위탁자 단말로부터 요청 받은 디지털 자산을 보관하 기 위한 디지털 자산 지갑(멀티시그 지갑)을 등록할 수 있다. 디지털 자산 지갑 등록부는 복수개의 가상 화폐 별로 하나 이상의 디지털 자산 지갑(멀티시그 지갑)을 등록할 수 있다. 디지털 자산 지갑 등록부는 위탁자 단말에서 등록 요청한 제1 디지털 자산 지갑(제1 멀티시그 지갑)과, 디 지털 자산 이력을 통해 검증된 제2 디지털 자산 지갑(제2 멀티시그 지갑)을 포함하는 복수개의 디지털 자산 지 갑(멀티시그 지갑)을 화이트리스트 디지털 자산 지갑으로 등록할 수 있다. 화이트리스트 디지털 자산 지갑으로 등록된 복수개의 디지털 자산 지갑(멀티시그 지갑) 중에서 신청자 계정에 의해 선택 가능한 디지털 자산 지갑(멀티시그 지갑)은 신청자 계정 별로 설정될 수 있다. 위탁자 단말로부터 신청자 계정과 승인자 계정의 생성이 요청되면(S15), 수탁자 단말의 신청자 계정 생성부 및 승인자 계정 생성부는 오너 계정과 관련된 위탁자 단말의 신청자 계정 및 승인자 계 정 생성 요청에 따라 신청자 계정 및 승인자 계정을 생성할 수 있다(S16) 이때, 신청자 계정 생성부와 승인자 계정 생성부는 복수개의 가상 화폐 및 디지털 자산 지갑 별로 각 각 신청자 계정 및 승인자 계정을 생성할 수 있다. 신청자 계정 생성부 및 승인자 계정 생성부에 의 해 생성된 신청자 계정 및 승인자 계정은 위탁자 단말에 공유되고, 수탁자 DB에 기록될 수 있다(S17, S18). 도 10은 본원 발명의 실시예에 따른 디지털 자산 관리 방법의 디지털 자산 관리 신청 및 승인 과정을 나타낸 순 서도이다. 도 1, 도 7 및 도 10을 참조하면, 승인 요청부는 신청자 계정을 통해 디지털 자산 관리 신청을 접수하여 승인자 계정으로 디지털 자산 관리 신청에 대한 승인을 요청할 수 있다(S21). 디지털 자산 관리 신청 시 신청자는 신청자 계정에 접속하여 둘 이상의 인증을 통해 신청 권한을 승인 받을 수 있다. 이와 같은 멀티팩터 인증을 통해 보안성을 높일 수 있다. 멀티팩터 인증은 예를 들어 패스워드 인증, 신 분증 인증, 안면 인식, 생체 인식(지문 인식) 등의 다양한 인증 방식들 중의 둘 이상으로 결정될 수 있다. 한편, 신청자 계정 별로 멀티팩터 인증에 해당하는 인증 방식들의 개수나 종류가 상이하게 설정될 수도 있다. 승인자 계정을 통해 디지털 자산 관리 신청이 승인되면(S22), 계정 검증부는 디지털 자산 관리 신청에 대 한 승인자 계정에 의한 승인 여부에 따라 디지털 자산 관리 신청에 대한 검증을 수행하며, 디지털 자산 확인부 는 디지털 자산 관리 신청과 관련된 디지털 자산 지갑에 보관 중인 디지털 자산을 확인할 수 있다(S23).디지털 자산 관리의 승인을 요청 받은 다수의 승인자는 각각 승인자 계정에 접속하여 둘 이상의 인증을 통해 디 지털 자산 관리를 승인할 수 있다. 이와 같은 멀티팩터 인증을 통해 보안성을 높일 수 있다. 멀티팩터 인증은 예를 들어 패스워드 인증, 신분증 인증, 안면 인식, 생체 인식(지문 인식) 등의 다양한 인증 방식들 중의 둘 이 상으로 결정될 수 있다. 한편, 승인자 계정 별로 멀티팩터 인증에 해당하는 인증 방식들의 개수나 종류는 상이 하게 설정될 수도 있다. 디지털 자산 관리부는 계정 검증부 및 디지털 자산 확인부의 검증 및 확인 완료 시, 디지털 자 산 관리 신청에 따른 디지털 자산 관리를 수행하고, 디지털 자산 관리에 따른 정보를 수탁자 DB에 기록할 수 있다(S24, S25). 상술한 본원 발명의 실시예에 의하면, 디지털 자산의 관리를 위한 계정을 신청자 계정과 승인자 계정으로 분산 시키고 고객사의 키 정보를 샤미르 키 분산(Shamir's Key Distribution) 방식으로 다수의 분산키로 분산하여 보 관하여 고객사의 내부 부정행위를 방지할 수 있으며, 디지털 자산의 탈취, 해킹 위험을 줄일 수 있다. 도 11은 본원 발명의 다른 실시예에 따른 디지털 자산 관리 방법의 디지털 자산 관리 신청 및 승인 과정을 나타 낸 순서도이다. 도 1 및 도 11을 참조하면, 수탁자 단말은 오너 계정에 대해 신청자 계정 별로 복수개의 승인자 계정을 부여할 수 있다(S32). 위탁자 단말의 신청자 단말이 신청자 계정에 접속하여 디지털 자산의 보관, 관리 등을 신청하게 되면, 수탁자 단말은 복수개의 승인자 계정 중 어느 승인자 계정으로 디지털 자산의 보관, 관리 등에 대해 승인을 요청할 것인지를 결정할 수 있다. 일 실시예로, 수탁자 단말은 신청자 계정을 통해 접수한 디지털 자산의 보관, 관리에 대한 신청 정보를 기 초로 복수의 승인자 계정 중 승인 요청을 할 승인자 계정 개수를 결정할 수 있다(S34). 수탁자 단말은 복수개의 승인자 계정 중 랜덤으로 하나 또는 둘 이상의 승인자 계정을 승인자 계정 개수만 큼 선택하여 디지털 자산의 보관, 관리에 대한 승인을 요청할 수 있다(S36). 수탁자 단말은 이전 또는 출금 요청 받은 디지털 자산의 규모가 기 설정된 기준 자산 크기를 초과할 경우, 둘 혹은 셋 이상의 승인자 계정으로 승인을 요청하여 모든 승인자 계정을 통해 승인이 될 경우에만 해당 디지털 자산에 대한 이전 또는 출금 등의 처리를 수행할 수 있다. 이와 달리, 수탁자 단말은 신청자 단말로부터 이전 또는 출금 요청 받은 디지털 자산의 규모가 기 설 정된 기준 자산 크기 이하인 경우, 하나의 승인자 계정으로 승인을 요청하여 해당 하나의 승인자 계정을 통해 승인이 되면 디지털 자산에 대한 이전 또는 출금 등의 처리를 수행할 수 있다. 수탁자 단말은 예를 들어, 신청자 계정에 의해 요청 받은 디지털 자산의 규모를 기초로 2개의 승인자 계정 을 랜덤으로 선택할 것으로 결정하면, 3개의 승인자 계정 중에서 2개의 승인자 계정을 임의로 선택하고 해당 선 택된 승인자 계정으로 디지털 자산의 보관, 관리에 대한 승인을 요청할 수 있다(S38). 신청자는 다수의 승인자 중 어느 승인자에게 디지털 자산에 대한 보관, 관리 승인이 요청될지 알 수 없다. 따라 서 신청자가 모든 승인자와 부정하게 모의를 하기는 어렵기 때문에, 사전 모의에 의한 기업 등에서의 디지털 자 산의 편취를 방지할 수 있다. 이하, 첨부된 도면을 참조하여 본원 발명에 따른 바람직한 일 실시예를 상세히 설명하기로 한다. 도 12는 본원 발명의 일 실시예에 따른, 커스터디 시스템을 둘러싼 전체 시스템 환경의 개요를 나타내는 도면이다. 도 12를 참조하면 전체 시스템 환경은 디지털 자산 커스터디 시스템과 이를 둘러싼 고객사 서버, 및 블록체인 네트워크 를 포함할 수 있다. 먼저, 고객사 서버를 통해 디지털 자산 보관 및 출금 의뢰 요청이 발생한다. 발생한 요청은 웹 서버로 수신된다. 웹 서버는 관리자 서버(Admin)로 고객사의 신원확인(KYC, Know Your Customer)을 요청하고, 고객사의 신원에 이상이 없으면 지갑 운용서버에 지갑 생성 요청을 전송한다. 지갑 운용서버는 키보관 시스템과 연동하여 디지털 자산(또는, 디지털 자산)의 지갑을 생성하고, 지갑 생성 과 정에서 만들어진 공개키 및 개인키는 지갑 운용서버와 콜드월렛 룸에 나누어 저장된다. 일 실시예로서, 키보관시스템이 접근 가능한 콜드월렛 룸에는 ISMS상 보안정책이 적용될 수 있다. 그리고, 디지털 자산 지갑 생성 결 과는 메인넷과 연동되어 블록체인 네트워크에 기록, 저장된다. 이하에서는, 도 12의 디지털 자산 커스터디 시스템을 이용한 디지털 자산 관리 방법에 대해 다양한 실시예를 참 조하여 설명하기로 한다. 도 2는 본원 발명의 일 실시예에 따른, 머신러닝 기반으로 디지털 자산 커스터디 고객 의 자산을 운용하는 방법을 나타내는 순서도이다. 도 13의 방법은 도 1에서 설명된 커스터디 시스템에 의해 수 행된다. 따라서, 이하의 단계들에서 수행 주체가 명시되지 않은 경우, 그 수행주체는 상기 커스터디 시스템인 것으로 전제한다. S310 단계에서, 고객으로부터 디지털 자산이 수탁된다. 이하에서, 디지털 자산은 가상 자산이나 고객 자산 등의 용어로 사용될 수도 있다. S320 단계에서, 거래소별 디지털 자산 거래데이터가 수집된다. S330 단계에서, 머신 러닝 기반으로 디지털 자산의 기간별 가격상승률 및 정확도가 예측된다. S340 단계에서, 고객 설문을 통해 고객 의 투자 성향이 분석된다. S350 단계에서, 고객 투자 성향에 적합한 포트폴리오가 구성되어 고객 자산의 투자 대행이 수행된다. 도 14는 고객으로부터 디지털 자산이 수탁되는 단계를 개념적으로 나타내는 도면이다. 디지털 자산 커스터디 서 비스 운영을 위해, 커스터디 시스템을 운영하는 회사는 복수의 고객들로부터 디지털 자산을 수탁하게 된다. 도 15는 거래소로부터 수집된 디지털 자산 거래 데이터의 예시적인 형태를 나타내는 도면이다. 도 15를 참조하면, 디지털 자산 거래 데이터는 각 디지털 자산의 일별, 시간별, 분별 디지털 자산 거래 데이터가 수집될 수 있다. 일 실시예로서, 상기 디지털 자산 거래 데이터는 디지털 자산 거래 일시, 거래시작 가격, 거래종료 가격, 최고 거래 가격, 최저 거래가격, 및/또는 거래량을 포함할 수 있다. 도 16은 도 13의 S330 단계를 더욱 구체화한 일 실시예를 나타내는 순서도이다. 도 16에서는 디지털 자산 거래 데이터로부터 포트폴리오 구성에 필요한 예측 정확도, 상승률, 안정성, 및 적정 투자금액 등의 투자 요인을 추 출하여, 이를 머신러닝 기법으로 시계열 데이터 학습시켜 예측 모델을 추출하는 실시예가 설명된다. S331 단계에서, 디지털 자산 거래데이터가 획득된다. S332 단계에서, 디지털 자산 거래데이터가 전처리된다. S333 단계에서, 디지털 자산 거래데이터로부터 투자 요인이 추출된다. 일 실시예로서, 추출되는 투자 요인은 예 측 정확도, 가격 상승률, 가격 안정성, 또는 적정 투자금액을 포함할 수 있다. S334 단계에서, 추출된 투자 요인을 기초로 머신러닝 기반의 시계열 데이터 학습이 수행된다. 이때, 머신러닝 알고리즘으로는 LGBM 또는 LSTM이 사용될 수 있다. S335 단계에서, 학습 수행 결과에 의해 예측 모델을 추출된 다. S336 단계에서, 추출된 예측 모델을 이용하여 디지털 자산의 투자 요인이 예측된다. 도 17은 고객 설문을 통해 투자 성향을 분석하는 단계를 개념적으로 나타내는 도면이다. 도 17에서는 고객 설문 을 통해 고객의 투자 성향을 안정형, 중립형, 공격투자형 등 다양한 유형으로 분류하되, 고객의 나이, 소득, 투 자 경험 및 지식, 희망 수익 등 여러 요소를 반영하여 최종적인 투자 성향이 산출되는 실시예가 도시된다. 도 18은 고객 투자 성향을 기초로 적절한 포트폴리오를 구성하여 고객 자산 투자 대행을 하는 단계를 개념적으 로 나타내는 도면이다. 도 18에서는 앞서 산출된 고객의 투자 성향에 기초하여, 투자 성향에 적합하도록 수익률 과 분산투자 정도를 조절하여 디지털 자산 포트폴리오를 구성하고, 그에 따라 디지털 자산 투자를 대행하는 실 시예가 도시된다. 도 18의 예를 참조하면, 고객의 투자 성향이 안정추구형인 경우, 그에 기초하여 디지털 자산 포트폴리오를 SOL, ETH, BTC, DOGE, BORA의 복수의 디지털 자산으로 구성하고, 각각의 투자 비중을 11%, 22%, 51%, 9%, 7%로 설정 한 예가 도시된다. 이상에서 설명한 본원 발명의 실시예들에 따르면, 커스터디 시스템을 통해 디지털 자산을 위 탁받아 효과적으로 보관 및 관리할 수 있다. 도 19는 본원 발명의 일 실시예에 따른 디지털 자산 커스터디 시스템을 구성하는 디지털 자산 투자 대행 분석 시스템의 구성도이다. 도 19를 참조하면, 본원 발명의 실시예에 따른 디지털 자산 커스터디 시스템은 디지털 자 산 투자 대행 분석 시스템을 포함할 수 있다. 디지털 자산 투자 대행 분석 시스템은 거래데이터 분 석부와, 고객 투자 성향 분석부 및 디지털 자산 투자 대행부를 포함할 수 있다. 디지털 자산 투자 대행 분석 시스템은 거래소 별로 디지털 자산 거래 데이터를 수집하여 머신러닝 기반으 로 디지털 자산의 기간별 가격상승률 및 정확도를 예측하고, 고객의 투자 성향을 분석하여, 고객의 투자 성향에 알맞는 포트폴리오를 구성하여 고객의 디지털 자산 투자를 대행하는 서비스를 제공하는 시스템일 수 있다. 디지 털 자산 투자 대행 분석 시스템은 디지털 자산 커스터디 서비스 제공자의 서버에 마련되거나, 디지털 자산 커스터디 서비스 제공자의 서버와 연동하도록 구현될 수 있다. 디지털 자산 투자 대행 분석 시스템의 각 구성요소는 적어도 하나의 프로세서(processor)로 구현될 수 있다. 거래데이터 분석부는 거래소 별로 디지털 자산 거래 데이터를 수집하여 머신러닝 기반으로 디지털 자산의 기간별 가격상승률 및 정확도를 예측할 수 있다. 거래데이터 분석부는 거래소 별 거래데이터를 수집하는 거래데이터 수집부, 인공지능부의 복수개의 인공지능 모델을 이용하여 거래소 별로 수집된 거래데 이터를 분석하는 거래소 거래데이터 분석부, 인공지능부의 각 인공지능 모델에 대한 학습을 수행하 는 기계학습부 및 기계학습부에 의해 학습된 복수개의 상이한 인공지능 모델을 포함하는 인공지능 부를 포함할 수 있다. 거래데이터 수집부는 다양한 거래소 단말로부터 각각 디지털 자산과 관련된 거래데이터를 수집하도록 구 성될 수 있다. 거래데이터 수집부는 설정된 주기(예를 들어, 1일)로 거래소 별 디지털 자산의 거래데이터 를 수집할 수 있다. 거래데이터 수집부는 거래소 별 디지털 자산 거래데이터를 거래소 거래데이터 분석부 로 전달할 수 있다. 거래소 거래데이터 분석부는 거래소 별 디지털 자산 거래데이터를 기초로 인공지능부의 복수개의 상이한 인공지능 모델을 이용하여 거래소 별 디지털 자산의 가격상승률 및 정확도를 예측할 수 있다. 즉, 거래 소 거래데이터 분석부는 거래소별 거래데이터에 포함된 정보들을 각 인공지능 모델에 입력하고, 각 인공 지능 모델로부터 출력되는 정보를 조합하여 이를 기초로 거래소별 디지털 자산의 가격상승률 및 정확도를 예측 할 수 있다. 기계학습부는 레이블링된 거래소별 거래데이터와 디지털 자산 가격 추이 정보를 포함하는 학습 데이터로 기초로, 거래데이터의 정보들을 입력 변수로 하고, 가격상승률을 출력 변수로 설정하여 기계 학습 방식을 통해 인공지능 모델을 학습할 수 있다. 기계학습부에 의해 학습된 인공지능부의 각 인공지능 모델은 다 시 후속의 거래데이터를 기초로 디지털 자산의 가격상승률 및 정확도를 예측하는데 활용될 수 있다. 기계 학습이란 다수의 파라미터로 구성된 모델을 이용하며, 주어진 데이터로 파라미터를 최적화하는 것을 의미 할 수 있다. 기계 학습은 학습 문제의 형태에 따라 지도 학습(supervised learning), 비지도 학습 (unsupervised learning) 및 강화 학습(reinforcement learning)을 포함할 수 있다. 지도 학습(supervised learning)은 입력과 출력 사이의 매핑을 학습하는 것이며, 입력과 출력 쌍이 데이터로 주어지는 경우에 적용할 수 있다. 비지도 학습(unsupervised learning)은 입력만 있고 출력은 없는 경우에 적용하며, 입력 사이의 규칙 성 등을 찾아낼 수 있다. 기계학습부는 다양한 방식으로 인공지능 모델을 생성할 수 있다. 예를 들어, 기계학습부는 학습 데 이터로부터 추출되는 특징들(features)을 딥러닝 기반의 학습방법으로 학습할 수 있다. 이때, 거래소별로 설정 된 과거의 실제 거래데이터의 필드들로부터 학습 데이터를 추출하거나, 거래소별 거래데이터의 통계 데이터나 추세 데이터, 추세 그래프 등으로부터 이미지 분석 기반(예컨대, 여러 단계의 컨볼루션 계층을 쌓은 CNN(Convolutional Neural Networks) 구조 등)으로 특징들을 추출하는 등의 다양한 방식이 활용될 수 있으며, 이에 제한되지 않고 언급되지 않은 방식이 활용될 수도 있다. 기계학습부의 학습 방식은 LGBM(Light Gradient Boosting Machine) 인공지능 알고리즘, 장단기 메모리 (LSTM; Long Short Term Memory) 기반의 재귀적 순환 인공신경망인 RNN(recurrent neural network), 완전연결 층 기반의 ANN(artificial neural network), K-최근접 이웃 인공신경망인 KNN(K-Nearest Neighbors), K-평균 클러스터링(K-Means Clustering) 알고리즘, PCA(Principal Component Analysis) 알고리즘, 서포트 벡터 머신 알고리즘 기반의 SVM(Suport Vector Machine) 인공신경망 및/또는 오토 인코더(Auto Encoder) 인공신경망 등을 포함하는 기계학습 알고리즘을 통한 방식일 수 있다. 고객 투자 성향 분석부는 고객 설문에 대한 고객 응답 데이터를 통해 고객의 투자 성향을 분석할 수 있다. 고객 투자 성향 분석부는 고객 설문을 통해 고객의 나이, 소득, 투자 경험 및 지식, 희망 수익 등 여러 요소를 반영하여 고객의 투자 성향을 안정형, 중립형, 공격투자형 등 다양한 유형으로 분류할 수 있다. 디지털 자산 투자 대행부는 거래소별 거래데이터의 분석 결과와 고객 투자 성향을 기초로 적절한 포트폴 리오를 구성하여 고객 자산 투자 대행을 수행할 수 있다. 즉, 디지털 자산 투자 대행부는 고객의 투자 성 향에 기초하여, 투자 성향에 적합하도록 수익률과 분산투자 정도를 조절하여 디지털 자산 포트폴리오를 구성하 고, 그에 따라 디지털 자산 투자를 대행할 수 있다. 거래데이터 분석부는 인공지능부의 각 인공지능 모델(1141~1145)에 의해 예측된 디지털 자산 가격 상승률 및 정확도를 기초로, 각 인공지능 모델(1141~1145)의 출력 값들을 조합하여 최종적으로 거래소별 디지털 자산의 가격상승률 및 정확도를 예측할 수 있다. 거래소 거래데이터 분석부는 인공지능 모델들 각각의 학 습용 거래데이터에 기초한 출력 예측 정확도를 기초로 각각의 인공지능 모델에 대응되는 가중치를 결정할 수 있 다. 예를 들어, 인공지능 모델이 5개일 경우, 학습용 거래데이터에 기초한 출력 예측 정확도가 높은 순으로 5개 의 인공지능 모델의 우선순위를 설정하여 각 인공지능 모델의 우선순위를 기초로 각 인공지능 모델의 가중치를 결정하고, 각각의 인공지능 모델에 대해 결정된 가중치를 적용한 후 합산한 값을 기초로 디지털 자산의 가격상 승률 및 정확도를 예측할 수 있다. 도 20은 본원 발명의 실시예에 따른 디지털 자산 커스터디 시스템을 구성하는 인공지능부의 개념도이다. 도 19 및 도 20을 참조하여 설명하면, 기계학습부는 LGBM(Light Gradient Boosting Machine) 인공지능 알고리 즘의 기계 학습 방식을 통해 제1 인공지능 모델을 생성할 수 있다. LGBM 인공지능 알고리즘은 결정 트리 (Decision Tree) 기반 모형으로 데이터의 그래디언트(Gradient)를 기준으로 정확도를 유지하면서 데이터 인스턴 스(Data Instance)를 줄이는 샘플링을 통해 데이터를 고속으로 학습하는 알고리즘일 수 있다. 기계학습부는 장단기 메모리(LSTM; Long Short Term Memory) 기반의 재귀적 순환 인공신경망(RNN) 기계 학습 방식을 통해 제2 인공지능 모델을 생성할 수 있다. LSTM 인공신경망 학습 방식은 순환 신경망(RNN) 의 일종으로, 장단기 메모리를 이용하여 기존 RNN의 문제였던 기울기 소멸 문제(vanishing gradient problem)를 방지하는 학습 알고리즘일 수 있다. 기계학습부는 KNN(K-Nearest Neighbors) 기반의 머신러닝 알고리즘의 기계 학습 방식을 통해 제3 인공지 능 모델을 생성할 수 있다. K-최근접 이웃 기반 머신러닝 알고리즘은 입력된 특징 벡터에 가장 가까운 점 몇 개를 뽑아 이들의 레이블을 사용하는 방식의 알고리즘일 수 있다. 기계학습부는 K-평균 클러스터링 기반의 머신러닝 알고리즘의 기계 학습 방식을 통해 제4 인공지능 모델 을 생성할 수 있다. K-평균 클러스터링 기반의 머신러닝 알고리즘은 주어진 입력을 군집화하는 학습 방법 으로서, 총 K 개의 클러스터가 있다고 가정하고, 특징 공간(feature space)에서 K 개의 중간점(centroid)을 찾 는 방식의 알고리즘일 수 있다. 기계학습부는 주성분 분석 모델(Principal Component Analysis; PCA) 기반의 머신러닝 알고리즘의 기계 학습 방식을 통해 제5 인공지능 모델을 생성할 수 있다. 주성분 분석 모델 기반의 머신러닝 알고리즘은 원 데이터의 분포를 최대한 보존하면서 고차원 공간의 데이터들을 저차원 공간으로 변환하는 기법을 활용한 방 식의 알고리즘일 수 있다. 그 외에도, 기계학습부는 완전연결층 기반의 ANN(artificial neural network) 머신러닝 알고리즘의 기계 학습 방식을 통해 제6 인공지능 모델(도시 생략됨)을 생성할 수 있다. 완전연결층 기반의 ANN(artificial neural network) 머신러닝 알고리즘은 다수의 입력 노드와 다수의 출력 노드 사이에 다수의 은닉 노드가 완전연 결층(FCL; Fully Connected Layer) 구조로 연결된 인공신경망을 학습하는 방식의 알고리즘일 수 있다. 기계학습부는 추가로 서포트 벡터 머신(Suport Vector Machine; SVM) 기반의 머신러닝 알고리즘의 기계 학습 방식을 통해 제7 인공지능 모델(도시 생략됨)을 생성할 수 있다. 서포트 벡터 머신 기반의 머신러닝 알고 리즘은 특징 공간에서 주어진 두 분류의 데이터를 구분 지을 수 있는 최적(optimal)의 초평면(hyperplane)을 이 용하는 방식의 알고리즘일 수 있다. 또한, 기계학습부는 오토 인코더(Auto Encoder) 기반의 머신러닝 알고리즘의 기계 학습 방식을 통해 제8 인공지능 모델(도시 생략됨)을 생성할 수 있다. 오토 인코더 기반의 머신러닝 알고리즘은 출력값을 입력값의 근 사로 하는 함수를 학습하는 방식의 비지도 학습 알고리즘일 수 있다. 거래소 거래데이터 분석부는 거래소별 거래데이터를 기초로, 제1 인공지능 모델, 제2 인공지능 모 델, 제3 인공지능 모델, 제4 인공지능 모델, 제5 인공지능 모델 및 제6 내지 제8 인 공지능 모델이 각각 출력하는 거래소별 디지털 자산의 가격상승률 및 정확도 예측 결과를 획득할 수 있다. 거래 소 거래데이터 분석부는 제1 내지 제8 인공지능 모델에 의해 각각 예측된 출력 결과를 각 인공지능 모델 에 대해 결정된 가중치에 따라 조합하여 최종적으로 거래소별 디지털 자산의 가격상승률 및 정확도 예측값을 출 력할 수 있다. 본원 발명의 실시예에 따르면, 다양한 인공지능 모델을 기반으로 거래소별 디지털 자산의 가격상 승률 및 정확도를 보다 높은 정확도로 예측할 수 있으며, 이에 따라 고객의 투자 유형에 부합(매칭)되는 거래소 를 추천하거나, 고객에게 적합한 디지털 자산 투자 포트폴리오를 추천할 수 있다. 이하에서는, 도 21을 참조하여 본원 발명의 다양한 실시예에 따른 커스터디 시스템 및 그것의 디지털 자산 관리 방법이 구현되는 예시적인 컴퓨팅 장치에 대하여 설명하도록 한다. 도 21은 컴퓨팅 장치를 나타내는 예시적인 하드웨어 구성도이다. 도 21에 도시된 바와 같이, 컴퓨팅 장치는 하나 이상의 프로세서, 버 스, 통신 인터페이스, 프로세서에 의하여 수행되는 컴퓨터 프로그램을 로드(load)하는 메 모리와, 컴퓨터 프로그램를 저장하는 스토리지를 포함할 수 있다. 다만, 도 21에는 본원 발명의"}
{"patent_id": "10-2023-0062315", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "실시예와 관련 있는 구성요소들만이 도시되어 있다. 따라서, 본원 발명이 속한 기술분야의 통상의 기술자라면 도 21에 도시된 구성요소들 외에 다른 범용적인 구성 요소들이 더 포함될 수 있음을 알 수 있다. 프로세서는 컴퓨팅 장치의 각 구성의 전반적인 동작을 제어한다. 프로세서는 CPU(Central Processing Unit), MPU(Micro Processor Unit), MCU(Micro Controller Unit), GPU(Graphic Processing Unit) 또는 본원 발명의 기술 분야에 잘 알려진 임의의 형태의 프로세서 중 적어도 하나를 포함하여 구성될 수 있다. 또한, 프로세서는 본원 발명의 다양한 실시예들에 따른 방법/동작을 실행하기 위한 적어도 하나의 애플리 케이션 또는 프로그램에 대한 연산을 수행할 수 있다. 컴퓨팅 장치는 하나 이상의 프로세서를 구비할 수 있다. 메모리는 각종 데이터, 명령 및/또는 정보를 저장한다. 메모리는 본원 발명의 다양한 실시예들에 따 른 방법/동작들을 실행하기 위하여 스토리지로부터 하나 이상의 프로그램을 로드(load) 할 수 있다. 메모리의 예시는 RAM이 될 수 있으나, 이에 한정되는 것은 아니다. 버스는 컴퓨팅 장치의 구성 요소 간 통신 기능을 제공한다. 버스는 주소 버스(Address Bus), 데 이터 버스(Data Bus) 및 제어 버스(Control Bus) 등 다양한 형태의 버스로 구현될 수 있다. 통신 인터페이스 는 컴퓨팅 장치의 유무선 인터넷 통신을 지원한다. 통신 인터페이스는 인터넷 통신 외의 다양한 통신 방식을 지원할 수도 있다. 이를 위해, 통신 인터페이스는 본원 발명의 기술 분야에 잘 알려진 통신 모듈을 포함하여 구성될 수 있다. 스토리지는 하나 이상의 컴퓨터 프로그램을 비임시적으로 저장할 수 있다. 스토리지는 ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리 등과 같은 비휘발성 메모리, 하드 디스크, 착탈형 디스크, 또는 본원 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터로 읽을 수 있는 기록 매체를 포함하여 구성될 수 있다. 컴퓨터 프로그램은 본원 발명의 다양한 실시예들에 따른 방법/동작들이 구현된 하나 이상의 인스트럭션 (Instruction)들을 포함할 수 있다. 컴퓨터 프로그램이 메모리에 로드 되면, 프로세서는 상기 하나 이상의 인스트럭션들을 실행시킴으로써 본원 발명의 다양한 실시예들에 따른 방법/동작들을 수행할 수 있 다. 이하에서는 사용자가 컨센서스 노드로 참여 가능한 디지털 자산 커스터디 시스템에 대해서 설명한다. 구체적으 로, 본원 발명은 사용자가 위탁한 디지털 자산 규모에 기초하여 검증에 대한 승인 권한을 가질 수 있는 디지털 자산 커스터디 시스템을 제공할 수 있다. 도 22는 본원 발명의 일 실시예에 따른 디지털 자산 커스터디 서비스 제공 시스템의 블록도이다. 도 22를 참조하면, 본원 발명의 일 실시예에 따른 디지털 자산 커스터디 서비스 제공 시스템(이하, 시스템)은 제어부, 계정 생성부, 컨센서스 노드 관리부, 계정 검증부, 디지털 자산 관리부 , 거래 기록 저장부 및 거래 기록 공시부를 포함할 수 있다. 도 22는 시스템에 포함되는 일 곱 가지 구성 요소를 도시하고 있으나, 도시된 구성 요소들이 필수적인 것은 아니고, 시스템은 그보다 많은 구 성 요소를 갖거나 그보다 적은 구성 요소를 가질 수 있다. 또한, 시스템의 각 구성 요소는 물리적으로 하나의 서버에 포함될 수도 있고, 각각의 기능 별로 분산된 분산 서버일 수 있다. 제어부는 시스템의 동작을 총괄할 수 있다. 구체적으로, 제어부는 계정 생성부, 컨센서스 노 드 관리부, 계정 검증부, 디지털 자산 관리부, 거래 기록 저장부 및 거래 기록 공시부 에 제어 명령을 보내 각 부서의 동작을 실행할 수 있다. 이하에서 특별한 언급이 없는 경우에는, 시스템의 동작은 제어부의 제어에 의해 수행되는 것으로 해석될 수 있다.계정 생성부는 복수의 사용자 단말기로부터 디지털 자산 관리 요청 데이터를 수신할 수 있다. 계정 생성 부는 데이터 송수신이 가능한 통신 모듈을 포함할 수 있다. 복수의 사용자 단말기는 시스템에 디지털 자 산 관리를 위탁하는 고객의 단말기일 수 있다. 이때, 디지털 자산 관리 요청 데이터는 사용자 정보, 위탁하려는 디지털 자산 규모, 위탁 기간, 사용자 요청 등을 포함할 수 있다. 계정 생성부는 디지털 자산 관리 요청 데이터에 기초하여 각 사용자 단말기에 대응되는 복수의 사용자 계 정을 생성할 수 있다. 예를 들어, 계정 생성부는 제1 사용자 단말기에 대응되는 제1 사용자 계정 및 제2 사용자 단말기에 대응되는 제2 사용자 계정을 생성할 수 있다. 계정 생성부가 사용자 계정을 생성하기 전, 시스템은 디지털 자산 관리 요청 데이터를 전송한 사용자의 신원 확인(KYC, Know Your Customer)을 할 수 있다. 시스템은 사용자의 신원 확인이 완료된 경우 계정 생성부 에 신호를 전송하여 계정을 생성하도록 할 수 있다. 계정 생성부는 사용자 계정과 함께 가상 자산을 관리하는 지갑을 생성할 수 있다. 계정 생성부는 지갑 생성 과정에서 만들어진 공개키 및 개인키를 시스템의 저장부와 콜드월렛 룸에 나누어 저장할 수 있다. 이 때, 콜드 월렛 룸은 키 보관 시스템이 접근 가능한 것으로 ISMS 상 보안 정책이 적용될 수 있다. 시스템은 가상 자산 지갑 생성 결과를 저장소에 저장할 수 있다. 컨센서스 노드 관리부는 디지털 자산 관리 요청 데이터에 포함된 디지털 자산 규모에 기초하여 복수의 사 용자 계정 각각에 대한 합의 권한 지분을 분배할 수 있다. 본원 발명의 시스템에서는 커스터디 고객이 블록체인 네트워크의 컨센서스 노드로 참여할 수 있다. 구체적으로, 고객은 컨센서스 노드로 참여함으로써 블록에 기록되 는 데이터를 검증함으로써 시스템 전체의 신뢰도를 고객이 평가할 수 있다. 본원 발명은 검증을 위한 지분이 고객의 위탁 자산 규모에 따라 결정되는 것을 특징으로 한다. 컨센서스 노드 관리부는 복수의 사용자 계정의 총 디지털 자산 규모에 대한 각각의 사용자 계정의 디지털 자산 규모 비 율에 기초하여, 각 사용자 계정에 합의 권한 지분을 분배할 수 있다. 예를 들어, 복수의 사용자 계정의 총 디지털 자산 규모가 1억원이고, 제1 사용자 계정의 위탁한 디지털 자산 규 모가 3천만원이고, 제2 사용자 계정의 위탁한 디지털 자산 규모가 1천만원인 경우, 컨센서스 노드 관리부(230 0)는 제1 사용자 계정에 30%의 합의 권한 지분을 분배하고, 제2 사용자 계정에 10%의 합의 권한 지분을 분배할 수 있다. 시스템은 각 사용자 계정에 분배된 합의 권한 지분에 기초하여 블록체인 네트워크에서 발생하는 수수료를 청구 하거나 이자를 분배할 수 있다. 사용자는 자신에게 분배된 합의 권한 지분에 따라 검증에 대한 지분 비율을 갖 는다. 위 예시에서, 제1 사용자 계정이 검증에 대한 승인을 완료한 경우, 합의 승인 지분 비율이 30%가 추가될 수 있다. 계정 검증부는 복수의 사용자 계정의 합의 승인 지분의 합에 따라 디지털 자산 관리 신청에 대한 검증을 수행할 수 있다. 구체적으로, 계정 검증부는 합의 승인 지분의 합이 기준값 이상인 경우에 검증이 완료된 것으로 처리할 수 있다. 이때, 검증 완료 처리의 기준이 되는 상기 기준값은 디지털 자산의 종류, 보안 등급, 총 디지털 자산 규모 및 사용자 요청 중 적어도 하나 이상에 기초하여 조절 가능할 수 있다. 예를 들어, 총 디지털 자산 규모가 1억원 이하인 경우 상기 기준값은 50%이고, 총 디지털 자산 규모가 5억원 이 상인 경우 상기 기준값은 80%일 수 있다. 또한 예를 들어, 합의 권한 지분이 50% 이상인 사용자가 존재하는 경 우, 상기 기준값은 50%를 초과한 값으로 설정될 수 있다. 또한 예를 들어, 보안 등급이 최고 등급인 경우 상기 기준값은 90% 이상으로 설정될 수 있다. 디지털 자산 관리부는 계정 검증부의 검증이 수행되면, 복수의 사용자 계정에 대해 디지털 자산 관 리 요청 데이터에 기초하여 디지털 자산 관리를 수행할 수 있다. 디지털 자산 관리부에 대한 내용은 도 7 의 디지털 자산 관리부의 내용과 중복될 수 있으므로, 자세한 설명은 생략한다. 거래 기록 저장부는 계정 생성부, 컨센서스 노드 관리부, 계정 검증부, 디지털 자산 관리부에 의해 생성 또는 처리되는 정보를 블록체인 상에 기록할 수 있다. 예를 들어, 거래 기록 저장부 는 계정 생성부에 의해 생성된 복수의 사용자 계정 및 복수의 지갑에 대한 데이터를 저장할 수 있 다. 또한 예를 들어, 거래 기록 저장부는 컨센서스 노드 관리부에 의해 분배된 합의 권한 지분에 대한 정보를 저장할 수 있다. 또한 예를 들어, 거래 기록 저장부는 디지털 자산 관리부의 디지털 자산 관리 내용에 대한 데이터를 저장할 수 있다.거래 기록 저장부는 저장하는 데이터에 대한 민감도를 설정할 수 있다. 구체적으로, 거래 기록 저장부 는 저장하는 데이터에 대해 보안과 관련된 점수 또는 등급을 설정할 수 있다. 예를 들어, 거래 기록 저장 부는 사용자 개인의 회원 가입 내용, 지갑 관리 정보, 활동 내역 등의 보안 등급을 상으로 설정할 수 있 다. 또한 예를 들어, 거래 기록 저장부는 블록체인 네트워크 상의 입출금 내역의 보안 등급을 중으로 설 정할 수 있다. 거래 기록 공시부는 사용자 단말기의 요청에 따라 사용자 단말기에 데이터를 전송할 수 있다. 거래 기록 공시부는 어떤 사용자 단말기가 어떤 정보를 요청했는지와 데이터에 설정된 민감도에 따라 암호화되거나 암호화되지 않은 데이터를 전송할 수 있다. 거래 기록 공시부는 데이터 송수신이 가능한 통신 모듈을 포 함할 수 있다. 구체적으로, 거래 기록 공시부는 제1 사용자 계정에 대응되는 제1 사용자 단말기로부터 제1 사용자 계정 과 관련된 거래 열람 신호를 수신할 수 있다. 이는 자신의 계정과 관련된 정보를 열람하는 경우이므로, 거래 기 록 공시부는 민감도에 상관없이 제1 사용자 계정과 관련된 데이터를 암호화하지 않고 제1 사용자 단말기 로 전송할 수 있다. 반면, 거래 기록 공시부는 제1 사용자 계정에 대응되는 제1 사용자 단말기로부터 제2 사용자 계정과 관련 된 거래 열람 신호를 수신할 수 있다. 이는 다른 사용자의 계정과 관련된 정보를 열람하는 경우이므로, 거래 기 록 공시부는 민감도에 따라 데이터를 선별적으로 전송할 수 있다. 구체적으로, 거래 기록 공시부는 제1 사용자 단말기에 제1 거래 공시 데이터를 전송할 수 있다. 제1 거래 공시 데이터는 제1 데이터 및 제2 데이터를 포함할 수 있다. 이때, 제1 데이터는 제2 사용자 계정과 관련된 데 이터 중 민감도가 임계값 이하인 데이터일 수 있다. 또한 이때, 제2 데이터는 제2 사용자 계정과 관련된 데이터 중 민감도가 상기 임계값을 초과한 데이터일 수 있다. 또한 제2 데이터는 암호화된 데이터(예를 들어, 양방향 암호화 방식을 이용한 데이터)일 수 있다. 위 설명에서는 거래 기록 저장부가 저장한 데이터에 대해 민감도를 설정하고, 거래 기록 공시부가 민감도에 따라 데이터를 전송하는 예시에 대해서 설명하였다. 그러나, 이에 한정되지 않고, 거래 기록 저장부 가 민감도를 설정하지 않고 거래 기록 공시부가 민감도를 설정하는 예시도 가능하다. 예를 들어, 거래 기록 공시부가 거래 기록 저장부에 저장된 데이터에 보안에 따라 민감도를 설정하고 민감도에 따라 사용자 단말기로 데이터를 전송할 수도 있다. 도 23은 본원 발명의 일 실시예에 따른 디지털 자산 커스터디 서비스의 검증 및 디지털 자산 관리 방법의 순서 도이다. 도 23을 참조하면, 본원 발명의 일 실시예에 따른 디지털 자산 커스터디 서비스의 검증 방법은 디지털 자산 관 리 요청 데이터를 수신하는 단계(S2110), 복수의 사용자 계정을 생성하는 단계(S2120), 합의 권한 지분을 분배 하는 단계(S2130), 디지털 자산 관리 신청에 대한 검증을 수행하는 단계(S2140) 및 디지털 자산 관리를 수행하 는 단계(S2150)를 포함할 수 있다. 도 23은 단계 S2110 내지 S2150이 순차적으로 수행되는 것을 도시하였으나, 이에 한정되지 않고, 일부 단계가 생략되거나 동시에 수행되거나 새로운 단계가 추가될 수도 있다. 디지털 자산 관리 요청 데이터를 수신하는 단계(S2110)는 시스템이 복수의 사용자 단말기로부터 디지털 자산의 위탁 요청을 수신하는 단계일 수 있다. 이때, 디지털 자산 관리 요청 데이터는 사용자 정보, 위탁하려는 디지털 자산 규모, 위탁 기간, 사용자 요청 등을 포함할 수 있다. 복수의 사용자 계정을 생성하는 단계(S2120)는 디지털 자산 관리 요청 데이터에 기초하여 계정 생성부가 사용자 단말기에 대응되는 사용자 계정을 생성하는 단계일 수 있다. 합의 권한 지분을 분배하는 단계(S2130)는 컨센서스 노드 관리부가 디지털 자산 관리 요청 데이터에 포함 된 위탁 디지털 자산 규모에 기초하여 각 사용자에 대한 합의 권한 지분을 설정하는 단계일 수 있다. 컨센서스 노드 관리부는 복수의 사용자 계정의 총 위탁 디지털 자산 규모에 대한 각 사용자 계정의 위탁 디지털 자 산 규모의 비율에 기초하여 합의 권한 지분을 설정할 수 있다. 디지털 자산 관리 신청에 대한 검증을 수행하는 단계(S2140)는 각 사용자들이 가지고 있는 합의 권한 지분에 대 해 승인을 완료한 지분의 합이 기준값 이상인지 여부에 기초하여 계정 검증부가 디지털 자산 관리 신청에대한 검증을 승인하는 단계일 수 있다. 디지털 자산 관리를 수행하는 단계(S2150)는 단계 S2140에서 검증이 수행된 경우 디지털 자산 관리부가 수탁한 디지털 자산에 대한 관리를 수행하는 단계일 수 있다. 도 24는 본원 발명의 일 실시예에 따른 디지털 자산 커스터디 서비스의 거래 기록 공시 방법의 순서도이다. 도 24를 참조하면, 본원 발명의 일 실시예에 따른 디지털 자산 커스터디 서비스의 거래 기록 공시 방법은 블록 체인 상에 거래 데이터를 기록하는 단계(S2210), 데이터에 대한 민감도를 설정하는 단계(S2220), 거래 열람 신 호를 수신하는 단계(S2230), 데이터를 선별 및/또는 데이터를 암호화하는 단계(S2240) 및 데이터를 전송하는 단 계(S2250)를 포함할 수 있다. 도 24는 단계 S2210 내지 S2250이 순차적으로 수행되는 것을 도시하였으나, 이에 한정되지 않고, 일부 단계가 생략되거나 동시에 수행되거나 새로운 단계가 추가될 수도 있다. 블록체인 상에 거래 데이터를 기록하는 단계(S2210)는 거래 기록 저장부가 도 23의 단계 S2110 내지 단계 S2150에서 발생 또는 처리된 데이터를 시스템의 저장소에 저장하는 단계일 수 있다. 데이터에 대한 민감도를 설정하는 단계(S2220)는 거래 기록 저장부 또는 거래 기록 공시부가 데이 터의 보안 정도에 따라 민감도를 설정하는 단계일 수 있다. 예를 들어, 거래 기록 저장부 또는 거래 기록 공시부는 블록체인에 기록되는 거래 기록 중 가상 자 산이 이동하는 입출금 정보는 공개가 필요한 정보이므로 민감도를 낮게 설정할 수 있다. 또한 예를 들어, 거래 기록 저장부 또는 거래 기록 공시부는 사용자의 개인 정보, 회원 가입/변경 정보, 가상 자산 지갑 생성/변경/삭제 정보 및/또는 고객의 활동 내역 정보는 보안이 필요한 정보이므로 민감도 를 높게 설정할 수 있다. 거래 열람 신호를 수신하는 단계(S2230)는 시스템이 사용자 단말기로부터 거래 열람 요청과 관련된 거래 열람 신호를 수신하는 단계일 수 있다. 이때, 거래 열람 신호는 열람하고자 하는 데이터 정보를 포함할 수 있다. 데이터를 선별 및/또는 데이터를 암호화하는 단계(S2240)는 거래 기록 공시부가 단계 S2230에서 수신한 거래 열람 신호에 기초하여 데이터를 선별하는 단계일 수 있다. 예를 들어, 거래 열람 신호가 자신의 계정에 대 한 정보를 요청하는 신호일 경우, 거래 기록 공시부는 요청하는 데이터를 모두 사용자 단말기로 전송할 수 있다. 그러나 예를 들어, 거래 열람 신호가 타인의 계정에 대한 정보를 요청하는 신호일 경우, 거래 기록 공시부 는 민감도가 임계값보다 낮은 데이터는 그대로 사용자 단말기에 전송하되, 민감도가 임계값보다 높은 데 이터는 암호화하여 전송(S2250)할 수 있다. 또는 거래 기록 공시부는 민감도가 임계값보다 높은 데이터는 전송하지 않아 데이터를 공개하지 않을 수도 있다. 도 25는 블록체인 네트워크를 이용한 거래 데이터 기록 방법을 설명하기 위한 예시 도면이다. 도 25를 참조하면, 시스템은 시스템 내에서 발생하는 거래 기록에 대해서 블록체인 네트워크 상에 저장할 수 있 다. 각 블록에 저장된 거래 기록은 해시 형태로 암호화 및 저장될 수 있다. 이에, 거래 기록에 대응된 가상 자 산 거래에 참여한 당사자 및 주소를 통해서만 그 내용을 확인할 수 있다. 도 26은 거래 기록 공시 방법을 설명하기 위한 예시 도면이다. 도 26을 참조하면, 사용자의 선택이나 데이터의 민감도에 따라 공개가 필요한 정보나 민감하지 않은 정보는 공 개 대상으로 설정될 수 있다. 반면, 사용자가 공개를 원하지 않거나 민감한 정보는 비공개 대상으로 설정될 수 있다. 블록체인에 기록되는 거래 기록 중 블록체인 상에서 가상 자산이 이동하는 입/출금 정보는 공개가 필요한 정보 이므로 공개 대상으로 설정될 수 있다. 반면, 사용자의 개인 정보에 속하거나 민감한 정보인 회원 가입/변경 정 보, 가상 자산 지갑 생성/변경/삭제 정보 및/또는 고객의 활동 내역 조회 정보는 비공개 대상으로 설정될 수 있 다.거래 기록 공시부는 공개 대상으로 설정된 정보에 대해서는 사용자 단말기의 요청에 따라 그대로 전송할 수 있다. 그러나, 거래 기록 공시부는 비공개 대상으로 설정된 정보에 대해서는 사용자 단말기의 요청이 있더라도 전송하지 않거나, 요청에 따라 이들 정보를 암호화하여 전송할 수 있다. 이하에서는 사용자에게 프리미엄 서비스를 제공하는 디지털 자산 커스터디 시스템에 대해서 설명한다. 구체적으 로, 본원 발명은 대체 불가능 토큰을 이용하여 사용자에게 프리미엄 서비스를 제공할 수 있는 디지털 자산 커스 터디 시스템을 제공할 수 있다. 도 27은 본원 발명의 다른 일 실시예에 따른 디지털 자산 커스터디 서비스 제공 시스템의 블록도이다. 도 27을 참조하면, 본원 발명의 다른 일 실시예에 따른 디지털 자산 커스터디 서비스 제공 시스템은 제어부 , 계정 생성부, 컨센서스 노드 관리부, 토큰 발행부, 토큰 처리부, 거래 기록 저장부 및 거래 기록 공시부를 포함할 수 있다. 도 27은 시스템에 포함되는 일곱 가지 구성 요소를 도시하고 있으나, 도시된 구성 요소들이 필수적인 것은 아니고, 시스템은 그보다 많은 구성 요소를 갖거나 그보 다 적은 구성 요소를 가질 수 있다. 또한, 시스템의 각 구성 요소는 물리적으로 하나의 서버에 포함될 수도 있 고, 각각의 기능 별로 분산된 분산 서버일 수 있다. 제어부는 시스템의 동작을 총괄할 수 있다. 구체적으로, 제어부는 계정 생성부, 고객 관리부 , 컨센서스 노드 관리부, 토큰 발행부, 토큰 처리부, 거래 기록 저장부 및 거 래 기록 공시부에 제어 명령을 보내 각 부서의 동작을 실행할 수 있다. 이하에서 특별한 언급이 없는 경우에는, 시스템의 동작은 제어부의 제어에 의해 수행되는 것으로 해석될 수 있다. 계정 생성부에 대한 내용은 도 22의 계정 생성부에 대한 내용과 중복되므로, 자세한 설명은 생략한 다. 고객 관리부는 디지털 자산 관리 요청 데이터에 포함된 디지털 자산 규모에 기초하여 사용자 계정의 클래 스를 결정할 수 있다. 또한, 고객 관리부는 결정된 클래스에 대응되는 고객 서비스가 사용자에게 제공될 수 있도록 전반적인 관리 기능을 수행할 수 있다. 예를 들어, 고객 관리부는 위탁한 디지털 자산 규모가 1억원 이하인 사용자는 제1 클래스로, 1억원 초과 3억원 이하인 사용자는 제2 클래스로, 3억원 초과인 사용자는 제3 클래스로 설정할 수 있다. 이때, 제1 클래스 는 일반 등급, 제2 클래스는 VIP 등급, 제3 클래스는 VVIP 등급에 대응될 수 있으나, 이에 한정되지 않는다. 컨센서스 노드 관리부에 대한 내용은 도 22의 컨센서스 노드 관리부에 대한 내용과 중복되므로, 자 세한 설명은 생략한다. 고객 관리부는 사용자 계정의 클래스를 결정할 때, 컨센서스 노드 관리부에 의해 설정된 사용자 계 정의 합의 권한 지분을 고려할 수 있다. 예를 들어, 고객의 위탁 자산이 1억원 이하이나, 합의 권한 지분이 50% 이상인 경우, 고객 관리부는 사용자 계정을 VVIP에 대응되는 제3 클래스로 결정할 수 있다. 토큰 발행부는 고객 관리부에 의해 결정된 사용자 계정의 클래스에 기초하여 클래스에 대응되는 서 비스 내역을 확인할 수 있다. 토큰 발행부는 확인한 서비스 내역에 기초하여 서비스 제공 기관에서 사용 가능한 서비스 이용 권리가 포함된 토큰을 발행할 수 있다. 예를 들어, 서비스 제공 기관은 호텔, 레스토랑, 라 운지, 골프장, 운동 센터, 전시장 또는 공연장을 포함할 수 있으나, 이에 한정되지 않는다. 토큰 발행부는 서비스 이용 권리에 관한 정보에 기초하여 스마트 컨트랙트를 생성하고, 생성한 스마트 컨 트랙트에 기초하여 대체 불가능 토큰을 발행할 수 있다. 이때, 대체 불가능 토큰은 멀티플(Multiple) 타입일 수 있으나, 이에 한정되지 않는다. 예를 들어, 토큰 발행부는 5성급 호텔 1박 이용 권리가 포함된 제1 대체 불가능 토큰을 발행할 수 있다. 또한 예를 들어, 토큰 발행부는 인천공항 A 라운지 1년 이용 권리가 포함된 제2 대체 불가능 토큰을 발행 할 수 있다. 또한 예를 들어, 토큰 발행부는 특정 스포츠 센터 1년 이용 권리가 포함된 제3 대체 불가능 토큰을 발행할 수 있다.토큰 처리부는 서비스 제공 기관으로부터 토큰 사용 여부에 관한 데이터를 획득할 수 있다. 토큰 처리부 는 서비스 제공 기관으로부터 서비스 이용 권리가 포함된 대체 불가능 토큰의 사용 완료 정보를 획득하면, 상기 대체 불가능 토큰을 폐기할 수 있다. 또한 토큰 처리부는 대체 불가능 토큰의 사용 기간 이 도과한 경우에 토큰이 사용되지 않았더라도 토큰을 폐기할 수 있다. 거래 기록 저장부는 계정 생성부, 고객 관리부, 토큰 발행부 및 토큰 처리부에 의해 생성 또는 처리되는 데이터를 블록체인 상에 기록할 수 있다. 거래 기록 저장부에 대한 내용은 도 22의 거래 기록 저장부에 대한 내용과 중복되므로, 자세한 설명은 생략한다. 거래 기록 공시부에 대한 내용은 도 22의 거래 기록 공시부에 대한 내용과 중복되므로, 자세한 설 명은 생략한다. 도 28은 본원 발명의 일 실시예에 따른 대체 불가능 토큰을 이용하여 프리미엄 서비스를 제공하는 디지털 자산 커스터디 서비스 제공 방법의 순서도이다. 도 28을 참조하면, 본원 발명의 일 실시예에 따른 대체 불가능 토큰을 이용하여 프리미엄 서비스를 제공하는 디 지털 자산 커스터디 서비스 제공 방법은 디지털 자산 관리 요청 데이터를 수신하는 단계(S3110), 사용자 계정을 생성하는 단계(S3120), 사용자 계정의 클래스를 결정하는 단계(S3130), 클래스에 대응되는 서비스 내역을 확인 하는 단계(S3140), 서비스 이용 권리가 포함된 대체 불가능 토큰을 발행하는 단계(S3150) 및 서비스를 이용한 경우, 대체 불가능 토큰을 폐기하는 단계(S3160)를 포함할 수 있다. 도 28은 단계 S3110 내지 S3150이 순차적으 로 수행되는 것을 도시하였으나, 이에 한정되지 않고, 일부 단계가 생략되거나 동시에 수행되거나 새로운 단계 가 추가될 수도 있다. 디지털 자산 관리 요청 데이터를 수신하는 단계(S3110)는 도 23의 단계 S3110에 대한 내용과 중복될 수 있어, 자세한 설명은 생략한다. 사용자 계정을 생성하는 단계(S3120)는 디지털 자산 관리 요청 데이터에 기초하여 계정 생성부가 사용자 단말기에 대응되는 사용자 계정을 생성하는 단계일 수 있다. 사용자 계정의 클래스를 결정하는 단계(S3130)는 디지털 자산 관리 요청 데이터에 포함된 디지털 자산 규모에 기초하여 고객 관리부가 사용자 계정의 클래스를 결정하는 단계일 수 있다. 고객 관리부는 디지털 자산 규모뿐만 아니라, 컨센서스 노드 관리부에 의해 분배된 합의 권한 지분에 기초하여 사용자 계정의 클래스를 결정할 수 있다. 클래스에 대응되는 서비스 내역을 확인하는 단계(S3140)는 토큰 발행부가 토큰 발행을 위해 클래스에 어 떤 서비스 이용 권리가 포함되어 있는지 여부를 확인하는 단계일 수 있다. 예를 들어, 제1 클래스의 사용자는 5 성급 호텔을 이용할 수 있고, 제2 클래스의 사용자는 제1 클래스의 이용 권리 및 특정 레스토랑 4인 식사권을 이용할 수 있고, 제3 클래스는 제2 클래스의 이용 권리 및 라운지 1년 이용권을 이용할 수 있다. 서비스 이용 권리가 포함된 대체 불가능 토큰을 발행하는 단계(S3150)는 토큰 발행부가 단계 S3140에서 확인한 서비스 내역에 기초하여 서비스 이용 권리를 포함하는 대체 불가능 토큰을 발행하는 단계일 수 있다. 이 때, 토큰 발행부는 서비스 이용 권리가 복수인 경우 복수의 대체 불가능 토큰을 발행할 수 있다. 또는 토 큰 발행부는 서비스 이용 권리가 복수인 경우에도 하나의 대체 불가능 토큰을 발행할 수도 있다. 서비스를 이용한 경우, 대체 불가능 토큰을 폐기하는 단계(S3160)는 토큰 처리부가 서비스 제공 기관으로 부터 토큰 사용 완료와 관련된 정보를 획득한 경우, 사용 완료된 토큰을 폐기하는 단계일 수 있다. 이때, 하나 의 대체 불가능 토큰에 복수의 서비스 이용 권리가 포함된 경우, 토큰 처리부는 모든 서비스 이용 권리가 사용 완료된 경우에만 대체 불가능 토큰을 폐기할 수 있다. 도 29는 서비스 이용 권리가 포함된 대체 불가능 토큰의 발행을 설명하기 위한 예시적인 도면이다. 도 29를 참조하면, 커스터디 시스템은 서비스 이용 권리와 관련된 정보에 기초하여 스마트 컨트랙트를 생성할 수 있다. 커스터디 시스템은 생성한 스마트 컨트랙트에 기초하여 서비스 이용 권리를 포함하는 대체 불가능 토 큰을 발행할 수 있다. 커스터디 시스템은 대체 불가능 토큰에 대응되는 서비스가 이용 완료된 경우, 대체 불가능 토큰을 폐기할 수 있다. 한편, 디지털 자산 커스터디 서비스의 고객이 불법적인 자금을 전달하기 위해 커스터디 시스템을 이용하거 나, 부당한 거래를 진행하려는 경우, 해당 고객의 거래를 탐지하고 해당 거래를 막는 것이 필요할 수 있다. 도 30은 본원 발명의 실시예에 따른 이상 거래 탐지 시스템의 구성도이며, 도 31은 본원 발명의 실시예에 따른 가상자산 커스터디 서비스를 이용하는 고객들의 입출금 데이터를 도시한 표이다. 도 30을 참조하면, 이상 거래 탐지 시스템은 분석자 단말 및 조치자 단말을 포함할 수 있다. 이상 거래 탐지 시스템은 디지털 자산을 관리하는 서비스를 제공하도록 구성되는 커스터디 시스템에 서 발생되는 디지털 자산의 거래가 이상 거래인지 여부를 판단하는 시스템일 수 있다. 이상 거래 탐지 시스템 은 디지털 자산 커스터디 서비스 제공자의 서버에 마련될 수 있으나 이상 거래 탐지 시스템이 반드 시 서비스 제동자의 서버에 마련되는 것으로 한정되는 것은 아니다. 분석자 단말은 검사 대상 거래의 이상 거래 여부를 판단하도록 구성되는 단말일 수 있다. 분석자 단말 은 입출금 데이터 수신부, 이상 거래 여부 분석부, 기계 학습부 및 기계학습부를 포함 할 수 있다. 입출금 데이터 수신부는 커스터디 시스템으로부터 검사 대상 거래의 입출금 데이터를 수신하도록 구 성될 수 있다. 검사 대상 거래는 커스터디 시스템에서 발생된 거래 중에서 이상 거래인지 여부를 판단하고 자하는 대상이 되는 거래일 수 있다. 입출금 데이터 수신부는 검사 대상 거래의 입출금 데이터를 이상 거 래 여부 분석부로 전달할 수 있다. 도 31을 참조하면, 가상 자산 커스터디 서비스 운영에 따라 발생되는 고객들의 입출금 관련 데이터에 포함되는 정보를 확인할 수 있다. 예를 들어, 입출금 데이터는 커스터디 시스템을 통해 거래가 발생된 일시, 거래한 고객의 ID, 주소이름, 거 래가 발생된 국가, 지역, 거래 발생 후 잔액 등의 정보들을 포함할 수 있다. 하지만, 입출금 데이터에 포함되는 정보가 도시된 정보들로 한정되는 것은 아니다. 입출금 데이터 수신부는 검사 대상 거래의 입출금 데이터에 포함된 정보를 커스터디 시스템으로부터 수신하고, 이를 이상 거래 여부 분석부로 전달할 수 있다. 도 30 및 도 31을 참조하면, 이상 거래 여부 분석부는 입출금 데이터를 기초로 인공지능 모델을 이용하여 상기 검사 대상 거래가 거래 정지의 대상이 되는 이상 거래인지 여부를 판단할 수 있다. 즉, 이상 거래 여부 분 석부는 검사 대상 거래의 입출금 데이터에 포함된 정보들을 인공지능 모델에 입력하고, 인공지능 모델이 출력하는 정보를 기초로 검사 대상 거래가 이상 거래인지 여부를 결정할 수 있다. 기계학습부는 학습용 정상 거래의 입출금 데이터 및 학습용 이상 거래의 입출금 데이터를 입력 변수로 하 고, 학습용 정상 거래에 대응되는 정상 여부 정보 및 학습용 이상 거래에 대응되는 정상 여부 정보를 출력 변수 로 설정하여 기계 학습 방식을 통해 인공지능 모델을 생성할 수 있다. 학습용 정상 거래의 입출금 데이터에 포함된 정보에는 어떠한 이상도 없는 거래 금액에 관한 정보, 고객에 관한 정보, 국가 또는 지역에 관한 정보 등이 포함될 수 있다. 학습용 정상 거래에 대응되는 정상 여부 정보는 해당 학습용 정상 거래가 정상적인 거래였다는 취지의 정보가 포함될 수 있다. 학습용 이상 거래의 입출금 데이터에 포함된 정보에는 문제가 될 소지가 있는 거래 금액에 관한 정보, 고객에 관한 정보, 국가 또는 지역에 관한 정보 등이 포함될 수 있다. 학습용 이상 거래에 대응되는 정상 여부 정보는 해당 학습용 이상 거래가 비정상적이거나 규제의 대상이 되는 거래였다는 취지의 정보가 포함될 수 있다. 기계학습부는 과거에 거래 정지 사유가 있는 위탁자가 실행시킨 디지털 자산의 거래, 과거에 거래 정지 사유가 있는 출금 대상자의 디지털 자산의 거래, 비정상적인 자전거래, 비정상적인 고가의 거래 및 비정상적인 저가의 거래 중 적어도 하나에 해당되는 학습용 이상 거래를 입력 변수로 설정하고, 학습용 이상 거래에 대응되 는 정상 여부 정보를 출력 변수로 설정하여 기계 학습 방식을 통해 인공지능 모델을 생성할 수 있다. 기계 학습이란 다수의 파라미터로 구성된 모델을 이용하며, 주어진 데이터로 파라미터를 최적화하는 것을 의미 할 수 있다. 기계 학습은 학습 문제의 형태에 따라 지도 학습(supervised learning), 비지도 학습(unsupervised learning) 및 강화 학습(reinforcement learning)을 포함할 수 있다. 지도 학습(supervised learning)은 입력과 출력 사이의 매핑을 학습하는 것이며, 입력과 출력 쌍이 데이터로 주어지는 경우에 적용할 수 있다. 비지도 학습(unsupervised learning)은 입력만 있고 출력은 없는 경우에 적용하며, 입력 사이의 규칙 성 등을 찾아낼 수 있다. 기계학습부는 다양한 방식으로 인공지능 모델을 생성할 수 있다. 예를 들어, 기계학습부는 학습용 이상 거래에 포함된 정보 또는 학습용 정상 거래에 포함된 정보로부터 추출되는 특징(feature)을 딥러닝 기반의 학습방법으로 학습할 수 있다. 이때, 학습용 이상 거래에 포함된 정보 또는 학습용 정상 거래에 포함된 정보로 부터 특징을 추출하는 방식을 학습하기 위해 여러 단계의 컨볼루션 계층(convolution layer)을 쌓은 CNN(Convolutional Neural Networks) 구조가 활용될 수 있으나, 기계학습부의 학습방법이 반드시 CNN 구 조를 활용하는 방법으로 한정되는 것은 아니다. 예를 들어, 기계학습부의 학습 방식은 ANN(artificial neural network), RNN(recurrent neural network), KNN(K-Nearest Neighbors), K-Means Clustering, PCA(Principal Component Analysis), SVM(Suport Vector Machine) 또는 Auto Encoder 등을 포함하는 기계학습 알고리즘을 통한 방식일 수 있다. 조치자 단말은 커스터디 시스템에서 발생된 거래를 관리하는 관리자 또는 조치를 취하는 조치자의 단 말일 수 있다. 조치자 단말은 검사 대상 거래에 관련된 위탁자 단말에 대한 거래 정지 여부를 결정 하도록 구성될 수 있다. 도 30을 참조하면, 분석자 단말은 검사 대상 거래가 이상 거래로 판단되면, 경고 신호를 조치자 단말 로 송신할 수 있다. 조치자 단말은 경고 신호를 수신하면, 조치자 단말의 디스플레이와 같은 출력부에 이상 거래의 발 생 사실 및 어떠한 거래가 이상 거래인지를 나타내는 정보 등을 출력할 수 있다. 조치자 단말을 이용하는 관리자 또는 조치자는 이러한 정보들을 기반으로 이상 거래로 판단된 거래에 대한 조치를 취할 수 있다. 예를 들어, 관리자 또는 조치자는 조치자 단말을 통해 탐지된 이상 거래가 정상인지 여부를 정밀 분석할 수 있 다. 또한, 관리자 또는 조치자가 복수일 경우, 각각의 관리자 또는 조치자가 이용하는 조치자 단말들을 통해 내부 감시 통제기구의 의사결정을 수행할 수도 있다. 조치자 단말은, 경고 신호를 수신하면, 검사 대상 거래를 정지하는 취지의 거래 정지 신호를 커스터디 시 스템으로 송신할 수 있다. 커스터디 시스템은 거래 정지 신호를 수신하면, 거래 정지 신호에 대응되는 검사 대상 거래를 정지할 수 있다. 또한, 커스터디 시스템은 거래 정지 신호를 수신하면, 해당 검사 대상 거래에 관여된 위탁자 단말에 의한 다른 거래도 정지하거나 제재할 수 있다. 조치자 단말은 입력부를 포함할 수 있다. 입력부는 관리자로부터 입력 정보를 수신할 수 있 다. 입력부가 입력 정보를 수신하는 것은, 조치자 단말에 마련되는 버튼이 관리자 또는 조치자로부 터 물리적인 힘을 받는 방식이거나 디스플레이에 터치 입력 방식으로 입력 정보를 입력 받는 것일 수 있으나, 이에 한정되는 것은 아니다. 한편, 분석자 단말에 의해 이상 거래로 판단되었던 검사 대상 거래가 관리자 또는 조치자에 의한 정밀 분 석 결과 이상 거래가 아닌 정상 거래로 확인될 수 있다. 또한, 분석자 단말에 의해 이상 거래로 판단되었 던 검사 대상 거래가 조치자 단말들을 통한 내부 감시 통제기구의 의사결정에 의해 정상 거래로 확인될 수도 있다. 이때, 조치자 단말의 입력부는 관리자 또는 조치자들로부터 검사 대상 거래가 정상 거 래임이 확인되었다는 취지의 정황 확인 정보를 수신할 수 있다. 조치자 단말은, 거래 정지 신호를 송신한 후, 입력부가 정상 확인 정보를 수신하면, 검사 대상 거 래의 정지를 취소하는 취지의 거래 재개 신호를 커스터디 시스템으로 송신할 수 있다. 커스터디 시스템은 거래 재개 신호를 수신하면, 거래 정지 신호에 의해 정지되었던 검사 대상 거래의 진행 을 재개할 수 있다. 또한, 커스터디 시스템은 거래 재개 신호를 수신하면, 해당 검사 대상 거래에 관여된 위탁자 단말의 다른 거래의 진행도 재개할 수 있다. 한편, 분석자 단말에 의해 이상 거래로 판단되었던 검사 대상 거래가 관리자 또는 조치자에 의한 정밀 분 석 결과에 의해서도 이상 거래로 확인될 수 있다. 또한, 분석자 단말에 의해 이상 거래로 판단되었던 검 사 대상 거래가 조치자 단말들을 통한 내부 감시 통제기구의 의사결정에 의해서도 정상 거래로 확인될 수 도 있다. 이때, 조치자 단말의 입력부는 관리자 또는 조치자들로부터 검사 대상 거래가 이상 거래임이 확인되었다는 취지의 정황 확인 정보를 수신할 수 있다. 조치자 단말은, 거래 정지 신호를 송신한 후, 입력부가 검사 대상 거래가 이상 거래임이 확인되었 다는 취지의 이상 확인 정보를 수신하면, 검사 대상 거래에 대하여 법규에 따른 조치를 진행하라는 취지의 신호 를 커스터디 시스템으로 송신할 수 있다. 커스터디 시스템은 검사 대상 거래에 대하여 법규에 따른 조치를 진행하라는 취지의 신호를 수신하면, 거래 정지 신호에 의해 정지되었던 검사 대상 거래에 대한 법규에 따른 미리 설정된 프로세스를 진행할 수 있다. 또 한, 커스터디 시스템은 검사 대상 거래에 대하여 법규에 따른 조치를 진행하라는 취지의 신호를 수신하면, 해당 검사 대상 거래에 관여된 위탁자 단말의 다른 거래에 대해서도 법규에 따른 미리 설정된 프로세스를 진행할 수 있다. 도 32는 본원 발명의 실시예에 따른 머신러닝 기반의 이상 거래 탐지 방법을 설명하기 위한 도면이다. 도 32를 참조하면, 이상 거래 탐지 시스템은 검사 대상 거래의 가상자산 입출금 데이터를 복수개의 인공 지능 모델에 각각 입력하고, 복수개의 인공지능 모델들이 출력한 정보들을 기초로 검사 대상 거래를 이상 거래 로 분류할 수 있다. 도 30 및 도 32를 참조하면, 기계학습부는 서로 다른 별개의 머신러닝 알고리즘을 기초로 서로 다른 복수 개의 인공지능 모델들을 생성할 수 있다. 이상 거래 여부 분석부는 입출금 데이터를 기초로 복수개의 인공지능 모델들이 각각 출력하는 검사 대상 거래의 이상 거래 여부 판단 결과를 획득할 수 있다. 이상 거래 여부 분석부는 검사 대상 거래를 이상 거래로 판단한 인공지능 모델의 개수를 기초로 검사 대 상 거래의 이상 거래 여부를 판단할 수 있다. 구체적으로, 이상 거래 여부 분석부는 검사 대상 거래를 이상 거래로 판단한 인공지능 모델의 개수가 미 리 설정된 개수 이상이면 검사 대상 거래를 이상 거래로 분류할 수 있다. 예를 들어, 미리 설정된 개수가 3이고 5개의 인공지능 모델 중에서 검사 대상 거래를 이상 거래로 분류한 인공지능 모델의 개수가 4이면, 이상 거래 여부 분석부는 검사 대상 거래를 이상 거래로 분류할 수 있다. 이상 거래 여부 분석부는 인공지능 모델들 각각의 학습용 이상 거래에 대한 탐지율을 기초로 각각의 인공 지능 모델에 대응되는 가중치를 결정할 수 있다. 예를 들어, 인공지능 모델이 5개일 경우, 학습용 이상 거래에 대한 탐지율이 높은 순서대로 각각의 인공지능 모델에 대해서 5, 4, 3, 2, 1 순으로 대응되는 가중치를 결정할 수 있다. 이상 거래 여부 분석부는 검사 대상 거래를 이상 거래로 판단한 인공지능 모델의 가중치 및 검사 대상 거 래를 정상 거래로 판단한 인공지능 모델의 가중치를 기초로 검사 대상 거래의 이상 거래 여부를 판단할 수 있다. 구체적으로, 이상 거래 여부 분석부는 검사 대상 거래를 이상 거래로 판단한 인공지능 모델들의 가중치를 합친 값이 미리 설정된 값 이상이면 검사 대상 거래를 이상 거래로 분류할 수 있다. 예를 들어, 미리 설정된 값 이 11이고 인공지능 모델들 중에서 검사 대상 거래를 이상 거래로 분류한 인공지능 모델들의 가중치가 5, 4 및 3 이면, 이를 합친 값이 12로서 미리 설정된 값 이상이므로, 이상 거래 여부 분석부는 검사 대상 거래를 이상 거래로 분류할 수 있다. 기계학습부는 거리 기반 이상치 탐지 모델(K-Nearest Neighbors; KNN) 기반의 머신러닝 알고리즘의 기계 학습 방식을 통해 제1 인공지능 모델을 생성할 수 있다. 기반 이상치 탐지 모델 기반의 머신러닝 알고리 즘은 입력된 특징 벡터에 가장 가까운 점 몇 개를 뽑아 이들의 레이블을 사용하는 방식의 알고리즘일 수 있다. 기계학습부는 군집 기반 이상치 탐지 모델(K-Means Clustering) 기반의 머신러닝 알고리즘의 기계 학습 방식을 통해 제2 인공지능 모델을 생성할 수 있다. 군집 기반 이상치 탐지 모델 기반의 머신러닝 알고리 즘은 주어진 입력을 군집화하는 학습 방법으로서 총 K 개의 클러스터가 있다고 가정하고, 특징 공간(feature space)에서 K 개의 중간점(centroid)을 찾는 방식의 알고리즘일 수 있다. 기계학습부는 주성분 분석 모델(Principal Component Analysis; PCA) 기반의 머신러닝 알고리즘의 기계 학습 방식을 통해 제3 인공지능 모델을 생성할 수 있다. 주성분 분석 모델 기반의 머신러닝 알고리즘은 원 데이터의 분포를 최대한 보존하면서 고차원 공간의 데이터들을 저차원 공간으로 변환하는 기법을 활용한 방식의 알고리즘일 수 있다. 기계학습부는 서포트 벡터 머신(Suport Vector Machine; SVM) 기반의 머신러닝 알고리즘의 기계 학습 방 식을 통해 제4 인공지능 모델을 생성할 수 있다. 서포트 벡터 머신 기반의 머신러닝 알고리즘은 특징 공 간에서 주어진 두 분류의 데이터를 구분 지을 수 있는 최적(optimal)의 초평면(hyperplane)을 이용하는 방식의 알고리즘일 수 있다. 기계학습부는 오토 인코더(Auto Encoder) 기반의 머신러닝 알고리즘의 기계 학습 방식을 통해 제5 인공지 능 모델을 생성할 수 있다. 오토 인코더 기반의 머신러닝 알고리즘은 출력값을 입력값의 근사로 하는 함 수를 학습하는 방식의 비지도 학습 알고리즘이다. 이상 거래 여부 분석부는, 입출금 데이터를 기초로 제1 인공지능 모델, 제2 인공지능 모델, 제3 인공지능 모델, 제4 인공지능 모델, 제5 인공지능 모델이 각각 출력하는 검사 대상 거래 의 이상 거래 여부 판단 결과를 획득할 수 있다. 이상 거래 여부 분석부는 검사 대상 거래를 이상 거래로 판단한 인공지능 모델의 가중치 및 검사 대상 거 래를 정상 거래로 판단한 인공지능 모델의 가중치를 기초로 검사 대상 거래의 이상 거래 여부를 판단할 수 있다. 도 33은 본원 발명의 실시예에 따른 이상 거래 탐지 시스템의 제어 방법의 순서도이다. 도 33을 참조하면, 입출금 데이터 수신부는 커스터디 시스템으로부터 검사 대상 거래의 입출금 데이 터를 수신할 수 있다(S4001). 이상 거래 여부 분석부는 입출금 데이터를 기초로 인공지능 모델을 이용하여 검사 대상 거래가 거래 정지 의 대상이 되는 이상 거래인지 여부를 판단할 수 있다(S4002). 분석자 단말은 검사 대상 거래가 이상 거래로 판단되면, 경고 신호를 조치자 단말로 송신할 수 있 다(S4003). 조치자 단말은 경고 신호를 수신하면, 조치자 단말의 디스플레이와 같은 출력부에 이상 거래의 발 생 사실 및 어떠한 거래가 이상 거래인지를 나타내는 정보 등을 출력할 수 있다(S4004). 조치자 단말을 이용하는 관리자 또는 조치자는 이러한 정보들을 기반으로 이상 거래로 판단된 거래에 대한 조치를 취할 수 있 다. 도 34는 본원 발명의 실시예에 따라 이상 거래로 판단된 위탁자 단말에 대한 조치 방법의 순서도이다. 도 34를 참조하면, 분석자 단말은 검사 대상 거래가 이상 거래로 판단되면, 경고 신호를 조치자 단말 로 송신할 수 있다. 이때, 조치자 단말은, 경고 신호를 수신하면, 검사 대상 거래를 정지하는 취지 의 거래 정지 신호를 커스터디 시스템으로 송신할 수 있다(S4101). 커스터디 시스템은 거래 정지 신호 를 수신하면, 거래 정지 신호에 대응되는 검사 대상 거래를 정지할 수 있다. 또한, 커스터디 시스템은 거래 정지 신호를 수신하면, 해당 검사 대상 거래에 관여된 위탁자 단말에 의한 다른 거래도 정지하거나 제재할 수 있다. 조치자 단말은 경고 신호를 수신하면, 조치자 단말의 디스플레이와 같은 출력부에 이상 거래의 발 생 사실 및 어떠한 거래가 이상 거래인지를 나타내는 정보 등을 출력할 수 있다(S4102). 조치자 단말을 이용하는 관리자 또는 조치자는 이러한 정보들을 기반으로 이상 거래로 판단된 거래에 대 한 조치를 취할 수 있다. 예를 들어, 관리자 또는 조치자는 조치자 단말을 통해 탐지된 이상 거래가 정상 인지 여부를 정밀 분석할 수 있다. 또한, 관리자 또는 조치자가 복수일 경우, 각각의 관리자 또는 조치자가 이 용하는 조치자 단말들을 통해 내부 감시 통제기구의 의사결정을 수행할 수도 있다. 입력부는 정밀 분석의 결과 또는 내부 감시 통제기구의 의사결정 결과를 관리자 또는 조치자로부터 입력 받을 수 있다(S4103). 조치자 단말은 정밀 분석의 결과 또는 내부 감시 통제기구의 의사결정 결과를 기초로 검사 대상 거래가 이상거래로 확인되었다는 취지의 정보 또는 정상 거래로 확인되었다는 취지의 정보를 입력 받을 수 있다 (S4104). 조치자 단말은, 거래 정지 신호를 송신한 후, 입력부가 검사 대상 거래가 이상 거래임이 확인되었 다는 취지의 이상 확인 정보를 수신하면(S4104의 '예'), 검사 대상 거래에 대하여 법규에 따른 조치를 진행하라는 취지의 신호를 커스터디 시스템으로 송신할 수 있다. 이때, 커스터디 시스템은 검사 대상 거래에 대 하여 법규에 따른 조치를 진행하라는 취지의 신호를 수신하면, 거래 정지 신호에 의해 정지되었던 검사 대상 거 래에 대한 법규에 따른 미리 설정된 프로세스를 진행할 수 있다(S4105). 또한, 커스터디 시스템은 검사 대 상 거래에 대하여 법규에 따른 조치를 진행하라는 취지의 신호를 수신하면, 해당 검사 대상 거래에 관여된 위탁 자 단말의 다른 거래에 대해서도 법규에 따른 미리 설정된 프로세스를 진행할 수 있다. 조치자 단말은, 거래 정지 신호를 송신한 후, 입력부가 검사 대상 거래가 정상 거래임이 확인되었 다는 취지의 정상 확인 정보를 수신하면(S4104의 '아니오'), 검사 대상 거래의 정지를 취소하는 취지의 거래 재 개 신호를 커스터디 시스템으로 송신할 수 있다. 이때, 커스터디 시스템은 거래 재개 신호를 수신하면, 거래 정지 신호에 의해 정지되었던 검사 대상 거래의 진행을 재개할 수 있다(S4106). 또한, 커스터디 시스템 은 거래 재개 신호를 수신하면, 해당 검사 대상 거래에 관여된 위탁자 단말의 다른 거래의 진행도 재 개할 수 있다. 입출금 데이터 수신부, 이상 거래 여부 분석부, 기계학습부, 입력부는 이상 거래 탐지 시스템에 포함된 복수개의 프로세서 중 어느 하나의 프로세서를 포함할 수 있다. 또한, 지금까지 설명된 본원 발명의 실시예 및 앞으로 설명할 실시예에 따른 소셜 네트워크 게시물 분류 방법은, 프로세서에 의해 구동 될 수 있는 프로그램의 형태로 구현될 수 있다. 여기서 프로그램은, 프로그램 명령, 데이터 파일 및 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 프로그램은 기계어 코드나 고급 언어 코드를 이용하여 설계 및 제작된 것일 수 있다. 프로그램은 상술한 이상 거래 탐지 방법을 구현하기 위하여 특별히 설계된 것일 수도 있고, 컴퓨터 소프트웨어 분야에서 통상의 기술자 에게 기 공지되어 사용 가능한 각종 함수나 정의를 이용하여 구현된 것일 수도 있다. 전술한 이상 거래 탐지 방 법을 구현하기 위한 프로그램은, 프로세서에 의해 판독 가능한 기록매체에 기록될 수 있다. 이때, 기록매체는 이상 거래 탐지 시스템에 마련되는 메모리일 수 있다. 메모리는 전술한 동작 및 후술하는 동작을 수행하는 프로그램을 저장할 수 있으며, 메모리는 저장 된 프로그램을 실행시킬 수 있다. 프로세서와 메모리가 복수인 경우에, 이들이 하나의 칩에 집적되는 것 도 가능하고, 물리적으로 분리된 위치에 마련되는 것도 가능하다. 메모리는 데이터를 일시적으로 기억하 기 위한 S램(Static Random Access Memory, S-RAM), D랩(Dynamic Random Access Memory) 등의 휘발성 메모리를 포함할 수 있다. 또한, 메모리는 제어 프로그램 및 제어 데이터를 장기간 저장하기 위한 롬(Read Only Memory), 이피롬(Erasable Programmable Read Only Memory: EPROM), 이이피롬(Electrically Erasable Programmable Read Only Memory: EEPROM) 등의 비휘발성 메모리를 포함할 수 있다. 프로세서는 각종 논리 회로와 연산 회로를 포함할 수 있으며, 메모리로부터 제공된 프로그램에 따라 데이 터를 처리하고, 처리 결과에 따라 제어 신호를 생성할 수 있다. 프로세서 및 메모리는 서버에 마련될 수 있다. 한편, 디지털 자산 커스터디 서비스의 고객은 미리 고정된 값의 가상자산만을 예치할 수 있는 검증기를 통해서 거래되는 가상자산에 대한 서비스를 받고자 할 수도 있다. 미리 고정된 값의 가상자산만을 예치할 수 있는 검증기를 통해서 거래되는 가상자산의 예시로는 이더리움이 있 다. 이더리움은 2.0 업그레이드로 인해 작업증명에서 지분증명으로 바뀌었으며, 스테이킹을 통한 지분증명으로 채굴대신 증명 수수료를 받을 수 있다. 이때, 이더리움을 예치하기 위해서는 한개의 검증기(validator)당 32ETH 라는 고정된 값을 예치해야한다. 즉, 고객은 검증기를 통해서 10ETH와 같이 32ETH로 나누어 떨어지지 않는 이더 리움에 대해서는 예치하기 어려울 수 있다. 이처럼 고객은 상대적으로 고가인 고정된 값의 가상자산을 전부 예치하는 경우가 아니면 미리 고정된 값의 가상 자산만을 예치할 수 있는 검증기를 통해서 거래되는 가상자산에 대한 서비스 이용이 어렵다는 문제가 있다. 따 라서 소량의 값의 가상자산을 예치하려는 고객에게 검증기를 운영해야 하는 부담을 줄이기 위한 스테이킹 서비 스가 제공될 필요가 있다. 도 35는 본원 발명의 실시예에 따른 스테이킹 서비스 제공 시스템에서 커스터디 시스템을 통한 자산 스테이킹을 설명하기 위한 도면이며, 도 36은 본원 발명의 실시예에 따른 커스터디 시스템을 통한 스테이킹 서비스 제공 시 스템을 도시한 도면이다.도 35 및 도 36을 참조하면, 일 실시예에 따른 스테이킹 서비스 제공 시스템이 제공하는 스테이킹 서비스는 solo 스테이킹 서비스 및 pool 스테이킹 서비스로 나뉠 수 있다. 예를 들어, 이더리움을 예치하려는 고객이 32ETH 전체를 스테이킹 하는 것은 solo 스테이킹 서비스로 제공될 수 있다. 또한, 다수의 고객들이 소량의 입금 만으로 32ETH를 모집한후 스테이킹하여 이자를 나누어 받는 방식은 pool 스테이킹 서비스로 제공될 수 있다. 스테이킹 서비스 제공 시스템은 디지털 자산 커스터디 서비스 제공자의 서버에 마련될 수 있으나 스테이킹 서비 스 제공 시스템이 반드시 서비스 제공자의 서버에 마련되는 것으로 한정되는 것은 아니다. 스테이킹 서비스 제공 시스템은 커스터디 시스템, 스마트 컨트랙트 및 스테이킹 컨트랙트를 포 함할 수 있다. 커스터디 시스템은 검증기(validator)를 통해 거래대상 가상자산을 관리하는 서비스를 제공하고, 검증기 하 나당 미리 고정된 값의 거래대상 가상자산을 예치할 수 있다. 거래대상 가상자산은 전술한 이더리움과 같이 검 증기 하나당 미리 고정된 값만 예치될 수 있는 종류의 가상자산일 수 있다. 스마트 컨트랙트는 커스터디 시스템으로부터 대납 계좌를 통해 거래 수수료를 대납받고, 위탁자 단말로부터 수신한 신호를 기초로 위탁자 단말에 대응되는 거래대상 가상자산의 거래를 수행할 수 있 다. 스마트 컨트랙트는 위탁자 단말로부터 거래대상 가상자산을 예치하고자 한다는 취지의 신호를 수 신할 수 있다. 스마트 컨트랙트가 위탁자 단말로부터 수신한 신호를 기초로, 스테이킹 컨트랙트는 검증기 하 나당 미리 고정된 값의 거래대상 가상자산을 예치할 수 있다. 도 37은 본원 발명의 실시예에 따른 검증기 디파짓 데이터를 생성하고 검증기를 등록하는 것을 설명하기 위한 도면이다. 도 37을 참조하면, 스테이킹 서비스 제공 시스템은 스테이킹 컨트랙트로 예치(Deposit)하기 전에 노드 (Node) 서버를 통해 검증기 디파짓 데이터 (Validator Deposit Data)를 생성하고, 검증기(Validator)를 Node에 등록하여 검증기를 준비하도록 구성될 수 있다. 위탁자 단말은 커스터디 시스템으로 스테이킹 서비스를 이용하고 싶다는 취지의 스테이킹 요청 신호를 송신할 수 있다. 커스터디 시스템은 위탁자 단말로부터 스테이킹 요청 신호를 수신하면, 거래대상 가상자산의 노드 (node)를 통해 검증기 디파짓 데이터(validator deposit data)를 생성할 수 있다. 커스터디 시스템은 검증기 디파짓 데이터를 기초로 검증기를 거래대상 가상자산의 노드에 등록할 수 있다. 이때, 커스터디 시스템은 검증기 디파짓 데이터를 커스터디 데이터베이스에 저장할 수 있다. 커스터 디 데이터베이스는 스테이킹 서비스를 이용하는 고객의 위탁자 단말에 대응되는 검증기 디파짓 데이 터를 저장하는 데이터베이스일 수 있다. 검증기 디파짓 데이터는 키스토어파일(keystrorefile) 및 디파짓 데이터(deposite data)를 포함할 수 있다. 커스터디 시스템은, 위탁자 단말로부터 스테이킹 요청 신호를 수신하면, 키스토어파일 및 디파짓 데이 터를 생성할 수 있다. 이후, 커스터디 시스템은 키스토어파일을 거래대상 가상자산의 노드로 송신할 수 있다. 이때, 커스터디 시 스템은 디파짓 데이터를 상기 위탁자 단말로 송신할 수 있다. 도 35, 도 36 및 도 37을 참조하면, 스터디 시스템은 어느 하나의 위탁자 단말로부터 스테이킹 요청 신호 를 수신하면, 위탁자 단말이 예치를 요청한 거래대상 가상자산의 값이 검증기 하나당 미리 고정된 값에 해 당하는지 여부를 판단할 수 있다. 커스터디 시스템은 하나의 위탁자 단말이 예치를 요청한 거래대상 가상자산의 값이 검증기 하나당 미 리 고정된 값에 해당하면, 해당 위탁자 단말에 대응되는 검증기 디파짓 데이터를 생성할 수 있다. 이때, 커스터디 시스템은 해당 위탁자 단말에 대응되는 검증기를 거래대상 가상자산의 노드에 등록할 수 있 다.커스터디 시스템은 하나의 위탁자 단말이 예치를 요청한 거래대상 가상자산의 값이 검증기 하나당 미 리 고정된 값보다 작으면, 적어도 하나 이상의 다른 위탁자 단말이 예치를 요청한 거래대상 가상자산의 값 들과 합하는 방식으로 복수개의 위탁자 단말들이 요청한 거래대상 가상자산의 값들의 합이 검증기 하나당 미리 고정된 값이 되도록 위탁자 단말들을 조합할 수 있다. 이때, 커스터디 시스템은 요청한 거래대상 가상자산의 값들의 합이 검증기 하나당 미리 고정된 값이 되도록 조합된 복수개의 위탁자 단말들에 대응되는 고유 번호를 생성할 수 있다. 조합된 복수개의 위탁자 단말들에 대응되는 고유 번호가 생성되면, 커스터디 시스템은 하나의 고유 번 호에 대응되는 검증기 디파짓 데이터를 생성하고 하나의 고유 번호에 대응되는 검증기를 거래대상 가상자산의 노드에 등록할 수 있다. 이처럼 일 실시예에 따른 스테이킹 서비스 제공 시스템은 어느 한 위탁자 단말이 예치를 요청한 거래대상 가상자산의 값이 검증기 하나당 미리 고정된 값보다 작더라도, 다른 위탁자 단말이 예치를 요청한 거래대 상 가상자산과 합쳐서 하나의 고유 번호로 묶인 그룹에 대해서 하나의 검증기가 대응되도록 하여 검증기 하나당 미리 고정된 값보다 작은 값의 거래대상 가상자산을 예치하고자 하는 고객에게도 가상자산의 예치 서비스를 제 공할 수 있다. 도 38은 본원 발명의 실시예에 따른 대납 계좌로 스테이킹을 실행하는 것을 설명하기 위한 도면이다. 도 38을 참조하면, 고객이 스마트 컨트랙트에 예치한 자산을 대납계좌를 통해 검증기 디파짓 데이터 (Validator Deposit Data)와 함께 스테이킹 실행하는 과정을 확인할 수 있다. 커스터디 시스템은, 위탁자 단말로부터 스테이킹 요청 신호를 수신하면, 대납 계좌를 통해, 위탁 자 단말이 스마트 컨트랙트에 예치한 거래대상 가상자산을 검증기 디파짓 데이터와 함께 스마트 컨트 랙트로 전달하는 방식으로 스마트 컨트랙트에 예치된 자산을 검증기 디파짓 데이터와 함께 스테이킹 을 실행할 수 있다. 도 39는 본원 발명의 실시예에 따른 언스테이킹에 의해 자산을 고객에게 전송하는 것을 설명하기 위한 도면이다. 도 39를 참조하면, 스테이킹 서비스를 이용하던 고객들 전부 또는 일부는 자신의 예치금을 찾고자 할 때 언스테 이킹의 실행을 요청할 수 있다. 스테이킹이 실행되면 대납 계좌로 고객의 원금과 이자가 입금될 수 있다. 이때, 이자에서 수수료를 수취 후 원금과 이자를 각 고객들에게 전달할 수 있다. 스마트 컨트랙트가 위탁자 단말로부터 출금 요청 신호 및 디파짓 데이터를 수신하면, 스테이킹 컨트 랙트는 대납 계좌로 위탁자 단말에 대응되는 검증기의 원금 및 이자를 입금하도록 구성될 수 있 다. 한편, 언스테이킹을 원하는 고객이 소량의 거래대상 가상자산을 예치하기 위해 고유번호에 대응되는 검증기를 통해 예치했던 고객일 경우 언스테이킹 절차가 따로 필요할 수 있다. 스테이킹 컨트랙트는 조합된 복수개의 위탁자 단말들에 대응되는 고유 번호가 생성된 후, 스마트 컨 트랙트가 고유 번호에 대응되는 위탁자 단말들 중 어느 하나의 위탁자 단말로부터 출금 요청 신 호 및 디파짓 데이터를 수신하면, 대납 계좌로 고유 번호에 대응되는 검증기의 원금 및 이자를 입금하도록 구성될 수 있다. 이때, 스마트 컨트랙트는 대납 계좌로 입금된 원금 및 이자를 고유 번호에 대응되는 위탁자 단말(10 0)들에 분배하도록 구성될 수 있다. 도 40은 본원 발명의 실시예에 따른 스테이킹 서비스 제공 시스템의 제어 방법의 순서도이다. 도 40을 참조하면, 스마트 컨트랙트는 위탁자 단말로부터 거래대상 가상자산을 예치하고자 한다는 취 지의 신호를 수신할 수 있다(S5001). 커스터디 시스템은 위탁자 단말로부터 스테이킹 요청 신호를 수신하면, 거래대상 가상자산의 노드 (node)를 통해 검증기 디파짓 데이터(validator deposit data)를 생성할 수 있다. 이때 커스터디 시스템은 검증기 디파짓 데이터를 기초로 검증기를 거래대상 가상자산의 노드에 등록할 수 있다(S5002). 커스터디 시스템은, 위탁자 단말로부터 스테이킹 요청 신호를 수신하면, 대납 계좌를 통해, 위탁 자 단말이 스마트 컨트랙트에 예치한 거래대상 가상자산을 검증기 디파짓 데이터와 함께 스마트 컨트 랙트로 전달하는 방식으로 스마트 컨트랙트에 예치된 자산을 검증기 디파짓 데이터와 함께 스테이킹 을 실행할 수 있다(S5003). 스마트 컨트랙트가 위탁자 단말로부터 출금 요청 신호 및 디파짓 데이터를 수신하면, 스테이킹 컨트 랙트는 대납 계좌로 위탁자 단말에 대응되는 검증기의 원금 및 이자를 입금하도록 구성될 수 있 다. 이때, 만약 스테이킹 컨트랙트는 조합된 복수개의 위탁자 단말들에 대응되는 고유 번호가 생성된 후, 스마트 컨트랙트가 고유 번호에 대응되는 위탁자 단말들 중 어느 하나의 위탁자 단말로부터 출금 요청 신호 및 디파짓 데이터를 수신하면, 대납 계좌로 고유 번호에 대응되는 검증기의 원금 및 이자를 입금하도록 구성될 수 있다. 이때, 스마트 컨트랙트는 대납 계좌로 입금된 원금 및 이자를 고유 번호에 대응되는 위탁자 단말(10 0)들에 분배하도록 구성될 수 있다. 도 41은 본원 발명의 일 실시예에 따른 커스터디 시스템에 기초하는 가상 자산 수탁 방법의 일부 예시를 나 타내는 흐름도이다. 도시된 바와 같이, 도 41에 개시된 방법은 커스터디 시스템, 커스터디 시스템 DB, 스마트 컨트랙트 및 스마트 컨트랙트 DB에 의해 수행될 수 있다. 한편, 도 41에서 커스 터디 시스템과 커스터디 시스템 DB이 별도의 구성으로 도시되어 있으나 이에 한정되지 않는다. 예를 들어, 커스터디 시스템 DB는 커스터디 시스템에 포함될 수 있다. 마찬가지로, 스마트 컨트랙트 DB는 스마트 컨트랙트에 포함될 수 있다. 커스터디 시스템은 복수의 난수 코드를 생성할 수 있다(S6012). 여기서, 난수 코드는 대문자 및/또는 소문 자의 알파벳을 포함하는 임의의 문자 조합을 지칭할 수 있다. 추가적으로, 커스터디 시스템은 토큰 아이디 를 생성할 수 있다. 여기서, 토큰 아이디는 하나 이상의 아라비안 숫자를 포함하는 임의의 숫자 조함을 지칭할 수 있다. 나아가, 커스터디 시스템은 임의의 난수 코드 및 임의의 토큰 아이디를 일대일로 매칭하여 후술 되는 머클 트리(merkle tree)를 위한 루트 시드(root seed)를 생성할 수 있다. 커스터디 시스템은 루트 시드를 이용하여 머클 트리 로직(merkle tree logic)을 통해 머클 트리를 획득할 수 있다(S6014). 그리고 나서, 커스터디 시스템은 머클 트리의 최하위 레벨에 배치된 루트 시드(root seed)를 커스터디 시스템 DB에 저장할 수 있다(S6016). 또한, 커스터디 시스템은 머클 트리의 최상 위 레벨에 배치된 루트(root)가 스마트 컨트랙트에 저장되도록 머클 트리의 루트 저장 요청을 스마트 컨트 랙트로 전송할 수 있다(S6018). 스마트 컨트랙트는 커스터디 시스템으로부터 머클 트리 루트 저장 요청을 수신하는 것에 응답하여, 스 마트 컨트랙트 DB에 루트(root)를 저장 할 수 있다(S6022). 도 42는 본원 발명의 일 실시예에 따른 커스터디 시스템에 기초하는 가상 자산 수탁 방법의 다른 일부 예시 를 나타내는 흐름도이다. 도시된 바와 같이, 도 42에 개시된 방법은 커스터디 시스템, 커스터디 시스템 DB, 스마트 컨트랙트 및 스마트 컨트랙트 DB에 의해 수행될 수 있다. 한편, 도 42에서 커스 터디 시스템과 커스터디 시스템 DB이 별도의 구성으로 도시되어 있으나 이에 한정되지 않는다. 예를 들어, 커스터디 시스템 DB는 커스터디 시스템에 포함될 수 있다. 마찬가지로, 스마트 컨트랙트 DB는 스마트 컨트랙트에 포함될 수 있다. 한편, 도 42에 개시된 방법은 도 41에 개시된 방법 이후 에 수행될 수 있다. 커스터디 시스템은 위탁자 단말로부터 일정한 금액의 자산에 대한 수탁 요청을 수신할 수 있다 (S6024). 그리고 나서, 커스터디 시스템은 고객을 확인하고 자산에 대한 유효성을 확인할 수 있다(S6026). 구체적으로, 커스터디 시스템은 위탁자 단말과 연관된 회원 식별 정보(예를 들어, ID)가 커스터디 시 스템 DB에 존재하는지 여부를 확인할 수 있다. 회원 식별 정보가 존재하는 경우, 커스터디 시스템은 복 수의 루트 시드 중 하나의 대상 루트 시드에 위탁자 단말과 연관된 회원 식별 정보를 매칭할 수 있다. 그 리고 나서, 회원 식별 정보 및 해당 회원 식별 정보와 매칭된 대상 루트 시드를 커스터디 시스템 DB에 기 록할 수 있다(S6028). 추가적으로, 커스터디 시스템은 일정한 금액의 자산이 유효하다고 판단하는 것에 응 답하여 스마트 컨트랙트에 디파짓 함수(deposit function)의 실행을 요청할 수 있다(S6032). 스마트 컨트랙트는 일정한 금액의 자산을 기초로 디파짓 함수를 실행할 수 있다(S6034). 그리고 나서, 스 마트 컨트랙트는 디파짓 함수를 실행한 결과 획득된 가상 자산 수탁 금액, 회원 식별 정보 및 회원 식별 정보에 가상 자산의 수탁을 위한 임의의 어드레스(address)를 매칭하여 스마트 컨트랙트 DB에 저장할 수 있다(S6036). 도 43은 본원 발명의 일 실시예에 따른 커스터디 시스템에 기초하는 가상 자산 출금 방법의 예시를 나타내 는 흐름도이다. 도시된 바와 같이, 도 43에 개시된 방법은 커스터디 시스템, 커스터디 시스템 DB, 스 마트 컨트랙트 및 스마트 컨트랙트 DB에 의해 수행될 수 있다. 한편, 도 43에서 커스터디 시스템 과 커스터디 시스템 DB이 별도의 구성으로 도시되어 있으나 이에 한정되지 않는다. 예를 들어, 커스 터디 시스템 DB는 커스터디 시스템에 포함될 수 있다. 마찬가지로, 스마트 컨트랙트 DB는 스 마트 컨트랙트에 포함될 수 있다. 추가적으로, 위탁자 단말과 수취자 단말은 도시된 바와 같 이 별도의 사용자 단말로 구성될 수 있으나, 하나의 사용자 단말로 구성될 수도 있다. 커스터디 시스템은 위탁자 단말로부터 출금 신청을 수신할 수 있다(S6038). 그리고 나서, 커스터디 시스템은 출금 신청을 기초로 복수의 루트 시드에 회원 식별 정보에 매칭된 대상 루트 시드가 존재하는 지 여부 를 확인하고(S6042), 대상 루트 시드가 존재한다고 판단하는 것에 응답하여, 스마트 컨트랙트로 출금 가부 검증 요청을 전송할 수 있다(S6044). 스마트 컨트랙트는 회원 식별 정보에 매칭된 어드레스를 통해 가상 자산 수탁 금액이 출금 신청에 기초하 는 가상 자산 출금 금액 이상인지 여부를 판단한 결과를 획득하여 커스터디 시스템으로 전송할 수 있다. 커스터디 시스템은 스마트 컨트랙트로부터 가상 자산 수탁 금액이 출금 신청에 기초하는 가상 자산 출 금 금액 이상인지 여부를 판단한 결과 수신하는 것에 응답하여, 스마트 컨트랙트로 디파짓 함수의 실행 요 청을 전송할 수 있다(S6048). 추가적으로 또는 대안적으로, 커스터디 시스템은 스마트 컨트랙트로부 터 가상 자산 수탁 금액이 출금 신청에 기초하는 가상 자산 출금 금액 이상인지 여부를 판단한 결과 수신하는 것에 응답하여, 복수의 루트 시드를 이용하여 머클 트리로부터 대상 루트 시드를 위한 머클 트리 프루프(proo f)를 획득할 수 있다. 그리고 나서, 커스터디 시스템은 스마트 컨트랙트로 머클 트리 프루프를 포함 하는 디파짓 함수의 실행 요청을 전송할 수 있다. 스마트 컨트랙트는 디파짓 함수의 실행 요청에 응답하여, 디파짓 함수를 실행할 수 있다(S6052). 스마트 컨트랙트는 디파짓 함수를 실행한 결과 출금 신청과 연관된 가상 자산 출금 금액을 획득할 수 있다. 그리 고 나서, 스마트 컨트랙트는 가상 자산 출금 금액에 대응하는 액수의 가상 자산을 수취자 단말로 전 송할 수 있다. 스마트 컨트랙트는 디파짓 함수의 실행 요청에 응답하여, 머클 트리 프루프 및 루트를 기초로 대상 루트 시드의 유효성을 확인하고(S6054), 대상 루트 시드가 유효하다고 판단하는 것에 응답하여, 디파짓 함수를 실행 한 결과 출금 신청과 연관된 가상 자산 출금 금액을 획득할 수 있다. 그리고 나서, 스마트 컨트랙트는 획득된 가상 자산 출금 금액에 대응하는 액수의 가상 자산을 수취자 단말로 전송할 수 있다(S6056). 스마트 컨트랙트는 위탁자 단말에 출금 확인증을 발급해줄 수 있다(S6058). 구체적으로, 스마트 컨 트랙트가 대상 루트 시드를 기초로 대상 루트 시드에 포함되 토큰 아이디와 상이한 다른 토큰 아이디를 생 성할 수 있다. 여기서, 다른 토큰 아이디란 출금 확인증 발급을 위한 토큰 아이디를 지칭할 수 있다. 스마트 컨트랙트는 다른 토큰 아이디를 기초로 출금 확인증을 생성하여 위탁자 단말로 전송할 수 있다. 이 경우, 다른 토큰 아이디는 출금 신청과 상이한 다른 출금 신청을 통해서 재생성되지 않도록 구성될 수 있다. 즉, 다른 토큰 아이디는 재사용이 불가능하게 구성될 수 있다. 예를 들어, 다른 토큰 아이디는 NFT(Non- Fungible Token)으로 구성될 수 있다. 이에 따라, 출금 확인증은 NFT를 위한 이미지를 포함할 수 있다. 도 44는 본원 발명의 일 실시예에 따른 가상 자산 매수 및 보관을 위한 계좌 생성 방법의 예시를 나타내는 흐름 도이다. 도시된 바와 같이, 방법은 기업 서버, 커스터디 시스템 및 은행 서버 중 적어도 하 나에 의해 실행될 수 있다. 도 44를 참고하면, 계좌 생성 방법은 커스터디 시스템과 은행 서버 사 이의 실명 계좌 계약 체결하는 단계(S7012)로 개시될 수 있다. 기업 서버는 커스터디 시스템에 지갑 생성을 요청할 수 있다(S7014). 추가적으로, 기업 서버 는 커스터디 시스템과 연동되는 은행 서버에 제1 실명 계좌 생성을 요청할 수 있다(S7016).이에 응답하여, 은행 서버는 기업 서버를 위한 제1 실명 계좌를 생성할 수 있다(S7018). 즉, 기업 서버는 은행 서버를 통해 제1 실명 계좌를 사전 획득할 수 있다. 또한, 이에 응답하여, 커스터디 시스템은 은행 서버에 기업 서버를 위한 은행 서버가 존재하는 지 여부를 확인할 수 있다(S7022). 커스터디 시스템 및/또는 은행 서버는 기업 서버의 기업 정보를 확인할 수 있다(S7024). 구 체적으로, 커스터디 시스템은 제2 실명 계좌를 통한 기업 서버의 거래 내역 정보를 기초로 제1 기 업 정보를 생성할 수 있다. 이 경우, 제1 기업 정보는 미리 결정된 주기마다 업데이트될 수 있다. 이와 유사 하게, 은행 서버는 제2 실명 계좌를 통한 기업 서버의 거래 내역 정보를 기초로 제2 기업 정보를 생성할 수 있다. 이 경우에도, 제2 기업 정보는 미리 결정된 주기마다 업데이트 될 수 있다. 추가적으로 또는 대안적으로, 은행 서버는 은행 서버와 연관된 다른 은행 서버의 제3 실명 계좌에 접근하여 획득된 정보를 기초로 제2 기업 정보를 생성할 수 있다. 커스터디 시스템 및/또는 은행 서버는 제1 기업 정보 및 제2 기업 정보 각각의 적어도 일부를 서로 비교함으로써 기업 서버의 기업 정보를 확인할 수 있다. 추가적으로 또는 대안적으로, 커스터디 시스템 및/또는 은행 서버는 제1 기업 정보 및 제2 기업 정보 각각을 분석한 결과를 기초로 기업 서버 의 기업 정보를 확인할 수도 있다. 구체적으로, 커스터디 시스템은 제1 기업 정보 및 제2 기업 정 보 각각을 기초로 기업 서버의 제1 위험 레벨 및 제2 위험 레벨을 산출할 수 있다. 그리고 나서, 커스터 디 시스템은, 제1 위험 레벨이 미리 결정된 제1 임계 범위에 포함되고, 제2 위험 레벨이 제2 위험 레벨이 미리 결정된 제2 임계 범위에 포함되는 경우, 제2 실명 계좌를 기업 서버에 부여할 수 있다. 여기서, 제 1 위험 레벨 및 제2 위험 레벨은 제1 기업 정보 및 제2 기업 정보 각각의 업데이트에 따라 업데이트 될 수 있다. 커스터디 시스템은 기업 서버로부터 제1 기업 정보를 포함하는 지갑 생성 요청을 수신하는 것에 응 답하여, 기업 서버를 위한 지갑을 생성할 수 있다(S7026). 추가적으로 또는 대안적으로, 커스터디 시스 템은 은행 서버에 제1 실명 계좌가 존재한다고 판단하는 것에 응답하여, 은행 서버로부터 획 득된 기업 서버의 제2 기업 정보 및 제1 기업 정보를 기초로 은행 서버와 연관된 제2 실명 계좌를 기업 서버에 부여할 수 있다. 도 45는 본원 발명의 일 실시예에 따른 현금 입출금 계좌를 이용한 가상 자산 매수 방법의 예시를 나타내는 흐 름도이다. 도시된 바와 같이, 방법은 기업 서버, 커스터디 시스템, 은행 서버 및 가상 자산 거래소 서버 중 적어도 하나에 의해 실행될 수 있다. 도 45를 참고하면, 가상 자산 매수 방법은 기업 서 버로부터 가상 자산 매수를 위한 현금이 입금되는 단계(S7028)로 개시될 수 있다. 다만, 커스터디 시스템 이 보유한 기업 서버의 지갑 내 현금이 존재하는 경우, 가상 자산 매수 방법은 기업 서버로부터 가 상 자수 매수 요청을 수신하는 단계로 개시될 수 있다. 커스터디 시스템은 기업 서버로부터 가상 자산 매수를 위한 현금이 입금되는 것에 응답하여, 가상 자산 거래소 서버에 지갑의 하위 지갑 생성을 요청할 수 있다. 그리고 나서, 커스터디 시스템은 가상 자산 거래소 서버를 통해 구입하여 하위 지갑에 저장된 일정 금액의 가상 자산을 지갑으로 이전 받 을 수 있다. 은행 서버는 일정 금액의 가상 자산과 연관된 정보를 획득하기 위하여 제2 실명 계좌 및 지갑 중 적어도 하나에 접근 가능하도록 구성될 수 있다. 예를 들어, 커스터디 시스템은 제2 실명 계좌 및 지갑 중 적어 도 하나에 대한 접근 권한이 부여된 API를 은행 서버에 제공하고, 은행 서버는 API를 호출함으로써 제2 실명 계좌 및 지갑 중 적어도 하나에 대한 실시간으로 접근 가능하도록 구성될 수 있다. 도 46은 본원 발명의 일 실시예에 따른 현금 입출금 계좌를 이용한 가상 자산 매도 방법의 예시를 나타내는 흐 름도이다. 도시된 바와 같이, 방법은 기업 서버, 커스터디 시스템 및 가상 자산 거래소 서버 중 적어도 하나에 의해 실행될 수 있다. 도 46을 참고하면, 가상 자산 매도 방법은 기업 서버가 커스터디 시스템에 현금 출금을 요청하는 단계(S7046)로 시작될 수 있다. 커스터디 시스템은 현금 출금 요청에 응답하여, 가상 자산 거래소 서버로 가상 자산 매수 요청 및 가상 자산을 전달할 수 있다(S7052). 이에 따라, 가상 자산 거래소 서버는 전달된 가상 자산을 하위 지갑에 할 당할 수 있다(S7052). 즉, 커스터디 시스템의 지갑에 저장된 가상 자산 중 적어도 일부가 가상 자산 거래 소 서버의 하위 지갑으로 이체될 수 있다.가상 자산 거래소 서버는 하위 지갑에 할당된 가상 자산을 매도할 수 있다(S7054). 가상 자산 거래소 서 버는 가상 자산을 매도함으로써 획득한 현금을 커스터디 시스템의 제2 실명 계좌에 입금할 수 있다. 이에 따라, 커스터디 시스템은 입금된 현금을 제2 실명 계좌에 보관할 수 있다(S7058). 그리고 나서, 커스터디 시스템은 출금을 승인하는 방식으로 기업 서버에 수수료를 제외한 현금을 반환할 수 있다(S7062)(S70). 도 47은 본원 발명의 실시예에 따른 커스터디 기반의 토큰증권 발행 관리시스템의 구성도이다. 도 47을 참고하면, 본원 발명의 실시예에 따른 커스터디 기반의 토큰증권 발행 관리시스템은 적어도 하나 의 위탁자 단말(8000: 8100 ~ 8100(n)), 수탁자 단말, 수탁자 DB를 포함할 수 있다. 단, 커스터디 기반의 토큰증권 발행 관리시스템을 구동시키기 위해 도 47에 도시된 구성요소보다 더 적은 구성요소 또는 더 많은 구성요소를 포함할 수 있다. 본 명세서에서 토큰증권이란 블록체인 기술을 기반으로 발행되는 디지털 자산에 포함되는 것으로서, 디지털 형 태로 발행되며 실제 자산에 대한 소유권을 나타내는 디지털토큰으로 구현될 수 있다. 이하, 디지털자산을 토큰 증권과 동일한 의미로 사용하여 서술하기로 한다. 적어도 하나의 위탁자 단말(8100 ~ 8100(n))은 수탁자 단말에 디지털 자산의 발행, 보관, 및 관리를 위탁하는 위탁자와 관련된 단말일 수 있다. 위탁자 단말(8100 ~ 8100(n))은 예를 들어, 디지털 자산의 발행, 보관, 및 관리를 위탁하기 위한 기업이나 기관, 조직 등의 단체(위탁자)에 소속된 단말일 수 있다. 적어도 하나의 위탁자 단말(8100 ~ 8100(n))은 디지털 자산의 발행 및 유통 계획서를 생성하고 수탁자 단말 에 제공할 수 있다. 이때, 디지털 자산의 발행 및 유통 계획서에는 디지털 자산의 발행에 대한 위탁자의 발행 및 유통 권한, 디지털 자산의 종류 및 수량, 및 디지털 자산의 유통량 및 유통시기를 포함하는 유통조건 등이 기재된 관리계획을 포함 할 수 있다. 적어도 하나의 위탁자 단말(8100 ~ 8100(n))은 예를 들어 데스크탑 PC, 랩탑, 노트북, 스마트폰, 스마트패드 등의 단말기로 제공될 수 있으나, 이에 한정되지는 않는다. 본원 발명의 실시예에서, 위탁자가 수탁자에게 위탁하는 대상인 디지털 자산은 비트코인, 이더리움 및 클레이튼 등을 포함하는 가상 화폐들 중에서 선택되는 하나 또는 복수개의 가상 화폐를 포함할 수 있다. 수탁자 단말은 적어도 하나의 위탁자 단말(8100 ~ 8100(n))로부터 디지털 자산의 발행 및 유통 계획서 를 제공받아 위탁자의 디지털 자산에 대한 발행 및 유통 권한을 검증할 수 있다. 수탁자 단말은 적어도 하나의 위탁자 단말(8100 ~ 8100(n))로부터 디지털 자산의 발행, 보관, 및 관리 를 수탁하여 적어도 하나의 위탁자 단말(8100 ~ 8100(n))로부터 요청 받은 디지털 자산을 발행, 보관, 및 관 리하는 커스터디 서비스를 제공할 수 있다. 수탁자 단말은 디지털 자산의 발행 및 유통을 포함하는 이벤트가 발생된 경우 디지털 자산과 관련된 이벤 트 정보를 적어도 하나의 수취자 단말(8400, 8500) 중 어느 하나에 제공할 수 있다. 또는, 수탁자 단말은 디지털 자산의 발행 및 유통을 포함하는 이벤트가 발생된 경우 디지털 자산과 관련 된 이벤트 정보를 적어도 하나의 수취자 단말(8400, 8500) 모두에 제공할 수 있다. 수탁자 데이터베이스(DB, 8300)는 적어도 하나의 위탁자 단말(8100 ~ 8100(n))로부터 위탁받은 디지털 자산 의 발행 및 유통 계획서에 대한 정보, 디지털 자산을 보관하는 디지털 자산 지갑 정보 등을 저장할 수 있다. 적어도 하나의 수취자 단말은 디지털 자산을 거래하기 위한 증권사 또는 거래소가 소유한 단말일 수 있다. 적어도 하나의 수취자 단말은 디지털 자산의 거래를 감시하기 위한 금융당국 또는 공시업체가 소유 한 단말일 수 있다. 도 48은 본원 발명의 실시예에 따른 커스터디 기반의 토큰증권 발행 관리시스템의 제어방법에 관한 흐름도이다. 도 49는 도 48의 단계(S8100, S8200)를 설명하기 위한 개념도이다. 이하, 도 48과 도 49를 함께 참고하여 서술하기로 한다. 위탁자 단말(8100, A)은 디지털 자산의 발행 및 유통계획서를 생성하여 커스터디 시스템에 해당하는 수탁자 단 말로 제공할 수 있다. 위탁자 단말(8100, A)은 커스터디 시스템에 해당하는 수탁자 단말에 디지털 자산(a, 또는 토큰증권)의 발행, 보관, 및 관리를 위탁할 수 있다. 구체적으로, 위탁자 단말(8100, A)은 네트워크를 통해 수탁자 단말의 커스터디 시스템에 접속하여 제휴계 약을 체결할 수 있다. 위탁자 단말(8100, A)은 회원가입을 진행하고 디지털 자산(a, 또는 토큰증권)에 대한 지 갑주소를 생성할 수 있다. 위탁자 단말(8100, A)은 수탁자 단말에 디지털 자산(a, 또는 토큰증권)의 발행에 대한 위탁자(A)의 발행 및 유통 권한, 디지털 자산(a, 또는 토큰증권)의 종류 및 수량, 및 디지털 자산(a, 또는 토큰증권)의 유통량 및 유통시기를 포함하는 유통조건 등이 기재된 관리계획을 포함하는 발행 및 유통 계획서를 제공할 수 있다 (S8100). 위탁자 단말(8100, A)은 수탁자 단말에 발행 및 유통 계획서에 포함된 디지털 자산(a, 또는 토큰증권)의 발행, 보관, 및 관리를 위탁할 수 있다. 커스터디 시스템에 해당하는 수탁자 단말은 미리 저장된 검증로직을 이용하여 발행 및 유통 계획서 로부터 위탁자(A)의 디지털 자산(a, 또는 토큰증권)에 대한 발행 및 유통 권한에 대한 검증을 수행할 수 있다 (S8200). 도 50은 도 48의 단계(S8200, S8300)를 설명하기 위한 개념도이다. 이하, 도 48과 도 50을 함께 참고하여 서술하기로 한다. 미리 저장된 검증로직에 의해 위탁자(A)의 디지털 자산(a, 또는 토큰증권)에 대한 발행 및 유통 권한이 검증된 경우 커스터디 시스템에 해당하는 수탁자 단말은 관리계획에 포함된 디지털 자산(a, 또는 토큰증 권)의 종류와 수량에 대응하여 디지털 자산(a, 또는 토큰증권)을 발행할 수 있다. 또한, 커스터디 시스템에 해당하는 수탁자 단말은 관리계획에 포함된 유통량 및 유통시기에 따른 디지털 자산(a, 또는 토큰증권)의 유통조건과 적어도 하나의 수취자 단말(8400, 8500) 중 이벤트 정보를 제공받기 위한 타겟 수취자 단말(예를 들어, 8400)을 설정하여 스마트 컨트랙트에 저장하여 보관할 수 있다(S8300). 미리 저장된 검증로직에 의해 위탁자(A)의 디지털 자산(a, 또는 토큰증권)에 대한 발행 및 유통 권한이 검증되지 않은 경우 커스터디 시스템에 해당하는 수탁자 단말은 디지털 자산(a, 또는 토큰증권)을 발행하 지 않을 수 있다. 도 51은 도 48의 단계(S8400)를 설명하기 위한 개념도이다. 이하, 도 48과 도 51을 함께 참고하여 서술하기로 한다. 수탁자 단말은 적어도 하나의 수취자 단말(8400, 8500) 중 어느 하나의 수취자 단말(이하, 타겟 수취자 단말이라 명명함)에 디지털 자산(a, 또는 토큰증권)의 발행 및 유통과 관련된 이벤트 정보를 제공할 수 있다 (S8400). 구체적으로, 수탁자 단말은 위탁자 단말(8100, A)로부터 디지털 자산의 종류 및 수량, 유통량과 유통시기 에 따른 유통조건, 및 이벤트 정보를 제공받기 위한 수취자 단말(8400 또는 8500)에 대한 정보를 미리 제공받을 수 있다. 수탁자 단말은 이벤트가 발생된 경우 위탁자 단말(8100, A)로부터 미리 제공받은 디지털 자산의 종류, 수 량, 유통량과 유통시기에 따른 유통조건, 및 이벤트 정보를 제공받기 위한 수취자 단말에 대한 정보와 관리계획 에 포함된 디지털 자산(a, 또는 토큰증권)의 종류, 수량, 유통량과 유통시기에 따른 유통조건, 및 타겟 수취자 단말에 대한 정보가 일치하는지 여부를 판단할 수 있다. 위탁자 단말(8100, A)로부터 미리 제공된 디지털 자산의 종류, 수량, 유통량과 유통시기에 따른 유통조건 및 이 벤트 정보를 제공받기 위한 수취자 단말에 대한 정보 각각과 관리계획에 포함된 디지털 자산(a, 또는 토큰증권)의 종류, 수량, 유통량과 유통시기에 따른 유통조건 및 타겟 수취자 단말에 대한 정보가 서로 일치하는 경우 스마트 컨트랙트에 보관된 디지털 자산(a, 또는 토큰증권)에 대한 이벤트 정보를 수취자 단말에 실시간으 로 제공할 수 있다(S8400). 위탁자 단말(8100, A)로부터 미리 제공된 디지털 자산의 종류, 수량, 유통량과 유통시기에 따른 유통조건 및 이 벤트 정보를 제공받기 위한 수취자 단말에 대한 정보 각각과 관리계획에 포함된 디지털 자산(a, 또는 토큰증 권)의 종류, 수량, 유통량과 유통시기에 따른 유통조건 및 타겟 수취자 단말에 대한 정보가 서로 일치하지 않는 경우 스마트 컨트랙트에 보관된 디지털 자산(a, 또는 토큰증권)에 대한 이벤트 정보를 수취자 단말에 실 시간으로 제공하지 않을 수 있다. 상술한 바와 같이 본원 발명의 실시예인 커스터디 기반의 토큰증권 발행 관리시스템은 기업(또는 위탁 자)와 증권사 또는 거래소(또는 수취자)가 코인 등을 포함하는 디지털 자산의 발행, 보관, 및 관리를 직접적으 로 수행하던 기존의 방식에서 벗어나 기업(또는 위탁자)와 증권사 또는 거래소(또는 수취자)의 사이에서 디지털 자산의 발행, 보관, 및 관리를 중계할 수 있다. 본원 발명의 실시예인 커스터디 기반의 토큰증권 발행 관리시스템은 기업(또는 위탁자)로부터 제공된 발 행 및 유통 계획서에 기초하여 기업(또는, 위탁자)의 디지털 자산에 대한 발행 및 유통 권한에 대한 검증을 수 행할 수 있다. 또한, 본원 발명의 실시예인 커스터디 기반의 토큰증권 발행 관리시스템이 디지털 자산의 발행, 보관, 및 관리를 수행함으로써 디지털 자산의 거래 및 관리 투명성을 달성할 수 있다. 도 52는은 본원 발명의 실시예에 따른 커스터디 기반의 토큰증권 유통 및 매매 관리시스템의 구성도이다. 도 52를 참고하면, 본원 발명의 실시예에 따른 커스터디 기반의 토큰증권 유통 및 매매 관리시스템은 적 어도 하나의 위탁자 단말(9100: 9100 ~ 9100(n)), 수탁자 단말, 수탁자 DB, 적어도 하나의 수 취자 단말, 적어도 하나의 사용자 단말을 포함할 수 잇다. 단, 커스터디 기반의 토큰증권 유통 및 매매 관리시스템을 구동시키기 위해 도 52에 도시된 구성요소보다 더 적은 구성요소 또는 더 많은 구성요소를 포함할 수 있다. 본 명세서에서 토큰증권이란 블록체인 기술을 기반으로 발행되는 디지털 자산에 포함되는 것으로서, 디지털 형 태로 발행되며 실제 자산에 대한 소유권을 나타내는 디지털토큰으로 구현될 수 있다. 이하, 디지털자산을 토큰 증권과 동일한 의미로 사용하여 서술하기로 한다. 적어도 하나의 위탁자 단말(9100: 9100 ~ 9100(n))은 수탁자 단말에 디지털 자산의 매입 및 매도를 위 탁하는 위탁자와 관련된 단말일 수 있다. 적어도 하나의 위탁자 단말(9100: 9100 ~ 9100(n))은 예를 들어, 디지털 자산의 매입 및 매도를 위탁하기 위한 기업이나 기관, 조직 등의 단체(위탁자)에 소속된 단말일 수 있다. 적어도 하나의 위탁자 단말(9100: 9100 ~ 9100(n))은 디지털 자산의 발행 및 유통 계획서를 생성하고 수탁자 단말에 제공할 수 있다. 이때, 디지털 자산의 발행 및 유통 계획서에는 디지털 자산의 발행 및 유통에 대한 위탁자의 발행 및 유통 권한 과 디지털 자산의 종류 및 수량과 디지털 자산의 유통량 및 유통시기를 포함하는 유통조건 등이 기재된 관리계 획을 포함할 수 있다. 적어도 하나의 위탁자 단말(9100: 9100 ~ 9100(n))은 예를 들어 데스크탑 PC, 랩탑, 노트북, 스마트폰, 스마 트패드 등의 단말기로 제공될 수 있으나, 이에 한정되지는 않는다. 본원 발명의 실시예에서, 위탁자가 수탁자에게 위탁하는 대상인 디지털 자산은 비트코인, 이더리움 및 클레이튼 등을 포함하는 가상 화폐들 중에서 선택되는 하나 또는 복수개의 가상 화폐를 포함할 수 있다. 적어도 하나의 위탁자 단말(9100: 9100 ~ 9100(n))은 이후 서술할 적어도 하나의 사용자 단말과 적어 도 하나의 수취자 단말로부터 제공된 디지털 자산의 매입 또는 매도에 대해 승인을 수탁자 단말에 지시할 수 있다. 수탁자 단말은 적어도 하나의 위탁자 단말(9100: 9100 ~ 9100(n))로부터 디지털 자산의 발행 및 유통 계획서를 미리 제공받을 수 있다.수탁자 단말은 미리 제공받은 디지털 자산의 발행 및 유통 계획서에 따라서 디지털 자산을 발행할 수 있 다. 수탁자 단말은 미리 제공된 디지털 자산의 발행 및 유통 계획서에 기초하여 적어도 하나의 위탁자 단말 로부터 제공된 승인의 지시를 검증하고 디지털 자산을 매도하거나 매입할 수 있다. 수탁자 단말은 디지털 자산의 매도나 매입 등의 이벤트가 발생된 경우 디지털 자산과 관련된 이벤트 정보 를 적어도 하나의 수취자 단말에 실시간으로 제공할 수 있다. 수탁자 데이터베이스(DB, 9300)는 적어도 하나의 위탁자 단말(9100: 9100 ~ 9100(n))로부터 제공받은 디지털 자산의 발행 및 유통 계획서에 대한 정보, 디지털 자산의 매도 또는 매입에 따른 변동정보, 디지털 자산을 보관 하는 디지털 자산 지갑 정보 등을 저장할 수 있다. 적어도 하나의 수취자 단말은 디지털 자산을 거래하기 위한 증권사 또는 거래소가 소유한 단말일 수 있다. 또는, 디지털 자산의 거래를 감시하기 위한 금융당국 또는 공시업체가 소유한 단말일 수 있다. 적어도 하나의 수취자 단말은 수탁자 단말로부터 디지털 자산과 관련된 이벤트 정보를 실시간으로 제공받아 공시할 수 있다. 예를 들어, 적어도 하나의 수취자 단말은 수탁자 단말이 보관한 디지털 자산의 종류 및 수량, 위탁 자의 발행 권한과 유통 권한, 디지털 자산의 유통량과 유통시기, 및 디지털 자산의 매입 또는 매도에 따른 변동 사항을 포함하는 이벤트 정보를 공시할 수 있다. 적어도 하나의 사용자 단말은 적어도 하나의 수취자 단말에 공시된 이벤트 정보에 기초하여 적어도 하나의 수취자 단말에 디지털 자산의 매입 또는 매도를 요청할 수 있다. 적어도 하나의 사용자 단말은 수탁자 단말에서 수행되는 지시의 검증의 결과에 따라서 수탁자 단말 로부터 디지털 자산을 매입하거나 수탁자 단말에 디지털 자산을 매도할 수 있다. 도 53은 본원 발명의 실시예에 따른 커스터디 기반의 토큰증권유통 및 매매 관리시스템의 제어방법에 관한 흐름 도이다. 도 54는 도 53의 단계(S9100 ~ S9400)를 설명하기 위한 개념도이다. 이하, 도 53과 도 54를 함께 참고하여 서술하기로 한다. 적어도 하나의 수취자 단말(9400, C)는 수탁자 단말로부터 수탁자 단말이 보관한 디지털 자산(a, 또는 토큰증권)의 종류 및 수량, 위탁자(B)의 발행 권한과 유통 권한, 디지털 자산(a, 또는 토큰증권)의 유통량 과 유통 시기, 및 디지털 자산(a, 또는 토큰증권)의 매입 또는 매도에 따른 변동사항을 포함하는 이벤트 정보를 실시간으로 제공받아 공시할 수 있다(S9100). 적어도 하나의 사용자 단말(9400, A)는 적어도 하나의 수취자 단말(9400, C)에 공시된 이벤트 정보에 기초하여 디지털 자산의 매입 또는 매도를 적어도 하나의 수취자 단말(9400, C)에 요청할 수 있다(S9200). 적어도 하나의 수취자 단말(9400, C)는 적어도 하나의 사용자 단말(9400, A)로부터 제공된 요청에 포함된 디지 털 자산의 종류, 수량과 매입시기 또는 매도시기에 따라 적어도 하나의 위탁자 단말(9100, B)에 디지털 자산의 매입 또는 매도를 요청할 수 있다(S9200). 적어도 하나의 위탁자 단말(9100, A)은 요청에 대응하여 디지털 자산의 매입 또는 매도의 승인을 수탁자 단말 에 지시할 수 있다(S9300). 수탁자 단말은 미리 저장된 검증 로직(9201, 도 55 참고)을 이용하여 지시를 검증하고 검증 결과에 따라 적어도 하나의 사용자 단말(9400, A)로부터 디지털 자산(a, 또는 토큰증권)을 매입하거나 적어도 하나의 사용자 단말(9400, A)에 디지털 자산(a, 또는 토큰증권)을 매도할 수 있다(S9400). 도 55는 본원 발명의 실시예에 따른 지시를 검증하고 디지털 자산(또는, 토큰증권)의 매입 또는 매도를 설명하 기 위한 개념도이다. 수탁자 단말은 미리 저장된 검증 로직을 이용하여 발행 및 유통 계획서로부터 위탁자의 디지털 자 산에 대한 발행 권한과 유통 권한의 검증을 수행할 수 있다. 수탁자 단말은 위탁자의 디지털 자산에 대한 발행 권한과 유통 권한에 대한 검증이 완료되지 않은 경우 사용자 단말(9400, A)로부터 디지털 자산을 매입하지 않거나 사용자 단말(9400, A)에 디지털 자산을 매도하지 않을 수 있다. 수탁자 단말은 적어도 하나의 수취자 단말(9500, C)로부터 공시된 이벤트 정보를 실시간으로 제공받을 수 있다. 수탁자 단말은 위탁자의 발행 권한과 유통 권한에 대한 검증이 완료되고 사용자(A)의 요청에 포함된 디지 털 자산의 종류와 수량, 매입시기 또는 매도시기가 공시된 이벤트 정보와 발행 및 유통 계획서에 포함된 디지털 자산에 대한 정보와 모두 일치하는 경우 사용자(A)의 요청에 포함된 매입시기 또는 매도시기에 종류와 수량에 해당하는 디지털 자산을 적어도 하나의 사용자 단말(A)로부터 매입하거나 매도할 수 있다. 수탁자 단말은 위탁자의 발행 권한과 유통 권한에 대한 검증이 완료되고 사용자(A)의 요청에 포함된 디지 털 자산의 종류와 수량, 매입시기 또는 매도시기가 공시된 이벤트와 발행 및 유통 계획서 중 적어도 어느 하나 에 포함된 디지털 자산에 대한 정보와 일치하지 않는 경우 적어도 하나의 사용자 단말(A)로부터 디지털 자산을 매입하지 않거나 적어도 하나의 사용자 단말(A)에 디지털 자산을 매도하지 않을 수 있다. 수탁자 단말은 디지털 자산의 매입 또는 매도에 따라 발생되는 이벤트 정보를 적어도 하나의 수취자 단말 (9500, C)에 실시간으로 제공할 수 있다. 적어도 하나의 수취자 단말(9500, C)은 이벤트 정보를 실시간으로 제공받아 공시할 수 있으며, 이는 적어도 하 나의 위탁자 단말(9100, B)과 적어도 하나의 사용자 단말(9400, A)에 공유되어 확인될 수 있다. 상술한 바와 같이 본원 발명의 실시예인 커스터디 기반의 토큰증권 유통 및 매매 관리시스템은 고객(또는, 사용자)와 기업(또는, 위탁자) 간의 디지털 자산의 매입 또는 매도하거나 고객(또는 사용자)와 증권 사 또는 거래소(또는 수취자) 간의 디지털 자산의 매입 또는 매도하던 기존의 방식에서 벗어나 고객(또는 사용 자)와 증권사 또는 거래소(또는 수취자)의 사이에서 디지털 자산의 매입 또는 매도를 중계할 수 있다. 본원 발명의 실시예인 커스터디 기반의 토큰증권 유통 및 매매 관리시스템은 고객(또는, 사용자)로부터 요청된 디지털 자산의 매입 또는 매도에 대응하여 기업(또는, 위탁자)로부터 승인의 지시를 검증할 수 있다. 구체적으로, 기업(또는, 위탁자)의 디지털 자산에 대한 매입 또는 매도의 승인 권한에 대한 검증을 수행할 수 있다. 또한, 본원 발명의 실시예인 커스터디 기반의 토큰증권 유통 및 매매 관리시스템은 증권사 또는 거래소 (또는, 수취자)에 공시된 이벤트 정보를 실시간으로 제공받고 고객(또는 사용자)의 요청사항이 이벤트 정보와 미리 제공된 디지털 자산에 대한 발행 및 유통 계획서에 모두 일치되는 경우에 한해 디지털 자산을 매입하거나 매도하여 거래 및 관리의 투명성을 달성할 수 있다. 이상에서 설명된 실시예들은 하드웨어 구성요소, 소프트웨어 구성요소, 및/ 또는 하드웨어 구성요소 및 소프트 웨어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치, 방법 및 구성요소는, 예를 들어, 프로세서, 컨트롤러, ALU(Arithmetic Logic Unit), 디지털 신호 프로세서(Digital Signal Processor), 마이크로컴퓨터, FPGA(Field Programmable Gate Array), PLU(Programmable Logic Unit), 마이크로프로세서, 또 는 명령(instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특 수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제 및 상기 운영 체제 상에서 수행되는 하나 이상의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있 다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설명된 경우도 있지만, 해당 기술 분야에서 통 상의 지식을 가진 자는 처리 장치가 복수 개의 처리 요소(Processing Element) 및/또는 복수 유형의 처리요소를 포함할 수 있음을 이해할 것이다. 예를 들어, 처리 장치는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 컨트롤러를 포함할 수 있다. 또한, 병렬 프로세서(Parallel Processor) 와 같은, 다른 처리 구성(Processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(Computer Program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/ 또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하 여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치에 구체화(embody) 될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분 산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매체 에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독 으로 또는 조합하여 포함할 수 있다. 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계되고 구성 된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CDROM, DVD와 같은 광기록 매체(optical media) 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로 그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러 에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 실시예의 동작을 수행하기 위해 하나 이상의 소프트 웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다."}
{"patent_id": "10-2023-0062315", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 청구범위와 균등한 것들도 후술하는 청구범위의 범위에 속 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16 도면17 도면18 도면19 도면20 도면21 도면22 도면23 도면24 도면25 도면26 도면27 도면28 도면29 도면30 도면31 도면32 도면33 도면34 도면35 도면36 도면37 도면38 도면39 도면40 도면41 도면42 도면43 도면44 도면45 도면46 도면47 도면48 도면49 도면50 도면51 도면52 도면53 도면54 도면55"}
{"patent_id": "10-2023-0062315", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본원 발명의 실시예에 따른 스마트 컨트랙트를 활용한 토큰 출금 거래 수수료 대납 시스템의 구성도이다. 도 2는 본원 발명의 실시예에 따른 스마트 컨트랙트를 활용한 토큰 출금 거래 수수료 대납 방법의 순서도이다. 도 3은 도 2의 단계 S100을 설명하기 위한 개념도이다. 도 4는 도 2의 단계 S200을 설명하기 위한 개념도이다. 도 5는 도 2의 단계 S300을 설명하기 위한 개념도이다. 도 6은 도 2의 단계 S400을 설명하기 위한 개념도이다. 도 7은 본원 발명의 실시예에 따른 디지털 자산 커스터디 시스템을 구성하는 수탁자 단말의 구성도이다. 도 8은 본원 발명의 실시예에 따른 디지털 자산 커스터디 시스템의 개념도이다. 도 9는 본원 발명의 실시예에 따른 디지털 자산 관리 방법의 신청자 계정 및 승인자 계정을 생성하는 과정을 나 타낸 순서도이다. 도 10은 본원 발명의 실시예에 따른 디지털 자산 관리 방법의 디지털 자산 관리 신청 및 승인 과정을 나타낸 순 서도이다. 도 11은 본원 발명의 다른 실시예에 따른 디지털 자산 관리 방법의 디지털 자산 관리 신청 및 승인 과정을 나타 낸 순서도이다. 도 12는 본원 발명의 일 실시예에 따른, 커스터디 시스템의 전체적인 개요를 나타내는 도면이다. 도 13은 본원 발명의 일 실시예에 따른, 머신러닝 기반으로 디지털 자산 커스터디 고객의 자산을 운용하는 방법 을 나타내는 순서도이다. 도 14는 고객으로부터 디지털 자산이 수탁되는 단계를 개념적으로 나타내는 도면이다. 도 15는 거래소로부터 수집된 디지털 자산 거래 데이터의 예시적인 형태를 나타내는 도면이다. 도 16은 도 13의 S330 단계를 더욱 구체화한 일 실시예를 나타내는 순서도이다.도 17은 고객 설문을 통해 투자 성향을 분석하는 단계를 개념적으로 나타내는 도면이다. 도 18은 고객 투자 성향을 기초로 적절한 포트폴리오를 구성하여 고객 자산 투자 대행을 하는 단계를 개념적으 로 나타내는 도면이다. 도 19는 본원 발명의 일 실시예에 따른 디지털 자산 커스터디 시스템을 구성하는 디지털 자산 투자 대행 분석 시스템의 구성도이다. 도 20은 본원 발명의 실시예에 따른 디지털 자산 커스터디 시스템을 구성하는 인공지능부의 개념도이다. 도 21은 본원 발명의 실시예에 따른 커스터디 시스템을 컴퓨팅 장치로 구현한 예를 설명하기 위한 도면이다. 도 22는 본원 발명의 일 실시예에 따른 디지털 자산 커스터디 서비스 제공 시스템의 블록도이다. 도 23은 본원 발명의 일 실시예에 따른 디지털 자산 커스터디 서비스의 검증 방법의 순서도이다. 도 24는 본원 발명의 일 실시예에 따른 디지털 자산 커스터디 서비스의 거래 기록 공시 방법의 순서도이다. 도 25는 블록체인 네트워크를 이용한 거래 데이터 기록 방법을 설명하기 위한 예시 도면이다. 도 26은 거래 기록 공시 방법을 설명하기 위한 예시 도면이다. 도 27은 본원 발명의 다른 일 실시예에 따른 디지털 자산 커스터디 서비스 제공 시스템의 블록도이다. 도 28은 본원 발명의 일 실시예에 따른 대체 불가능 토큰을 이용하여 프리미엄 서비스를 제공하는 디지털 자산 커스터디 서비스 제공 방법의 순서도이다. 도 29는 서비스 이용 권리가 포함된 대체 불가능 토큰의 발행을 설명하기 위한 예시적인 도면이다. 도 30은 본원 발명의 실시예에 따른 이상 거래 탐지 시스템의 구성도이다. 도 31은 본원 발명의 실시예에 따른 가상자산 커스터디 서비스를 이용하는 고객들의 입출금 데이터를 도시한 표 이다. 도 32는 본원 발명의 실시예에 따른 머신러닝 기반의 이상 거래 탐지 방법을 설명하기 위한 도면이다. 도 33은 본원 발명의 실시예에 따른 이상 거래 탐지 시스템의 제어 방법의 순서도이다. 도 34는 본원 발명의 실시예에 따라 이상 거래로 판단된 위탁자 단말에 대한 조치 방법의 순서도이다. 도 35는 본원 발명의 실시예에 따른 스테이킹 서비스 제공 시스템에서 커스터디 시스템을 통한 자산 스테이킹을 설명하기 위한 도면이다. 도 36은 본원 발명의 실시예에 따른 커스터디 시스템을 통한 스테이킹 서비스 제공 시스템을 도시한 도면이다. 도 37은 본원 발명의 실시예에 따른 검증기 디파짓 데이터를 생성하고 검증기를 등록하는 것을 설명하기 위한 도면이다. 도 38은 본원 발명의 실시예에 따른 대납 계좌로 스테이킹을 실행하는 것을 설명하기 위한 도면이다. 도 39는 본원 발명의 실시예에 따른 언스테이킹에 의해 자산을 고객에게 전송하는 것을 설명하기 위한 도면이다. 도 40은 본원 발명의 실시예에 따른 스테이킹 서비스 제공 시스템의 제어 방법의 순서도이다. 도 41은 본원 발명의 일 실시예에 따른 커스터디 시스템에 기초하는 가상 자산 수탁 방법의 일부 예시를 나타내 는 흐름도이다. 도 42는 본원 발명의 일 실시예에 따른 커스터디 시스템에 기초하는 가상 자산 수탁 방법의 다른 일부 예시를 나타내는 흐름도이다. 도 43은 본원 발명의 일 실시예에 따른 커스터디 시스템에 기초하는 가상 자산 출금 방법의 예시를 나타내는 흐 름도이다. 도 44는 본원 발명의 일 실시예에 따른 가상 자산 매수 및 보관을 위한 계좌 생성 방법의 예시를 나타내는 흐름 도이다.도 45는 본원 발명의 일 실시예에 따른 현금 입출금 계좌를 이용한 가상 자산 매수 방법의 예시를 나타내는 흐 름도이다. 도 46은 본원 발명의 일 실시예에 따른 현금 입출금 계좌를 이용한 가상 자산 매도 방법의 예시를 나타내는 흐 름도이다. 도 47은 본원 발명의 실시예에 따른 커스터디 기반의 토큰증권 발행 관리시스템의 구성도이다. 도 48은 본원 발명의 실시예에 따른 커스터디 기반의 토큰증권 발행 관리시스템의 제어방법에 관한 흐름도이다. 도 49는 도 48의 단계(S8100, S8200)를 설명하기 위한 개념도이다. 도 50은 도 48의 단계(S8200, S8300)를 설명하기 위한 개념도이다. 도 51은 도 48의 단계(S8400)를 설명하기 위한 개념도이다. 도 52는 본원 발명의 실시예에 따른 커스터디 기반의 토큰증권 유통 및 매매 관리시스템의 구성도이다. 도 53은 본원 발명의 실시예에 따른 커스터디 기반의 토큰증권 유통 및 매매 관리시스템의 제어방법에 관한 흐 름도이다. 도 54는 도 53의 단계(S9100 ~ S9400)를 설명하기 위한 개념도이다. 도 55는 본원 발명의 실시예에 따른 지시를 검증하고 디지털 자산(또는, 토큰증권)의 매입 또는 매도를 설명하 기 위한 개념도이다."}
