{"patent_id": "10-2023-0040513", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0145720", "출원번호": "10-2023-0040513", "발명의 명칭": "뇌전증 진단 및 치료를 위한 전자약.", "출원인": "오션스바이오 주식회사", "발명자": "이현웅"}}
{"patent_id": "10-2023-0040513", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "신경 신호 측정 및 신경 자극 신호를 수신 받는 전극 슈트부;상기 측정된 신경 신호를 증폭하기 위한 앰프부;상기 신경 신호 데이터 처리를 위한 신호 처리부;낮은 주파수의 신호를 통과시키는 저역필터부;상기 전극 슈트부와 연결되는 복수의 스위치를 제어하는 프로세서부; 및상기 신경 자극 신호를 전달하는 자극부를 포함하며,상기 전극 슈트부는,상기 신경 신호를 상기 앰프부로 전달하기 위한 채널 전극;상기 신경 자극 신호 및 신경 신호 중 적어도 어느 하나의 기준 전위 역할을 하는 접지 전극; 및상기 신경 신호를 측정할 때, 비교 전위 역할을 하는 참조 전극을 더 포함하며,상기 상기 전극 슈트부는,매트릭스 구조를 가지며, 상기 자극부로부터 특정 전극에 상기 신경 자극 신호를 수신하여 동작하기 위해 각 전극의 전극 스위치를 포함하고,상기 저역필터부는,상기 신경 신호의 노이즈를 제거하며, 상기 신경 신호만 통과하도록하는 것을 특징으로 하는 전자약."}
{"patent_id": "10-2023-0040513", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 자극부는,제1 신경 자극 신호를 전달하기 위해, 제1 전극의 채널 스위치를 온(ON)하며, 제1 전극을 제외한 나머지 전극의접지 스위치를 온(ON)하는 것을 특징으로 하는 전자약."}
{"patent_id": "10-2023-0040513", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 전극 슈트부는,상기 신경 자극 신호를 측정 및 상기 신경 측정을 동시에 하기 위하여 제1 전극의 채널 스위치 및 제2 전극의참조 스위치를 온(ON)하는 것을 특징으로 하는 전자약."}
{"patent_id": "10-2023-0040513", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 자극부는,상기 신경 신호의 주파수 보다 높은 주파수의 상기 신경 자극 신호를 상기 전극 슈트부에 전달하는 것을 특징으로 하는 전자약."}
{"patent_id": "10-2023-0040513", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2024-0145720-3-제1항에 있어서,신경 신호를 측정하여 측정된 상기 신경 신호를 토대로 신경을 자극하는 전자약;데이터를 처리하는 센서데이터 처리모듈부; 및 센서데이터를 전송하는 센서데이터 전송모듈부;를 포함하는 엣지시스템;상기 엣지 시스템의 이동성 향상을 위한 이동통신 브릿지; 및무선 통신 서버와 연결하기 위한 상기 이동통신 중계기를 포함하는 것인 인 전자약."}
{"patent_id": "10-2023-0040513", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 엣지 시스템의 센서데이터 처리모듈부로부터 데이터를 전송 및 수신하는 서버 데이터 처리모듈부; 및 상기엣지 시스템의 센서데이터 전송모듈부로부터 수신받은 데이터를 저장하는 센서데이터 데이터베이스(DB,Database)를 포함하는 인공지능 시스템 서버를 더포함하는 전자약."}
{"patent_id": "10-2023-0040513", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 전자약은, 매트릭스 구조를 가지는 전극 슈트를 포함하며, 상기 전극 슈트를 통해 동일 동작에서의 상기 신경 신호를 측정하는 것을 특징으로 하는 전자약."}
{"patent_id": "10-2023-0040513", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 인공지능 시스템 서버는,상기 신경 신호의 복수 측정을 통해 상기 복수 측정동안 전달되는 신경자극 신호를 기반으로 인공지능 학습을수행하며, 복수 회의 인공지능 학습을 수행하여 뉴럴 네트워크 가중치를 계산하는 것을 특징으로 하는 전자약."}
{"patent_id": "10-2023-0040513", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 인공지능 학습 시스템은,상기 인공지능 학습 시스템을 통해 학습된 학습 데이터 및 상기 다층 뉴럴 네트워크 가중치를 통해 예측 데이터를 생성하는 인공지능 예측 시스템을 더 포함하고,상기 인공지능 예측 시스템은,측정된 실시간 신경 신호 및 상기 예측 데이터를 수신 받고, 상기 다층 뉴럴 네트워크 가중치를 통해 상기 신경자극 신호를 복수의 전극 중 적어도 하나 이상의 전극으로 전달하도록 제어 신호를 상기 전자약에 전달 하는 것을 특징으로 하는 전자약.."}
{"patent_id": "10-2023-0040513", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "전극 슈트부에서 수행되며, 신경 신호 측정 및 신경 자극 신호를 수신하는 신경 신호 측정 및 신경 자극 단계;앰프부에서 수행되며, 상기 측정된 신경 신호를 증폭하기 위한 증폭단계;신호 처리부에서 수행되며, 상기 신경 신호 데이터 처리를 위한 데이터 처리 단계;자극부에서 수행되며 상기 신경 자극 신호를 전달하는 자극 신호 전달 단계;저역필터부에서 수행되며, 낮은 주파수의 신호를 통과시키는 저역필터 단계; 및프로세서부에서 수행되며, 상기 전극 슈트부와 연결되는 복수의 스위치를 제어하는 제어단계를 포함하며,공개특허 10-2024-0145720-4-상기 저역필터 단계는,상기 신경 신호의 노이즈를 제거하며, 상기 신경 신호만 통과하도록하는 단계를 통해 수행되는 것인 전자약."}
{"patent_id": "10-2023-0040513", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 뇌전증 진단 및 치료를 위한 전자약에 관한 것이다. 본 발명에 따르면, 신경 신호 측정 및 신경 자극 신호를 수신 받는 전극 슈트부; 상기 측정된 신경 신호를 증폭 하기 위한 앰프부; 상기 신경 신호 데이터 처리를 위한 신호 처리부; 낮은 주파수의 신호를 통과시키는 저역필터 (뒷면에 계속)"}
{"patent_id": "10-2023-0040513", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 뇌전증 진단 및 치료를 위한 전자약에 관한 것으로서, 신경 신호를 측정하여, 측정된 신경 신호를 증 폭 후 필터부를 이용하여 신경 신호만을 통과 시킨 후, 통과된 신경 신호를 토대로 자극이 필요 한 신경 위치에 자극을 하는 뇌전증 진단 및 치료를 위한 전자약에 관한 것이다."}
{"patent_id": "10-2023-0040513", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "뇌전증(간질)은 뇌 신경세포가 일시적으로 이상을 일으켜 과도한 흥분 상태를 유발함으로써 나타나는 의식 소실, 발작, 행동 변화 등과 같은 뇌 기능의 일시적 마비 증상이 만성적, 반복적으로 발생하는 뇌 질환이다, 뇌전증을 진단하기위해서는 발작이 언제 어떻게 일어나고, 발작 시에 눈과 손이 어떤 모양이었으며, 발작이 얼 마나 지속되었는지, 환자가 반응했는지, 환자가 기억하는지에 대한 문진표를 작성하고, 뇌자기 공명영상(MRI), 뇌파 검사(EEG), 양전자 방출 단층촬영법(PET)을 시행한다. 그러나, 이러한 뇌전증을 효과적으로 진단 및 치료하기 위해서는 해당 신경의 신호를 정확하게 파악하여, 그 의 도에 맞는 신경자극을 주는 인공지능 기반 전자약 시스템이 필요한 실정이다."}
{"patent_id": "10-2023-0040513", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 신경 신호를 측정하며, 측정된 신경 신호를 증폭 후 저역 필터부를 이용하여 신경 신호만을 통과 시 킨 후, 통과된 신경 신호를 토대로 자극이 필요한 신경 위치에 자극을 하는 전자약에 관한 것이다."}
{"patent_id": "10-2023-0040513", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위해 본 발명의 뇌전증 진단 및 치료를 위한 전자약은 신경 신호 측정 및 신경 자극 신호 를 수신 받는 전극 슈트부; 상기 측정된 신경 신호를 증폭하기 위한 앰프부; 상기 신경 신호 데이터 처리를 위 한 신호 처리부; 낮은 주파수의 신호를 통과시키는 저역필터부; 상기 전극 슈트부와 연결되는 복수의 스위치를 제어하는 프로세서부; 및 상기 신경 자극 신호를 전달하는 자극부를 포함하며, 상기 전극 슈트부는, 상기 신경 신호를 상기 앰프부로 전달하기 위한 채널 전극; 상기 신경 자극 신호 및 신경 신호 중 적어도 어느 하나의 기 준 전위 역할을 하는 접지 전극; 및 상기 신경 신호를 측정할 때, 비교 전위 역할을 하는 참조 전극을 더 포함 하며, 상기 상기 전극 슈트부는, 매트릭스 구조를 가지며, 상기 자극부로부터 특정 전극에 상기 신경 자극 신호 를 수신하여 동작하기 위해 각 전극의 전극 스위치를 포함하고, 상기 저역필터부는, 상기 신경 신호의 노이즈를 제거하며, 상기 신경 신호만 통과하도록하는 것을 특징으로 한다. 상기 자극부는, 제1 신경 자극 신호를 전달하기 위해, 제1 전극의 채널 스위치를 온(ON)하며, 제1 전극을 제외 한 나머지 전극의 접지 스위치를 온(ON)하는 것을 특징으로 한다. 상기 전극 슈트부는, 상기 신경 자극 신호를 측정 및 상기 신경 측정을 동시에 하기 위하여 제1 전극의 채널 스 위치 및 제2 전극의 참조 스위치를 온(ON)하는 것을 특징으로 한다, 상기 자극부는, 상기 신경 신호의 주파수 보다 높은 주파수의 상기 신경 자극 신호를 상기 전극 슈트부에 전달 하는 것을 특징으로 한다. 신경 신호를 측정하여 측정된 상기 신경 신호를 토대로 신경을 자극하는 전자약; 데이터를 처리하는 센서데이터 처리모듈부; 및 센서데이터를 전송하는 센서데이터 전송모듈부;를 포함하는 엣지 시스템; 상기 엣지 시스템의 이동성 향상을 위한 이동통신 브릿지; 및 무선 통신 서버와 연결하기 위한 상기 이동통신 중계기를 포함한다, 상기 엣지 시스템의 센서데이터 처리모듈부로부터 데이터를 전송 및 수신하는 서버 데이터 처리모듈부; 및 상기 엣지 시스템의 센서데이터 전송모듈부로부터 수신받은 데이터를 저장하는 센서데이터 데이터베이스(DB, Database)를 포함하는 인공지능 시스템 서버를 더포함한다.상기 전자약은, 매트릭스 구조를 가지는 전극 슈트를 포함하며, 상기 전극 슈트를 통해 동일 동작에서의 상기 신경 신호를 측정하는 것을 특징으로 한. 상기 인공지능 시스템 서버는, 상기 신경 신호의 복수 측정을 통해 상기 복수 측정동안 전달되는 신경자극 신호 를 기반으로 인공지능 학습을 수행하며, 복수 회의 인공지능 학습을 수행하여 뉴럴 네트워크 가중치를 계산하는 것을 특징으로 한다. 상기 인공지능 학습 시스템은, 상기 인공지능 학습 시스템을 통해 학습된 학습 데이터 및 상기 다층 뉴럴 네트 워크 가중치를 통해 예측 데이터를 생성하는 인공지능 예측 시스템을 더 포함하고, 상기 인공지능 예측 시스템 은, 측정된 실시간 신경 신호 및 상기 예측 데이터를 수신 받고, 상기 다층 뉴럴 네트워크 가중치를 통해 상기 신경 자극 신호를 복수의 전극 중 적어도 하나 이상의 전극으로 전달하도록 제어 신호를 상기 전자약에 전달 하 는 것을 특징으로 한다. 전극 슈트부에서 수행되며, 신경 신호 측정 및 신경 자극 신호를 수신 하는 신경 신호 측정 및 신경 자극 단계; 앰프부에서 수행되며, 상기 측정된 신경 신호를 증폭하기 위한 증폭단계; 신호 처리부에서 수행되며, 상기 신경 신호 데이터 처리를 위한 데이터 처리 단계; 자극부에서 수행되며 상기 신경 자극 신호를 전달하는 자극 신호 전달 단계; 저역필터부에서 수행되며, 낮은 주파수의 신호를 통과시키는 저역필터 단계; 및 프로세서부에서 수 행되며, 상기 전극 슈트부와 연결되는 복수의 스위치를 제어하는 제어단계를 포함하며, 상기 저역필터 단계는, 상기 신경 신호의 노이즈를 제거하며, 상기 신경 신호만 통과하도록하는 단계를 통해 수행된다."}
{"patent_id": "10-2023-0040513", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 신경 부위를 자극하여 동작을 유도하며, 반복된 동작에 대한 신경 신호를 학습한 후, 예측 하여 신경에 자극 신호를 통해 신경 신호에 맞는 동작을 할 수 있는 이점을 가진다."}
{"patent_id": "10-2023-0040513", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시예가 첨부된 도면을 참조하여 기재된다. 본 발명은 특정 실시예에 대해 한정되지 아니며, 본 발명의 실시예들의 다양한 변경(modification), 균등물(equivalent), 및/또는 대체물(alternativ e)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부 호가 사용될 수 있다. 본원에서, \"가진다\", \"가질 수 있다\", \"포함한다\", 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기 능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본원에서, \"A 또는 B\", \"A 또는/및 B 중 적어도 하나\", 또는 \"A 또는/및 B 중 하나 또는 그 이상\" 등의 표현은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B\", \"A 및 B 중 적어도 하나\", 또는 \"A 또는 B 중 적어도 하나\"는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어 도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 본원에서 사용된 \"제1\", \"제2\", \"첫째\", 또는 \"둘째\" 등의 표현들은 다양한 구성요소들을, 순서 및/또는 중요도 에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들을 한정 하지 않는다. 예를 들면, 본원에 기재된 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 바꾸어 명명될 수 있다. 본원에서 사용된 용어들은 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 다른 실시예의 범위를 한정하려 는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있"}
{"patent_id": "10-2023-0040513", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본원에 기재된 기술분야에서 통상의 지 식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 본원에 사용된 용어들 중 일반적인 사전에 정의된 용어들은 관련 기술의 문맥상 가지는 의미와 동일 또는 유사 한 의미로 해석될 수 있으며, 본원에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해 석되지 않는다. 경우에 따라서, 본원에서 정의된 용어일지라도 본원의 실시예들을 배제하도록 해석될 수 없다.이하 첨부된 도면 및 실시예를 통하여 본 발명을 상세히 설명하기로하며, 하기에서 본 발명을 설명함에 있어 관 련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 에는 그에대해 상세한 설명을 생략하였다. 그리고 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로써, 이는 사용자, 운용자의 의도 또 는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것 이다. 전자약은 전극 슈트부, 앰프부, 신호 처리부, 저역필터부, 프로세서부, 자극부을 포함한다. 여기에서, 전극 슈트부는 전극 패드를 포함하며, 전극 패드를 통해 특정 부위의 신경 신호를 측정할 수 있으며, 신경 자극 신호를 수신 받을 수 있다. 전극 슈브부를 통해 신경 신호 및 신경 자극 신호를 수신 받은 후, 앰프 부는 신경 신호 및 신경 자극 신호 중 적어도 어느 하나의 신호를 증폭 시킨다. 앰프부를 통해 증폭된 신경 신 호 및 신경 자극 신호 중 적어도 어느 하나의 신호는 신호 처리부를 통해 신경 신호의 데이터 처리를 하며, 여 기에서 데이터 처리란, 디지털화된 신호를 원하는 방향으로 정보 신호를 수정하거나 개선할 목적으로 알고리즘 에 의해 수치적으로 처리하는 것을 의미며, 보통 아날로그 신호를 디지털화하는 과정에서 이산 신호가 되고 수 치화 되는 것을 의미한다. 신호 처리부로부터 데이터 처리된 신경 신호를 낮은 주파수 신호만을 통과시키는 저 역필터부에 통과시켜, 노이즈를 제거하여 신경 신호만을 통과한다. 또한, 프로세서부는 신경 자극 제어 및 전극 슈트부와 연결되는 복수의 스위치를 제어하며, 자극부는 각 패드의 자극을 줄 수 있는 신경 자극 신호를 전달한 다. 전극 슈트부는 매트릭스 구조의 형상을 가지며, 전극 슈트부가 포함하는 각 전극에는, 자극의 신호를 신경에 전 달하거나 신경의 신경 신호를 앰프부로 전달하기 위한 채널 전극, 신경 자극 신호 및 신경 신호 중 적어도 어느 하나의 기준이 되는 접지 전극 및 신경의 신경 신호를 증폭할 때 기준 신호를 측정하기 위한 참조 전극을 포함 하며, 이를 선택하기 위한 스위치를 포함한다 하나의 전극은 채널 전극, 접지 전극 및 참조 전극 중 하나의 역할을 할 수 있다. 채널 전극은 신경을 측정하거나 자극을 전달하는 역할을 하고, 접지 전극은 신경을 측정하거나 자극을 줄 때 기 준 전위 역할을 하며, 참조 전극은 신경을 측정할 때, 비교 전위로 활용 될 수 있다. 신경을 자극할 때는 채널 전극과 접지 전극이 자극하고자 하는 위치에 동시에 존재해야 하기 때문에 매트릭스 구조의 전극 슈트부의 슈트 전극에서 자극하고자 하는 위치가 변경될 때마다 동시에 자극을 주는 채널 전극과 접지 전극이 변경되어야 한다. 또한, 신경을 측정하기 위해서는 전극 슈트부의 접지 전극 또는 참조 전극을 이용하여 측정할 수 있다. 신경 신호는 100Hz에서 500hz사이의 주파수를 가지며, 자극할 때는 신경 신호와 구별하기 위해서 그전도 신호보 다 높은 주파수로 자극을 하여야 한다. 또한, 여러 신경을 자극하기 위해 자극을 위한 프로토콜이 필요하다. 하나의 슈퍼프레임은 여러 개의 프레임으로 구성되며, 하나의 프레임은 여러 개의 슬롯으로 구성된다. 하나의 슬롯의 길이는 자극 펄스 하나의 파장 길이로 정하며, 프레임의 길이는 자극 펄스의 간격에 따라 정한다. 또한, 자극 펄스의 파장과 자극 간격은 신경에 따라 달라진다. 상기 자극부가 신경을 자극하기 위해 신경 자극 신호를 전달할 때, 하나의 슬롯에는 하나의 자극기 신호를 할당 할 수 있으며, 따라서 복수의 전극 중 하나의 채널 스위치만 온(ON)될 수 있고, 다른 전극의 접지 스위치도 온 (ON) 되어야 한다. 보다 자세하게는 제1 내지 제10 신경 중 제1 신경 위치에 신경 자극 신호를 전달하기 위해 제1 채널 스위치는 온(ON) 상태여야 하며, 나머지 제2 내지 제10 신경 위치의 전극에는 접지 스위치를 온(ON) 상태로 하여야 한다. 또한, 자극 신호를 전달하여 자극을 함과 동시에, 신경 측정을 하기 위해서는 측정하고자 하는 스위치의 채널 스위치와 참조 스위치 모두 온(ON) 상태로 하여야 한다. 여기에서, 슬롯의 개수만큼 동시에 여러 개의 신경 자극 신호를 전달하여 신경을 자극할 수 있다. 또한, 신경의 활성 정도는 동일 자극기의 슬롯이 포함된 프레임의 반복 정도에 따라 달라진다. 전자약은 신경 신호를 측정하여 신경 신호를 토대로 신경을 자극하며, 엣지 시스템은 데이터를 처리하는 센서데 이터 처리모듈부 및 센서데이터를 전송하는 센서데이터 전송 모듈부를 포함한다인공지능 시스템 서버는, 엣지 시스템의 센서데이터 처리모듈부로부터 데이터를 전송 및 수신하는 서버 데이터 처리모듈부 및 엣지 시스템의 센서데이터 전송모듈부로부터 수신받은 데이터를 저장하는 센서데이터 데이터베이 스(DB, Database)를 포함한다. 또한, 신경 신호의 복수 측정을 통해 복수 측정동안 전달되는 신경 자극 신호를 기반으로 인공지능 학습을 수행하며, 복수 회의 인공지능 학습을 수행하여 뉴럴 네트워크 가중치를 계산할 수 있다. 이동통신 중계기 및 이동통신 브릿지은 엣지 시스템의 데이터이동성을 향상하기 위해 무선 인터넷을 통해 서버 와 연결할 수 있다. 매트릭스 전극 슈트를 통해서 신경 신호를 측정하고, 신경 신호를 입력받아, 특정 동작의 신호를 정답으로 인공 지능 학습 시스템을 통해 반복 학습하며, 반복 학습을 통해 다층 뉴럴 네트워크의 가중치를 계산하며, 학습 데 이터의 정답으로 특정된 신호를 가중치와 합하여 비용함수를 계산한다. 전자약은 매틀기스 구조를 가지는 전극 슈트를 포함하며, 전극 슈트를 통해 동일 동작에서의 신경 신호를 측정 할 수 있다. 인공지능 학습 시스템을 통해 계산된 다층 뉴럴 네트워크의 가중치를 인공지능 예측 시스템에 대비하고, 매트릭 스 전극 슈트로부터 측정한 실시간 신경 신호 데이터를 입력으로 인공지능 예측 시스템을 통해 의도하는 동작을 예측할 수 있다. 실시간 신경 데이터와 예측된 값을 입력으로 다층 뉴럴 네트워크의 가중치를 업데이트하며, 예측된 동작의도에 따라 정해진 신경에 부착된 전극에 신경 자극 신호를 전달하는 동작을 제어한다. 즉, 인공지능 학습 시스템은 인공지능 학습 시스템을 통해 학습된 학습 데이터 및 상기 다층 뉴럴 네트워크 가 중치를 통해 예측 데이터를 생성하는 예측 시스템을 더 포함하고, 인공지능 예측 시스템은 측정된 실시간 신경 신호 및 상기 예측 데이터를 수신 받고, 다층 뉴럴 네트워크 가중치를 통해 신경 자극 신호를 복수의 전극 중 적어도 하나 이상의 전극으로 전달하도록 제어 신호를 전자약에 전달할 수 있다. 도 1은 본 발명의 뇌전증 진단 및 치료를 위한 전자약의 신경 자극 방법을 나타내는 순서도 구성도이다 도 1을 참조하면, 전극 슈트부에서 수행되며, 신경 신호 측정 및 신경 자극 신호를 수신 할 수 있다(S101). 앰 프부에서 수행되며, 상기 측정된 신경 신호를 증폭할 수 있다(S102). 신호 처리부에서 수행되며, 상기 신경 신 호 데이터 처리를 할 수 있다(S103). 그 후, 자극부에서 수행되며 상기 신경 자극 신호를 전달하며, 저역필터부 에서 수행되고, 낮은 주파수의 신호를 통과시킨다(S104). 프로세서부에서 수행되며, 상기 전극 슈트부와 연결되 는 복수의 스위치를 제어한다(S105). 상기의 순서를 통해 신경 자극 방법을 구현할 수 있다."}
{"patent_id": "10-2023-0040513", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하 지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로, 이상에서 기술한 실시예들은 모든 면에서 예시적인 것며, 한정적이 아닌 것으로 이해해야만 한다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구의 범위에 의하여 나타내어지며, 특허청구의 범위 의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함 되는 것으로 해석되어야 한다.도면 도면1"}
{"patent_id": "10-2023-0040513", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 뇌전증 진단 및 치료를 위한 전자약의 신경 자극 방법을 나타내는 순서도 구성도이다."}
