{"patent_id": "10-2019-0041313", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0119022", "출원번호": "10-2019-0041313", "발명의 명칭": "구조물의 긴급 동적위험도 평가시스템 및 방법", "출원인": "한국건설기술연구원", "발명자": "곽필재"}}
{"patent_id": "10-2019-0041313", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "구조물에 설치되어 지진이 발생하는 경우 상기 구조물의 거동 정보를 감지하는 센서부;상기 센서부의 감지 정보 중 특정 값을 이용하여 상기 특정 값이 설계치를 초과하는지 여부를 판단하여 재실자의 대피 여부를 판단하는 대피 여부 판단부; 상기 센서부의 감지 정보로부터 도출되는 파라미터와 지진파 데이터 베이스의 파라미터를 비교하여 지진파를 선정하고, 선정된 지진파로부터 구조물의 상태를 판단하는 구조물 상태 판단부; 및상기 대피 여부 판단부 및 상기 구조물 상태 판단부의 판단 정보를 알리는 알림부;를 포함하는 구조물의 긴급 동적위험도 평가시스템."}
{"patent_id": "10-2019-0041313", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 대피 여부 판단부는 상기 센서부의 감지 값 중 Peak Acceleration값을 이용하는 것을 특징으로 하는 구조물의 긴급 동적위험도 평가시스템."}
{"patent_id": "10-2019-0041313", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 구조물 상태 판단부는 파라미터 비교시 적어도 3개를 비교판단하는 것을 특징으로 하는 구조물의 긴급 동적위험도 평가시스템."}
{"patent_id": "10-2019-0041313", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 구조물 상태 판단부는 파라미터 비교시 Peak Acceleration, Peak Velocity, Predominant period,Duration 중 적어도 3개를 포함하는 구조물의 긴급 동적위험도 평가시스템."}
{"patent_id": "10-2019-0041313", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서,상기 지진파 데이터 베이스는 상기 구조물의 정보를 반영하여, 가상의 지진파에 대한 수치해석에 기초한 구조물의 응답을 저장하는 것을 특징으로 하는 구조물의 긴급 동적위험도 평가시스템."}
{"patent_id": "10-2019-0041313", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서,상기 구조물 상태 판단부는 구조물의 상태를 판단하여 구조물로의 입실이 가능한지 여부를 판단하고, 판단된 정보를 상기 알림부로 송출하는 것을 특징으로 하는 구조물의 긴급 동적위험도 평가시스템."}
{"patent_id": "10-2019-0041313", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "지진이 발생하는 경우 센서를 이용하여 구조물의 거동을 감지하는 구조물 거동 감지단계;상기 센서에서 감지되는 감지 값과 상기 구조물의 설계 값을 비교하여 구조물의 이상거동을 판단하는 이상 거동판단 단계;공개특허 10-2020-0119022-3-상기 구조물의 거동이 이상거동으로 판단되는 경우, 재실자에게 대피 경보를 알리는 대피 경보 단계; 및상기 대피 경보가 발생되는 경우, 상기 센서의 감지 정보로부터 도출되는 파라미터와 지진파 데이터 베이스의파라미터를 비교하여 지진파를 선정하고, 선정된 지진파로부터 구조물의 상태를 판단하는 구조물 안정도 판단단계;를 포함하는 구조물의 긴급 동적위험도 평가 방법."}
{"patent_id": "10-2019-0041313", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7 항에 있어서,상기 이상 거동 판단 단계는 상기 센서의 감지 값 중 Peak Acceleration값을 이용하는 것을 특징으로 하는 구조물의 긴급 동적위험도 평가 방법."}
{"patent_id": "10-2019-0041313", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7 항에 있어서,상기 구조물 안정도 판단 단계는 상기 센서의 감지정보로부터 도출되는 파라미터 중 적어도 3개를 상기 지진파데이터 베이스의 파라미터와 비교하여 지진파를 선정하고, 선정된 지진파에 기초하여 상기 구조물의 안정도를판단하는 것을 특징으로 하는 구조물의 긴급 동적위험도 평가 방법."}
{"patent_id": "10-2019-0041313", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9 항에 있어서,상기 파라미터 비교시 Peak Acceleration, Peak Velocity, Predominant period, Duration 중 적어도 3개를 포함하는 구조물의 긴급 동적위험도 평가 방법."}
{"patent_id": "10-2019-0041313", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9 항에 있어서,상기 구조물 안정도 판단 단계는상기 구조물이 안전한 것으로 판단되는 경우, 입실 명령을 송출하는 것을 특징으로 하는 구조물의 긴급 동적위험도 평가 방법."}
{"patent_id": "10-2019-0041313", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 구조물에 설치되어 지진이 발생하는 경우 상기 구조물의 거동 정보를 감지하는 센서부, 상기 센서부의 감지 정보 중 특정 값을 이용하여 상기 특정 값이 설계치를 초과하는지 여부를 판단하여 재실자의 대피 여부를 판단하는 대피 여부 판단부, 상기 센서부의 감지 정보로부터 도출되는 파라미터와 지진파 데이터 베이스의 파라 미터를 비교하여 지진파를 선정하고, 선정된 지진파로부터 구조물의 상태를 판단하는 구조물 상태 판단부 및 상 기 대피 여부 판단부 및 상기 구조물 상태 판단부의 판단 정보를 알리는 알림부를 포함하는 구조물의 긴급 동적 위험도 평가 시스템을 제공한다."}
{"patent_id": "10-2019-0041313", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "실시예는 구조물의 긴급 동적위험도 평가시스템 및 방법에 관한 것이다. 보다 상세하게는, 지진이 발생하는 경 우 지진으로부터 감지되는 계측자료에 기초하여 구조물의 안정성을 평가하는 구조물의 긴급 동적위험도 평가시 스템 및 방법에 관한 것이다."}
{"patent_id": "10-2019-0041313", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "산업사회로 발전하는 과정에서 건설된 대형 구조물과 시설물들은 설계 및 시공 과정에서의 결함 또는 설계 당시 에 고려하지 못하였던 각종 요인으로 인하여 구조 손상이 발생되며, 이러한 구조물들의 사용 기간이 경과함에 따라 점차 노후화됨으로써 그 안전성이 크게 위협을 받고 있다. 예를 들면, 심각한 정도의 구조 손상이 발생한 구조물의 경우, 설계 당시에 계획되었던 설계 사용연한에 크게 못 미칠 정도로 사용연한의 단축을 초래하는 경 우도 빈번히 발생하고 있다. 이에 따라 건축 구조물의 장기적인 안전성 및 작동성을 확보하기 위한 노력이 절실히 요구되고 있다. 특히,건물, 교량, 댐 등과 같은 대형 구조물은 각종 운영 하중, 외부 물체에 의한 충격, 지진, 풍하중, 파랑 하 중,부식 등에 지속적으로 노출되어 있기 때문에 이들로부터 구조물의 안전을 확보하는 문제는 경제, 사회적으로 지대한 관심의 현안이 되고 있다. 이러한 대형 구조물들의 정확한 안전 진단을 위해서는 적절한 실험 계측을 통 한 구조물 거동의 모니터링, 구조물 손상을 역학적으로 분석하는 기술 및 구조물 손상을 모델화하는 해석 기술을 통한 진단 기술이 요구된다. 특히, 최근에는 지진의 안전 지역으로 평가되던 국내에서도 다수의 지진이 발생하고 있어 지진에 대한 우려가 증가하고 있다. 이러한 지진에 대응하기 위해 지진의 신호를 이용한 다양한 지진 안전성 평가 시스템이 등장하고 있다. 그러나, 지진에 따른 구조물의 안정도를 평가하는데 시간이 많이 소요되며, 빠른 대피가 생명인 재난 대응에 적합하지 않은 문제가 있다. 선행기술문헌 대한민국 등록특허 제10-1431237호"}
{"patent_id": "10-2019-0041313", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "실시예는 지진으로부터 신호를 단계적으로 분석하여 빠른 시간 내에 재실자가 대피할 수 있는 구조물의 긴급 동 적위험도 평가시스템 및 방법 제공한다. 본 발명이 해결하고자 하는 과제는 이상에서 언급된 과제에 국한되지 않으며 여기서 언급되지 않은 또 다른 과 제들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0041313", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예는, 구조물에 설치되어 지진이 발생하는 경우 상기 구조물의 거동 정보를 감지하는 센서부; 상 기 센서부의 감지 정보 중 특정 값을 이용하여 상기 특정 값이 설계치를 초과하는지 여부를 판단하여 재실자의 대피 여부를 판단하는 대피 여부 판단부; 상기 센서부의 감지 정보로부터 도출되는 파라미터와 지진파 데이터 베이스의 파라미터를 비교하여 지진파를 선정하고, 선정된 지진파로부터 구조물의 상태를 판단하는 구조물 상태 판단부; 및 상기 대피 여부 판단부 및 상기 구조물 상태 판단부의 판단 정보를 알리는 알림부;를 포함하는 구조 물의 안정성 평가 시스템을 제공한다. 바람직하게는, 상기 대피 여부 판단부는 상기 센서부의 감지 값 중 Peak Acceleration값을 이용하는 것을 특징 으로 할 수 있다. 바람직하게는, 상기 구조물 상태 판단부는 파라미터 비교시 적어도 3개를 비교판단하는 것을 특징으로 할 수 있 다. 바람직하게는, 상기 구조물 상태 판단부는 파라미터 비교시 Peak Acceleration, Peak Velocity, Predominant period, Duration 중 적어도 3개를 포함할 수 있다. 바람직하게는, 상기 지진파 데이터 베이스는 상기 구조물의 정보를 반영하여, 가상의 지진파에 대한 수치해석에 기초한 구조물의 응답을 저장하는 것을 특징으로 할 수 있다. 바람직하게는, 상기 구조물 상태 판단부는 구조물의 상태를 판단하여 구조물로의 입실이 가능한지 여부를 판단 하고, 판단된 정보를 상기 알림부로 송출하는 것을 특징으로 할 수 있다. 본 발명의 또 다른 실시예로, 지진이 발생하는 경우 센서를 이용하여 구조물의 거동을 감지하는 구조물 거동 감 지단계; 상기 센서에서 감지되는 감지 값과 상기 구조물의 설계 값을 비교하여 구조물의 이상거동을 판단하는 이상 거동 판단 단계; 상기 구조물의 거동이 이상거동으로 판단되는 경우, 재실자에게 대피 경보를 알리는 대피 경보 단계; 및 상기 대피 경보가 발생되는 경우, 상기 센서의 감지 정보로부터 도출되는 파라미터와 지진파 데 이터 베이스의 파라미터를 비교하여 지진파를 선정하고, 선정된 지진파로부터 구조물의 상태를 판단하는 구조물 안정도 판단 단계;를 포함하는 구조물의 안정성 평가 방법을 제공한다. 바람직하게는, 상기 이상 거동 판단 단계는 상기 센서의 감지 값 중 Peak Acceleration값을 이용하는 것을 특징 으로 할 수 있다. 바람직하게는, 상기 구조물 안정도 판단 단계는 상기 센서의 감지정보로부터 도출되는 파라미터 중 적어도 3개 를 상기 지진파 데이터 베이스의 파라미터와 비교하여 지진파를 선정하고, 선정된 지진파에 기초하여 상기 구조물의 안정도를 판단하는 것을 특징으로 할 수 있다. 바람직하게는, 상기 파라미터 비교시 Peak Acceleration, Peak Velocity, Predominant period, Duration 중 적 어도 3개를 포함할 수 있다. 바람직하게는, 상기 구조물 안정도 판단 단계는 상기 구조물이 안전한 것으로 판단되는 경우, 입실 명령을 송출 하는 것을 특징으로 할 수 있다."}
{"patent_id": "10-2019-0041313", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "실시예에 따르면, 지진의 발생이 감지되는 경우 빠른 시간 내에 구조물에서 대피할 수 있는 효과가 있다. 또한, 구조물의 위험 판단을 빠른 시간에 실시하여 2차적 피해를 감소시킬 수 있는 효과가 있다. 본 발명의 다양하면서도 유익한 장점과 효과는 상술한 내용에 한정되지 않으며, 본 발명의 구체적인 실시형태를 설명하는 과정에서 보다 쉽게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0041313", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시예를 상세히 설명한다. 다만, 본 발명의 기술 사상은 설명되는 일부 실시 예에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있고, 본 발명의 기술 사상 범위 내에서라면, 실시 예들간 그 구성 요소들 중 하나 이상을 선택적으로 결합, 치환하여 사용할 수 있다. 또한, 본 발명의 실시예에서 사용되는 용어(기술 및 과학적 용어를 포함)는, 명백하게 특별히 정의되어 기술되"}
{"patent_id": "10-2019-0041313", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "지 않는 한, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 일반적으로 이해될 수 있는 의미로 해 석될 수 있으며, 사전에 정의된 용어와 같이 일반적으로 사용되는 용어들은 관련 기술의 문맥상의 의미를 고려 하여 그 의미를 해석할 수 있을 것이다. 또한, 본 발명의 실시예에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함할 수 있고, “A 및(와) B, C 중 적 어도 하나(또는 한 개 이상)”로 기재되는 경우 A, B, C로 조합할 수 있는 모든 조합 중 하나 이상을 포함할 수 있다. 또한, 본 발명의 실시 예의 구성 요소를 설명하는 데 있어서, 제1, 제2, A, B, (a), (b) 등의 용어를 사용할 수 있다. 이러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소의 본 질이나 차례 또는 순서 등으로 한정되지 않는다. 그리고, 어떤 구성 요소가 다른 구성요소에 ‘연결’, ‘결합’ 또는 ‘접속’된다고 기재된 경우, 그 구성 요 소는 그 다른 구성 요소에 직접적으로 연결, 결합 또는 접속되는 경우뿐만 아니라, 그 구성 요소와 그 다른 구 성 요소 사이에 있는 또 다른 구성 요소로 인해 ‘연결’, ‘결합’ 또는 ‘접속’ 되는 경우도 포함할 수 있다. 또한, 각 구성 요소의 “상(위) 또는 하(아래)”에 형성 또는 배치되는 것으로 기재되는 경우, 상(위) 또는 하 (아래)는 두 개의 구성 요소들이 서로 직접 접촉되는 경우뿐만 아니라 하나 이상의 또 다른 구성 요소가 두 개 의 구성 요소들 사이에 형성 또는 배치되는 경우도 포함한다. 또한, “상(위) 또는 하(아래)”으로 표현되는 경 우 하나의 구성 요소를 기준으로 위쪽 방향뿐만 아니라 아래쪽 방향의 의미도 포함할 수 있다. 이하, 첨부된 도면을 참조하여 실시 예를 상세히 설명하되, 도면 부호에 관계없이 동일하거나 대응하는 구성 요 소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다.도 1 내지 도 3는, 본 발명을 개념적으로 명확히 이해하기 위하여, 주요 특징 부분만을 명확히 도시한 것이며, 그 결과 도해의 다양한 변형이 예상되며, 도면에 도시된 특정 형상에 의해 본 발명의 범위가 제한될 필요는 없 다. 본 발명에서의 설명은 건물의 예시로 설명하고 있으나, 이게 한정되는 것은 아니며, 교량 또는 댐 기타 사람이 재실할 수 있는 다양한 구조물에 적용될 수 있다. 도 1은 본 발명의 실시예에 따른 구조물의 안정성 평가 시스템의 구조를 나타내는 도면이다. 도 1을 참조하면, 본 발명의 실시예에 따른 구조물의 긴급 동적위험도 평가시스템은 센서부, 대피 여부 판 단부, 구조물 상태 판단부 및 알림부를 포함할 수 있다. 센서부는 구조물에 설치되어 지진이 발생하는 경우 구조물의 거동 정보를 감지할 수 있다. 센서부는 구조물의 거동을 판단하기 위해 구조물의 움직임에 영향을 미치는 요인을 감지하기 위한 다양한 장치가 사용될 수 있다. 센서부는 외부요인(하중조건)을 감지하기 위한 장치와 구조물의 응답을 감지하기 위한 장치로 구분될 수 있다. 외부요인을 감지하기 위한 장치로는 풍하중을 감지하기 위한 풍향계와 풍속계, 지진하중(자유장)을 감지하기 위 한 가속도계, 기상조건을 감지하기 위한 온도계와 습도계, 지반거동을 감지하기 위한 침하계 및 지중 경사계, 지하수 거동을 감지하기 위한 지하수위계 등이 사용될 수 있다. 구조물의 응답을 감지하기 위한 장치로는 전역적 거동을 판단하기 위한 GPS 및 건물 경사계, 동적응답을 감지하 기 위한 가속도계, 국부적 거동을 감지하기 위한 응력/변형률계 등이 사용될 수 있다. 센서부는 구조물의 크기나 종류에 따라 복수로 배치될 수 있으며, 설치 위치나 형상에 제한을 받지 않는다. 대피 여부 판단부는 센서부에서 감지된 감지 정보 중 특정 값이 설계치를 초과하는 지 여부를 판단하 여 재실자의 대피 여부를 판단할 수 있다. 대피 여부 판단부는 센서부로부터 감지되는 많은 정보 중 하나를 이용하여 구조물이 일정 범위를 넘 어서는 거동을 하는 것으로 판단되는 경우 경고를 발생시킬 수 있다. 이러한 대피 여부 판단부는 하나의 감지 정보를 이용함으로 대피여부를 판단하기 위한 연산시간을 단축하여 단시간 내에 재실자에게 경고할 수 있 다. 일실시예로, 대피 여부 판단부는 센서부로부터 감지되는 정보 중 Peak Acceleration을 구조물의 설계 치와 비교하여 대피 여부를 판단할 수 있다. 감지된 Peak Acceleration이 구조물의 설계시 반영되었던 Peak Acceleration보다 큰 경우, 구조물에 이상이 생 긴 것으로 판단하고 알림부로 대피 명령을 전송할 수 있다. 이는 지진파를 분석하는 것이 아니라 지진으로 부터 감지되는 감지 값을 이용하여 이상 거동을 판단하는바, 지진파 분석을 위한 시간을 단축하여 대응시간이 핵심인 지진에 효율적으로 대응할 수 있다. 구조물 상태 판단부는 센서부의 감지 정보로부터 도출되는 파라미터와 지진파 데이터 베이스의 파라미터를 비교하여 지진파를 선정하고, 선정된 지진파로부터 구조물의 상태를 판단할 수 있다. 지진파 데이터 베이스는 인공지능(Artificial Intelligence, AI)을 통한 학습으로 구조물에 가상의 지진파 를 적용하여, 지진파에 따른 구조물의 응답 거동을 저장한다. 이때 구조물의 응답 거동은 시간별로 구조물의 상 대변위, 구조물의 국부경사, 중요부재의 응력 변화, 중요부재의 변형률 등을 고려하여 구해질 수 있다. 구조물 에 가해지는 지진은 다양한 파라미터를 가지도록 설정될 수 있다. 하기 표 1은 지진파 데이터 베이스의 파라미터 구성을 나타낸다. 표 1"}
{"patent_id": "10-2019-0041313", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "지진파 데이터 베이스는 가상의 지진파를 적용하여 수치해석시 나타나는 데이터를 표 1에 나타나는 지진파 데이터 베이스의 파라미터와 같이 분류할 수 있다. 표 2는 지진파 데이터 베이스의 일 실시예를 나타낸다. 표 2 지진파 NO. Peak AccelerationPeak VelocityPredominant periodDuration ..... 1 0.1 .. .. .. ... 2 0.11 .. .. .. .... 3 0.12 .. .. .. .... 4 0.13 .. .. .. .... .... .. .. ..... 지진파 데이터 베이스는 구조물의 기초 정보를 반영하여 사전에 지진파의 수치해석을 통한 결과와 이에 따른 구 조물의 거동 및 응답을 저장한다. 구조물 상태 판단부는 센서부의 감지 정보로부터 도출되는 감지 값을 지진파 데이터 베이스의 파라미터에 대응되도록 분류하며, 이 중 복수의 파라미터를 비교하여 가장 유사한 지진파를 찾을 수 있다. 구조물 상태 판단부는 파라미터 비교시 적어도 3개의 파라미터를 비교판단하여 지진파를 선정할 수 있다. 일실시예로, 구조물 상태 판단부는 파라미터 비교시 Peak Acceleration, Peak Velocity, Predominant period, Duration 중 적어도 3개를 포함할 수 있다. 복수의 파라미터를 비교하여 미리 해석된 지진파 데이터 베 이스에서 지진파를 선정시 오류를 방지할 수 있다. 또한, 구조물 상태 판단부는 센서부에서 도출된 감지 값으로부터 도출된 파라미터와 지진파 데이터 베이스에 저장된 파라미터가 완벽하게 일치하지 않는 경우, 가장 가까운 지진파를 이용하여 구조물의 거동 을 판단할 수 있다. 일실시예로, 가장 가까운 지진파는 각 파라미터에 가중치를 부여하고 이를 연산하여 가장 가까운 파라미터를 가지는 값으로 연산될 수 있다. 종래에는 지진이 발생하는 경우 전체 지진파를 분석해야하므로 많은 시간이 소요되는 문제점이 있었다. 본 발명 은 지진파로부터 감지되는 감지 정보 중 특정 파라미터만을 비교하여 지진파에 따른 구조물의 응답을 판단하는 시간을 감소하여 종래의 문제점을 해결하였다. 또한, 지진으로 재실자가 대피하는 경우, 지진이 끝났다고 하여 재실자들이 구조물로 입실하는 것은 위험하다. 이는 구조물이 지진에 의해 어떠한 손상을 입었는지 육안으로 확인이 곤란한바, 2차 피해의 우려가 존재하기 때 문이다. 본 발명은 지진 분석의 시간을 단축하여 재실자들의 입실 여부를 빠르게 판단할 수 있는바, 2차 피해를 감소시 킬 수 있으며, 재실자들의 불편 및 우려를 빠르게 해소할 수 있는 장점이 있다. 이와 같이 구조물 상태 판단부는 복수의 파라미터를 이용하여 구조물의 상태를 판단하여 구조물로의 입실 이 가능한지 여부를 판단하고, 판단된 정보를 알림부로 송출할 수 있다. 구조물 상태 판단부는 구조물의 상태가 안정적인 것으로 판단되는 경우 입실 명령을 송출하게 되며, 구조 물의 상태가 위험한 것으로 판단되는 경우 대피 유지 명령을 송출하게 된다. 알림부는 대피 여부 판단부 및 구조물 상태 판단부의 판단 정보를 재실자 또는 방재청 등의 기 관에 전달할 수 있다. 알림부는 시각 또는 청각의 방법으로 정보를 전달할 수 있다. 한편, 이하에서는, 첨부된 도면을 참조하여 본 발명의 또 다른 실시예에 따른 구조물의 긴급 동적위험도 평가 방법을 설명하면 다음과 같다. 단, 본 발명의 일 실시예에 따른 구조물의 긴급 동적위험도 평가시스템에서 설명 한 바와 동일한 것에 대해서는 그 설명을 생략하기로 한다. 도 2에 있어서, 도 1과 동일한 참조부호는 동일한 부재를 나타내며 상세한 설명은 생략하기로 한다. 도 2는 본 발명의 또 다른 실시예에 따른 구조물의 긴급 동적위험도 평가 방법의 순서도이다. 도 2를 참조하면, 본 발명의 또 다른 실시예에 따른 구조물의 긴급 동적위험도 평가 방법은 구조물 거동 감지 단계(S100), 이상 거동 판단 단계(S200), 대피 경보 단계(S300) 및 구조물 안정도 판단 단계(S400)를 포함할 수 있다. 구조물 거동 감지 단계(S100)는 지진이 발생하는 경우 센서를 이용하여 구조물의 거동을 감지할 수 있다. 구조 물 거동 감지 단계(S100)는 구조물에 구비되는 복수의 센서부를 통해 지진에 의한 구조물의 거동을 감지할 수 있다. 이상 거동 판단 단계(S200)는 대피 여부 판단부를 이용하여 센서에서 감지되는 감지 값과 상기 구조물의 설계 값을 비교하여 구조물의 이상거동을 판단할 수 있다. 일실시예로, 이상 거동 판단 단계(S200)는 센서로부터 감지되는 정보 중 Peak Acceleration을 구조물의 설계시 반영되었던 설계 값과 비교하여 대피 여부를 판단할 수 있다. 이때, 구조물의 설계시 반영되었던 Peak Acceleration보다 센서로부터 감지되는 Peak Acceleration이 큰 경우 구조물에 이상 거동이 있는 것으로 판단할 수 있다. 대피 경보 단계(S300)는 이상 거동 판단 단계(S200)에서 구조물의 거동이 이상 거동으로 판단되는 경우, 재실자 에게 대피 경보를 알릴 수 있다. 이때, 대피 경보는 대피 여부 판단부에서 이상 거동으로 판단되는 경우, 대피 신호를 알림부로 송신하게 되며, 알림부는 이를 재실자에게 알려 구조물에서 대피하도록 할 수 있다. 구조물 안정도 판단 단계(S400)는 구조물 상태 판단부를 이용하여 대피 경보 단계(S300)에서 대피 경보가 발생되는 경우, 상기 센서의 감지 정보로부터 도출되는 파라미터와 지진파 데이터 베이스의 파라미터를 비 교하여 지진파를 선정하고, 선정된 지진파로부터 구조물의 상태를 판단할 수 있다. 구조물 안정도 판단 단계(S400)는 센서의 감지정보로부터 도출되는 파라미터 중 적어도 3개를 지진파 데이터 베 이스의 파라미터와 비교하여 지진파를 선정하고, 선정된 지진파에 기초하여 상기 구조물의 안정도를 판단 할 수 있다. 복수의 파라미터를 이용함으로 지진파 선정시의 오류를 감소할 수 있음과 동시에 빠르게 지진파에 따른 구조물의 안정도를 판단할 수 있다. 일실시예로, 구조물 안정도 판단 단계(S400)는 파라미터 비교시 Peak Acceleration, Peak Velocity, Predominant period, Duration 중 적어도 3개를 포함할 수 있다. 구조물 안정도 판단 단계(S400)에서 구조물이 안전한 것으로 판단하는 경우 구조물로 입실 명령을 송출할 수 있 으며, 구조물이 안전하지 않은 것으로 판단되는 경우 대피 명령을 유지할 수 있다. 이상으로 본 발명의 실시 예에 관하여 첨부된 도면을 참조하여 구체적으로 살펴보았다. 이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위 내에서 다양한 수정, 변경 및 치환이 가능할 것이다. 따라서, 본 발명에 개시된 실시예 및 첨부된 도면들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이고, 이러한 실시예 및 첨부된 도면에 의하여 본 발명의 기술 사상의 범위 가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범 위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2019-0041313", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 구조물의 긴급 동적위험도 평가시스템의 구조를 나타내는 도면이고, 도 2는 본 발명의 또 다른 실시예에 따른 구조물의 긴급 동적위험도 평가 방법의 순서도이다."}
