{"patent_id": "10-2022-0137651", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0057194", "출원번호": "10-2022-0137651", "발명의 명칭": "무선 통신 시스템에서 단말이 실행중인 기능의 실행 모드를 제어하는 방법 및 장치", "출원인": "삼성전자주식회사", "발명자": "이상호"}}
{"patent_id": "10-2022-0137651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신 시스템에서 단말(user equipment, UE)이 동작하는 방법에 있어서,상기 단말의 상태 정보를 획득하는 단계;상기 단말에서 실행중인 기능들 각각의 실행 모드를 식별하는 단계;상기 단말의 상태 정보에 기초하여, 상기 단말에서 실행중인 기능들 중 실행 모드를 변경할 적어도 하나의 기능을 식별하는 단계; 및상기 식별된 적어도 하나의 기능의 실행 모드를 변경하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-0137651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 단말의 상태 정보는, 잔여 배터리 용량, 단위 시간당 전력 소모량, 단위 시간당 데이터 처리량, 데이터 전송 속도, 또는 발열량 중 적어도 하나를 포함하는, 방법."}
{"patent_id": "10-2022-0137651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 단말의 상태 정보는, 상기 단말에 포함된 센서를 통해 획득되는 것인, 방법."}
{"patent_id": "10-2022-0137651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 단말에서 실행중인 기능들 중 실행 모드를 변경할 적어도 하나의 기능을 식별하는 단계는,상기 단말의 상태 정보에 기초하여, 상기 단말에서 실행중인 기능들 각각의 우선 순위(priority)를 결정하는 단계; 및상기 결정된 우선 순위에 기초하여, 상기 단말에서 실행중인 기능들 중 실행 모드를 변경할 적어도 하나의 기능을 식별하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-0137651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 실행 모드를 변경할 적어도 하나의 기능은 제1 기능 및 제2 기능을 포함하고,상기 식별된 적어도 하나의 기능의 실행 모드를 변경하는 단계는,상기 제1 기능의 실행 모드를 변경하는 단계;상기 제1 기능의 실행 모드가 변경됨에 따라 업데이트된 상기 단말의 상태 정보를 획득하는 단계; 및상기 단말의 업데이트된 상태 정보에 기초하여 상기 제2 기능의 실행 모드를 변경할지 여부를 결정하는 단계를포함하는, 방법."}
{"patent_id": "10-2022-0137651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 실행 모드는 비활성화 모드를 포함하고,상기 식별된 적어도 하나의 기능의 실행 모드를 변경하는 단계는, 상기 단말에서 실행중인 적어도 하나의 기능공개특허 10-2024-0057194-3-을 비활성화하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-0137651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 적어도 하나의 기능의 실행 모드 변경 정보를 기지국으로 전송하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-0137651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "무선 통신 시스템에서 기능의 실행 모드를 제어하는 단말에 있어서,송수신부; 및적어도 하나의 프로세서를 포함하고,상기 적어도 하나의 프로세서는,상기 단말의 상태 정보를 획득하고,상기 단말에서 실행중인 기능들 각각의 실행 모드를 식별하고,상기 단말의 상태 정보에 기초하여, 상기 단말에서 실행중인 기능들 중 실행 모드를 변경할 적어도 하나의 기능을 식별하고,상기 식별된 적어도 하나의 기능의 실행 모드를 변경하는, 단말."}
{"patent_id": "10-2022-0137651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 단말의 상태 정보는, 잔여 배터리 용량, 단위 시간당 전력 소모량, 단위 시간당 데이터 처리량, 데이터 전송 속도, 또는 발열량 중 적어도 하나를 포함하는, 단말."}
{"patent_id": "10-2022-0137651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 단말의 상태 정보를 획득하는 센서를 더 포함하는, 단말."}
{"patent_id": "10-2022-0137651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제8항에 있어서, 상기 적어도 하나의 프로세서는,상기 단말의 상태 정보에 기초하여, 상기 단말에서 실행중인 기능들 각각의 우선 순위를 결정하고,상기 결정된 우선 순위에 기초하여, 상기 단말에서 실행중인 기능들 중 실행 모드를 변경할 적어도 하나의 기능을 식별하는, 단말."}
{"patent_id": "10-2022-0137651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서,상기 실행 모드를 변경할 적어도 하나의 기능은 제1 기능 및 제2 기능을 포함하고,상기 적어도 하나의 프로세서는,상기 제1 기능의 실행 모드를 변경하고,상기 제1 기능의 실행 모드가 변경됨에 따라 업데이트된 상기 단말의 상태 정보를 획득하고,상기 단말의 업데이트된 상태 정보에 기초하여 상기 제2 기능의 실행 모드를 변경할지 여부를 결정하는, 단말."}
{"patent_id": "10-2022-0137651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제8항에 있어서,공개특허 10-2024-0057194-4-상기 실행 모드는 비활성화 모드를 포함하고,상기 적어도 하나의 프로세서는, 상기 단말에서 실행중인 상기 식별된 적어도 하나의 기능을 비활성화하는, 단말."}
{"patent_id": "10-2022-0137651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제8항에 있어서,상기 송수신부를 통해, 상기 적어도 하나의 기능의 실행 모드 변경 정보를 기지국으로 전송하는, 단말."}
{"patent_id": "10-2022-0137651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "컴퓨터로 읽을 수 있는 기록 매체에 있어서,단말의 상태 정보를 획득하는 단계;상기 단말에서 실행중인 기능들 각각의 실행 모드를 식별하는 단계;상기 단말의 상태 정보에 기초하여, 상기 단말에서 실행중인 기능들 중 실행 모드를 변경할 적어도 하나의 기능을 식별하는 단계; 및상기 식별된 적어도 하나의 기능의 실행 모드를 변경하는 단계를 포함하는 방법을 컴퓨터에서 수행하기 위한 프로그램이 기록된, 기록 매체."}
{"patent_id": "10-2022-0137651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 단말의 상태 정보는, 잔여 배터리 용량, 단위 시간당 전력 소모량, 단위 시간당 데이터 처리량, 데이터 전송 속도, 또는 발열량 중 적어도 하나를 포함하고,상기 단말의 상태 정보는, 상기 단말에 포함된 센서를 통해 획득되는 것인, 기록 매체."}
{"patent_id": "10-2022-0137651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항에 있어서,상기 단말에서 실행중인 기능들 중 실행 모드를 변경할 적어도 하나의 기능을 식별하는 단계는,상기 단말의 상태 정보에 기초하여, 상기 단말에서 실행중인 기능들 각각의 우선 순위(priority)를 결정하는 단계; 및상기 결정된 우선 순위에 기초하여, 상기 단말에서 실행중인 기능들 중 실행 모드를 변경할 적어도 하나의 기능을 식별하는 단계를 포함하는, 기록 매체."}
{"patent_id": "10-2022-0137651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제15항에 있어서,상기 실행 모드를 변경할 적어도 하나의 기능은 제1 기능 및 제2 기능을 포함하고,상기 식별된 적어도 하나의 기능의 실행 모드를 변경하는 단계는,상기 제1 기능의 실행 모드를 변경하는 단계;상기 제1 기능의 실행 모드가 변경됨에 따라 업데이트된 상기 단말의 상태 정보를 획득하는 단계; 및상기 단말의 업데이트된 상태 정보에 기초하여 상기 제2 기능의 실행 모드를 변경할지 여부를 결정하는 단계를포함하는, 기록 매체."}
{"patent_id": "10-2022-0137651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제15항에 있어서,공개특허 10-2024-0057194-5-상기 실행 모드는 비활성화 모드를 포함하고,상기 식별된 적어도 하나의 기능의 실행 모드를 변경하는 단계는, 상기 단말에서 실행중인 적어도 하나의 기능을 비활성화하는 단계를 포함하는, 기록 매체."}
{"patent_id": "10-2022-0137651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제15항에 있어서,상기 기록된 프로그램을 통해 상기 컴퓨터에서 수행되는 방법은,상기 적어도 하나의 기능의 실행 모드 변경 정보를 기지국으로 전송하는 단계를 더 포함하는, 기록 매체."}
{"patent_id": "10-2022-0137651", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시 예에 따르면, 무선 통신 시스템에서 단말(user equipment, UE)이 동작하는 방법이 제공된다. 방법은, 단말의 상태 정보를 획득하는 단계, 단말에서 실행중인 기능들 각각의 실행 모드를 식별하는 단계, 단말 의 상태 정보에 기초하여, 단말에서 실행중인 기능들 중 실행 모드를 변경할 적어도 하나의 기능을 식별하는 단 계, 및 식별된 적어도 하나의 기능의 실행 모드를 변경하는 단계를 포함할 수 있다."}
{"patent_id": "10-2022-0137651", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 무선 통신 시스템에 관한 것으로, 단말의 상태 정보에 기초하여, 단말에서 실행중인 기능들 중 적어 도 하나의 기능의 실행 모드를 변경하는 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2022-0137651", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "무선 통신 세대를 거듭하면서 발전한 과정을 돌아보면 음성, 멀티미디어, 데이터 등 주로 인간 대상의 서비스를 위한 기술이 개발되어 왔다. 5G(5th-generation) 통신 시스템 상용화 이후 폭발적인 증가 추세에 있는 커넥티드 기기들이 통신 네트워크에 연결될 것으로 전망되고 있다. 네트워크에 연결된 사물의 예로는 차량, 로봇, 드론, 가전제품, 디스플레이, 각종 인프라에 설치된 스마트 센서, 건설기계, 공장 장비 등이 있을 수 있다. 모바일 기 기는 증강현실 안경, 가상현실 헤드셋, 홀로그램 기기 등 다양한 폼팩터로 진화할 것으로 예상된다. 6G(6th- generation) 시대에는 수천억 개의 기기 및 사물을 연결하여 다양한 서비스를 제공하기 위해, 개선된 6G 통신 시스템을 개발하기 위한 노력이 이루어지고 있다. 이러한 이유로, 6G 통신 시스템은 5G 통신 이후(beyond 5G) 시스템이라 불리어지고 있다. 2030년쯤 실현될 것으로 예측되는 6G 통신 시스템에서 최대 전송 속도는 테라 (즉, 1,000기가) bps, 무선 지연 시간은 100마이크로초(μsec) 이다. 즉, 5G 통신 시스템대비 6G 통신 시스템에서의 전송 속도는 50배 빨라지고 무선 지연시간은 10분의 1로 줄어든다. 이러한 높은 데이터 전송 속도 및 초저(ultra-low) 지연시간을 달성하기 위해, 6G 통신 시스템은 테라헤르츠 (terahertz, THz) 대역(예를 들어, 95기가헤르츠(95GHz)에서 3테라헤르츠(3THz)대역)에서의 구현이 고려되고 있 다. 테라헤르츠 대역에서는 5G에서 도입된 밀리미터파(mmWave) 대역에 비해 더 심각한 경로 손실 및 대기 흡수 현상으로 인해서 신호 도달 거리, 즉 커버리지를 보장할 수 있는 기술의 중요성이 더 커질 것으로 예상된다. 커 버리지를 보장하기 위한 주요 기술로서 RF(radio frequency) 소자, 안테나, OFDM(orthogonal frequency division multiplexing)보다 커버리지 측면에서 더 우수한 신규 파형(waveform), 빔포밍(beamforming) 및 거대 배열 다중 입출력(massive multiple-input and multiple-output; massive MIMO), 전차원 다중 입출력(full dimensional MIMO; FD-MIMO), 어레이 안테나(array antenna), 대규모 안테나(large scale antenna)와 같은 다 중 안테나 전송 기술 등이 개발되어야 한다. 이 외에도 테라헤르츠 대역 신호의 커버리지를 개선하기 위해 메타 물질(metamaterial) 기반 렌즈 및 안테나, OAM(orbital angular momentum)을 이용한 고차원 공간 다중화 기술, RIS(reconfigurable intelligent surface) 등 새로운 기술들이 논의되고 있다. 또한 주파수 효율 향상 및 시스템 네트워크 개선을 위해, 6G 통신 시스템에서는 상향링크(uplink)와 하향링크 (downlink)가 동일 시간에 동일 주파수 자원을 동시에 활용하는 전이중화(full duplex) 기술, 위성(satellite) 및 HAPS(high-altitude platform stations)등을 통합적으로 활용하는 네트워크 기술, 이동 기지국 등을 지원하 고 네트워크 운영 최적화 및 자동화 등을 가능하게 하는 네트워크 구조 혁신 기술, 스펙트럼 사용 예측에 기초 한 충돌 회피를 통한 동적 주파수 공유(dynamic spectrum sharing) 기술, AI(artificial intelligence)를 설계 단계에서부터 활용하고 종단간(end-to-end) AI 지원 기능을 내재화하여 시스템 최적화를 실현하는 AI 기반 통신 기술, 단말 연산 능력의 한계를 넘어서는 복잡도의 서비스를 초고성능 통신과 컴퓨팅 자원(mobile edge computing (MEC), 클라우드 등)을 활용하여 실현하는 차세대 분산 컴퓨팅 기술 등의 개발이 이루어지고 있다. 뿐만 아니라 6G 통신 시스템에서 이용될 새로운 프로토콜의 설계, 하드웨어 기반의 보안 환경의 구현 및 데이터 의 안전 활용을 위한 메커니즘 개발 및 프라이버시 유지 방법에 관한 기술 개발을 통해 디바이스 간의 연결성을더 강화하고, 네트워크를 더 최적화하고, 네트워크 엔티티의 소프트웨어화를 촉진하며, 무선 통신의 개방성을 높이려는 시도가 계속되고 있다. 이러한 6G 통신 시스템의 연구 및 개발로 인해, 사물 간의 연결 뿐만 아니라 사람과 사물 간의 연결까지 모두 포함하는 6G 통신 시스템의 초연결성(hyper-connectivity)을 통해 새로운 차원의 초연결 경험(the next hyper- connected experience)이 가능해질 것으로 기대된다. 구체적으로 6G 통신 시스템을 통해 초실감 확장 현실 (truly immersive extended reality; truly immersive XR), 고정밀 모바일 홀로그램(high-fidelity mobile hologram), 디지털 복제(digital replica) 등의 서비스 제공이 가능할 것으로 전망된다. 또한 보안 및 신뢰도 증진을 통한 원격 수술(remote surgery), 산업 자동화(industrial automation) 및 비상 응답(emergency response)과 같은 서비스가 6G 통신 시스템을 통해 제공됨으로써 산업, 의료, 자동차, 가전 등 다양한 분야에서 응용될 것이다."}
{"patent_id": "10-2022-0137651", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시의 일 실시 예는, 다양한 기술이 적용된 무선 통신 시스템에서 단말의 상황에 따라 실행되는 기능들 각 각의 모드(mode)를 조절함으로써 효율적인 통신 서비스를 제공할 수 있다. 본 개시의 일 실시 예는, 단계적으로 기능들 각각의 모드를 조절함으로써 모뎀(modem)의 기능을 세부적으로 제 한할 수 있고, 단말의 단위 시간당 전력 소모량, 단위 시간당 데이터 처리량, 데이터 전송 속도 또는 발열량을 필요에 따라 탄력적으로 제어할 수 있다. 본 개시의 일 실시 예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제로 한정되지 않으며, 이하 의 실시 예들로부터 또 다른 기술적 과제들이 유추될 수 있다."}
{"patent_id": "10-2022-0137651", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서 개시된, 무선 통신 시스템에서 단말(user equipment, UE)이 동작하는 방법은, 단말의 상태 정보를 획득하는 단계, 단말에서 실행중인 기능들 각각의 실행 모드를 식 별하는 단계, 단말의 상태 정보에 기초하여 단말에서 실행중인 기능들 중 실행 모드를 변경할 적어도 하나의 기 능을 식별하는 단계, 및 식별된 적어도 하나의 기능의 실행 모드를 변경하는 단계를 포함할 수 있다. 상술한 기술적 과제를 달성하기 위한 기술적 수단으로서 개시된, 무선 통신 시스템에서 기능의 실행 모드를 제 어하는 단말(UE)은, 송수신부 및 적어도 하나의 프로세서를 포함할 수 있다. 적어도 하나의 프로세서는, 단말의 상태 정보를 획득하고, 단말에서 실행중인 기능들 각각의 실행 모드를 식별하고, 단말의 상태 정보에 기초하여, 단말에서 실행중인 기능들 중 실행 모드를 변경할 적어도 하나의 기능을 식별하고, 식별된 적어도 하나의 기능 의 실행 모드를 변경할 수 있다. 상술한 기술적 과제를 달성하기 위한 기술적 수단으로서 개시된, 컴퓨터로 읽을 수 있는 기록매체는, 단말의 상 태 정보를 획득하는 단계, 단말에서 실행중인 기능들 각각의 실행 모드를 식별하는 단계, 단말의 상태 정보에 기초하여 단말에서 실행중인 기능들 중 실행 모드를 변경할 적어도 하나의 기능을 식별하는 단계, 및 식별된 적 어도 하나의 기능의 실행 모드를 변경하는 단계를 포함하는 방법을 컴퓨터에서 수행하기 위한 프로그램이 기록 된 것일 수 있다."}
{"patent_id": "10-2022-0137651", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시에서 제안하고 있는 무선 통신 시스템에서 단말이 실행중인 기능의 실행 모드를 제어하는 방법 및 장치 에 따르면, 다양한 기술이 적용된 무선 통신 시스템에서 단말의 상황에 따라 실행되는 기능들 각각의 모드 (mode)를 조절함으로써 효율적인 통신 서비스를 제공할 수 있다. 또한, 본 개시에서 제안하고 있는 무선 통신 시스템에서 단말이 실행중인 기능의 실행 모드를 제어하는 방법 및 장치에 따르면, 단계적으로 기능들 각각의 모드를 조절함으로써 모뎀(modem)의 기능을 세부적으로 제한할 수 있 고, 단말의 단위 시간당 전력 소모량, 단위 시간당 데이터 처리량, 데이터 전송 속도 또는 발열량을 필요에 따 라 탄력적으로 제어할 수 있다."}
{"patent_id": "10-2022-0137651", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 상세한 설명 및 청구범위의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0137651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 개시의 실시 예들을 첨부된 도면을 참조하여 상세히 설명한다. 본 개시를 설명함에 있어서 본 개시가 속하는 기술 분야에 익히 알려져 있고 본 개시와 직접적으로 관련이 없는 기술 내용에 대해서는 설명을 생략한다. 이는 불필요한 설명을 생략함으로써 본 개시의 요지를 흐리지 않고 더 욱 명확히 전달하기 위함이다. 그리고 후술되는 용어들은 본 개시에서의 기능을 고려하여 정의된 용어들로 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용 을 토대로 내려져야 할 것이다. 마찬가지 이유로 첨부된 도면에 있어서 일부 구성요소는 과장되거나 생략되거나 개략적으로 도시 되었다. 또한, 각 구성요소의 크기는 실제 크기를 전적으로 반영하는 것이 아니다. 각 도면에서 동일한 또는 대응하는 구성 요 소에는 동일한 참조 번호를 부여하였다. 본 개시의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술 되어 있는 실 시 예들을 참조하면 명확해질 것이다. 그러나 본 개시는 이하에서 개시되는 실시 예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시 예들은 본 개시의 개시가 완전 하도록 하고, 본 개시"}
{"patent_id": "10-2022-0137651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "가 속하는 기술분야에서 통상의 지식을 가진 자에게 개시의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 개시는 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭 한다. 또한 본 개시를 설명함에 있어서 관련된 기능 또는 구성에 대한 구체적인 설명이 본 개시의 요지를 불필 요하게 흐릴 수 있다고 판단된 경우 그 상세한 설명은 생략한다. 이하, 기지국(base station, BS)은 단말의 자원 할당을 수행하는 주체로서, gNode B, eNode B, Node B, (또는 xNode B (x는 g, e를 포함하는 알파벳)), 무선 접속 유닛, 기지국 제어기, 위성(satellite), 비행체(airborn), 또는 네트워크 상의 노드 중 적어도 하나일 수 있다. 단말(user equipment, UE)은 MS(Mobile Station), 차량 (Vehicular), 위성(satellite), 비행체(airborn), 셀룰러폰, 스마트폰, 컴퓨터, 또는 통신기능을 수행할 수 있 는 멀티미디어 시스템을 포함할 수 있다. 본 개시에서 하향링크(Downlink, DL)는 기지국이 단말에게 전송하는 신호의 무선 전송경로이고, 상향링크(Uplink, UL)는 단말이 기국에게 전송하는 신호의 무선 전송경로를 나타낼 수 있다. 추가적으로 단말이 또 다른 단말에게 전송하는 신호의 무선 전송 경로를 의미하는 사이드링크 (sidelink, SL)가 존재할 수 있다. 또한, 이하에서 LTE, LTE-A 또는 5G 시스템을 일 예로서 설명할 수도 있지만, 유사한 기술적 배경 또는 채널 형 태를 갖는 여타의 통신시스템에도 본 개시의 실시 예가 적용될 수 있다. 예를 들어 5G 이동통신 기술(혹은 new radio, NR) 이후에 개발되는 5G-Advance 또는 NR-Advance 또는 6세대 이동통신 기술(6G)이 이에 포함될 수 있 으며, 이하의 5G는 기존의 LTE, LTE-A 및 유사한 다른 서비스를 포함하는 개념일 수도 있다. 또한, 본 개시는 숙련된 기술적 지식을 가진 자의 판단으로써 본 개시의 범위를 크게 벗어나지 아니하는 범위에서 일부 변형을 통해 다른 통신시스템에도 적용될 수 있다. 이때, 처리 흐름도 도면들의 각 블록과 흐름도 도면들의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수행될 수 있음을 이해할 수 있을 것이다. 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터 또는 기 타 프로그램 가능한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있다. 컴퓨터 프로그램 인스트럭션들은 기능 을 구현하기 위해 컴퓨터 또는 기타 데이터 프로세싱 장비를 지향할 수 있는 메모리에 저장되는 것도 가능하며, 컴퓨터로 판독 가능한 메모리에 저장된 인스트럭션들은 흐름도 블록(들)에서 설명된 기능을 수행할 수 있다. 컴 퓨터 프로그램 인스트럭션들은 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에 탑재되는 것도 가 능하고, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 흐름도 블록(들)에서 설명된 기능들을 실행하기 위한 단계들을 제공하는 것도 가능하다. 또한, 각 블록은 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 일부 실시 예에서는 각각의 블록에서 언급된 기능들이 순서를 벗어나서 발생하는 것도 가능하다. 예를 들면, 잇달아 도시되어 있는 두 개의 블록들은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 블록들이 때때로 해당하는 기능에 따라 역순으로 수행되는 것도 가능하 다. 본 개시의 일 실시 예에서 사용되는 '~부'라는 용어는 소프트웨어 또는 FPGA(Field Programmable Gate Array) 또는 ASIC(Application Specific Integrated Circuit)과 같은 하드웨어 구성요소를 나타내고, '~부'는 어떤 역 할들을 수행할 수 있다. 그러나, '~부'는 소프트웨어 또는 하드웨어에 한정되는 의미는 아니다. '~부'는 어드레 싱 할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성 요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프 로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들, 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성 요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소 들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 또한 실시 예에서 ‘~부’는 하나 이상의 프로세서를 포함할 수 있다. 이하 설명에서 사용되는 방송 정보를 지칭하는 용어, 제어 정보를 지칭하는 용어, 통신 커버리지(coverage)에 관련된 용어, 상태 변화를 지칭하는 용어(예를 들어, 이벤트(event)), 망 객체(network entity)들을 지칭하는 용어, 메시지들을 지칭하는 용어, 장치의 구성 요소를 지칭하는 용어 등은 설명의 편의를 위해 예시된 것이다. 따라서, 본 개시가 후술되는 용어들에 한정되는 것은 아니며, 동등한 기술적 의미를 가지는 다른 용어가 사용될 수 있다. 이하 설명의 편의를 위하여, 본 발명은 현재 존재하는 통신 표준 가운데 3GPP (The 3rd Generation Partnership Project) 단체에서 정의하는 가장 최신의 표준인 LTE 및 NR 규격에서 정의하고 있는 용어 및 명칭 들을 사용한다. 하지만, 본 발명이 상기 용어 및 명칭들에 의해 한정되는 것은 아니며, 다른 규격에 따르는 시 스템에도 동일하게 적용될 수 있다. 도 1은 본 개시의 일 실시 예에 따른, 무선 통신 시스템에서 단말(user equipment, UE)이 실행중인 기능들 및 각각의 기능들의 실행 모드(mode)를 설명하기 위한 도면이다. 본 개시의 일 실시 예에 따른 단말은 통신 플랫폼(platform)에서 다양한 기능(feature, function)들을 실행할 수 있다. LTE 이후의 통신 시스템에서는 사용자 및 서비스 제공자의 다양한 요구 사항을 자유롭게 반영할 수 있는 서비스 가 지원될 것이 요구된다. 5G 이후 통신 시스템에서 고려되는 서비스로는 향상된 모바일 광대역 통신(enhanced Mobile Broad Band, eMBB), 대규모 기계형 통신(massive Machine Type Communication, mMTC), 초신뢰 저지연 통신(Ultra-Reliability Low Latency Communication, URLLC) 등이 있다. 5G 이후의 통신 시스템에서는 다양한 기능들을 실행하면서 많은 양의 데이터를 전송하고, 더 많은 전력을 소비 할 수 있으므로 잠재적으로 단말의 온도를 상승하게 할 수 있다. 예를 들면, 단말은 높은 주파수 대역의 사용과 데이터 처리량의 증가로 인해 전력 소모가 커질 수 밖에 없고, 이에 따른 발열량이 증가하면서 과열 현상이 발 생할 수 있다. 단말이 과열될 경우, 해당 부위 근처에 배치된 안테나 모듈이나 부품들이 손상되거나 성능이 저 하될 수 있고, 사용자에게도 불편함을 줄 수 있다. 따라서, 통신 서비스 제공 시 단말의 원활한 통신을 위해 단 말의 발열을 효율적으로 제어할 수 있는 방법이 필요하다. 본 개시의 일 실시 예에 따르면, 단말 지향적인(UE-oriented) 기능 제어 방법이 제공될 수 있다. 일 실시 예에 서 방법은, 단말의 상태 정보를 획득하는 단계, 단말에서 실행중인 기능들 각각의 실행 모드를 식별하는 단계, 단말의 상태 정보에 기초하여 단말에서 실행중인 기능들 중 실행 모드를 변경할 적어도 하나의 기능을 식별하는 단계, 및 식별된 적어도 하나의 기능의 실행 모드를 변경하는 단계를 포함할 수 있다. 도 1을 참조하면, 단말은 적어도 하나의 기능(제1 기능, 제2 기능, 제3 기능, 제4 기능 )을 실행하고 있을 수 있다. 단말이 실행하는 기능(제1 기능, 제2 기능, 제3 기능, 제4 기능)은 통신 플랫폼을 구성하거나 통신 플랫폼에서 지원되는 다양한 기술들을 나타낼 수 있다. 일 실 시예에서, 단말이 기능(제1 기능, 제2 기능, 제3 기능, 제4 기능)을 실행한다는 것은, 기능(제1 기능, 제2 기능, 제3 기능, 제4 기능)에 대응되는 기술이 단말에 적 용되고 있거나, 단말에서 활성화(activated)되거나, 기능(제1 기능, 제2 기능, 제3 기능, 제4 기능)에 대응되는 동작들이 단말에서 수행되는 경우를 나타낼 수 있다. 단말이 특정 기능(제1 기능, 제2 기능, 제3 기능, 제4 기능)을 실행할 때, 특정 모드 (Mode)로 실행할 수 있다. 예를 들어, 단말은 제n 기능을 모드 n-m (n, m은 자연수)로 실행할 수 있다. 여 기서, m은 1 이상 M 이하의 수이고, M은 제n 기능의 서로 다른 실행 모드의 개수를 나타낼 수 있다. 도 1을 참 조하면, 단말이 제1 기능, 제2 기능, 제3 기능, 및 제4 기능을 실행하는 실시 예에서, 단말은 제1 기능을 Mode 1-1로 실행하고, 제2 기능을 Mode 2-1로 실행하고, 제3 기능 을 Mode 3-1로 실행하고, 제4 기능을 Mode 4-1로 실행할 수 있다. 예를 들어, 단말이 실행할 수 있는 기능(제1 기능, 제2 기능, 제3 기능, 제4 기능)들 은 각각 X-MIMO(extreme Multiple-Input Multiple-Output) 기능, 고주파수 이용 기능, XDD(cross division duplex) 기능, Multi-TRP(transmission and reception port) 기능, 인공지능(artificial intelligence, AI) 모델 이용 기능, 또는 그 밖에 다양한 기능에 대응될 수 있다. X-MIMO 기능(또는, e-MIMO 기능)은, 많은 수의 디지털 포트(digital port)를 지원하는 기술에 관련될 수 있다. 예를 들어, X-MIMO 기능을 수행하는 단말은 많은 수의 디지털 포트를 지원할 수 있다. 무선 통신 시스템에서 지 원되는 디지털 포트 수가 증가하면, 통신 채널(channel)의 수도 증가한다. 통신 채널의 수가 많을수록, 단말이 측정하여야 하는 채널 상태 정보(channel state information, CSI)의 양도 방대하다. 이 경우, 단말은 방대한 양의 CSI 피드백을 수행해야 하며, 단말의 전력 소모가 증가할 수 있다. 고주파수 이용 기능은, 무선 통신에 고대역 주파수의 빔(beam)이 이용되는 기술에 관련될 수 있다. 고대역 주파 수는 직진성이 높아 빠른 시간에 이동이 가능하나, 도달 범위가 짧고 장애물 회피에 용이하지 않아 좁은 커버리 지의 특성을 갖는다. 따라서, 고대역 주파수는 경로 손실(path loss)이 크고, 충분한 상향링크 커버리지를 확보 하기 위해서는 단말이 송신하는 빔의 세기가 커야 한다. 고대역 주파수의 빔을 이용할 경우, 단말은 방출 빔의 세기를 증가시켜야 하며, 단말의 전력 소모가 증가할 수 있다. XDD(cross division duplex), AD(adaptive duplex), 또는 플렉시블 듀플렉스(flexible duplex) 기능은, 상향링 크 전송을 보다 효과적으로 하기 위해 상향링크 슬롯(slot)을 증가시켜 상향링크 데이터를 긴 시간동안 송신하 는 기술에 관련될 수 있다. XDD 기능이 활성화되는 경우, 시간 대역 상 일부 영역에서 하향링크와 상향링크가 중첩되게 된다. 따라서, 교차 링크 간섭(cross link interference, CLI)을 측정하기 위한 레퍼런스 신호 (reference signal, RS)의 전송이 필요하다. 이 경우, 단말은 XDD 기능이 비활성화된 경우에 비해 CLI 피드백 동작을 더 수행해야 하며, 상향링크 신호 또한 더욱 긴 시간 동안 송신해야 하므로, 단말의 전력 소모가 증가할 수 있다. XDD 기능의 실행 모드는 상향링크 슬롯이 추가로 할당된 구간에 따라 단계적으로 결정될 수 있다. 표 1 모드 내용 Mode 1 UL slot capability 100% Mode 2 UL slot capability 50% Mode 3 UL slot capability 0% 표 1을 참조하면, 일 실시 예에서 XDD 기능의 실행 모드는 상향링크 슬롯이 추가로 할당된 구간에 따라 3가지로 결정될 수 있다. 상향링크 슬롯 구간이 작을수록 시간 대역 상 하향링크와 중첩되는 구간이 좁고, 상향링크 신호를 짧은 시간 동안 송신하게 되어 저전력 모드이다. 따라서, 표 1의 실시 예에서 Mode 2가 Mode 1에 비해 저 전력 모드이고, Mode 3이 Mode 2에 비해 저전력 모드이다. 상향링크 슬롯 추가 할당 구간 0%에 대응하는 Mode 3 은 XDD 기능의 'OFF' 상태에 대응될 수도 있다. 한편, 표 1에서는 XDD 기능의 실행 모드가 3단계인 실시 예를 나타내고 있으나, 본 개시에 따른 XDD 기능의 실 행 모드는 보다 많은 단계로 구성되거나 보다 적은 단계로 구성될 수도 있다. 일 실시 예에서, 단말은 XDD 기능의 실행 모드를 변경하기로 결정한 경우, 해당 정보를 기지국에 전송하고 리소 스 할당 변경을 요청할 수 있다. 단말로부터 XDD 기능의 실행 모드 변경에 따른 리소스 할당 변경 요청 메시지 를 수신한 기지국은 리소스 할당 변경 응답 메시지를 단말로 전송할 수 있다. 또는, 단말은 상태 정보에 따라 XDD 기능의 지원이 불가하다는 정보를 기지국에 전송할 수도 있다. Multi-TRP(transmission and reception point) 기능은, 단말이 복수의 기지국들에 동시에 같은 데이터를 전송 하거나 안테나 빔을 제어함으로써 상향링크 전송을 보다 효과적으로 하기 위한 기지국 간 협력 통신 기술과 관 련될 수 있다. 일 실시 예에서, 단말은 복수의 기지국과 동일한 포트(port) 및 동일한 자원(resource)을 통해 통신할 수도 있고(coherent joint transmission, JT), 기지국에 따라 상이한 포트 및 상이한 자원을 통해 통신 할 수도 있다(non-coherent JT). 단말이 복수의 기지국과 통신하는 경우, 채널 수가 증가함으로써 높은 데이터 처리량(throughput)을 가질 수 있고, 상향링크 커버리지의 증가 및 단말의 이동성(mobility) 향상이 가능하다. 한편, 채널 수의 증가로 인해 방대한 양의 CSI 피드백을 수행해야 하며 단말의 전력 소모가 증가할 수 있다. Multi-TRP 기능의 실행 모드는 단말이 연결된 기지국의 개수에 따라 단계적으로 결정될 수 있다. 표 2 모드 내용 Mode 1 Connected TRP # = 4 Mode 2 Connected TRP # = 2 Mode 3 Connected TRP # = 1 표 2를 참조하면, 일 실시 예에서 Multi-TRP 기능의 실행 모드는 단말에 연결된 기지국의 개수에 따라 3가지로 결정될 수 있다. 단말에 연결된 기지국의 개수가 작을수록 채널 수가 적어 저전력 모드이다. 따라서, 표 2의 실 시 예에서 Mode 2가 Mode 1에 비해 저전력 모드이고, Mode 3이 Mode 2에 비해 저전력 모드이다. 단말에 연결된 기지국의 개수가 1인 Mode 3은 Multi-TRP 기능의 'OFF' 상태에 대응될 수도 있다. 한편, 표 2에서는 Multi-TRP 기능의 실행 모드가 3단계인 실시 예를 나타내고 있으나, 본 개시에 따른 Multi- TRP 기능의 실행 모드는 보다 많은 단계로 구성되거나 보다 적은 단계로 구성될 수도 있다. 일 실시 예에서, 단말은 Multi-TRP 기능의 실행 모드를 변경하기로 결정한 경우, 해당 정보를 기지국에 전송할 수 있다. 또는, 단말은 Multi-TRP 기능의 실행 모드 변경을 기지국에게 명시적으로 알리는 대신 총 채널 수보다 적은 N 개의 채널에 대해서만 채널 상태 정보를 측정하여 기지국에 피드백할 수도 있다. 이 경우, 단말은 CSI 피드백의 PMI(precoding matrix indicator)를 CSI 코드북 레이어 N으로 제한할 수 있고, RI(rank indicator) 또한 N으로 기지국에 보고할 수 있다. 또는, 단말은 상태 정보에 따라 Multi-TRP 기능의 지원이 불가하다는 정 보를 기지국에 전송할 수도 있다. 인공지능 모델 이용 기능은, 단말 또는 기지국의 동작에 인공지능 모델이 이용되는 기술에 관련될 수 있다. 예를 들어, 인공지능 모델 이용 기능은 단말의 증폭기(power amplifier)의 백오프(backoff)를 완화하는 동작에 인공지능 기반의 비선형 보상기(nonlinear compensator)가 이용되는 기술에 관련될 수 있다. 백오프는 증폭기의 최대 출력전력 대비 전송 전력의 차이를 나타낸다. 증폭기의 백오프를 완화하는 경우, 단말의 전송 전력이 증가 하여 상향링크 빔 전송 거리가 증가할 수 있으나, 선형성(linearity)이 손상된다는 반대급부가 존재한다. 일 실 시 예에서, 기지국은 인공지능 모델을 이용하여 단말의 송신부 증폭기 특성을 학습하고, 단말 증폭기의 백오프 를 완화하여 전송 전력을 증가시키면서도 손상된 선형성을 기지국 수신부에서 보상해 줌으로서 상향링크의 스펙 트럼 효율(spectral efficiency)를 향상시킬 수 있다. 즉, 증폭기 백오프를 완화하기 위해 단말은 방출 빔의 세 기를 증가시켜야 하며, 단말의 전력 소모가 증가할 수 있다. 단말의 증폭기 백오프를 완화하는 동작에 관련된 인공지능 모델 이용 기능의 실행 모드는 백오프 감소 정도에 따라 단계적으로 결정될 수 있다. 표 3 모드 내용 Mode 1 Backoff reduction 100% Mode 2 Backoff reduction 50% Mode 3 Backoff reduction 0% 표 3을 참조하면, 일 실시 예에서 단말의 단말의 증폭기 백오프를 완화하는 동작에 관련된 인공지능 모델 이용 기능의 실행 모드는 백오프 감소 정도에 따라 3가지로 결정될 수 있다. 백오프 감소 정도가 작을수록 저전력 모 드이다. 따라서, 표 3의 실시 예에서 Mode 2가 Mode 1에 비해 저전력 모드이고, Mode 3이 Mode 2에 비해 저전력 모드이다. 백오프 감소 정도 0%에 대응하는 Mode 3은 인공지능 모델 이용 기능의 'OFF' 상태에 대응될 수도 있 다. 한편, 표 3에서는 인공지능 모델 이용 기능의 실행 모드가 3단계인 실시 예를 나타내고 있으나, 본 개시에 따른 인공지능 모델 이용 기능의 실행 모드는 보다 많은 단계로 구성되거나 보다 적은 단계로 구성될 수도 있다. 일 실시 예에서, 단말은 인공지능 모델 이용 기능의 실행 모드를 변경하기로 결정한 경우, 해당 정보를 기지국 에 전송할 수 있다. 또는, 단말은 상태 정보에 따라 인공지능 모델 이용 기능의 지원이 불가하다는 정보를 기지 국에 전송할 수도 있다. 인공지능 모델 이용 기능은, 단말 혹은 기지국의 동작에 인공지능 모델이 이용되는 또 다른 기술에 관련될 수도 있다. 예를 들어, 인공지능 모델 이용 기능은 단말이 실시간으로 CSI를 추론하는 동작에 인공지능 모델이 이용되는 기 술에 관련될 수 있다. 다양한 기능이 실행됨에 따라 채널 수가 증가하면, 단말이 측정해야하는 CSI 양도 많아지 고, 방대한 CSI 피드백을 기지국으로 보고하는 과정에서 자원 소모가 크다. 이에 따라, CSI 피드백 과정에서의 자원 소모를 줄이기 위해 CSI를 압축해서 전송하는 방법인 CSI 압축(CSI compression) 기술이 적용될 수 있다. 일 실시 예에서, CSI 압축을 위한 오토인코더(autoencoder)는 단말 측의 인코더 및 기지국 측의 디코더를 포함 할 수 있고, 인코더 및 디코더는 각각 인공지능 모델을 포함할 수 있다. 단말의 다양한 인공지능 관련 동작에 대한 인공지능 모델 이용 기능의 실행 모드는 기능의 'ON' 상태에 대응되 는 모드와 기능의 'OFF' 상태에 대응되는 모드로 결정될 수 있다. 표 4 모드 내용 Mode 1 feature ON state Mode 2 feature OFF state 표 4를 참조하면, 일 실시 예에서 인공지능 모델 이용 기능의 실행 모드는 ON/OFF 상태에 따라 2가지로 결정될 수 있다. 특정 기능이 실행되는 것보다 실행되지 않는 것이 상대적으로 저전력 모드이다. 따라서, 표 4의 실시 예에서 Mode 2가 Mode 1에 비해 저전력 모드이다. 한편, 표 4에서는 인공지능 모델 이용 기능의 실행 모드가 2단계인 실시 예를 나타내고 있으나, 본 개시에 따른 인공지능 모델 이용 기능의 실행 모드는 보다 많은 단계로 구성될 수도 있다. 일 실시 예에서, 단말 모뎀(modem)은 인공지능 모델 이용 기능의 실행 모드를 변경하기로 결정한 경우, 해당 정 보를 기지국 등의 외부 장치 또는 단말 내부의 GPU나 CPU(AI orchestrator) 등의 내부 프로세서에 전송할 수 있 다. 또는, 단말은 상태 정보에 따라 인공지능 모델 이용 기능의 지원이 불가하여 관련된 데이터가 제공되지 않 을 것임을 나타내는 정보를 기지국 또는 단말 내부의 프로세서에 전송할 수도 있다. 도 1을 다시 참조하면, 단말은 획득한 상태 정보에 기초하여 단말에서 실행중인 통신 플랫폼 기능(제1 기능, 제2 기능, 제3 기능, 제4 기능)들 각각의 실행 모드를 제어 또는 변경할 수 있다. 예를 들어, 획득한 상태 정보는 잔여 배터리 용량, 단위 시간당 전력 소모량, 단위 시간당 데이터 처리량, 데이 터 전송 속도, 또는 발열량 중 적어도 하나를 포함할 수 있다. 상태 정보는 단말에 포함된 센서를 통해 획득될 수 있다. 예를 들어, 단말은 배터리 용량에 기초하여 실행중인 기능(제1 기능, 제2 기능, 제3 기능, 제4 기능)들의 실행 모드를 저전력(low-power) 모드로 변경하기로 결정할 수 있다. 반대로, 단말은 배 터리 용량이 충분하다는 것을 지시하는 상태 정보를 획득한 경우, 실행중인 기능(제1 기능, 제2 기능 , 제3 기능, 제4 기능)들을 저전력 모드에서 일반 모드로 변경하기로 결정할 수도 있다. 즉, 단 말은 상태 정보(배터리 용량)에 기초하여 저전력 모드로 진입하거나 저전력 모드를 해제할 것을 결정할 수 있다. 예를 들어, 단말은 발열량에 기초하여 실행중인 기능(제1 기능, 제2 기능, 제3 기능, 제4 기능)들의 실행 모드를 발열 제어 모드로 변경하기로 결정할 수 있다. 반대로, 단말은 발열량이 작다 는 것을 지시하는 상태 정보를 획득한 경우, 실행중인 기능(제1 기능, 제2 기능, 제3 기능, 제4 기능)들을 발열 제어 모드에서 일반 모드로 변경하기로 결정할 수도 있다. 즉, 단말은 상태 정보(발열 량)에 기초하여 발열 제어 모드로 진입하거나 발열 제어 모드를 해제할 것을 결정할 수 있다. 예를 들어, 단말은 단위 시간당 데이터 처리량(throughput)에 기초하여 실행중인 기능(제1 기능, 제2 기능, 제3 기능, 제4 기능)들의 실행 모드를 급속 모드로 변경하기로 결정할 수 있다. 반대로, 단말은 시간당 데이터 처리량이 충분하다는 것을 지시하는 상태 정보를 획득한 경우, 실행중인 기능(제1 기 능, 제2 기능, 제3 기능, 제4 기능)들을 급속 모드에서 완속 모드로 변경하기로 결정할 수 도 있다. 즉, 단말은 상태 정보(시간당 데이터 처리량)에 기초하여 급속 모드로 진입하거나 급속 모드를 해 제할 것을 결정할 수 있다. 일 실시예에서, 단말은 획득한 상태 정보 또는 기능 특성에 기초하여 단말에서 실행중인 기능(제1 기능 , 제2 기능, 제3 기능, 제4 기능)들 각각의 우선 순위(priority)를 결정할 수 있다. 이후, 결정된 우선 순위에 기초하여 실행중인 기능(제1 기능, 제2 기능, 제3 기능, 제4 기능 )들 중 실행 모드를 변경할 적어도 하나의 기능을 식별할 수 있다. 예를 들어, 기능의 실행 모드를 저전력 모드 또는 발열 제어 모드 등으로 변경할 필요가 있는 경우, 즉, 현재 실행중인 기능의 제한이 필요한 경우, 단말은 우선 순위가 낮은 기능부터 실행 모드를 변경하기로 결정할 수 있다. 반대로, 기능의 실행 모드를 저전력 모드의 해제 또는 발열 제어 모드의 해제로 변경할 필요가 있는 경우, 즉, 현재 실행중인 기능의 강화가 필요한 경우, 단말은 우선 순위가 높은 기능부터 실행 모드를 변경 하기로 결정할 수 있다. 도 1의 기능 모드 변경 후의 단말을 참조하면, 일 실시 예에서 단말은 실행중인 4개의 기능(제1 기능 , 제2 기능, 제3 기능, 제4 기능)들 중 3개의 기능(제1 기능, 제2 기능, 제3 기능)에 대해 실행 모드 변경을 결정할 수 있다. 제1 기능의 실행 모드는 'OFF' 상태로 변경될 수 있다. 예를 들어, 단말에서 실행되고 있는 기능(제1 기능, 제2 기능, 제3 기능, 제4 기능)들 간의 우선 순위에 따라 제1 기능이 우선 순 위가 제일 낮고 기능이 실행되지 않아도 무방한 경우, 단말은 단말 상태 정보에 기초하여 제1 기능을 'OFF' 모드로 변경할 수 있다. 'OFF' 모드로 변경된 제1 기능의 경우 비활성화되거나 하위 버전의 통 신 기술로 변경된 것으로 볼 수 있다. 예를 들어, 제1 기능이 XDD 기능일 경우, 모드 변경 후 단말 에 서 제1 기능은 XDD 기능이 비활성화되고, 하위 버전 기능인 TDD(time division duplex) 기능이 활성화되 어 구현될 수 있다. 제2 기능의 실행 모드는 Mode 2-3으로 변경될 수 있다. 예를 들어, 제2 기능의 실행 모드는 적어도 3 개의 모드 Mode 2-1, Mode 2-2, 및 Mode 2-3을 포함할 수 있고, Mode 2-2가 Mode 2-1에 비해 저전력 모드이고, Mode 2-3이 Mode 2-2에 비해 저전력 모드일 수 있다. 즉, 도 1을 참조하면, 제2 기능은 단말의 상태 정보 및 필요에 따라 Mode 2-1에서 Mode 2-3으로 두 단계 조절될 수 있다. 제3 기능의 실행 모드는 Mode 3-2로 변경될 수 있다. 예를 들어, 제3 기능의 실행 모드는 적어도 2개 의 모드 Mode 3-1 및 Mode 3-2를 포함할 수 있다. 일 실시 예에서, Mode 3-1이 Mode 3-2에 비해 저전력 모드일 수도 있고, Mode 3-2가 Mode 3-1에 비해 저전력 모드일 수도 있다. 즉, 도 1을 참조하면, 제3 기능은 단말 의 상태 정보 및 필요에 따라 Mode 3-1에서 Mode 3-2로 조절될 수 있다. 실행 모드가 변경되지 않은 제4 기능은 변경 후에도 동일한 모드로 실행될 수 있다. 도 2는 본 개시의 일 실시 예에 따른, 무선 통신 시스템에서 단말이 실행중인 기능의 실행 모드를 제어하는 방 법의 흐름도이다. 일 실시 예에서, 단말은 상태 정보에 따라, 실행중인 기능들 중 적어도 하나의 실행 모드를 변경하기로 결정할 수 있다. 단계 210에서, 단말은 단말의 상태 정보를 획득한다. 예를 들어, 단말은 잔여 배터리 용량, 단위 시간당 전력 소모량, 단위 시간당 데이터 처리량, 데이터 전송 속도, 또는 발열량 중 적어도 하나를 정보를 획득할 수 있다. 일 실시 예에서, 단말의 상태 정보는 단말에 포함된 센서(sensor)를 통해 획득될 수 있다. 단말의 상태 정보는 기 설정된 주기로 획득될 수 있다. 예를 들어, 단말은 10초 간격으로 상태 정보를 측정 또 는 획득할 수 있다. 단계 220에서, 단말은 실행중인 기능들 각각의 실행 모드를 식별한다. 일 실시 예에서, 단계 220은 전술한 단계 210보다 선행될 수도 있고, 단계 210과 동시에 수행될 수도 있다. 일 실시 예에서, 단말은 현재 실행중인 기능들의 리스트, 현재 실행하고 있지는 않으나 단말에서 실행 가능한 기능들의 리스트, 또는 각각의 기능들의 실행 모드에 대한 정보 중 적어도 하나를 획득할 수 있다. 예를 들어, 기능은 X-MIMO(extreme Multiple-Input Multiple-Output) 기능, 고주파수 이용 기능, XDD(cross division duplex) 기능, Multi-TRP(transmission and reception port) 기능, 인공지능(artificial intelligence, AI) 모델 이용 기능, 또는 그 밖에 다양한 기능들을 포함할 수 있다. 특정 기능의 실행 모드는 두 개 이상으로 분류 될 수 있고, 서로 다른 실행 모드로 특정 기능이 실행될 경우 대응되는 단말의 상태 정보가 달라질 수 있다. 단계 230에서, 단말은 획득한 상태 정보에 기초하여 단말에서 실행중인 기능들 중 실행 모드를 변경할 적어도 하나의 기능을 식별한다. 실행 모드를 변경할 적어도 하나의 기능은, 기능 식별에 기초가 되는 상태 정보에 따라 달라질 수 있다. 일 실시예에서, 단말에서 실행중인 기능들 중 실행 모드를 변경할 적어도 하나의 기능을 식별하는 동작은, 단말 의 상태 정보에 기초하여 단말에서 실행중인 기능들 각각의 우선 순위(priority)를 결정하는 동작 및 결정된 우 선 순위에 기초하여 단말에서 실행중인 기능들 중 실행 모드를 변경할 적어도 하나의 기능을 식별하는 동작을 포함할 수 있다. 예를 들어, 기능의 실행 모드를 저전력 모드 또는 발열 제어 모드 등으로 변경할 필요가 있는 경우, 즉, 현재 실행중인 기능의 제한이 필요한 경우, 단말은 우선 순위가 낮은 기능부터 실행 모드를 변경하기로 결정할 수 있 다. 반대로, 기능의 실행 모드를 저전력 모드의 해제 또는 발열 제어 모드의 해제로 변경할 필요가 있는 경우, 즉, 현재 실행중인 기능의 강화가 필요한 경우, 단말은 우선 순위가 높은 기능부터 실행 모드를 변경하기로 결 정할 수 있다. 일 실시 예에서, 실행 모드를 변경할 적어도 하나의 기능은 제1 기능 및 제2 기능을 포함할 수 있다. 이 경우, 식별된 적어도 하나의 기능의 실행 모드를 변경하는 동작은, 제1 기능의 실행 모드를 변경하고, 제1 기능의 실 행 모드가 변경됨에 따라 업데이트된 단말의 상태 정보를 획득하고, 단말의 업데이트된 상태 정보에 기초하여 제2 기능의 실행 모드를 변경할지 여부를 결정하는 동작을 포함할 수 있다. 하나의 기능에 대한 실행 모드를 변 경하고, 업데이트된 상태 정보에 기초하여 해당 기능 또는 다른 기능에 대한 실행 모드 추가 변경 여부를 결정 하는 동작은 후술할 도 3에서 보다 자세히 설명하도록 한다. 일 실시 예에서, 실행 모드는 '비활성화(deactivated)' 모드를 포함하고, 식별된 적어도 하나의 기능의 실행 모 드를 변경하는 동작은 단말에서 실행중인 적어도 하나의 기능을 비활성화하는 동작을 포함할 수 있다. 기능의 실행 모드가 '비활성화' 모드로 변경되는 동작은 전술한 도 1의 제1 기능이 'OFF' 모드로 변경되는 동작에 대응될 수 있다. 일 실시 예에서, 단말의 상태 정보를 획득한 단말 AP(Application processor)는, IPC(inter process command) 를 통해 단말 CP(Communication processor)에게 적어도 하나의 기능의 실행 모드를 변경하는 것을 지시할 수 있 다. 예를 들어, IPC 값은 적어도 하나의 기능의 실행 모드를 변경할 것을 나타내는 'TRUE' 또는 실행중인 기능 들의 실행 모드를 변경하지 않고 유지할 것을 나타내는 'FALSE' 값을 가질 수 있다. 예를 들어, IPC 값은 적어 도 하나의 기능의 실행 모드를 다운그레이드(downgrade)할 것을 나타내는 '-1', 실행중인 기능들의 실행 모드를 변경하지 않고 유지할 것을 나타내는 '0', 또는 적어도 하나의 기능의 실행 모드를 업그레이드(upgrade)할 것을나타내는 '1' 값을 가질 수도 있다. 한편, 단말 AP가 단말 CP로 전송하는 IPC의 값은 전술한 예시에 한정되는 것은 아니며, 다양한 형태로 구현될 수 있다. 일 실시예에서, 단말 CP가 단말 AP로부터 수신된 IPC에 대응되는 동작을 수행할 수 없는 경우, 수신된 IPC를 무 시할 수 있다. 예를 들어, 특정 기능의 현재 실행 모드가 가장 저전력 모드이고, 수신된 IPC 값이 실행 모드를 저전력 모드로 변경할 것을 나타내는 값이라면, 수신된 IPC를 무시할 수 있다. 또는, 특정 기능의 현재 실행 모 드가 일반 모드이고, 수신된 IPC 값이 실행 모드의 저전력 모드를 해제할 것을 나타내는 값이라면, 수신된 IPC 를 무시할 수 있다. 단계 240에서, 단말은 식별된 적어도 하나의 기능의 실행 모드를 변경한다. 일 실시예에서, 단말은 실행 모드 변경이 결정된 적어도 하나의 기능을 현재 실행중인 모드에서 다른 모드로 변경하거나, 기능의 실행을 중단할 수 있다. 일 실시 예에서, 단말이 자체적으로 기능의 실행 모드를 변경할 수 없는 경우에는, 기능 실행 모드를 변경하기로 결정된 정보를 포함하는 실행 모드 변경 요청 메시지를 기지국으로 전송할 수 있고, 기능의 실행 모 드는 기지국을 통해 제어될 수도 있다. 이와 같이, 본 개시의 일 실시 예에 따르면, 다양한 기술이 적용된 무선 통신 시스템에서 단말의 상황에 따라 실행되는 기능들 각각의 모드(mode)를 조절함으로써 효율적인 통신 서비스를 제공할 수 있다. 또한, 본 개시의 일 실시 예에 따르면, 단계적으로 기능들 각각의 모드를 조절함으로써 모뎀(modem)의 기능을 세부적으로 제한할 수 있고, 단말의 단위 시간당 전력 소모량, 단위 시간당 데이터 처리량, 데이터 전송 속도 또는 발열량 등의 특성을 필요에 따라 탄력적으로 제어할 수 있다. 도 3은 본 개시의 일 실시 예에 따른, 무선 통신 시스템에서 단말이 실행중인 적어도 하나의 기능의 실행 모드 를 제어하는 방법을 설명하기 위한 도면이다. 일 실시 예에서, 단말은 상태 정보에 따라, 실행중인 기능들 중 적어도 하나의 실행 모드를 변경하기로 결정할 수 있다. 단계 310에서 단말은 단말의 상태 정보를 획득한다. 예를 들어, 단말은 잔여 배터리 용량, 단위 시간당 전력 소 모량, 단위 시간당 데이터 처리량, 데이터 전송 속도, 또는 발열량 중 적어도 하나를 정보를 획득할 수 있고, 단말의 상태 정보는 단말에 포함된 센서를 통해 획득될 수 있다. 단말의 상태 정보는 기 설정된 주기로 획득될 수도 있다. 도 3의 단계 310은 전술한 도 2의 단계 210에 대응될 수 있다. 단계 320에서 단말은 획득된 상태 정보에 기초하여 현재 단말에서 실행중인 기능들 중 적어도 일부의 제어가 필 요한지 여부를 판단할 수 있다. 기능 실행 모드의 제어가 필요하지 않다고 판단된 경우, 방법은 단계 310으로 이동하여 이후 시점의 상태 정보 획득을 대기할 수 있다. 도 3의 단계 320은 전술한 도 2의 단계 220 및 230에 대응될 수 있다. 기능 실행 모드의 제어가 필요하다고 판단된 경우, 방법은 단계 330으로 이동한다. 단계 330에서 단말은 실행 모드의 제어가 필요한 것으로 결정된 제1 기능의 실행 모드를 변경할 수 있다. 제1 기능은 단말에서 현재 실행중인 기능들 중에서, 단말의 상태 정보 및 기능들 간의 우선 순위에 기초하여 선 택될 수 있다. 예를 들어, 기능의 실행 모드를 저전력 모드 또는 발열 제어 모드 등으로 변경할 필요가 있는 경 우, 즉, 현재 실행중인 기능의 제한이 필요한 경우, 단말은 우선 순위가 가장 낮은 기능을 제1 기능으로 선택할 수 있다. 반대로, 기능의 실행 모드를 저전력 모드의 해제 또는 발열 제어 모드의 해제로 변경할 필요가 있는 경우, 즉, 현재 실행중인 기능의 강화가 필요한 경우, 단말은 우선 순위가 가장 높은 기능을 제1 기능으로 선택 할 수 있다. 일 실시 예에서, 실행 모드는 '비활성화(deactivated)' 모드를 포함하고, 제1 기능의 실행 모드를 변경하는 동 작은 제1 기능을 비활성화하는 동작을 포함할 수 있다. 제1 기능의 실행 모드가 '비활성화' 모드로 변경되는 동 작은 전술한 도 1의 제1 기능이 'OFF' 모드로 변경되는 동작에 대응될 수 있다. 도 3의 단계 330은 전술한 도 2의 단계 240에 대응될 수 있다. 단계 340에서 단말은 제1 기능의 실행 모드가 변경됨으로써 업데이트된 단말의 상태 정보를 획득할 수 있다. 일 실시 예에서, 업데이트된 단말의 상태 정보는 단계 310의 단말 상태 정보 획득 시점으로부터 기 설정된 시간 간 격 이후에 획득될 수 있다. 단계 350에서 단말은 획득된 업데이트된 상태 정보에 기초하여 단말에서 실행중인 기능들 중 적어도 일부의 추 가적인 제어가 필요한지 여부를 판단할 수 있다. 기능 실행 모드의 추가적인 제어가 필요하지 않다고 판단된 경 우, 방법은 단계 310으로 이동하여 이후 시점의 상태 정보 획득을 대기할 수 있다. 기능 실행 모드의 추가적인 제어가 필요하다고 판단된 경우, 방법은 단계 360으로 이동한다. 단계 360에서 단말 은 실행 모드의 변경이 가능한 실행중인 기능이 존재하는지 여부를 판단할 수 있다. 실행 모드의 변경이 가능한 실행중인 기능이 존재하지 않는 경우, 방법은 종료될 수 있다. 실행 모드의 변경이 가능한 실행중인 기능이 존재하는 것으로 판단된 경우, 방법은 단계 370으로 이동한다. 단 계 370에서 단말은 제어가 필요한 것으로 결정된 제2 기능의 실행 모드를 변경할 수 있다. 제2 기능은 단말에서 해당 시점에 실행중인 기능들 중에서, 단말의 상태 정보 및 기능들 간의 우선 순위에 기초 하여 선택될 수 있다. 예를 들어, 기능의 실행 모드를 저전력 모드 또는 발열 제어 모드 등으로 변경할 필요가 있는 경우, 즉, 해당 시점에 실행중인 기능의 제한이 필요한 경우, 단말은 우선 순위가 가장 낮은 기능을 제2 기능으로 선택할 수 있다. 반대로, 기능의 실행 모드를 저전력 모드의 해제 또는 발열 제어 모드의 해제로 변경 할 필요가 있는 경우, 즉, 해당 시점에 실행중인 기능의 강화가 필요한 경우, 단말은 우선 순위가 가장 높은 기 능을 제2 기능으로 선택할 수 있다. 일 실시 예에서, 실행 모드를 추가적으로 변경할 제2 기능은 단계 330에서 실행 모드가 변경된 제1 기능과 동일 할 수도 있고, 제1 기능과 상이한 기능일 수도 있다. 제2 기능이 제1 기능과 동일한 경우, 하나의 기능에 대해 단계적으로 실행 모드를 조절하는 실시 예를 나타낼 수 있다. 일 실시 예에서, 실행 모드는 '비활성화(deactivated)' 모드를 포함하고, 제2 기능의 실행 모드를 변경하는 동 작은 제2 기능을 비활성화하는 동작을 포함할 수 있다. 제2 기능의 실행 모드가 '비활성화' 모드로 변경되는 동 작은 전술한 도 1의 제1 기능이 'OFF' 모드로 변경되는 동작에 대응될 수 있다. 도 4는 본 개시의 일 실시 예에 따른, 단말이 적어도 하나의 기능의 실행 모드를 변경하고, 실행 모드 변경 정 보를 기지국(base station, BS)으로 전송하는 동작을 설명하기 위한 도면이다. 도 4를 참조하면, 단말은 단말의 중앙처리장치로서 동작하는 UE AP(application processor) 및 단 말의 통신 모뎀으로 동작하는 UE CP(communication processor)를 포함할 수 있다. 단계 410에서, 단말은 UE AP를 통해 단말의 상태 정보를 획득할 수 있다. 도 4의 단계 410은 전술한 도 2의 단계 210 및 도 3의 단계 310 또는 340에 대응될 수 있다. 단계 420에서, UE AP는 UE CP에게 적어도 하나의 기능의 모드 변경 요청 메시지를 전송할 수 있다. 일 실시 예에서, 단말의 상태 정보를 획득한 UE AP는, IPC(inter process command)를 통해 UE CP에게 적어도 하나의 기능의 실행 모드를 변경하는 것을 지시할 수 있다. 예를 들어, IPC 값은 적어도 하나의 기능의 실행 모드를 변경할 것을 나타내는 'TRUE' 또는 실행중인 기능들의 실행 모드를 변경하지 않고 유지할 것을 나 타내는 'FALSE' 값을 가질 수 있다. 예를 들어, IPC 값은 적어도 하나의 기능의 실행 모드를 다운그레이드 (downgrade)할 것을 나타내는 '-1', 실행중인 기능들의 실행 모드를 변경하지 않고 유지할 것을 나타내는 '0', 또는 적어도 하나의 기능의 실행 모드를 업그레이드(upgrade)할 것을 나타내는 '1' 값을 가질 수도 있다. 한편, UE AP가 UE CP로 전송하는 IPC의 값은 전술한 예시에 한정되는 것은 아니며, 다양한 형태로 구현될 수 있다. 일 실시예에서, UE CP가 UE AP로부터 수신된 IPC에 대응되는 동작을 수행할 수 없는 경우, 수신된 IPC 를 무시할 수 있다. 예를 들어, 특정 기능의 현재 실행 모드가 가장 저전력 모드이고, 수신된 IPC 값이 실행 모 드를 저전력 모드로 변경할 것을 나타내는 값이라면, 수신된 IPC를 무시할 수 있다. 또는, 특정 기능의 현재 실 행 모드가 일반 모드이고, 수신된 IPC 값이 실행 모드의 저전력 모드를 해제할 것을 나타내는 값이라면, 수신된 IPC를 무시할 수 있다. 단계 430에서, 단말은 UE CP를 통해 식별된 제1 기능의 실행 모드를 변경할 수 있다. 도 4의 단계 430 은 전술한 도 2의 단계 230 내지 240, 및 도 3의 단계 330 또는 370에 대응될 수 있다. 단계 440에서, 단말은 기지국에게 제1 기능에 대한 실행 모드 변경 정보를 전송할 수 있다. 예를 들어, 단말이 기지국에게 전송하는 메시지에는 실행 모드가 변경된 대상 기능의 식별자(identity) 및 변경 후 의 실행 모드에 대한 정보를 포함할 수 있다. 일 실시 예에서, 단말이 기지국에게 전송하는 메시지는 실행 모드가 변경된 대상 기능 별로 독립적인 메시지로 구성될 수도 있다.일 실시 예에서, 단말이 자체적으로 기능의 실행 모드를 변경할 수 없는 경우에는, 기능 실행 모드를 변경 하기로 결정된 정보를 포함하는 실행 모드 변경 요청 메시지를 기지국으로 전송할 수 있고, 기능의 실행 모 드는 기지국을 통해 제어될 수도 있다. 예를 들어, 단말이 XDD 기능의 실행 모드를 변경하기로 결정한 경우, 해당 정보를 기지국에 전송하고 리소스 할당 변경을 요청할 수 있다. 단말로부터 XDD 기능의 실행 모드 변경에 따른 리소스 할당 변경 요청 메시지를 수신한 기지국은 리소스 할당 변경 응답 메시지를 단말로 전송할 수 있다. 또는, 단말은 상태 정보에 따라 XDD 기능의 지원이 불가하다는 정보를 기지국에 전송할 수도 있다. 예를 들어, 단말이 Multi-TRP 기능의 실행 모드를 변경하기로 결정한 경우, 해당 정보를 기지국에 전송 할 수 있다. 또는, 단말은 Multi-TRP 기능의 실행 모드 변경을 기지국에게 명시적으로 알리는 대신 총 채널 수보다 적은 N 개의 채널에 대해서만 채널 상태 정보를 측정하여 기지국에 피드백할 수도 있다. 이 경 우, 단말은 CSI 피드백의 PMI(precoding matrix indicator)를 CSI 코드북 레이어 N으로 제한할 수 있고, RI(rank indicator) 또한 N으로 기지국에 보고할 수 있다. 또는, 단말은 상태 정보에 따라 Multi-TRP 기능의 지원이 불가하다는 정보를 기지국에 전송할 수도 있다. 일 실시 예에서, 기능의 실행 모드 변경을 위해 기지국으로의 정보 제공이 필수적으로 요구되는 경우, 해당 기능의 실행 모드 변경 정보는 UAI(UE assistance information) 메시지에 포함되어 기지국으로 전송될 수 있다. 표 5"}
{"patent_id": "10-2022-0137651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "표 5는 UAI 메시지의 구조를 나타낸다. 본 개시의 일 실시예에 따른 기능 실행 모드 변경 정보는 UAI 메시지에 포함될 수 있다. 예를 들어, UAI 메시지는 아래의 표 6에 포함된 특징을 가질 수 있다. 표 6 Signaling radio bearer SRB1 RLC(radio link control)-SAP(service access point)AM(acknowledge mode) Logical Channel DCCH(dedicated control channel) direction UE to BS/network 이후, 일 실시 예에서, 기지국은 단말 또는 네트워크(network)로부터 RRC 연결의 릴리즈(release) 요청 을 수신함에 따라, RRC 연결을 릴리즈하고, 추가적인 요청이 없는 한 RRC 재연결을 방지할 수 있다. 일 실시 예 에서, 단말로부터의 릴리즈 요청은 LOWPWRCTRL_ACTION 메시지를 통해 수신될 수 있다.도 5는 본 개시의 일 실시 예에 따른 단말의 구성을 개략적으로 도시한 블록도이다. 도 5를 참조하면, 본 개시에 따른 단말은 프로세서와 메모리 및 송수신부로 구성될 수 있 다. 다만, 단말의 구성 요소가 전술한 예에 한정되는 것은 아니다. 예를 들어, 단말은 전술한 구성 요소들 보다 더 많은 구성 요소를 포함하거나 더 적은 구성 요소를 포함할 수도 있다. 일 실시 예에서, 프로세 서, 메모리, 및 송수신부는 하나의 칩(chip) 형태로 구현될 수도 있다. 프로세서는 하나 또는 복수의 프로세서로 구성될 수 있다. 이때, 하나 또는 복수의 프로세서는 CPU, AP, DSP(Digital Signal Processor) 등과 같은 범용 프로세서, GPU, VPU(Vision Processing Unit)와 같은 그래픽 전용 프로세서 또는 NPU와 같은 인공지능 전용 프로세서일 수 있다. 예를 들어, 하나 또는 복수의 프로세서가 인공지능 전용 프로세서인 경우, 인공지능 전용 프로세서는, 특정 인공지능 모델의 처리에 특화된 하드웨어 구 조로 설계될 수 있다. 프로세서는 상술한 본 개시의 실시 예에 따라 단말이 동작할 수 있도록 일련의 과정을 제어할 수 있 다. 예를 들면, 프로세서는 송수신부를 통해 제어 신호와 데이터 신호를 수신하고, 수신한 제어 신호 와 데이터 신호를 처리할 수 있다. 프로세서는 처리한 제어 신호와 데이터 신호를 송수신부를 통해 송신할 수 있다. 또한, 프로세서는 메모리에 저장된 기 정의된 동작 규칙 또는 인공지능 모델에 따라, 수신한 제어 신호와 데이터 신호에서 도출된 입력 데이터를 처리하도록 제어할 수 있다. 프로세서는 메모리에 데이터를 기록하고 읽을 수 있다. 그리고, 프로세서는 통신 규격에서 요구하는 프로토콜 스 택의 기능들을 수행할 수 있다. 일 실시 예에 따라, 프로세서는 적어도 하나의 프로세서(at least one processor)를 포함할 수 있다. 일 실시 예에서, 송수신부의 일부 또는 프로세서는 CP(communication processor)라 지칭될 수 있다. 메모리는 단말의 동작에 필요한 프로그램 및 데이터를 저장할 수 있다. 또한, 메모리는 단말 에서 획득되는 신호에 포함된 제어 정보 또는 데이터를 저장할 수 있다. 또한, 메모리는 단말에 서 사용되는 기 정의된 동작 규칙 또는 인공지능 모델을 저장할 수 있다. 메모리는 롬(ROM), 램(RAM), 하 드디스크, CD-ROM 및 DVD 등과 같은 저장 매체 또는 저장 매체들의 조합으로 구성될 수 있다. 또한, 메모리 는 별도로 존재하지 않고 프로세서에 포함되어 구성될 수도 있다. 메모리는 휘발성 메모리, 비 휘발성 메모리 또는 휘발성 메모리와 비휘발성 메모리의 조합으로 구성될 수 있다. 메모리는 프로세서 의 요청에 따라 저장된 데이터를 제공할 수 있다. 송수신부는 송신부와 수신부를 통칭한 것으로서, 단말의 송수신부는 기지국 또는 네트워크 엔티 티(Network Entity)와 신호를 송수신할 수 있다. 송수신하는 신호는 제어 정보 및 데이터를 포함할 수 있다. 이 를 위해, 송수신부는 전송되는 신호의 주파수를 상승 변환 및 증폭하는 RF 송신기와, 수신되는 신호를 저 잡음 증폭하고 주파수를 하강 변환하는 RF 수신기 등으로 구성될 수 있다. 다만, 이는 송수신부의 하나의 실시 예며, 송수신부의 구성 요소가 RF 송신기 및 RF 수신기에 한정되는 것은 아니다. 또한, 송수신부 는 무선 채널을 통해 신호를 수신하여 프로세서로 출력하고, 프로세서로부터 출력된 신호를 무 선 채널을 통해 전송할 수 있다. 일 실시 예에서, 프로세서는, 단말의 상태 정보를 획득하고, 단말에서 실행중인 기능들 각각의 실행 모드를 식별하고, 단말의 상태 정보에 기초하여, 단말에서 실행중인 기능들 중 실행 모드를 변 경할 적어도 하나의 기능을 식별하고, 식별된 적어도 하나의 기능의 실행 모드를 변경할 수 있다. 일 실시 예에서, 프로세서는 단말의 상태 정보에 기초하여, 단말에서 실행중인 기능들 각각의 우선 순위를 결정하고, 결정된 우선 순위에 기초하여 단말에서 실행중인 기능들 중 실행 모드를 변경할 적 어도 하나의 기능을 식별할 수 있다. 일 실시 예에서, 프로세서는 제1 기능의 실행 모드를 변경하고, 제1 기능의 실행 모드가 변경됨에 따라 업 데이트된 단말의 상태 정보를 획득하고, 단말의 업데이트된 상태 정보에 기초하여 제2 기능의 실행 모드를 변경할지 여부를 결정할 수 있다. 일 실시 예에서, 프로세서는 단말에서 실행중인 적어도 하나의 기능을 비활성화할 수 있다. 일 실시 예에서, 프로세서는 송수신부를 통해 적어도 하나의 기능의 실행 모드 변경 정보를 기지국으 로 전송할 수 있다. 도 6은 본 개시의 일 실시 예에 따른 기지국의 구성을 개략적으로 도시한 블록도이다. 도 6을 참조하면, 기지국은 송수신부, 프로세서, 및 메모리로 구성될 수 있다. 전술한 기 지국의 통신 방법에 따라, 기지국의 송수신부, 프로세서, 및 메모리가 동작할 수 있 다. 다만, 기지국의 구성 요소가 전술한 예에 한정되는 것은 아니다. 예를 들어, 기지국은 전술한 구 성 요소들 보다 더 많은 구성 요소를 포함하거나 더 적은 구성 요소를 포함할 수도 있다. 일 실시 예에서, 송수 신부, 프로세서, 및 메모리는 하나의 칩(chip) 형태로 구현될 수도 있다. 또한, 프로세서 는 하나 이상의 프로세서를 포함할 수 있다. 송수신부는 기지국의 수신부와 기지국의 송신부를 통칭한 것으로서, 단말 또는 네트워크 엔티티 (Network Entity)와 신호를 송수신할 수 있다. 단말 또는 네트워크 엔티티와 송수신하는 신호는 제어 정보 및 데이터를 포함할 수 있다. 이를 위해, 송수신부는 전송되는 신호의 주파수를 상승 변환 및 증폭하는 RF 송 신기와, 수신되는 신호를 저 잡음 증폭하고 주파수를 하강 변환하는 RF 수신기 등으로 구성될 수 있다. 다만, 이는 송수신부의 하나의 실시 예며, 송수신부의 구성 요소가 RF 송신기 및 RF 수신기에 한정되는 것 은 아니다. 또한, 송수신부는 무선 채널을 통해 신호를 송수신하기 위한 기능들을 수행할 수 있다. 예를 들어, 송수신 부는 무선 채널을 통해 신호를 수신하여 프로세서로 출력하고, 프로세서로부터 출력된 신호를 무선 채널을 통해 전송할 수 있다. 메모리는 기지국의 동작에 필요한 프로그램 및 데이터를 저장할 수 있다. 또한, 메모리는 기지 국에서 획득되는 신호에 포함된 제어 정보 또는 데이터를 저장할 수 있다. 메모리는 롬(ROM), 램(RAM), 하 드디스크, CD-ROM 및 DVD 등과 같은 저장 매체 또는 저장 매체들의 조합으로 구성될 수 있다. 또한, 메모리 는 별도로 존재하지 않고 프로세서에 포함되어 구성될 수도 있다. 메모리는 휘발성 메모리, 비 휘발성 메모리 또는 휘발성 메모리와 비휘발성 메모리의 조합으로 구성될 수 있다. 그리고, 메모리는 프로 세서의 요청에 따라 저장된 데이터를 제공할 수 있다. 프로세서는 상술한 본 개시의 실시 예에 따라 기지국이 동작할 수 있도록 일련의 과정을 제어할 수 있다. 예를 들면, 프로세서는 송수신부를 통해 제어 신호와 데이터 신호를 수신하고, 수신한 제어 신 호와 데이터 신호를 처리할 수 있다. 프로세서는 처리한 제어 신호와 데이터 신호를 송수신부를 통해 송신할 수 있다. 또한, 프로세서는 메모리에 데이터를 기록하거나 읽을 수 있다. 프로세서는 통 신 규격에서 요구하는 프로토콜 스택의 기능들을 수행할 수 있다. 이를 위해, 프로세서는 적어도 하나의 프로세서 또는 마이크로(micro) 프로세서를 포함할 수 있다. 일 실시 예에서, 송수신부의 일부 또는 프로 세서는 CP(communication processor)로 지칭될 수 있다. 프로세서는 하나 또는 복수의 프로세서로 구성될 수 있다. 이때, 하나 또는 복수의 프로세서는 CPU, AP, DSP(Digital Signal Processor) 등과 같은 범용 프로세서, GPU, VPU(Vision Processing Unit)와 같은 그래픽 전용 프로세서 또는 NPU와 같은 인공지능 전용 프로세서일 수 있다. 예를 들어, 하나 또는 복수의 프로세서가 인공지능 전용 프로세서인 경우, 인공지능 전용 프로세서는, 특정 인공지능 모델의 처리에 특화된 하드웨어 구 조로 설계될 수 있다. 일 실시 예에서, 프로세서는 송수신부를 통해 적어도 하나의 기능의 실행 모드 변경 정보를 단말로부 터 수신할 수 있다. 기능의 실행 모드 변경 정보는, 단말이 실행 모드를 변경한 적어도 하나의 기능과 관련된 정보를 포함할 수 있다. 예를 들어, 실행 모드 변경 정보는 변경 대상인 기능에 대한 식별자 또는 변경 후의 실 행 모드에 대한 정보 중 적어도 하나를 포함할 수 있다. 본 개시에 따른 인공지능과 관련된 기능은 프로세서와 메모리를 통해 동작된다. 프로세서는 하나 또는 복수의 프로세서로 구성될 수 있다. 이때, 하나 또는 복수의 프로세서는 CPU, AP, DSP(Digital Signal Processor) 등 과 같은 범용 프로세서, GPU, VPU(Vision Processing Unit)와 같은 그래픽 전용 프로세서 또는 NPU와 같은 인 공지능 전용 프로세서일 수 있다. 하나 또는 복수의 프로세서는, 메모리에 저장된 기 정의된 동작 규칙 또는 인 공지능 모델에 따라, 입력 데이터를 처리하도록 제어한다. 하나 또는 복수의 프로세서가 인공지능 전용 프로세 서인 경우, 인공지능 전용 프로세서는 특정 인공지능 모델의 처리에 특화된 하드웨어 구조로 설계될 수 있다. 기 정의된 동작 규칙 또는 인공지능 모델은 학습을 통해 만들어진 것을 특징으로 한다. 여기서, 학습을 통해 만 들어진다는 것은, 기본 인공지능 모델(또는, 딥러닝 모델)이 학습 알고리즘에 의하여 다수의 학습 데이터들을 이용하여 학습됨으로써, 원하는 특성(또는, 목적)을 수행하도록 설정된 기 정의된 동작 규칙 또는 인공지능 모 델이 만들어짐을 의미한다. 이러한 학습은 본 개시에 따른 인공지능이 수행되는 기기 자체에서 이루어질 수도있고, 별도의 서버 및/또는 시스템을 통해 이루어 질 수도 있다. 학습 알고리즘의 예로는, 지도형 학습 (supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또 는 강화 학습(reinforcement learning)이 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델(또는, 딥러닝 모델)은, 복수의 신경망 레이어들로 구성될 수 있다. 복수의 신경망 레이어들 각각 은 복수의 가중치들(weight values)을 갖고 있으며, 이전(previous) 레이어의 연산 결과와 복수의 가중치들 간 의 연산을 통해 신경망 연산을 수행한다. 복수의 신경망 레이어들이 갖고 있는 복수의 가중치들은 인공지능 모 델의 학습 결과에 의해 최적화될 수 있다. 예를 들어, 학습 과정 동안 인공지능 모델에서 획득한 로스(loss) 값 또는 코스트(cost) 값이 감소 또는 최소화되도록 복수의 가중치들이 갱신될 수 있다. 인공 신경망은 심층 신경 망(Deep Neural Network, DNN)를 포함할 수 있으며, 예를 들어, CNN(Convolutional Neural Network), RNN(Recurrent Neural Network), RBM(Restricted Boltzmann Machine), DBN(Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network) 또는 심층 Q-네트워크(Deep Q-Networks) 등이 있으나, 전술한 예에 한정되지 않는다. 본 개시의 다양한 실시 예들은 하나 이상의 컴퓨터 프로그램들에 의해 구현 또는 지원될 수 있고, 컴퓨터 프로 그램들은 컴퓨터 판독 가능한 프로그램 코드(code)로부터 형성되고, 컴퓨터로 판독 가능한 매체에 수록될 수 있 다. 본 개시에서, \"애플리케이션(application)\" 및 \"프로그램(program)\"은 컴퓨터 판독 가능한 프로그램 코드에 서의 구현에 적합한 하나 이상의 컴퓨터 프로그램, 소프트웨어 컴포넌트, 명령어 세트, 프로시저(procedure), 함수, 개체(object), 클래스, 인스턴스, 관련 데이터, 또는 그것의 일부를 나타낼 수 있다. \"컴퓨터 판독 가능 한 프로그램 코드\"는, 소스 코드, 목적 코드, 및 실행 가능한 코드를 포함하는 다양한 유형의 컴퓨터 코드를 포 함할 수 있다. \"컴퓨터 판독 가능한 매체\"는, ROM(read only memory), RAM(random access memory), 하드 디스 크 드라이브(HDD), CD(compact disc), DVD(digital video disc), 또는 다양한 유형의 메모리와 같이, 컴퓨터에 의해 액세스(access)될 수 있는 다양한 유형의 매체를 포함할 수 있다. 또한, 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형태로 제공될 수 있다. 여기 서, ‘비일시적 저장 매체'는 실재(tangible)하는 장치이고, 일시적인 전기적 또는 다른 신호들을 전송하는 유 선, 무선, 광학적, 또는 다른 통신 링크들을 배제할 수 있다. 한편, 이 '비일시적 저장 매체'는 데이터가 저장 매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는다. 예를 들어, '비일시적 저 장 매체'는 데이터가 임시적으로 저장되는 버퍼를 포함할 수 있다. 컴퓨터 판독 가능한 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포 함할 수 있다. 컴퓨터 판독 가능한 매체는, 데이터가 영구적으로 저장될 수 있는 매체와 데이터가 저장되고 나 중에 덮어쓰기 될 수 있는 매체, 이를테면 재기입 가능한 광 디스크 또는 소거 가능한 메모리 디바이스를 포함 한다. 일 실시 예에 따르면, 본 문서에 개시된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래 될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예를 들어, compact disc read only memory (CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어를 통해 또는 두 개의 사용자 장치들(예를 들 어, 스마트폰) 간에 직접, 온라인으로 배포(예를 들어, 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우 에, 컴퓨터 프로그램 제품(예를 들어, 다운로드 가능한 앱(downloadable app))의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다."}
{"patent_id": "10-2022-0137651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "전술한 본 개시의 설명은 예시를 위한 것이며, 본 개시가 속하는 기술분야의 통상의 지식을 가진 자는 본 개시 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 예를 들어, 설명된 기술들이 설명된 방법과 다른 순서로 수행되거나, '및'이나'또는'으로 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로 이상에서 기 술한 실시 예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가지로 분산된 것으로 설명되어 있는 구성 요 소들도 결합된 형태로 실시될 수 있다. 본 개시의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 개시의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2022-0137651", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시 예에 따른, 무선 통신 시스템에서 단말(user equipment, UE)이 실행중인 기능들 및 각각의 기능들의 실행 모드(mode)를 설명하기 위한 도면이다. 도 2는 본 개시의 일 실시 예에 따른, 무선 통신 시스템에서 단말이 실행중인 기능의 실행 모드를 제어하는 방 법의 흐름도이다. 도 3은 본 개시의 일 실시 예에 따른, 무선 통신 시스템에서 단말이 실행중인 적어도 하나의 기능의 실행 모드 를 제어하는 방법을 설명하기 위한 도면이다. 도 4는 본 개시의 일 실시 예에 따른, 단말이 적어도 하나의 기능의 실행 모드를 변경하고, 실행 모드 변경 정 보를 기지국(base station, BS)으로 전송하는 동작을 설명하기 위한 도면이다. 도 5는 본 개시의 일 실시 예에 따른 단말의 구성을 개략적으로 도시한 블록도이다. 도 6은 본 개시의 일 실시 예에 따른 기지국의 구성을 개략적으로 도시한 블록도이다."}
