{"patent_id": "10-2020-0093893", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0014464", "출원번호": "10-2020-0093893", "발명의 명칭": "촬영 장치를 이용한 중환자실 감시 시스템", "출원인": "부산대학교 산학협력단", "발명자": "남경원"}}
{"patent_id": "10-2020-0093893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "감시 대상(1)의 활력 징후가 출력되는 하나 이상의 활력 징후 감시 장치(10), 상기 활력 징후의 개선을 위해 설치되는 하나 이상의 활력 징후 개선 장치(20) 및 상기 감시 대상(1)과 유체 소통 가능하게 연결되어 상기 감시대상(1)으로부터 배출되는 유체가 저장되는 하나 이상의 유체 저장 장치(30)로 이루어진 그룹 중 하나 이상을포함하는 의료 장치(40);상기 의료 장치(40)를 촬영하는 하나 이상의 촬영 장치(50);상기 촬영 장치(50)의 상기 의료 장치(40)를 촬영한 결과인 제1 모니터링 결과를 이용하여 상기 활력 징후 감시장치(10)에서 출력되는 활력 징후 데이터(D1), 상기 활력 징후 개선 장치(20)에서 설정된 설정 데이터(D2) 및 상기 유체 저장 장치(30)에서의 저장 용량 데이터(D3)를 추출하는 연산 장치(60);감시 대상 각각마다 일대일 매칭되어 미리 결정되는 기준 활력 징후 데이터(D1_ref), 기준 설정 데이터(D2_ref)및 기준 저장 용량 데이터(D3_ref)가 저장되는 저장 장치(70); 및상기 연산 장치(60)에서 추출된 상기 활력 징후 데이터(D1)를 상기 기준 활력 징후 데이터(D1_ref)와비교하거나, 상기 설정 데이터(D2)를 상기 기준 설정 데이터(D2_ref)와 비교하거나, 상기 저장 용량 데이터(D3)를 상기 기준 저장 용량 데이터(D3_ref)와 비교하여, 비교 결과에 따라 제1 경고 신호(S1)를 생성하는 경고 장치(80);를 포함하는,촬영 장치를 이용한 중환자실 감시 시스템."}
{"patent_id": "10-2020-0093893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 활력 징후 감시 장치(10)에서 상기 감시 대상(1)의 심전도, 혈압, 호흡수, 혈중산소포화도 및 심박수를 포함하는 활력 징후 데이터(D1)가 활력 징후 감시 장치 모니터(11)를 통해 출력되고,상기 활력 징후 개선 장치(20)에서 약제 주입 속도, 약제 주입량, 약제 잔여량, 설정 온도, 인공호흡 구동모드, 인공호흡 설정 정보, 인공호흡 오류 정보를 포함하는 설정 데이터(D2)가 활력 징후 개선 장치 모니터를 통해 출력되며,상기 연산 장치(60)는 상기 제1 모니터링 결과를 이용하여, 각각의 의료 장치 모니터에서 출력되는 상기 활력징후 데이터(D1) 및 상기 설정 데이터(D2)를 추출하는,촬영 장치를 이용한 중환자실 감시 시스템."}
{"patent_id": "10-2020-0093893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 활력 징후 개선 장치(20)는 상기 감시 대상(1)에 약제를 주입하는 약제 주입 펌프(21)를 포함하고,상기 약제 주입 펌프(21)는,시린지(28)에 저장된 약제가 배출되도록 상기 시린지(28)에 결합되어 상기 약제를 가압하는 푸셔(P)를 구동시킴으로써 상기 시린지(28)로부터의 상기 약제 주입 속도를 제어하는 시린지 펌프(23)를 포함하며,공개특허 10-2022-0014464-3-상기 연산 장치(60)는, 상기 시린지(28)와 상기 푸셔(P)를 포함하는 상기 제1 모니터링 결과로부터 실제 약제주입 속도 및 상기 약제 잔여량을 더 추출하고,상기 경고 장치(80)는,상기 추출된 실제 약제 주입 속도와 상기 시린지 펌프(28)의 모니터에서 출력된 상기 약제 주입 속도를 비교하여, 비교 결과에 따라 상기 제1 경고 신호(S1)를 생성하고,상기 추출된 약제 잔여량이 기준 약제 잔여량보다 적은 경우, 상기 제1 경고 신호(S1)를 생성하는,촬영 장치를 이용한 중환자실 감시 시스템."}
{"patent_id": "10-2020-0093893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 연산 장치(60)는,상기 제1 모니터링 결과로부터 상기 시린지(28)의 선단과 상기 푸셔(P)의 선단 사이의 거리를 이용하여 상기 약제 잔여량을 추출하고,상기 제1 모니터링 결과로부터 상기 푸셔(P)의 이동 속도, 상기 푸셔(P)를 구동시키는 상기 시린지 펌프(23)의구동부(23a)의 이동 속도 또는 상기 구동부(23a)에 부착된 마커(23c)의 이동 속도를 이용하여 상기 실제 약제주입 속도를 추출하는,촬영 장치를 이용한 중환자실 감시 시스템."}
{"patent_id": "10-2020-0093893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 시린지(28)의 배출구에 연결된 배출 라인(22a)에 설치되어 상기 배출 라인(22a)을 가압하는 클램프(22e)를더 포함하고,상기 경고 장치(80)가 상기 실제 약제 주입 속도와 상기 시린지 펌프(23)의 모니터에서 출력된 상기 약제 주입속도를 비교하여, 비교 결과에 따라 상기 제1 경고 신호(S1)가 생성된 경우,상기 경고 장치(80)는 상기 배출 라인(22a)을 폐쇄하도록 상기 클램프(22e)의 동작을 제어하는,촬영 장치를 이용한 중환자실 감시 시스템."}
{"patent_id": "10-2020-0093893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서,상기 경고 장치(80)는, 상기 추출된 저장 용량 데이터(D3)가 상기 기준 저장 용량 데이터(D3_ref)보다 큰 경우상기 제1 경고 신호(S1)를 생성하는,촬영 장치를 이용한 중환자실 감시 시스템."}
{"patent_id": "10-2020-0093893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제2항에 있어서,상기 저장 장치(70)에는,공개특허 10-2022-0014464-4-상기 활력 징후 감시 장치(10) 및 상기 활력 징후 개선 장치(20) 각각의 제조사 및 모델에 매칭되는 형상 데이터(DS)들이 미리 저장되어 있으며,상기 연산 장치(60)는 상기 저장 장치(70)에 저장된 형상 데이터(DS)들을 이용하여 상기 제1 모니터링 결과에포함된 상기 활력 징후 감시 장치(10) 및 상기 활력 징후 개선 장치(20)의 제조사 및 모델을 특정하고,상기 저장 장치(70)에는,상기 활력 징후 감시 장치(10)의 각 제조사 및 모델마다 상기 활력 징후 감시 장치(10)의 모니터 상에서 출력되는 상기 활력 징후의 표시 패턴들과, 상기 활력 징후 개선 장치(20)의 모니터 상에서 출력되는 설정 데이터의표시 패턴들이 미리 저장되어 있으며,상기 연산 장치(60)는 특정된 모델에 매칭되는 표시 패턴에 따라 상기 제1 모니터링 결과로부터 상기 활력 징후데이터(D1) 및 상기 설정 데이터(D2)를 추출하는,촬영 장치를 이용한 중환자실 감시 시스템."}
{"patent_id": "10-2020-0093893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 활력 징후 개선 장치(20)는, 상기 감시 대상(1)에 약제를 주입하는 약제 주입 펌프(21), 상기 감시 대상(1)의 인공 호흡을 위한 인공호흡기(24) 및 상기 감시 대상(1)의 체온을 미리 설정된 온도로 유지시키는 체온유지 장치(25)를 포함하고,상기 약제 주입 펌프(21)의 모니터에서 상기 약제 주입 속도 및 상기 약제 주입량이 출력되고,상기 인공호흡기(24)의 모니터에서 상기 인공호흡 구동 모드, 상기 인공호흡 설정 정보 및 상기 인공호흡 오류정보가 출력되며,상기 체온 유지 장치(25)의 모니터에서 상기 설정 온도가 출력되는,촬영 장치를 이용한 중환자실 감시 시스템."}
{"patent_id": "10-2020-0093893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 약제 주입 펌프(21)는,약제가 저장되는 약제 저장백(27)과 유체 소통 가능하게 연결되는 배출 라인(22a)에 설치되어, 상기 약제 저장백(27)으로부터의 상기 약제 주입 속도를 제어하는 인퓨전 펌프(22)를 포함하고,상기 연산 장치(60)는, 상기 약제 저장백(27)과, 상기 약제 저장백(27)에 연결된 드립 챔버(22b)를 포함하는 상기 제1 모니터링 결과로부터 실제 약제 주입 속도 및 상기 약제 잔여량을 더 추출하고,상기 경고 장치(80)는,상기 추출된 실제 약제 주입 속도와 상기 인퓨전 펌프(22)의 모니터에서 출력된 상기 약제 주입 속도를 비교하여, 비교 결과에 따라 상기 제1 경고 신호(S1)를 생성하고,상기 연산된 약제 잔여량이 기준 잔여량보다 적은 경우, 상기 제1 경고 신호(S1)를 생성하는,촬영 장치를 이용한 중환자실 감시 시스템."}
{"patent_id": "10-2020-0093893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2022-0014464-5-제9항에 있어서,상기 연산 장치(60)는,상기 제1 모니터링 결과를 상기 약제 저장백(27)를 포함하는 제1 부분 영상과, 상기 드립 챔버(22b)를 포함하는제2 부분 영상으로 분할하고, 상기 제1 부분 영상으로부터 상기 약제 잔여량을 추출하고, 상기 제2 부분 영상으로부터 상기 실제 약제 주입 속도를 추출하는,촬영 장치를 이용한 중환자실 감시 시스템."}
{"patent_id": "10-2020-0093893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 연산 장치(60)는,상기 드립 챔버(22b)의 내부 상단의 유체 낙하구(22c)에 맺혀 있는 유체 방울의 부피가 증가하다가 미리 설정된비율 이상 감소하는 경우 1회의 드랍(drop)으로 판단하고, 드랍과 드랍 사이의 시간 간격을 이용하여 상기 실제약제 주입 속도를 추출하는,촬영 장치를 이용한 중환자실 감시 시스템."}
{"patent_id": "10-2020-0093893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 배출 라인(22a)에 설치되어 상기 배출 라인(22a)을 가압하는 클램프(22e)를 더 포함하고,상기 경고 장치(80)가 상기 실제 약제 주입 속도와 상기 인퓨전 펌프(22)의 모니터에서 출력된 상기 약제 주입속도를 비교하여, 비교 결과에 따라 상기 제1 경고 신호(S1)가 생성된 경우,상기 경고 장치(80)는 상기 배출 라인(22a)을 폐쇄하도록 상기 클램프(22e)의 동작을 제어하는,촬영 장치를 이용한 중환자실 감시 시스템."}
{"patent_id": "10-2020-0093893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 있어서,상기 의료 장치(40)가 설치된 공간에 구비되고, 상기 하나 이상의 촬영 장치(50)가 설치되어 상기 촬영 장치(50)의 이동을 안내하는 가이드 레일(R)을 더 포함하고,상기 하나 이상의 촬영 장치(50)는 상기 공간에 구비된 상기 의료 장치(40) 각각에 일대일 매칭되는 개수로 구비되는,촬영 장치를 이용한 중환자실 감시 시스템."}
{"patent_id": "10-2020-0093893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1항에 있어서,상기 제1 모니터링 결과는 상기 의료 장치(40) 중 통신 기능이 구비된 의료 장치를 제외한 나머지 의료 장치만을 촬영한 결과이고,상기 통신 기능이 구비된 의료 장치의 상기 활력 징후 데이터(D1) 및 상기 설정 데이터(D2)는 유무선 통신을 통해 상기 연산 장치(60)에 전송되는,공개특허 10-2022-0014464-6-촬영 장치를 이용한 중환자실 감시 시스템."}
{"patent_id": "10-2020-0093893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항에 있어서,상기 연산 장치(60)는,인공지능 알고리즘을 이용하여 상기 제1 모니터링 결과로부터 상기 활력 징후 데이터(D1), 상기 설정 데이터(D2)및 상기 저장 용량 데이터(D3)를 추출하는,촬영 장치를 이용한 중환자실 감시 시스템."}
{"patent_id": "10-2020-0093893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제1항에 있어서,상기 연산 장치(60) 및 상기 경고 장치(80)와 통신 연결되며, 상기 연산 장치(60)에 의해 추출된 상기 활력 징후 데이터(D1), 상기 설정 데이터(D2) 및 상기 저장 용량 데이터(D3)가 전송되어 전송된 데이터들이 출력되고,상기 경고 장치(80)에 의해 생성된 경고 신호가 전송되는 경우 미리 결정된 알람을 출력하는 하나 이상의 감시단말기(90)를 더 포함하는,촬영 장치를 이용한 중환자실 감시 시스템."}
{"patent_id": "10-2020-0093893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제1항에 따른 중환자실 감시 시스템을 이용한,감시 방법."}
{"patent_id": "10-2020-0093893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 따른 감시 방법을 실행하도록 컴퓨터 판독 가능한 기록 매체에 저장된,프로그램."}
{"patent_id": "10-2020-0093893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "감시 대상(1)의 활력 징후가 출력되는 하나 이상의 활력 징후 감시 장치(10), 상기 활력 징후의 개선을 위해 설치되는 하나 이상의 활력 징후 개선 장치(20) 및 상기 감시 대상(1)과 유체 소통 가능하게 연결되어 상기 감시대상(1)으로부터 배출되는 유체가 저장되는 하나 이상의 유체 저장 장치(30)로 이루어진 그룹 중 하나 이상을포함하는 의료 장치(40);상기 의료 장치(40)와 상기 감시 대상(1)을 촬영하는 하나 이상의 촬영 장치(50);상기 촬영 장치(50)의 상기 의료 장치(40)를 촬영한 결과인 제1 모니터링 결과를 이용하여 상기 활력 징후 감시장치(10)에서 출력되는 활력 징후 데이터(D1), 상기 활력 징후 개선 장치(20)에서 설정된 설정 데이터(D2) 및 상기 유체 저장 장치(30)에서의 저장 용량 데이터(D3)를 추출하고, 상기 촬영 장치(50)의 상기 감시 대상(1)을 촬영한 결과인 제2 모니터링 결과를 이용하여 의료 장치 정상 착용 여부, 낙상 위험 여부, 통증 레벨 및 의식 레벨 중 하나 이상을 포함하는 환자 감시 데이터(D4)를 추출하는, 연산 장치(60);감시 대상 각각마다 일대일 매칭되어 미리 결정되는 기준 활력 징후 데이터(D1_ref), 기준 설정 데이터(D2_ref)공개특허 10-2022-0014464-7-및 기준 저장 용량 데이터(D3_ref)가 저장되는 저장 장치(70); 및상기 연산 장치(60)에서 추출된 상기 활력 징후 데이터(D1)를 상기 기준 활력 징후 데이터(D1_ref)와비교하거나, 상기 설정 데이터(D2)를 상기 기준 설정 데이터(D2_ref)와 비교하거나, 상기 저장 용량 데이터(D3)를 상기 기준 저장 용량 데이터(D3_ref)와 비교하여, 비교 결과에 따라 제1 경고 신호(S1)를 생성하거나, 상기환자 감시 데이터(D4)가 미리 설정된 기준을 충족하는 경우 제2 경고 신호(S2)를 생성하는 경고 장치(80);를 포함하는,촬영 장치를 이용한 중환자실 감시 시스템."}
{"patent_id": "10-2020-0093893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 경고 장치(80)는, 상기 환자 감시 데이터(D4)가 의료 장치 비정상 착용 또는 낙상 위험 있음을포함하거나, 상기 통증 레벨이 기준 통증 레벨보다 높거나, 상기 의식 레벨이 기준 의식 레벨보다 낮은 경우 상기 제2 경고 신호(S2)를 생성하는,촬영 장치를 이용한 중환자실 감시 시스템."}
{"patent_id": "10-2020-0093893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제19항에 따른 중환자실 감시 시스템을 이용한,감시 방법."}
{"patent_id": "10-2020-0093893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제21항에 따른 감시 방법을 실행하도록 컴퓨터 판독 가능한 기록 매체에 저장된,프로그램."}
{"patent_id": "10-2020-0093893", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 촬영 장치를 이용하여 중환자실에 구비된 의료 장치들, 그리고 감시 대상을 촬영하고, 활력 징후 데이 터, 설정 데이터, 저장 용량 데이터 및 환자 감시 데이터를 추출하며, 추출된 데이터들을 기준 데이터들과 비교 함으로써 중환자실 감시를 수행할 수 있는 시스템에 관한 것이다."}
{"patent_id": "10-2020-0093893", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 촬영 장치를 이용하여 중환자실에 구비된 의료 장치들, 그리고 감시 대상을 촬영하고, 활력 징후 데 이터, 설정 데이터, 저장 용량 데이터 및 환자 감시 데이터를 추출하며, 추출된 데이터들을 기준 데이터들과 비 교함으로써 중환자실 감시를 수행할 수 있는 시스템에 관한 것이다."}
{"patent_id": "10-2020-0093893", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "중환자실(ICU) 입원 환자들의 경우, 신체 상태에 따라 다양한 의료기기들이 동시에 사용된다. 예를 들어, 신체 활력(심전도, 혈압, 호흡 등) 감시를 위한 환자 감시 장치(Patient Monitor) 및 개별 신체활력 감시 장치, 자가 호흡 곤란자를 위한 인공호흡기, 처방약제투여 및 영양약제 주입을 위한 약물 주입 장치, 체온 유지를 위한 온 도 조절 장치, 수술 후 신체 내부에 남은 혈액을 외부로 배출하기 위한 음압통, 환자로부터 배출되는 소변을 보 관하기 위한 배뇨백 등이 환자 1명에 상시 사용되는 경우가 흔히 발생한다. 대부분의 중대형 의료기관에서는 중환자실 입원 환자의 신체활력 변화양상의 감시를 위해 개인 감시 장치와 중 앙 감시 장치의 조합으로 이루어진 중앙감시형 환자 감시 체계를 도입하여 운용하고 있는 경우가 많다. 하지만, 환자 감시 장치를 제외한 나머지 개인 감시 장치 및 개인용 의료 장치의 경우 이러한 중앙감시형 감시 체계가운용되지 아니하였다. 특히, 중앙 관리 서버와 데이터를 주고 받을 수 있는 통신 기능이 구비된 의료 장치도 존재하지만, 상기 통신 기능이 구비되지 않은 의료 장치(배뇨백, 수액백, 음압통 등)도 다양하게 존재하며, 의료 장치 제조 회사 간에 통신 기능이 서로 호환되지 않는 경우가 대부분이므로, 이들 모두를 아우르는 단일 감시 체계를 구축하는 것은 매우 어려운 문제로 인식되어 왔다. 또한, 중환자실에서 근무하는 간호인력이 수행하는 업무의 상당부분은 주기적으로 담당 환자들을 방문하여 수액 백 교체 필요 여부를 확인하고 교체하고, 개별 수액백 내 약제 주입 상태를 확인하고, 개별 의료 장치의 모니터 에 출력되는 값들(설정 정보, 측정 정보, 구동 정보)의 적절성을 확인하고 이를 수기로 기록하며, 수기로 기록 된 정보의 전산 입력 등이 차지하게 된다. 현재의 중환자실 관리체계 하에서 주기적 방문, 확인, 기록, 처치 업 무는 간호인력의 수작업 노동에 전적으로 의존하고 있어 간호인력들의 업무량 과다 및 이로 인한 피로 누적의 직접적 원인이 되고 있으며, 이는 또다시 과로, 피로에 시달리는 간호인력들의 집중력 저하로 인한 환자 오인 실수 및 기기 설정 실수로 이어져 결과적으로 환자에 큰 위해가 가해지는 사건, 사고로 연결되게 된다. 따라서, 중환자실 내 입원환자의 안전 강화 및 간호인력의 업무량 경감을 위해, 기존의 신체 활력 중앙감시체계와 함께 환자에 사용 중인 나머지 의료 장치들에 대한 중앙감시체계를 함께 구축하는 것이 필요하다. 선행기술문헌 특허문헌 (특허문헌 0001) 미국공개특허문헌 제2018/0122506호(2018.05.03) (특허문헌 0002) 미국등록특허문헌 제10,643,446호(2020.05.05) (특허문헌 0003) 한국등록특허문헌 제10-1788034호(2017.11.15)"}
{"patent_id": "10-2020-0093893", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위하여 안출된 것이다. 구체적으로, 중환자실에 구비된 의료 장치, 그리고 감시 대상을 촬영한 결과인 모니터링 결과로부터 활력 징후 데이터, 설정 데이터, 저장 용량 데이터 및 환자 감시 데이터를 추출하고, 추출된 데이터들을 기준 데이터들과 비교하여 미리 설정된 기준에 충족할 경우 알람이 출력되게 함으로써, 간호 인력의 수작업 노동이 아닌 하나의 시스템 상에서의 중환자 자동 감시를 수행할 수 있는 발명을 제공하는 것에 그 목적이 있다."}
{"patent_id": "10-2020-0093893", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 과제를 해결하기 위한 본 발명의 일 실시예는, 감시 대상의 활력 징후가 출력되는 하나 이상의 활력 징후 감시 장치, 상기 활력 징후의 개선을 위해 설치되는 하나 이상의 활력 징후 개선 장치 및 상 기 감시 대상과 유체 소통 가능하게 연결되어 상기 감시 대상으로부터 배출되는 유체가 저장되는 하나 이 상의 유체 저장 장치로 이루어진 그룹 중 하나 이상을 포함하는 의료 장치, 상기 의료 장치와 상기 감시 대상을 촬영하는 하나 이상의 촬영 장치, 상기 촬영 장치의 상기 의료 장치를 촬영한 결과 인 제1 모니터링 결과를 이용하여 상기 활력 징후 감시 장치에서 출력되는 활력 징후 데이터(D1), 상기 활 력 징후 개선 장치에서 설정된 설정 데이터(D2) 및 상기 유체 저장 장치에서의 저장 용량 데이터(D3)를 추출하는 연산 장치, 감시 대상 각각마다 일대일 매칭되어 미리 결정되는 기준 활력 징후 데이터(D1_ref), 기준 설정 데이터(D2_ref) 및 기준 저장 용량 데이터(D3_ref)가 저장되는 저장 장치 및 상기 연산 장치(6 0)에서 추출된 상기 활력 징후 데이터(D1)를 상기 기준 활력 징후 데이터(D1_ref)와 비교하거나, 상기 설정 데이 터(D2)를 상기 기준 설정 데이터(D2_ref)와 비교하거나, 상기 저장 용량 데이터(D3)를 상기 기준 저장 용량 데이터(D3_ref)와 비교하여, 비교 결과에 따라 제1 경고 신호(S1)를 생성하는 경고 장치를 포함하는, 촬영 장치 를 이용한 중환자 감시 시스템을 제공한다. 일 실시예에 있어서, 상기 활력 징후 감시 장치에서 상기 감시 대상의 심전도, 혈압, 호흡수, 혈중산소 포화도 및 심박수를 포함하는 활력 징후 데이터(D1)가 활력 징후 감시 장치 모니터를 통해 출력되고, 상기 활력 징후 개선 장치에서 약제 주입 속도, 약제 주입량, 약제 잔여량, 설정 온도, 인공호흡 구동 모드, 인 공호흡 설정 정보, 인공호흡 오류 정보를 포함하는 설정 데이터(D2)가 활력 징후 개선 장치 모니터를 통해 출력 되며, 상기 연산 장치는 상기 제1 모니터링 결과를 이용하여, 각각의 의료 장치 모니터에서 출력되는 상기 활력 징후 데이터(D1) 및 상기 설정 데이터(D2)를 추출할 수 있다. 일 실시예에 있어서, 상기 활력 징후 개선 장치는 상기 감시 대상에 약제를 주입하는 약제 주입 펌프 를 포함하고, 상기 약제 주입 펌프는, 시린지에 저장된 약제가 배출되도록 상기 시린지에 결합 되어 상기 약제를 가압하는 푸셔(P)를 구동시킴으로써 상기 시린지로부터의 상기 약제 주입 속도를 제어하 는 시린지 펌프를 포함하며, 상기 연산 장치는, 상기 시린지와 상기 푸셔(P)를 포함하는 상기 제1 모니터링 결과로부터 실제 약제 주입 속도 및 상기 약제 잔여량을 더 추출하고, 상기 경고 장치는, 상기 추 출된 실제 약제 주입 속도와 상기 시린지 펌프의 모니터에서 출력된 상기 약제 주입 속도를 비교하여, 비교 결과에 따라 상기 제1 경고 신호(S1)를 생성하고, 상기 추출된 약제 잔여량이 기준 약제 잔여량보다 적은 경우, 상기 제1 경고 신호(S1)를 생성할 수 있다. 일 실시예에 있어서, 상기 연산 장치는, 상기 제1 모니터링 결과로부터 상기 시린지의 선단과 상기 푸 셔(P)의 선단 사이의 거리를 이용하여 상기 약제 잔여량을 추출하고, 상기 제1 모니터링 결과로부터 상기 푸셔 (P)의 이동 속도, 상기 푸셔(P)를 구동시키는 상기 시린지 펌프의 구동부(23a)의 이동 속도 또는 상기 구동 부(23a)에 부착된 마커(23c)의 이동 속도를 이용하여 상기 실제 약제 주입 속도를 추출할 수 있다. 일 실시예에 있어서, 상기 시린지의 배출구에 연결된 배출 라인(22a)에 설치되어 상기 배출 라인(22a)을 가 압하는 클램프(22e)를 더 포함하고, 상기 경고 장치가 상기 실제 약제 주입 속도와 상기 시린지 펌프의 모니터에서 출력된 상기 약제 주입 속도를 비교하여, 비교 결과에 따라 상기 제1 경고 신호(S1)가 생성된 경우, 상기 경고 장치는 상기 배출 라인(22a)을 폐쇄하도록 상기 클램프(22e)의 동작을 제어할 수 있다. 일 실시예에 있어서, 상기 경고 장치는, 상기 추출된 저장 용량 데이터(D3)가 상기 기준 저장 용량 데이터 (D3_ref)보다 큰 경우 상기 제1 경고 신호(S1)를 생성할 수 있다. 일 실시예에 있어서, 상기 경고 장치는, 상기 환자 감시 데이터(D4)가 의료 장치 비정상 착용 또는 낙상 위 험 있음을 포함하거나, 상기 통증 레벨이 기준 통증 레벨보다 높거나, 상기 의식 레벨이 기준 의식 레벨보다 낮 은 경우 상기 제2 경고 신호(S2)를 생성할 수 있다. 일 실시예에 있어서, 상기 저장 장치에는, 상기 활력 징후 감시 장치 및 상기 활력 징후 개선 장치 각각의 제조사 및 모델에 매칭되는 형상 데이터(DS)들이 미리 저장되어 있으며, 상기 연산 장치는 상기 저 장 장치에 저장된 형상 데이터(DS)들을 이용하여 상기 제1 모니터링 결과에 포함된 상기 활력 징후 감시 장 치 및 상기 활력 징후 개선 장치의 제조사 및 모델을 특정하고, 상기 저장 장치에는, 상기 활력 징 후 감시 장치의 각 제조사 및 모델마다 상기 활력 징후 감시 장치의 모니터 상에서 출력되는 상기 활력 징후의 표시 패턴들과, 상기 활력 징후 개선 장치의 모니터 상에서 출력되는 설정 데이터의 표시 패턴들이 미리 저장되어 있으며, 상기 연산 장치는 특정된 모델에 매칭되는 표시 패턴에 따라 상기 제1 모니터링 결 과로부터 상기 활력 징후 데이터(D1) 및 상기 설정 데이터(D2)를 추출할 수 있다. 일 실시예에 있어서, 상기 활력 징후 개선 장치는, 상기 감시 대상에 약제를 주입하는 약제 주입 펌프 , 상기 감시 대상의 인공 호흡을 위한 인공호흡기 및 상기 감시 대상의 체온을 미리 설정된 온도 로 유지시키는 체온 유지 장치를 포함하고, 상기 약제 주입 펌프의 모니터에서 상기 약제 주입 속도 및 상기 약제 주입량이 출력되고, 상기 인공호흡기의 모니터에서 상기 인공호흡 구동 모드, 상기 인공호흡 설 정 정보 및 상기 인공호흡 오류 정보가 출력되며, 상기 체온 유지 장치의 모니터에서 상기 설정 온도가 출 력될 수 있다.일 실시예에 있어서, 상기 약제 주입 펌프는, 약제가 저장되는 약제 저장백과 유체 소통 가능하게 연결 되는 배출 라인(22a)에 설치되어, 상기 약제 저장백로부터의 상기 약제 주입 속도를 제어하는 인퓨전 펌프 를 포함하고, 상기 연산 장치는, 상기 약제 저장백과, 상기 약제 저장백에 연결된 드립 챔버 (22b)를 포함하는 상기 제1 모니터링 결과로부터 실제 약제 주입 속도 및 상기 약제 잔여량을 더 추출하고, 상 기 경고 장치는, 상기 추출된 실제 약제 주입 속도와 상기 인퓨전 펌프의 모니터에서 출력된 상기 약제 주입 속도를 비교하여, 비교 결과에 따라 상기 제1 경고 신호(S1)를 생성하고, 상기 연산된 약제 잔여량이 기준 잔여량보다 적은 경우, 상기 제1 경고 신호(S1)를 생성할 수 있다. 일 실시예에 있어서, 상기 연산 장치는, 상기 제1 모니터링 결과를 상기 약제 저장백를 포함하는 제1 부분 영상과, 상기 드립 챔버(22b)를 포함하는 제2 부분 영상으로 분할하고, 상기 제1 부분 영상으로부터 상기 약제 잔여량을 추출하고, 상기 제2 부분 영상으로부터 상기 실제 약제 주입 속도를 추출할 수 있다. 일 실시예에 있어서, 상기 연산 장치는, 상기 드립 챔버(22b)의 내부 상단의 유체 낙하구(22c)에 맺혀 있는 유체 방울의 부피가 증가하다가 미리 설정된 비율 이상 감소하는 경우 1회의 드랍(drop)으로 판단하고, 드랍과 드랍 사이의 시간 간격을 이용하여 상기 실제 약제 주입 속도를 추출할 수 있다. 일 실시예에 있어서, 상기 배출 라인(22a)에 설치되어 상기 배출 라인(22a)을 가압하는 클램프(22e)를 더 포함 하고, 상기 경고 장치가 상기 실제 약제 주입 속도와 상기 인퓨전 펌프의 모니터에서 출력된 상기 약제 주입 속도를 비교하여, 비교 결과에 따라 상기 제1 경고 신호(S1)가 생성된 경우, 상기 경고 장치는 상기 배출 라인(22a)을 폐쇄하도록 상기 클램프(22e)의 동작을 제어할 수 있다. 일 실시예에 있어서, 상기 의료 장치가 설치된 공간에 구비되고, 상기 하나 이상의 촬영 장치가 설치되 어 상기 촬영 장치의 이동을 안내하는 가이드 레일(R)을 더 포함하고, 상기 하나 이상의 촬영 장치는 상기 공간에 구비된 상기 의료 장치 각각에 일대일 매칭되는 개수로 구비될 수 있다. 일 실시예에 있어서, 상기 제1 모니터링 결과는 상기 의료 장치 중 통신 기능이 구비된 의료 장치를 제외한 나머지 의료 장치만을 촬영한 결과이고, 상기 통신 기능이 구비된 의료 장치의 상기 활력 징후 데이터(D1) 및 상 기 설정 데이터(D2)는 유무선 통신을 통해 상기 연산 장치에 전송될 수 있다. 일 실시예에 있어서, 상기 연산 장치는, 인공지능 알고리즘을 이용하여 상기 제1 모니터링 결과로부터 상기 활력 징후 데이터(D1), 상기 설정 데이터(D2) 및 상기 저장 용량 데이터(D3)를 추출할 수 있다. 일 실시예에 있어서, 상기 연산 장치 및 상기 경고 장치와 통신 연결되며, 상기 연산 장치에 의해 추출된 상기 활력 징후 데이터(D1), 상기 설정 데이터(D2) 및 상기 저장 용량 데이터(D3)가 전송되어 전송된 데 이터들이 출력되고, 상기 경고 장치에 의해 생성된 경고 신호가 전송되는 경우 미리 결정된 알람을 출력하 는 하나 이상의 감시 단말기를 더 포함할 수 있다. 또한, 본 발명은 감시 대상의 활력 징후가 출력되는 하나 이상의 활력 징후 감시 장치, 상기 활력 징후 의 개선을 위해 설치되는 하나 이상의 활력 징후 개선 장치 및 상기 감시 대상과 유체 소통 가능하게 연 결되어 상기 감시 대상으로부터 배출되는 유체가 저장되는 하나 이상의 유체 저장 장치로 이루어진 그룹 중 하나 이상을 포함하는 의료 장치, 상기 의료 장치와 상기 감시 대상을 촬영하는 하나 이상의 촬 영 장치, 상기 촬영 장치의 상기 의료 장치를 촬영한 결과인 제1 모니터링 결과를 이용하여 상기 활력 징후 감시 장치에서 출력되는 활력 징후 데이터(D1), 상기 활력 징후 개선 장치에서 설정된 설정 데이터(D2) 및 상기 유체 저장 장치에서의 저장 용량 데이터(D3)를 추출하고, 상기 촬영 장치의 상기 감 시 대상을 촬영한 결과인 제2 모니터링 결과를 이용하여 의료 장치 정상 착용 여부, 낙상 위험 여부, 통증 레벨 및 의식 레벨 중 하나 이상을 포함하는 환자 감시 데이터(D4)를 추출하는, 연산 장치, 감시 대상 각각 마다 일대일 매칭되어 미리 결정되는 기준 활력 징후 데이터(D1_ref), 기준 설정 데이터(D2_ref) 및 기준 저장 용량 데이터(D3_ref)가 저장되는 저장 장치 및 상기 연산 장치에서 추출된 상기 활력 징후 데이터(D1)를 상기 기준 활력 징후 데이터(D1_ref)와 비교하거나, 상기 설정 데이터(D2)를 상기 기준 설정 데이터(D2_ref)와 비교하거나, 상기 저장 용량 데이터(D3)를 상기 기준 저장 용량 데이터(D3_ref)와 비교하여, 비교 결과에 따라 제1 경고 신호(S1)를 생성하거나, 상기 환자 감시 데이터(D4)가 미리 설정된 기준을 충족하는 경우 제2 경고 신호(S2)를 생성하는 경고 장치를 포함하는, 촬영 장치를 이용한 중환자실 감시 시스템을 제공한다. 일 실시예에 있어서, 상기 경고 장치는, 상기 환자 감시 데이터(D4)가 의료 장치 비정상 착용 또는 낙상 위 험 있음을 포함하거나, 상기 통증 레벨이 기준 통증 레벨보다 높거나, 상기 의식 레벨이 기준 의식 레벨보다 낮 은 경우 상기 제2 경고 신호(S2)를 생성할 수 있다. 또한, 본 발명은 상기한 중환자실 감시 시스템을 이용한, 감시 방법을 제공한다. 또한, 본 발명은 상기한 감시 방법을 실행하도록 컴퓨터 판독 가능한 기록 매체에 저장된, 프로그램을 제공한다."}
{"patent_id": "10-2020-0093893", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 촬영 장치를 이용하여 중환자실에 구비된 다양한 의료 장치, 그리고 감시 대상에 대한 실시 간 감시를 수행할 수 있으며, 응급 상황, 의료 장치 교체 등의 요구가 실시간으로 감시 단말기에 전송될 수 있 어, 실제 의료 현장에서 간호 인력의 단순 업무량을 크게 경감시킬 수 있고, 이를 통해 과로 예방 및 아전사고 최소화 등의 효과가 달성된다. 또한, 네트워킹 감시가 가능한 새로운 환자 적용 의료 장치를 새로이 제작할 필요 없이, 기존에 널리 사용 중인 의료 장치들에 대한 딥러닝 학습 모델만을 새로이 생성하여 추가하는 것만으로 중환자실 감시가 가능하기에, 의 료 기관 입장에서는 전체 의료 장치를 모두 교체해야 하는 비용적 부담이 없고, 의료 장치 제조 업체 입장에서 도 초기에 제안 시스템에 대한 시판허가만 받은 후, 추가되는 감시 장치들에 대한 인공지능 모델만 추가로 소프 트웨어에 업데이트하는 의료 장치 감시가 이루어질 수 있기에, 비용 경제적이다."}
{"patent_id": "10-2020-0093893", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명을 상세히 설명한다. 이하에서, 시스템은 \"물건\"으로 이해하여야 한다. 이하에서, 용어 \"활력 징후 데이터\"는 감시 대상의 신체 활력을 직접적으로 또는 간접적으로 나타낼 수 있는 모 든 생체 데이터를 포함하는 개념으로 이해하여야 한다. 이하에서, 용어 \"설정 데이터\"는 중환자실에 구비된 의료 장치의 구동 설정 데이터를 포함하는 개념으로 이해하 여야 한다. 이하에서, 용어 \"저장 용량 데이터\"는 유체가 저장되는 장치에서의 유체 저장 용량, 유체 저장 용량에 따른 교 체/비움 주기 등의 데이터를 포함하는 개념으로 이해하여야 한다. 이하에서, 용어 \"환자 감시 데이터\"는 의료 장치 정상 착용 여부, 낙상 위험 여부, 통증 레벨 및 의식 레벨 등 의 감시 대상의 행동, 심리 정보와 관련된 데이터를 포함하는 개념으로 이해하여야 한다. 이하에서, 용어 \"활력 징후 감시 장치\"는 감시 대상의 활력 징후를 실시간 모니터링하고, 모니터링된 활력 징후 가 모니터를 통해 출력될 수 있는 모든 장치를 포함하는 개념으로 이해하여야 한다. 이하에서, 용어 \"활력 징후 개선 장치\"는 감시 대상의 활력 징후를 적어도 유지시키거나 개선하기 위한 모든 의 료 장치를 포함하는 개념으로 이해하여야 한다. 이하에서, 용어 \"유체 저장 장치\"는 수액백, 약제 저장부와 같이 유체가 저장되는 모든 의료 장치, 또는 배뇨백, 음압통과 같이 감시 대상으로부터 배출되는 유체가 저장되는 모든 의료 장치를 포함하는 개념으로 이해 하여야 한다. 도 1 및 2를 참조하여, 본 발명의 실시예에 따른 중환자실 감시 시스템을 보다 구체적으로 설명한다. 본 발명의 실시예에 따른 중환자실 감시 시스템은 하나 이상의 활력 징후 감시 장치, 하나 이상의 활력 징 후 개선 장치 및 하나 이상의 유체 저장 장치로 이루어진 그룹 중 하나 이상을 포함하는 의료 장치 , 촬영 장치, 연산 장치, 저장 장치, 경고 장치 및 감시 단말기를 포함한다. 활력 징후 감시 장치는 감시 대상의 감시 대상의 활력 징후를 실시간 모니터링하고, 모니터링된 활력 징 후가 모니터를 통해 출력될 수 있는 장치이다. 예를 들어, 환자 모니터(Patient Monitor)가 여기에 해당할 수 있다. 활력 징후 감시 장치의 모니터에서는 심전도, 혈압, 호흡수, 혈중산소포화도, 심박수 등의 감시 대상의 활력 징후(D1)가 출력된다. 활력 징후 개선 장치는 감시 대상의 활력 징후를 적어도 유지시키거나 개선하기 위한 장치이다. 예를 들 어, 감시 대상에 약제를 주입하는 약제 주입 펌프, 자가 호흡이 어려운 감시 대상의 인공 호흡을 보 조하는 인공호흡기, 감시 대상의 체온을 설정된 온도로 유지시키는 체온 유지 장치, 감시 대상에 수액을 주입하기 위한 수액백, 감시 대상에 주입되는 약제가 저장되는 약제 저장백 및 시린지를 포함할 수 있다. 약제 주입 펌프의 모니터를 통해 약제 주입 속도, 약제 주입량, 약제 잔여량 등의 설정 데이터(D2)가 출력 된다.약제 주입 펌프는 인퓨전 펌프 및 시린지 펌프를 포함할 수 있으며, 인퓨전 펌프는 약제 저장 백에 저장된 약제의 주입을 제어하기 위한 장치이다. 인퓨전 펌프는 약제 저장백과 감시 대상을 유체 소통 가능하게 연결하는 배출 라인(22a)에 설치되어, 배출 라인(22a)의 가압에 의해 약제 저장백에 저 장된 감시 대상에의 약제 주입 속도를 제어한다. 시린지 펌프는 시린지에 저장된 약제의 주입을 제어하기 위한 장치이다. 시린지 펌프에 구비된 구 동부(23a)가, 시린지의 후단에 결합되어 시린지에 저장된 약제를 가압하는 푸셔(P)를 구동시킴으로써, 시린지로부터의 약제 주입 속도를 제어한다. 약제 주입 펌프의 모니터와, 시린지 펌프의 모니터 각각에서 약제 주입 속도와 약제 주입량, 약제 잔여 량 등의 설정 데이터가 출력된다. 인공 호흡기는 감시 대상의 인공 호흡을 보조하는 장치로, 인공 호흡 마스크가 감시 대상의 코와 입 을 덮도록 감시 대상에 설치되며, 인공 호흡의 설정 데이터(D2)가 인공 호흡기 모니터를 통해 출력된다. 예를 들어, 인공 호흡 구동 모드(HFO/CPAP/IMV), 인공호흡 설정 정보(흡기 시간(inspiration time), 흡기 압력 (inspiration pressure), 부피(volume), 속도(flow), FiO2, 트리거(trigger) 등), 인공호흡 오류 정보(low gas supply, power failure, paw high/low 등)의 설정 데이터(D2)가 인공 호흡기 모니터를 통해 출력된다. 체온 유지 장치는 감시 대상의 체온을 설정 온도로 유지시키기 위한 장치로, 체온 유지 장치의 모니 터를 통해 설정 온도의 설정 데이터(D2)가 출력된다. 유체 저장 장치는 감시 대상으로부터 배출되는 혈액이 저장되는 음압통, 감시 대상으로부터 배출 된 소변이 저장되는 소변백과 같이 감시 대상으로부터 배출되는 유체가 저장되는 장치이다. 유체 저장 장치는 전술한 활력 징후 감시 장치 및 활력 징후 개선 장치와 달리 데이터가 출력되는 모니터가 구비되지 않으며, 촬영 장치의 촬영에 의한 촬영 결과 분석에 의해 유체 저장 장치에 저장된 유체의 저장 용량과, 교체 주기, 교체 잔여 시간 등의 저장 용량 데이터(D3)가 추출될 수 있다. 이에 대한 자세 한 설명은 후술한다. 촬영 장치는 감시 대상과 의료 장치가 놓인 공간에 설치되어, 감시 대상과 의료 장치를 촬영 한다. 촬영 장치에 의한 촬영 결과는 영상으로 변환되어 연산 장치에 전송될 수 있으며, 일 예로 카메 라, 보다 구체적으로는 야간에도 촬영이 가능한 적외선 카메라일 수 있다. 본 발명의 실시예에 따른 중환자실 감시 시스템의 경우, 촬영 시스템의 다양한 변형이 가능하다. 일 실시예로, 도 1에 도시된 바와 같이 공간의 천정면에 고정 장치가 설치되고, 고정 장치에 설치된 지지 장치에 자유롭게 회전이 가능한 구동 암이 설치되며, 구동 암의 말단에 촬영 장치가 설치될 수 있 다. 구동 암의 회전에 의해 촬영 장치 역시 촬영 각도와 촬영 시야를 달리하면서 공간에 구비된 모든 의 료 장치, 그리고 감시 대상의 촬영을 수행하는 것이 가능하다. 다른 실시예로, 도 13에 도시된 바와 같이 공간의 천정면에 고정 장치가 설치되고, 고정 장치에 가이드 레일(R)이 설치되며, 가이드 레일(R)을 따라 촬영 장치가 이동이 가능할 수 있다. 촬영 장치는 가이드 레일(R)을 따라 이동하면서 촬영 각도와 촬영 시야를 달리하면서 공간에 구비된 모든 의료 장치, 그리고 감 시 대상의 촬영을 수행하는 것이 가능하다. 또 다른 실시예로, 도 14에 도시된 바와 같이 가이드 레일(R)이 구비되되, 공간에 존재하는 모든 의료 장치(4 0)에 일대일 매칭되는 개수의 촬영 장치가 구비될 수 있다. 촬영 장치가 모든 의료 장치에 일대일 매칭되기 때문에, 촬영 장치의 이동이 최소화되고, 모든 의료 장치의 실시간 모니터링이 가능한 장점을갖는다. 연산 장치는 촬영 장치의 촬영 결과인 제1 모니터링 결과 및 제2 모니터링 결과를 이용하여 소정의 방 법으로 활력 징후 데이터(D1), 설정 데이터(D2), 저장 용량 데이터(D3) 및 환자 감시 데이터(D4)를 추출한다. 여기서, 제1 모니터링 결과는 촬영 장치가 의료 장치를 촬영한 영상을 의미하고, 제2 모니터링 결과는 촬영 장치가 감시 대상을 촬영한 영상을 의미한다. 연산 장치는 데이터 연산, 처리 기능을 갖는 마이크로프로세서(MCU, Micro Controller Unit)나 컴퓨터일 수 있고, 보다 구체적으로는 인공지능 알고리즘, DNN(Deep Neural Network), CNN(Convolutional Neural Network), DCNN(Deep Convolutional Neural Network), RNN(Recurrent Neural Network), RBM(Restricted Boltzmann Machine), DBN(Deep Belief Network), SSD(Single Shot Detector), MLP (Multi-layer Perceptron) 또는 어텐 션 메커니즘(Attention Mechanism)을 기반으로 한 인공신경망 모델을 이용하여 데이터 연산, 처리를 수행할 수 있으나 이에 제한되는 것은 아니다. 저장 장치에는 감시 대상 각각마다 일대일 매칭되어 미리 결정된 기준 활력 징후 데이터(D1_ref), 기준 설정 데이터(D2_ref), 기준 저장 용량 데이터(D3_ref)가 저장된다. 여기서, 감시 대상 마다 기준 활력 징후 데이터(D1_ref), 기준 설정 데이터(D2_ref), 기준 저장 용량 데이터 (D3_ref)는 상이할 수 있다. 또한, 저장 장치에는 각 의료 장치의 제조사 및 모델마다의 형상 데이터(DS)가 저장된다. 의료 장치 의 제조사 및 모델에 따라 형상이 상이하며, 이들 형상 데이터(DS)가 미리 저장되어, 형상 데이터(DS)와의 비교를 통해, 이후 연산 장치에 의한 데이터 추출 시 의료 장치의 종류, 제조사 및 모델을 특정할 수 있게 된다. 또한, 저장 장치에는 각 의료 장치의 제조사 및 모델마다 의료 장치의 모니터에서 출력되는 데이터 들의 표시 패턴들이 저장된다. 의료 장치, 환자 모니터의 경우를 예로 들면, 다양한 제조사로부터 제조된 다양한 모델이 존재한다. 제조사, 모델이 달라짐에 따라 모니터에서 출력되는 데이터들의 표시 패턴 또한 다르다. 저장 장치에는 의 료 장치의 제조사 및 모델마다 데이터들의 표시 패턴이 모두 저장되어 있으며, 이들 데이터들을 이용하여 추후 연산 장치에 의한 데이터 추출이 용이하게 이루어질 수 있다. 경고 장치는 연산 장치에 의해 추출된 활력 징후 데이터(D1)를 저장 장치에 저장된 해당 감시 대상 의 기준 활력 징후 데이터(D1_ref)와 비교하고, 설정 데이터(D2)를 기준 설정 데이터(D2_ref)와 비교하며, 저 장 용량 데이터(D3)를 기준 저장 용량 데이터(D3_ref)와 비교하고, 비교 결과에 따라 제1 경고 신호(S1)를 생성 한다. 경고 장치 역시 연산 장치와 마찬가지로 데이터 연산, 처리 기능을 갖는 마이크로프로세서(MCU, Micro Controller Unit)일 수 있다. 예를 들어, 활력 징후 데이터(D1) 중 혈압을 기준 활력 징후 데이터(D1_ref) 중 기준 혈압과 비교하여, 혈압과 기준 혈압이 미리 설정된 값 이상 차이나는 경우 제1 경고 신호(S1)를 생성할 수 있다. 다른 예로, 설정 데이터 (D2) 중 약제 주입 속도를 기준 설정 데이터(D2_ref) 중 기준 약제 주입 속도와 비교하여, 약제 주입 속도와 기 준 약제 주입 속도가 미리 설정된 값 이상 차이나는 경우 제1 경고 신호(S1)를 생성할 수 있다. 또 다른 예로, 저장 용량 데이터(D3) 중 유체 저장 용량을 기준 저장 용량 데이터(D3_ref) 중 기준 유체 저장 용량과 비교하여, 유체 저장 용량이 기준 유체 저장 용량보다 큰 경우 제1 경고 신호(S1)를 생성할 수 있다. 저장 장치에 저장되어 있는 기준 데이터들은 해당 감시 대상의 활력 징후를 개선하기 위한 최적의 값이 거나, 유체 저장 장치를 교체 또는 비워야 하는 임계값에 해당하는데, 이 값들과 많은 차이가 나거나, 벗어나는 경우 제1 경고 신호(S1)를 생성하여 후술하는 감시 단말기에 알림이 출력되도록 하는 것이다. 또한, 경고 장치는 연산 장치에 의해 추출된 환자 감시 데이터(D4)가 미리 설정된 기준에 충족된 경우 제2 경고 신호(S2)를 생성한다. 예를 들어, 연산 장치에 의해 추출된 환자 감시 데이터(D4)가 의료 장치 비정상 착용 또는 낙상 위험을 포 함하거나, 추출된 통증 레벨이 기준 통증 레벨 이상이거나, 추출된 의식 레벨이 기준 의식 레벨 이하인 기준을 충족하는 경우 제2 경고 신호(S2)를 생성한다. 상기 기준은 응급 상황을 가정한 것으로, 제2 경고 신호(S2)가 생성되었다는 의미는, 감시 대상과 관련된 응 급 상황이 발생한 것으로 볼 수 있기 때문에, 제2 경고 신호(S2)를 생성하여 후술하는 감시 단말기에 알림 이 출력되도록 하는 것이다. 감시 단말기는 병원 내부에 다수개가 설치되어 간호 인력이 휴대하거나, 간호 스테이션에 구비될 수 있으며, 감시 단말기를 통해 제1 모니터링 결과, 제2 모니터링 결과, 그리고 활력 징후 데이터(D1), 설정 데이터(D2), 저장 용량 데이터(D3) 및 환자 데이터(S4)를 모니터링할 수 있다. 또한, 경고 장치에 의해 생성된 제1 경고 신호(S1)와 제2 경고 신호(S2)가 발생하는 경우 감시 단말기에 음향, 깜빡임 등을 통한 알람이 출력될 수 있으며, 알람을 통해 해당 감시 대상에 응급 상황이 발생하였음을 간호 인력이 인지할 수 있다. 이러한 감시 단말기는 통신망을 통해 다수의 중환자 감시 시스템과 유무선 통신이 가능하고, 통신 연결된 감시 시스템에서 감시되는 감시 대상의 실시간 모니터링과 응급 상황 모니터링이 가능하다. 이하에서는, 도 3 내지 12를 참조하여, 연산 장치에 의해 활력 징후 데이터(D1), 설정 데이터(D2), 저장 용 량 데이터(D3) 및 환자 감시 데이터(D4)를 추출하는 과정을 보다 구체적으로 설명한다. 먼저, 도 3 및 4를 참조하여, 촬영 장치의 시린지 펌프 촬영 결과를 이용하여 연산 장치가 설정 데 이터(D2)를 추출하는 과정을 구체적으로 설명한다. 촬영 장치의 시린지 펌프 촬영 결과인 제1 모니터링 결과는 시린지 펌프, 시린지 펌프에 설치 된 시린지와, 시린지에 결합된 푸셔(P)를 포함한다. 연산 장치는 제1 모니터링 결과에 포함된 시린지 펌프의 형상을 저장부에 저장된 형상 데이터(DS) 들과 비교하여, 가장 유사한 형상 데이터를 갖는 시린지 펌프의 제조사 및 모델을 제1 모니터링 결과에 포함된 시린지 펌프의 제조사 및 모델로 특정할 수 있다. 또한, 연산 장치는 특정된 시린지 펌프의 제조사 및 모델에 매칭되고 저장 장치에 저장되어 있는 데이터 표시 패턴으로부터 시린지 펌프의 모니터(23b)에서 약제 주입 속도와 약제 잔여량, 약제 주입량 등 의 설정 데이터(D2)를 추출하게 된다. 도 3에서는 약제 주입 속도가 1ml/s이고, 약제 잔여량이 20ml인 설정 데 이터(D2)가 추출된다. 연산 장치는 또한, 제1 모니터링 결과에 포함된 시린지, 푸셔(P), 또는 시린지 펌프의 구동부(23 a)로부터 실제 약제 주입 속도와 실제 약제 잔여량의 데이터를 추출할 수 있다.도 4를 참조하여, 이를 구체적으로 설명한다. 일 실시예에서, 연산 장치는 푸셔(P)의 선단(P1) 이동 속도(이동 속도는 도 4(a)의 d로부터 연산될 수 있음)를 이용하여 실제 약제 주입 속도를 추출할 수 있고, 다른 실시예에서 연산 장치는 구동부(23a)의 이 동 속도(이동 속도는 도 4(b)의 d로부터 연산될 수 있음)를 이용하여 실제 약제 주입 속도를 추출할 수 있으며, 또 다른 실시예에서 연산 장치는 구동부(23a)에 부착된 태그(23c)의 이동 속도(이동 속도는 도 4(c)의 d로부터 연산될 수 있음)를 이용하여 실제 약제 주입 속도를 추출할 수 있다. 또한, 연산 장치는 시린지의 선단과 푸셔(P1)의 선단 사이의 거리를 이용하여 시린지에서의 실제 약제 잔여량의 데이터를 추출할 수 있다. 또한, 연산 장치는 시린지 용량, 약제 주입량의 데이터를 더 추출할 수도 있다. 경고 장치는, 모니터(23b)에서 추출된 약제 주입 속도 및 약제 잔여량과, 시린지에서 추출된 실제 약제 주입 속도 및 실제 약제 잔여량을 각각 비교하고, 비교 결과에 따라 제1 경고 신호(S1)를 생성한다. 예를 들어, 약제 주입 속도와 실제 약제 주입 속도의 차이가 미리 설정된 값 이상인 경우 제1 경고 신호(S1)를 생성할 수 있으며, 약제 잔여량과 실제 약제 잔여량의 차이가 미리 설정된 값 이상인 경우 제1 경고 신호(S1)를 생성할 수 있으며, 실제 약제 잔여량이 기준 잔여량보다 적은 경우 제1 경고 신호(S1)를 생성할 수 있다. 제1 경고 신호(S1)가 생성된 경우, 배출 라인(22a)에 설치되어 배출 라인(22a)을 가압하는 클램프(22e)가 작동 하여 배출 라인(22a)을 폐쇄하여 추가의 약제 주입이 이루어지지 않도록 할 수 있으며, 감시 단말기에서 알 람이 출력됨으로써 간호 인력이 응급 상황임을 인지하는 것이 가능하다. 다음, 도 5 및 6을 참조하여 촬영 장치의 수액백(또는 약제 저장백) 촬영 결과를 이용하여 연산 장 치가 설정 데이터(D2)를 추출하는 과정을 구체적으로 설명한다. 촬영 장치의 수액백 촬영 결과인 제1 모니터링 결과는 수액백 및 드립 챔버(22b)를 포함한다. 연산 장치는 먼저, 제1 모니터링 결과를 수액백(또는 약제 저장백)을 포함하는 제1 부분 영상과, 드립 챔버(22b)를 포함하는 제2 부분 영상으로 분할한다. 하지만, 제1 모니터링 결과의 분할 없이 제1 모니터링 결과를 그대로 이용하여 데이터를 추출하는 실시예도 가능하다. 연산 장치는 제1 부분 영상으로부터 수액백(또는 약제 저장백)에서의 약제 잔여량을 추출하는데, 구체적으로는 수액백에 저장된 약제의 높이(h)를 이용하여 약제 잔여량을 추출할 수 있다(도 6 참조). 경고 장치는 연산 장치에 의해 추출된 약제 잔여량이, 저장 장치에 저장되어 해당 감시 대상에 매칭되는 기준 약제 잔여량보다 적은 경우 제1 경고 신호(S1)를 생성한다. 제1 경고 신호(S1)가 생성된 경우, 배출 라인(22a)에 설치되어 배출 라인(22a)을 가압하는 클램프(22e)가 작동 하여 배출 라인(22a)을 폐쇄함으로써, 에어가 감시 대상으로 주입되지 않도록 할 수 있으며, 또한 감시 단말 기를 통해 알람이 출력되어 간호 인력이 수액백을 교체하여야 하는 상황임을 인지하는 것이 가능하다. 또한, 연산 장치는 제2 부분 영상으로부터 약제 주입 속도를 추출한다. 드립 챔버(22b)는 일단이 수액백(또는 약제 저장백)과 유체 소통 가능하게 연결되고, 타단이 배출 라인 (22a)과 유체 소통 가능하게 연결된다. 내부에는 소정 부피의 유체가 저장될 수 있는 저장 공간(22d) 형성되며, 중력에 의해 또는 인퓨전 펌프의 펌핑에 따라 수액백(또는 약제 저장백)에서 배출되는 약제가 상기 저장 공간(22d)으로 투입된다. 저장 공간(22d)의 상단에는 유체 낙하구(22c)가 형성될 수 있다. 유체 낙하구(22c)는 수액백과 연결되어, 수액백으로부터 배출된 약제가 유체 낙하구(22c)에서 유체 방울을 이루고, 약제의 표면장력보다 유체 방울 에 인가되는 중력의 크기(약제 방울의 무게에 비례함)가 클 경우 저장 공간(22d)으로 드랍(drop)된다. 드랍된 약제 방울은 배출 라인(22a)을 따라 감시 대상에 주입되며, 약제 방울의 드랍은 유체 낙하구(22c)에 맺혀 있는 약제 방울의 부피가 지속적으로 증가하다가 미리 설정된 비율 이상 갑자기 감소하는 경우(드랍이 이 루어지면 유체 낙하구에 맺혀 있는 약제 방울의 부피가 급감하게 됨) 이를 1회의 드랍으로 판단할 수 있다. 연산 장치는 1회의 드랍까지 소요된 시간(t)을 이용하여 실제 약제 주입 속도를 추출할 수 있다. 연산 장치에 의해 추출된 실제 약제 주입 속도와, 저장 장치에 저장되어 해당 감시 대상에 매칭되는 약제 주입 속도의 차이가 미리 설정된 값 이상인 경우, 경고 장치는 제1 경고 신호(S1)를 생성한다. 제1 경고 신호(S1)가 생성된 경우, 배출 라인(22a)에 설치되어 배출 라인(22a)을 가압하는 클램프(22e)가 작동 하여 배출 라인(22a)을 폐쇄함으로써, 의도치 않은 주입 속도로 약제가 감시 대상으로 주입되지 않도록 할 수 있으며, 또한 감시 단말기를 통해 알람이 출력되어 간호 인력이 약제 주입 속도를 체크하여야 하는 상황 임을 인지하는 것이 가능하다. 다음 도 7을 참조하여, 촬영 장치의 활력 징후 감시 장치 촬영 결과를 이용하여 연산 장치가 활력 징후 데이터(D1)를 추출하는 과정을 구체적으로 설명한다. 촬영 장치의 활력 징후 감시 장치 촬영 결과인 제1 모니터링 결과는 활력 징후 감시 장치의 모니터 를 포함한다. 연산 장치는 제1 모니터링 결과에 포함된 활력 징후 감시 장치의 형상을 저장부에 저장된 형상 데 이터(DS)들과 비교하여, 가장 유사한 형상 데이터를 갖는 활력 징후 감시 장치의 제조사 및 모델을 제1 모니터링 결과에 포함된 활력 징후 감시 장치의 제조사 및 모델로 특정할 수 있다. 또한, 연산 장치는 특정된 활력 징후 감시 장치의 제조사 및 모델에 매칭되고 저장 장치에 저장되 어 있는 데이터 표시 패턴으로부터 활력 징후 감시 장치의 모니터에서 심전도, 혈압, 호흡수, 혈중산소포화 도, 심박수 등의 활력 징후 데이터(D1)를 추출하게 된다. 연산 장치에 의해 추출된 활력 징후 데이터(D1) 각각을 해당 감시 대상에 매칭되는 기준 활력 징후 데이 터(D1_ref)와 비교하여, 활력 징후 데이터(D1)와 기준 활력 징후 데이터(D1_ref)의 차이가 미리 설정된 값 이상 인 경우 경고 장치는 제1 경고 신호(S1)를 생성할 수 있다. 제1 경고 신호(S1)가 생성된 경우, 감시 단말기를 통해 알람이 출력되어 간호 인력이 응급 상황임을 인지하 는 것이 가능하다. 다음 도 8을 참조하여, 촬영 장치의 인퓨전 펌프 촬영 결과를 이용하여 연산 장치가 설정 데이터 (D2)를 추출하는 과정을 구체적으로 설명한다. 촬영 장치의 인퓨전 펌프 촬영 결과인 제1 모니터링 결과는 인퓨전 펌프와 약제 저장백, 그리 고 드립 챔버(22b)를 포함한다. 연산 장치는 제1 모니터링 결과에 포함된 인퓨전 펌프의 형상을 저장부에 저장된 형상 데이터(DS) 들과 비교하여, 가장 유사한 형상 데이터를 갖는 인퓨전 펌프의 제조사 및 모델을 제1 모니터링 결과에 포함된 인퓨전 펌프의 제조사 및 모델로 특정할 수 있다. 또한, 연산 장치는 특정된 인퓨전 펌프의 제조사 및 모델에 매칭되고 저장 장치에 저장되어 있는 데이터 표시 패턴으로부터 인퓨전 펌프의 모니터에서 약제 주입 속도, 약제 주입량, 약제 잔여량 등의 설정 데이터(D2)를 추출하게 된다. 연산 장치는 약제 저장백과 드립 챔버(22b)를 포함하는 제1 모니터링 결과로부터 약제 저장백에 저 장된 약제 잔여량과 실제 약제 주입 속도의 설정 데이터(D2)를 추출할 수 있다. 이에 대한 과정은 전술하였으므 로, 자세한 설명은 생략한다. 연산 장치에 의해 추출된 실제 약제 주입 속도와, 인퓨전 펌프의 모니터에서 추출된 약제 주입 속도의 차이가 미리 설정된 값 이상인 경우, 경고 장치는 제1 경고 신호(S1)를 생성할 수 있으며, 추출된 약제 잔 여량이 기준 잔여량보다 적은 경우 제1 경고 신호(S1)를 생성할 수 있다. 제1 경고 신호(S1)가 생성된 경우, 배출 라인(22a)에 설치되어 배출 라인(22a)을 가압하는 클램프(22e)가 작동 하여 배출 라인(22a)을 폐쇄함으로써, 의도치 않은 주입 속도로 약제가 감시 대상으로 주입되지 않도록 할 수 있으며, 또한 감시 단말기를 통해 알람이 출력되어 간호 인력이 약제 저장백을 교체 또는 제거하여 야 하는 상황임을 인지하는 것이 가능하다. 다음 도 9를 참조하여, 촬영 장치의 인공 호흡기 촬영 결과를 이용하여 연산 장치가 설정 데이터 (D2)를 추출하는 과정을 구체적으로 설명한다. 촬영 장치의 인공 호흡기 촬영 결과인 제1 모니터링 결과는 인공호흡기의 모니터를 포함한다. 연산 장치는 제1 모니터링 결과에 포함된 인공 호흡기의 형상을 저장부에 저장된 형상 데이터(DS) 들과 비교하여, 가장 유사한 형상 데이터를 갖는 인공 호흡기의 제조사 및 모델을 제1 모니터링 결과에 포함된 인공 호흡기의 제조사 및 모델로 특정할 수 있다. 또한, 연산 장치는 특정된 인공 호흡기의 제조사 및 모델에 매칭되고 저장 장치에 저장되어 있는 데이터 표시 패턴으로부터 인공 호흡기의 모니터에서 인공호흡 구동 모드, 인공호흡 설정 정보, 인공호흡 오류 정보 등의 설정 데이터(D2)를 추출하게 된다. 연산 장치에 의해 추출된 설정 데이터(D2) 각각을 해당 감시 대상에 매칭되는 기준 설정 데이터(D2_ref) 와 비교하여, 설정 데이터(D2)와 기준 설정 데이터(D2_ref)의 차이가 미리 설정된 값 이상인 경우 경고 장치(8 0)는 제1 경고 신호(S1)를 생성할 수 있다. 또한, 경고 장치는 추출된 설정 데이터(D2)가 인공호흡 오류 정 보를 포함할 경우 제1 경고 신호(S1)를 생성할 수도 있다. 제1 경고 신호(S1)가 생성된 경우, 감시 단말기를 통해 알람이 출력되어 간호 인력이 응급 상황임을 인지하 는 것이 가능하다. 다음 도 10을 참조하여, 촬영 장치의 체온 유지 장치 촬영 결과를 이용하여 연산 장치가 설정 데이 터(D2)를 추출하는 과정을 구체적으로 설명한다. 촬영 장치의 체온 유지 장치 촬영 결과인 제1 모니터링 결과는 체온 유지 장치의 모니터를 포함한 다. 연산 장치는 제1 모니터링 결과에 포함된 체온 유지 장치의 형상을 저장부에 저장된 형상 데이터 (DS)와 비교하여, 가장 유사한 형상 데이터를 갖는 체온 유지 장치의 제조사 및 모델을 제1 모니터링 결과에 포 함된 체온 유지 장치의 제조사 및 모델로 특정할 수 있다. 또한, 연산 장치는 특정된 체온 유지 장치의 제조사 및 모델에 매칭되고 저장 장치에 저장되어 있 는 데이터 표시 패턴으로부터 체온 유지 장치의 모니터에서 설정 온도 등의 설정 데이터(D2)를 추출하게 된 다. 연산 장치에 의해 추출된 설정 데이터(D2)를 해당 감시 대상에 매칭되는 기준 설정 데이터(D2_ref)와 비 교하여, 설정 데이터(D2)와 기준 설정 데이터(D2_ref)의 차이가 미리 설정된 값 이상인 경우 경고 장치는 제 1 경고 신호(S1)를 생성할 수 있다.제1 경고 신호(S1)가 생성된 경우, 감시 단말기를 통해 알람이 출력되어 간호 인력이 응급 상황임을 인지하 는 것이 가능하다. 다음 도 11을 참조하여, 촬영 장치의 음압통 또는 소변백 촬영 결과를 이용하여 연산 장치가 저장 용량 데이터(D3)를 추출하는 과정을 구체적으로 설명한다. 연산 장치는 제1 모니터링 결과에 포함된 음압통 또는 소변백 각 의료 장치의 바닥면으로부터 혈액 또는 소변의 최상면까지의 높이를 이용하여 저장 용량, 교체 주기, 교체 잔여 시간 등의 저장 용량 데이터(D3)를 추출할 수 있다. 경고 장치는 연산 장치에 의해 추출된 저장 용량 데이터(D3)가 기준 저장 용량 데이터(D3_ref)를 비교하 여, 예를 들어 음압통의 혈액 저장 용량이 기준 혈액 저장 용량보다 큰 경우, 또는 음압통의 교체 잔여 시간이 기준 교체 잔여 시간보다 작은 경우 제1 경고 신호(S1)를 생성할 수 있다. 제1 경고 신호(S1)가 생성된 경우, 감시 단말기를 통해 알람이 출력되어 간호 인력이 음압통 또는 소변 백을 교체하여야 하는 상황임을 인지할 수 있다. 다음 도 12를 참조하여, 촬영 장치의 감시 대상 촬영 결과를 이용하여 연산 장치가 환자 감시 데이 터(D4)를 추출하는 과정을 구체적으로 설명한다. 연산 장치는 인공지능망 모델을 이용하여 의료 장치 정상 착용 여부, 낙상 위험 여부, 통증 레벨 및 의식 레벨 등의 환자 감시 데이터(D4)를 추출할 수 있다. 일 예로 인공 호흡기의 감시 대상 안면에의 위치 추적 등을 통해 정상 착용 여부를 추출할 수 있고, 감시 대 상에 놓여진 베드와 감시 대상의 위치 상관 관계 추적을 통해 낙상 위험 여부를 추출할 수 있으며, 감시 대상의 안면 인식을 통해 표정을 추출하여 통증 레벨을 추출할 수 있고, 감시 대상의 움직임 인식을 통해 의식 레벨을 추출할 수 있다. 경고 장치는 연산 장치에 의해 추출된 환자 감시 데이터(D4)가 의료 장치 비정상 착용 또는 낙상 위험 있음을 포함하거나, 통증 레벨이 감시 대상에 매칭되어 저장 장치에 미리 저장된 기준 통증 레벨보다 높 거나, 의식 레벨이 감시 대상에 매칭되어 저장 장치에 미리 저장된 기준 의식 레벨보다 낮은 경우 제2 경고 신호(S2)를 생성할 수 있다. 제2 경고 신호(S2)가 생성된 경우, 감시 단말기를 통해 알람이 출력되어 간호 인력이 응급 상황임을 인지하 는 것이 가능하다. 본 발명의 다른 실시예에서는, 촬영 장치가 통신 기능이 구비되지 않은 의료 장치만을 촬영하여 연산 장치가 데이터를 추출하고, 통신 기능이 구비된 의료 장치들은 유무선 통신을 통해 연산 장치에 각 각의 활력 징후 데이터(D1) 및 설정 데이터(D2)를 전송하는 것도 가능하다. 이에 따르면, 하나의 감시 시스템을 구현하기 위해 필요한 촬영 장치의 개수가 감소될 수 있어 경제적이고, 의료 장치의 제조사 및 모델에 따른 통신 기능 유무와 독립적으로 감시 시스템을 구현할 수 있다는 점에서 효과적이다. 위 설명한 본 발명의 감시 시스템을 이용한 감시 방법, 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령 은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical dis k)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명 령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 본 발명을 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈 로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 이상, 본 명세서에는 본 출원을 당업자가 용이하게 이해하고 재현할 수 있도록 도면에 도시한 실시예를 참고로 설명되었으나 이는 예시적인 것에 불과하며, 당업자라면 본 출원의 실시예로부터 다양한 변형 및 균등한 타 실 시예가 가능하다는 점을 이해할 것이다. 따라서 본 출원의 보호범위는 청구범위에 의해서 정해져야 할 것이다."}
{"patent_id": "10-2020-0093893", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 중환자실 감시 시스템을 설명하기 위한 개략적인 도면이다. 도 2는 도 1의 중환자실 감시 시스템을 설명하기 위한 블록도이다. 도 3은 촬영 장치가 중환자실에 구비된 시린지 펌프를 촬영하는 모습과, 촬영 결과로부터 추출될 수 있는 데이 터를 설명하기 위한 도면이다. 도 4는 도 3의 데이터를 추출하는 과정을 설명하기 위한 도면이다. 도 5는 촬영 장치가 중환자실에 구비된 수액백 및 드립 챔버를 촬영하는 모습과, 촬영 결과로부터 추출될 수 있 는 데이터를 설명하기 위한 도면이다. 도 6은 도 5의 데이터를 추출하는 과정을 설명하기 위한 도면이다. 도 7은 촬영 장치의 중환자실에 구비된 활력 징후 감시 장치 촬영 결과로부터 추출될 수 있는 데이터를 설명하 기 위한 도면이다. 도 8은 촬영 장치의 중환자실에 구비된 인퓨전 펌프 및 약제 저장백 촬영 결과로부터 추출될 수 있는 데이터를 설명하기 위한 도면이다. 도 9는 촬영 장치의 중환자실에 구비된 인공호흡기 촬영 결과로부터 추출될 수 있는 데이터를 설명하기 위한 도 면이다. 도 10은 촬영 장치의 중환자실에 구비된 체온 유지 장치 촬영 결과로부터 추출될 수 있는 데이터를 설명하기 위 한 도면이다. 도 11은 촬영 장치의 중환자실에 구비된 유체 저장 장치 촬영 결과로부터 추출될 수 있는 데이터를 설명하기 위 한 도면이다. 도 12는 촬영 장치의 감시 대상 촬영 결과로부터 추출될 수 있는 데이터를 설명하기 위한 도면이다. 도 13 및 14는 중환자실에 촬영 장치의 이동을 안내하기 위한 가이드 레일이 더 구비된 모습을 설명하기 위한도면으로, 도 13는 하나의 촬영 장치가 적용된 실시예이고, 도 14는 촬영 장치가 중환자실에 구비된 의료 장치 에 일대일 매칭되도록 다수의 촬영 장치가 적용된 실시예를 도시한다."}
