{"patent_id": "10-2023-0042132", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0146937", "출원번호": "10-2023-0042132", "발명의 명칭": "가상/증강현실 및 일반환경에서의 실시간 관절 및 체절 협응 측정 방법 및 시스템", "출원인": "리파인 주식회사", "발명자": "고창용"}}
{"patent_id": "10-2023-0042132", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "관절/체절의 동작 측정 및 분석이 가능한 모션센서, 모션을 기반으로 관절간/체절간 협응력을 평가하는 인공지능 알고리즘과, 이를 분석 및 모니터링 해주는 소프트프웨어 및 앱/웹, 결과를 사용자에게 피드백하는 시스템으로 구성되는 가상/증강현실 및 일반환경에서의 실시간 관절 및 체절 협응 측정시스템."}
{"patent_id": "10-2023-0042132", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 모션센서는 관성센서, 가속센서 또는 자이로센서인 것을 특징으로 하는 측정시스템."}
{"patent_id": "10-2023-0042132", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 인공지능알고리즘은 머신러닝과 딥러닝을 사용하여 상기 모션센서가 측정한 값을 기반으로 관절 및 체절간의 운동성과 협응성을 학습하는 것을 특징으로 하는 측정시스템."}
{"patent_id": "10-2023-0042132", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 분석 및 모니터링 소트프웨어 및 앱/웹은 유무선으로 상기 모션센서가 측정한 값을 수신한 다음, 인공지능알고리즘을 통해 관절 및 체절들의 운동을 평가한 학습데이터를 기반으로, 관절과 체절들 간에 정상적인 또는비정적인 협응이 발생하는지를 평가하는 것을 특징으로 하는 측정시스템."}
{"patent_id": "10-2023-0042132", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 피드백은 소리 또는 진동 및 디스플레이를 이용하여, 체절 및 관절들의 협응이 정상적인지 아니면 비정상적인지를 알려주고, 체절 및 관절들의 협응 상태를 디스플레이를 통해 보여주는 것을 특징으로 하는측정시스템."}
{"patent_id": "10-2023-0042132", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 따른 측정시스템을 이용한가상/증강현실 및 일반환경에서의 실시간 관절 및 체절 협응 측정 방법."}
{"patent_id": "10-2023-0042132", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인간의 체절 간 및 관절 간 움직임의 조화를 평가하기 위한 실시간 협응 평가 방법 및 시스템에 관한 것이다. 이를 위해 협응 평가를 가능하게 하는 센서 기술, 머신러닝 및 수학적 알고리즘의 개발이 이루어졌다. 이러한 기술을 바탕으로 본 발명은 뇌졸중, 근육병, 근무력증, 파킨슨병 등 운동계 질환 환자들의 재활치료나 평 가, 낙상 예방 및 부상 위험성 감소를 위한 재활 프로그램 등에 적용될 수 있으며, 고유수용성감각과의 상관관계 도 중요한 역할을 한다. 이를 통해 디지털바이오마커로 활용할 수 있으며, 청구범위를 통해 상세히 설명되어 있 다. 이러한 발명은 운동계 질환 환자들에게 더 나은 치료 및 재활 방법을 제공할 뿐만 아니라, 일반 개인들에게 도 건강한 라이프스타일을 유지하기 위한 운동 프로그램을 제공함으로써 많은 사람들에게 긍정적인 영향을 끼칠 것으로 기대된다."}
{"patent_id": "10-2023-0042132", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 체절 및 관절의 협응 평가 방법을 비롯하여 이를 활용한 재활 단계 평가, 운동 평가, 약물평가, 의료 기기 평가 등을 위한 디지털바이오마커로 활용할 수 있으며, 이를 실제 환경 및 가상/증강현실, 디지털환경 내 에서 재활치료를 할 수 있는 가상/증강현실 및 일반환경에서의 실시간 관절 및 체절 협응 측정 방법 및 시스템 에 관한 것이고, 또한, 다양한 연령층 및 신체적 제약이 있는 환자들을 대상으로 비강간섭적인 평가가 가능하며, 현장에서의 실시간 협응 측정이 가능한 가상/증강현실 및 일반환경에서의 실시간 관절 및 체절 협응 측정 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2023-0042132", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 정상적으로 동작하는 신체구조를 가지는 사람들, 예컨대 청소년 및 장년층들은 스스로의 의지대로 신체를 통한 움직임을 아무런 문제나 어려움이 없이 구현할 수 있다. 즉, 근육, 인대, 뼈, 신경계 등의 복잡한 연결체계로 이루어진 관절의 운동을 통한 움직임을 의지대로 구현할 수 있게 된다. 그러나, 인체가 노령화되거 나, 뇌졸증, 근육병, 근무력증, 파킨슨병과 같은 운동계 질환 환자들은 스스로의 움직임을 의지대로 구현하지 못하여 일상 생활에 큰 어려움을 겪게 된다. 도 1은 관절운동의 정상적인 협응성과 비정상적인 협응성의 예를 간략하게 도시한 도면이다. 도면에 도시한 바 와 같이 어깨관절, 팔꿈치 관절, 및 손목관절의 협응을 통해 커피잔과 음료잔을 파지할 때, 정상적인 협응인 경 우에는 정확하게 음료잔을 파지할 수 있지만, 비정상적인 협응의 경우에는 음료잔을 파지 못하거나 또는 잘못 파지하게 된다. 따라서, 음료잔을 떨어뜨리거나 또는 쓰러트리게 된다. 이와 같이, 관절의 협응성이 떨어지는 노령층이나, 운동계 질환 환자들은 의료기관의 도움을 받아 재활치료를 받아야 하지만, 정확히 관절운동의 협응 상태가 어떠한지를 정확히 파악하지 못하기 때문에 효율적인 재활치료 에 어려움이 있었다. 한편, 인간의 신체 구조와 관절 운동에 대한 이해, 머신러닝 및 수학적 알고리즘의 개발, 그리고 센서 기술의 발전으로 인해 협응 평가가 가능해지고 있는 상태이다. 그러나, 앞서 설명한 관절 운동은 근육, 인대, 뼈, 신경 계 등의 복잡한 연결체계로 이루어져 있으며, 이를 정량적으로 분석하는 것은 매우 어렵다. 현재 관절협응 분석은 대부분 연구차원으로 이루어지고 있으며, 이와 관련한 상업적인 장치들은 판매되지 않고 있는 실정이다."}
{"patent_id": "10-2023-0042132", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명의 목적은 가상/증강현실 및 일반환경에서의 실시간 관절 및 체절 협응 측정 방법 및 시스템을 제공하는 것이다."}
{"patent_id": "10-2023-0042132", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 목적을 달성하기 위하여, 본 발명에 따른 가상/증강현실 및 일반환경에서의 실시간 관절 및 체절 협 응 측정시스템은 관절/체절의 동작 측정 및 분석이 가능한 모션센서, 모션을 기반으로 관절간/체절간 협응력을 평가하는 인공지능 알고리즘과, 이를 분석 및 모니터링 해주는 소프트프웨어 및 앱/웹, 결과를 사용자에게 피드 백하는 측정 시스템으로 구성된다. 본 발명에 따른 측정 시스템에서, 상기 모션센서는 관성센서, 가속센서 또는 자이로센서인 것을 특징으로 한다. 본 발명에 따른 측정시스템에서, 상기 인공지능알고리즘은 머신러닝과 딥러닝을 사용하여 상기 모션센서가 측정 한 값을 기반으로 관절 및 체절간의 운동성과 협응성을 학습하는 것을 특징으로 한다. 본 발명에 따른 측정시스템에서, 상기 분석 및 모니터링 소트프웨어 및 앱/웹은 유무선으로 상기 모션센서가 측 정한 값을 수신한 다음, 인공지능알고리즘을 통해 관절 및 체절들의 운동을 평가한 학습데이터를 기반으로, 관 절과 체절들 간에 정상적인 또는 비정적인 협응이 발생하는지를 평가하는 것을 특징으로 한다. 본 발명에 따른 측정시스템에서, 상기 피드백은 소리 또는 진동 및 디스플레이를 이용하여, 체절 및 관절들의 협응이 정상적인지 아니면 비정상적인지를 알려주고, 체절 및 관절들의 협응 상태를 디스플레이를 통해 보여주 는 것을 특징으로 한다. 가상/증강현실 및 일반환경에서의 실시간 관절 및 체절 협응 측정 방법은 상기 측정시스템을 이용하여 이루어진 다."}
{"patent_id": "10-2023-0042132", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "운동계 질환 환자들의 재활치료나 평가, 낙상 위험성이 높은 개인들의 낙상 예방 및 부상 위험성 감소를 위한 재활 프로그램에 사용될 수 있는 실시간 협응 측정 방법 및 시스템을 제공한다. 이를 통해 재활치료나 운동 프 로그램 등에서 디지털바이오마커로 활용 가능하며, 개인 맞춤형 운동 프로그램을 구성하는 데도 활용할 수 있다. 또한, 기존의 체력 측정 방법으로는 측정하지 못했던 고유수용성감각과 협응간의 상관관계를 측정할 수 있어 더욱 정확한 평가와 개인 맞춤형 재활 프로그램 구성에 기여할 수 있다. 이러한 발명은 환자들의 신체 기 능 회복 및 건강 유지에 기여하며, 낙상 예방 및 부상 위험성 감소를 통해 노인들의 삶의 질 향상에도 큰 역할을 할 것으로 기대된다."}
{"patent_id": "10-2023-0042132", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는, 첨부된 도면을 참고하여 본 발명에 따른 바람직한 실시예를 보다 상세하게 설명하기로 한다. 본 발명의 설명에 앞서, 이하의 특정한 구조 내지 기능적 설명들은 단지 본 발명의 개념에 따른 실시예를 설명 하기 위한 목적으로 예시된 것으로, 본 발명의 개념에 따른 실시예들은 다양한 형태로 실시될 수 있으며, 본 명 세서에 설명된 실시예들에 한정되는 것으로 해석되어서는 아니된다. 또한, 본 발명의 개념에 따른 실시예는 다양한 변경을 가할 수 있고 여러 가지 형태를 가질 수 있으므로, 특정 실시예들을 도면에 예시하고 본 명세서에 상세하게 설명하고자 한다. 그러나, 이는 본 발명의 개념에 따른 실시 예들을 특정한 개시 형태에 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경물, 균 등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 본 발명과 관련해, 머신러닝 및 수학적 알고리즘을 적용하여 관절 운동의 협응성을 측정할 수 있는 방법이 개발 되는 중이고, 이러한 방법을 실현하기 위한 센서 기술도 발전하였다. 이러한 기술의 발전으로 협응 평가는 체절 간 및 관절 간의 움직임이 얼마나 조화롭게 이루어지는지를 정량적으로 측정하는 것이 가능해졌다. 이를 통해 뇌졸중, 근육병, 근무력증, 파킨슨병 등과 같은 운동계 질환 환자들의 재활치료나 평가에 사용될 수 있으며, 노 인 등 낙상 위험성이 높은 개인들의 낙상 예방 및 부상 위험성 감소를 위한 재활 프로그램에도 적용될 수 있다. 또한, 최근 연구에서는 고유수용성감각과 관절 및 체절간의 협응과의 상관관계도 중요한 역할을 한다는 것이 밝 혀졌다. 이에 따라 본 발명은 실시간 협응 측정 방법 및 시스템을 제공하며, 이를 활용하여 재활치료나 운동 프 로그램 등에서 디지털바이오마커로 활용할 수 있다. 도 2는 본 발명에 따른, 가상/증강현실 및 일반환경에서의 실시간 관절 및 체절 협응 측정시스템을 도시한 것이다. 도 2을 참조하며, 본 발명에 따른 측정시스템은은 관절/체절의 동작 측정 및 분석이 가능한 모션센서, 모션을 기반으로 관절간/체절간 협응력을 평가하는 인공지능 알고리즘과, 이를 분석 및 모니터링 해주는 소 프트프웨어 및 앱/웹, 결과를 사용자에게 피드백하는 시스템으로 구성된다. 본 발명에 따른 시스템에서, 모션센서는 사용자의 체절에 부착하여 각도, 각속도, 각가속등의 움직임 특성 을 측정한다. 이와 같은 움직임의 특성을 기반으로 인공지능 알고리즘을 통해 관절 및 체절을 평가해주고 정상 및 비정상정도를 분석 및 모니터링 소트프웨어 및 앱/웹에 결과를 보여준다. 또한 진동 및 소리 등의 다양한 피드백 방법을 통해 사용자에게 그 결과를 전달하는 피드백하게 된다. 사용자의 체절에 부착되는 상기 모션센서는 관성, 가속 또는 자이로센서이다. 이러한 센서를 통해 체절부위 의 움직인 속도와 그리고 움직임의 방향을 정확하게 측정할 수 있어서, 관절을 포함한 체절부위들 간의 협응 정 도도 정확하게 확인할 수 있게 된다. 또한, 상기 모센센서를 통해 측정한 값을, 분석 및 모니터링 소프트웨어 및 앱/웹이 설치된 장치, 예컨대 컴퓨터단말기 또는 휴대용단말기에 전송을 위해 모션센서에는 유무선 전송 용 통신모듈이 설치될 수 있다. 유선모듈의 경우에는 통신케이블을 사용하고, 무선모듈의 경우에는 블루투스나 와이파이와 같은 통신표준을 사용할 수 있지만, 이러한 통신방식뿐만 아니라 통신표준으로 설정된 다른 통신방 식도 사용할 수 있다. 상기 인공지능알고리즘은 관련업계와 학계에서 잘 공지된 머신러닝과 딥러닝을 사용하여, 모션센서를 통한 관절부위의 운동성평가와 관절부위들 간의 협응에 대해 정확하게 평가하여, 필요시 사람의 관절부위 재활이나치료가 큰 오차없이 효율적으로 이루어지게 할 수 있다. 분석 및 모니터링 소트프웨어 및 앱/웹은 유무선으로 상 모션센서가 측정한 값을 수신한 다음, 인공지 능알고리즘을 통해 관절 및 체절들의 운동을 평가 학습한 데이터를 기반으로 관절과 체절들 간에 정상적인 또는 비정적인 협응이 발생하는지를 보여준다. 상기 피드백은 소리 또는 진동 및 디스플레이를 이용하여, 체절 및 관절들의 협응이 정상적인지 아니면 비 정상적인지를 알여주고, 체절 및 관절들의 협응 상태를 디스플레이를 통해 보여준다. 도 3은 협응 소프트웨어 및 앱/웹에서 사용자에게 제공하는 정보의 예를 보여주는 것으로, 협응 평가시 정상 범위인지 비정상범위인지를 보여주게 된다. 이때 협응을 평가한 부위와 협응정도를 디스플레이한다. 만일 비정상적인 협응이 발생한다면 이를 소리 또는 진동으로 사용자 또는 재활치료사에게 알려주는 한편 디스 플레이들 통해 정상적인 협응 이루어지게 되는 상태를 보여줘 재활치료가 효율적으로 이루어지게 한다. 도 4는 협응을 측정하는 전체적인 절차를 나타낸다. 도면에 도시한 바와 같이. 관절이나 체절부위에 모션센서 를 부착한 후, 일반적으로 동작수행시 관절이나 체절의 각도, 각속도, 각가속도 등을 사용하여 각 값의 위상을 측정한다. 그 후 두 관절 혹은 체절의 위상차를 구해서 연속상대위상을 구한다. 반복되는 동작에서 연속상대위 상의 변화 정도 및 경향 등을 분석하여 형응을 평가하게된다. 이와 같은 협응을 지속적으로 모니터링하여 재활 및 운동의 단계를 평가하거나 향후 발생할 부상위험성 분석, 조기진단등에 활용 가능하다. 즉, 이와 같은 모니터링을 통해, 노령층의 경우 해당 나이대에 비해 운동성이 우 수한지 또는 나쁜지와, 관절 및 체절들 간의 협응성이 우수한지 나쁜지를 진단할 수 있고, 이러한 진단결과 운 동성 또는 협응성이 나쁜 것으로 판단되면, 운동성과 협응성을 향상시킬 수 있는 운동처방을 할 수 있게 된다. 이는 근질환자에 대해서도 동일하게 적용할 수 있다. 이에 따라, 과학적이고 체계적이며 또한 효율적인 방식으 로, 발생할 수도 있는 부상위험성 분석, 조기 진단 등을 행할 수 있다."}
{"patent_id": "10-2023-0042132", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이제까지 본 발명에 대하여 그 실시예들을 중심으로 살펴보았다. 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자는 본 발명이 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 변형된 형태로 구현될 수 있음을 이 해할 수 있을 것이다. 그러므로 개시된 실시예들은 한정적인 관점이 아니라 설명적인 관점에서 고려되어야 한다. 본 발명의 범위는 전술한 설명이 아니라 특허청구범위에 나타나 있으며, 그와 동등한 범위 내에 있는 모 든 차이점은 본 발명에 포함된 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2023-0042132", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 동작을 할 때 하나의 관절이나 체절만 움직이는 것이 아니라 여러 관절 및 체절의 협응을 통해 이뤄지는 것을 보여주고, 관절 및 체절의 협응이 정상적일때와 비정상적일때의 예시를 도시한 도면. 도 2는 본 발명에 따른 관절/체절의 동작 측정 및 분석이 가능한 모션센서, 모션을 기반으로 관절간/체절간 협 응력을 평가하고 이를 분석 및 모니터링 해주는 소프트프웨어 및 앱/웹, 협응정도 피드백 시스템을 도시한 도면. 도 3은 협응 소프트웨어 및 앱/웹에서 제공해는 최소 정보를 도식한 도면. 도 4는 협응을 평가하는 흐름을 도식한 도면."}
