{"patent_id": "10-2021-0180211", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0091265", "출원번호": "10-2021-0180211", "발명의 명칭": "스마트 화물입하장치 및 관리시스템", "출원인": "한국해양대학교 산학협력단", "발명자": "김환성"}}
{"patent_id": "10-2021-0180211", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "대차 형태로써 소정의 적재대가 구비되는, 스마트 화물입하장치에 있어서,상기 대차 형태의 몸체를 구성하는 프레임;상기 프레임의 상부에서 소정의 면적을 가지는 평판 형태로 구비되는 적재베이스;상기 프레임에 고정되며, 적재대상물 중 가장 큰 높이를 가지는 적재대상물의 높이보다 높은 위치에 형성되는카메라지지대;상기 카메라지지대의 일측에 고정되는 카메라;상기 적재베이스의 하부에서 적재베이스와 평행한 평판 형태로 구비되는 라벨프린터거치대;상기 라벨프린터거치대에 거치되는 라벨프린터;상기 라벨프린터거치대의 하부에 구비되는 수납공간;상기 프레임의 일측에 형성되는 손잡이;상기 프레임의 하단에 구비되는 바퀴; 및소정의 제어신호를 발생시키는 제어부;를 포함하고,상기 적재대는:상기 적재베이스로부터 소정의 거리만큼 이격되어 구비되되, 회전축을 기준으로 적재베이스에 대해 회전 가능하도록 구비되는 회전판;상기 회전판을 회전시키는 모터; 및상기 회전판에 적재된 적재대상물의 무게를 측정하는 무게센서;를 포함하여,상기 회전판이 모터에 의해 일정한 속도로 회전할 때, 회전판에 적재된 적재대상물의 정면, 배면, 좌측면, 우측면 및 평면이 카메라에 의해 영상으로 촬영되는, 스마트 화물입하장치"}
{"patent_id": "10-2021-0180211", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1항에 있어서,상기 제어부는:상기 적재대상물의 무게를 측정하는 단계;촬영된 상기 영상을 일정 시간 간격마다 캡쳐하는 단계;캡쳐된 이미지들로부터 POI를 추출하는 단계;서로 다른 캡쳐된 이미지 간에 POI를 서로 매칭시키는 단계;매칭된 POI를 기준으로 캡쳐된 이미지들을 합성하는 단계;합성된 이미지로부터 적재대상물의 가로, 세로 및 높이를 측정하는 단계;캡쳐된 이미지들에 대해 광학 문자 인식 모듈을 적용하여 캡쳐된 이미지로부터 문자를 인식하는 단계;인식된 문자들을 미리 학습된 인공지능 모델에 입력하여 인식된 문자들로부터 송장 내용을 추출하는 단계;상기 적재대상물의 무게, 가로, 세로, 높이 및 송장 내용을 화물관리서버에 전송하는 단계; 및상기 화물관리서버로부터 적재대상물의 적재위치를 수신받아, 상기 적재위치로 이동하는 단계;에 따라공개특허 10-2023-0091265-3-제어되는, 스마트 화물입하장치"}
{"patent_id": "10-2021-0180211", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1항에 있어서,상기 무게센서는:상기 회전판의 하부에서, 회전축을 기준으로 방사상으로 다수개 배치되고,상기 적재대는:상기 회전판의 하부에, 회전축을 기준으로 방사상으로 배치되는 다수개의 감쇠장치; 및상기 감쇠장치의 탄성력을 조절하는 감쇠조절장치;를 더 포함하고,상기 감쇠장치는:상기 회전판과 접하는 지점에서 회전판의 회전에 따라 구름마찰하도록 구비되는 볼롤러; 및상기 볼롤러의 하부에 구비되는 스프링;을 포함하고,상기 감쇠조절장치는:상기 볼롤러의 하부에 결합되는 스프링권취부;상기 스프링권취부의 하부에 연결되는 감쇠조절축;상기 감쇠조절축을 회전시키는 감쇠조절모터; 및상기 감쇠조절축이 관통하도록 소정의 통공이 형성되며, 상기 스프링의 일단을 고정 지지하는 스프링지지판;을포함하여,상기 회전판에 가해지는 적재대상물의 편심하중에 따라 다수개의 감쇠장치 각각의 탄성력이 조절되는, 스마트화물입하장치"}
{"patent_id": "10-2021-0180211", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1항에 있어서,상기 수납공간의 상부에 배치되는 수평거리조절장치;상기 수평거리조절장치의 단부에 연결되는 수직거리조절장치;상기 수직거리조절장치의 단부에 연결되는 소형진공펌프; 및상기 소형진공펌프로부터 신장되는 흡착관;을 포함하여,상기 라벨프린터에서 지면에 수직한 방향으로 출력된 라벨을 흡착관으로 흡착하고,상기 라벨을 적재대상물의 라벨부착지점까지 이송시키도록 수평거리조절장치 및 수직거리조절장치를 제어하고,상기 라벨이 라벨부착지점까지 이송되었을 때, 수평거리조절장치를 제어하여 라벨을 적재대상물에 부착시킨 뒤소형진공펌프의 작동을 중지함으로써 라벨을 적재대상물에 부착시키는, 스마트 화물입하장치"}
{"patent_id": "10-2021-0180211", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1항 내지 5항 중 어느 한 항의 스마트 화물입하장치를 이용하는, 스마트 화물입하 관리시스템에 있어서,상기 스마트 화물입하장치로부터 적재대상물의 무게, 가로, 세로, 높이 및 송장 내용을 전송받는 화물관리서버;를 포함하고,상기 화물관리서버는:1) 입하 사이클마다 입하창고 내부의 현재 적재 현황을 갱신하는 단계;2) 상기 현재 적재 현황이 갱신된 후, 입하 예정 적재대상물들에 대해 제1권장적재위치를 지정 및 갱신하여 룩업테이블에 저장하는 단계;공개특허 10-2023-0091265-4-3) 상기 적재대상물의 무게, 가로, 세로 및 높이 값을 기준으로, 상기 제1권장적재위치에의 적재적합성을 판별하는 단계;4) 상기 적재적합성이 부적합한 것으로 판별되는 경우에는, 현재 입하 사이클 이외의 입하 사이클에 입하 예정인 적재대상물의 제2권장적재위치 중 제1권장적재위치로부터 가장 가까운 제2권장적재위치를 제1권장적재위치로재지정하는 단계; 및상기 제1권장적재위치의 적재적합성이 적합한 것으로 판별될 때까지 상기 3) 및 4) 단계를 반복하는 단계;에 따라 제어되는, 스마트 화물입하 관리시스템"}
{"patent_id": "10-2021-0180211", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 스마트 화물입하장치 및 관리시스템에 관한 것으로, 더 상세하게는 입하된 화물의 제원과 송장정보를 자동으로 취득하여 서버에 등록할 수 있는 스마트 화물입하장치와, 그를 이용한 스마트 화물입하 관리시스템에 관한 것이다. (뒷면에 계속)"}
{"patent_id": "10-2021-0180211", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 스마트 화물입하장치 및 관리시스템에 관한 것으로, 더 상세하게는 입하된 화물의 제원과 송장정보를 자동으로 취득하여 서버에 등록할 수 있는 스마트 화물입하장치와, 이를 이용한 스마트 화물입하 관리시스템에 관한 것이다."}
{"patent_id": "10-2021-0180211", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "물류 산업의 규모가 증가함에 따라, 화물창고에서 화물들을 관리하는 기술에 대한 수요가 증가하고 있다. 특히, 입하화물을 취급하는 창고(물류센터)에서는 입하화물의 제원(크기, 무게 등)과 송장정보 등을 수작업으로 입력하는 과정들을 수행하고 있으며, 이러한 수작업들로 인해 불필요한 행정/인력 소모가 많이 발생하고 있을뿐 만 아니라, 휴먼에러로 인한 화물 데이터의 오류 발생 등의 문제가 발생하고 있다. 이러한 문제점을 해결하기 위하여, 국내특허공개공보 제10-2019-0117417호에는 입력부(카메라 등)를 통해 물품 (화물)의 정보를 식별하여 처리하는 로봇이 개시되어 있다. 다만, 상기 특허문헌에서는 과일이나 커피 등 소형 물품에 대해서 정보를 식별하는 형태의 기술을 제안하고 있 어서, 크기가 큰 입하화물을 취급하는 물류센터 등에서는 적용하기 어려운 한계점이 있다."}
{"patent_id": "10-2021-0180211", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는, 전술한 바와 같은 종래 물류 관리 시스템의 한계점을 극복하기 위하여, 박 스 형태로 취급되는 다양한 크기의 화물들의 제원 및 송장정보를 인식하고 이를 서버에 자동으로 입력하도록 하 는 스마트 화물입하장치 및 관리시스템을 제공하는 것이다."}
{"patent_id": "10-2021-0180211", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 전술한 바와 같은 종래 물류 관리 시스템의 한계점을 극복하기 위하여, 대차 형태로써 소정의 적재대 가 구비되는, 스마트 화물입하장치에 있어서, 상기 대차 형태의 몸체를 구성하는 프레임; 상기 프레임의 상부에 서 소정의 면적을 가지는 평판 형태로 구비되는 적재베이스; 상기 프레임에 고정되며, 적재대상물 중 가장 큰 높이를 가지는 적재대상물의 높이보다 높은 위치에 형성되는 카메라지지대; 상기 카메라지지대의 일측에 고정되 는 카메라; 상기 적재베이스의 하부에서 적재베이스와 평행한 평판 형태로 구비되는 라벨프린터거치대; 상기 라 벨프린터거치대에 거치되는 라벨프린터; 상기 라벨프린터거치대의 하부에 구비되는 수납공간; 상기 프레임의 일 측에 형성되는 손잡이; 상기 프레임의 하단에 구비되는 바퀴; 및 소정의 제어신호를 발생시키는 제어부;를 포함 하고, 상기 적재대는: 상기 적재베이스로부터 소정의 거리만큼 이격되어 구비되되, 중심을 기준으로 적재베이스 에 대해 회전 가능하도록 구비되는 회전판; 상기 회전판을 회전시키는 모터; 및 상기 회전판에 적재된 적재대상 물의 무게를 측정하는 무게센서;를 포함하여, 상기 회전판이 모터에 의해 일정한 속도로 회전할 때, 회전판에 적재된 적재대상물의 정면, 배면, 좌측면, 우측면 및 평면이 카메라에 의해 영상으로 촬영되는, 스마트 화물입 하장치를 제공한다. 또한, 상기 제어부는: 상기 적재대상물의 무게를 측정하는 단계; 촬영된 상기 영상을 일정 시간 간격마다 캡쳐 하는 단계; 캡쳐된 이미지들로부터 POI를 추출하는 단계; 서로 다른 캡쳐된 이미지 간에 POI를 서로 매칭시키는 단계; 매칭된 POI를 기준으로 캡쳐된 이미지들을 합성하는 단계; 합성된 이미지로부터 적재대상물의 가로, 세로및 높이를 측정하는 단계; 캡쳐된 이미지들에 대해 광학 문자 인식 모듈을 적용하여 캡쳐된 이미지로부터 문자 를 인식하는 단계; 인식된 문자들을 미리 학습된 인공지능 모델에 입력하여 인식된 문자들로부터 송장 내용을 추출하는 단계; 상기 적재대상물의 무게, 가로, 세로, 높이 및 송장 내용을 화물관리서버에 전송하는 단계; 및 상기 화물관리서버로부터 적재대상물의 적재위치를 수신받아, 상기 적재위치로 이동하는 단계;에 따라 제어될 수 있다. 그리고, 상기 무게센서는: 상기 회전판의 하부에서, 회전축을 기준으로 방사상으로 다수개 배치되고, 상기 적재 대는: 상기 회전판의 하부에, 회전축을 기준으로 방사상으로 배치되는 다수개의 감쇠장치; 및 상기 감쇠장치의 스프링상수를 조절하는 감쇠조절장치;를 더 포함하고, 상기 감쇠장치는: 상기 회전판과 접하는 지점에서 회전판 의 회전에 따라 구름마찰하도록 구비되는 볼롤러; 및 상기 볼롤러의 하부에 구비되는 스프링;을 포함하고, 상기 감쇠조절장치는: 상기 볼롤러의 하부에 결합되는 스프링권취부; 상기 스프링권취부의 하부에 연결되는 감쇠조절 축; 상기 감쇠조절축을 회전시키는 감쇠조절모터; 및 상기 감쇠조절축이 관통하도록 소정의 통공이 형성되며, 상기 스프링의 일단을 고정 지지하는 스프링지지판;을 포함하여, 상기 회전판에 가해지는 적재대상물의 편심하 중에 따라 다수개의 감쇠장치 각각의 스프링상수가 조절되도록 구성될 수 있다. 아울러, 상기 수납공간의 상부에 배치되는 수평거리조절장치; 상기 수평거리조절장치의 단부에 연결되는 수직거 리조절장치; 상기 수직거리조절장치의 단부에 연결되는 소형진공펌프; 및 상기 소형진공펌프로부터 신장되는 흡 착관;을 포함하여, 상기 라벨프린터에서 지면에 수직한 방향으로 출력된 라벨을 흡착관으로 흡착하고, 상기 라 벨을 적재대상물의 라벨부착지점까지 이송시키도록 수평거리조절장치 및 수직거리조절장치를 제어하고, 상기 라 벨이 라벨부착지점까지 이송되었을 때, 수평거리조절장치를 제어하여 라벨을 적재대상물에 부착시킨 뒤 소형진 공펌프의 작동을 중지함으로써 라벨을 적재대상물에 부착시키도록 구성될 수 있다. 또한, 상기 스마트 화물입하장치를 이용하는, 스마트 화물입하 관리시스템에 있어서, 상기 스마트 화물입하장치 로부터 적재대상물의 무게, 가로, 세로, 높이 및 송장 내용을 전송받는 화물관리서버;를 포함하고, 상기 화물관 리서버는: 1) 입하 사이클마다 입하창고 내부의 현재 적재 현황을 갱신하는 단계; 2) 상기 현재 적재 현황이 갱 신된 후, 입하 예정 적재대상물들에 대해 제1권장적재위치를 지정 및 갱신하여 룩업테이블에 저장하는 단계; 3) 상기 적재대상물의 무게, 가로, 세로 및 높이 값을 기준으로, 상기 제1권장적재위치에의 적재적합성을 판별하는 단계; 4) 상기 적재적합성이 부적합한 것으로 판별되는 경우에는, 현재 입하 사이클 이외의 입하 사이클에 입하 예정인 적재대상물의 제2권장적재위치 중 제1권장적재위치로부터 가장 가까운 제2권장적재위치를 제1권장적재위 치로 재지정하는 단계; 및 상기 제1권장적재위치의 적재적합성이 적합한 것으로 판별될 때까지 상기 3) 및 4) 단계를 반복하는 단계;에 따라 제어되는, 스마트 화물입하 관리시스템을 제공한다."}
{"patent_id": "10-2021-0180211", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예에 따르면, 다양한 크기의 화물(적재대상물)에 대하여 크기 및 무게를 측정할 수 있으며, 화 물의 외부에 부착된 송장정보를 자동으로 취득하여 서버에 기록할 수 있다. 또한, 적재대상물을 회전시키면서 촬영함으로써, 송장이 부착된 위치와 무관하게 송장으로부터 정보를 취득할 수 있다. 그리고, 화물의 정보를 입력하는 절차를 자동화하여 인적/행정적 소모를 절감할 수 있다. 아울러, 편심하중을 가지는 화물에 대응하도록 소정의 감쇠조절장치를 구비함으로써, 편심하중에 의한 장치의 고장이나 회전 시 발생하는 진동 등을 방지함으로써 보다 정확한 영상 데이터를 취득할 수 있다. 또한, 라벨을 화물의 외부 일측 지정된 위치에 자동으로 부착할 수 있다. 그리고, 화물이 적재될 최적의 위치를 지속적으로 관리/갱신함으로써, 적재작업 소요시간 및 정체현상 등을 최 소화할 수 있다."}
{"patent_id": "10-2021-0180211", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 문서의 다양한 실시예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 문서에 기재된 기술을 특 정한 실시 형태에 대해 한정하려는 것이 아니며, 본 문서의 실시예의 다양한 변경(modifications), 균등물 (equivalents), 및/또는 대체물(alternatives)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 본 문서에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 문서에서, \"A 또는 B,\" \"A 또는/및 B 중 적어도 하나,\" 또는 \"A 또는/및 B 중 하나 또는 그 이상\"등의 표현 은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B,\" \"A 및 B 중 적어도 하나,\" 또는 \"A 또는 B 중 적어도 하나\"는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 본 문서에서 사용된 \"제 1,\" \"제 2,\" \"1) 단계\" 또는 \"2) 단계\"등의 표현들은 다양한 구성요소들을, 순서 및/또 는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소 들을 한정하지 않는다. 예를 들면, 제 1 사용자 기기와 제 2 사용자 기기는, 순서 또는 중요도와 무관하게, 서 로 다른 사용자 기기를 나타낼 수 있다. 예를 들면, 본 문서에 기재된 권리 범위를 벗어나지 않으면서 제 1 구 성요소는 제 2 구성요소로 명명될 수 있고, 유사하게 제 2 구성요소도 제 1 구성요소로 바꾸어 명명될 수 있다. 어떤 구성요소(예: 제 1 구성요소)가 다른 구성요소(예: 제 2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결 되어(operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제 3 구성요소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제 1 구성요소)가 다 른 구성요소(예: 제 2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어 떤 구성요소와 상기 다른 구성요소 사이에 다른 구성요소(예: 제 3 구성요소)가 존재하지 않는 것으로 이해될수 있다. 본 문서에서 사용된 용어들은 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 다른 실시 예의 범위를 한 정하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 문서에 기재된 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 본 문서에 사용된 용어 들 중 일반적인 사전에 정의된 용어들은, 관련 기술의 문맥상 가지는 의미와 동일 또는 유사한 의미로 해석될 수 있으며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따라서, 본 문서에서 정의된 용어일지라도 본 문서의 실시 예들을 배제하도록 해석될 수 없다."}
{"patent_id": "10-2021-0180211", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 발명의 청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야에서 통상의 지 식을 가진자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 발명의 기술적 사상이나 전망으로부터 개별적으로 이해되어져서는 안될 것이다. 발명의 설명에서 사용되는 용어 \"상부, 하부, 정면, 배면, 좌측면, 우측면 및 평면\" 등은 도면을 기준으로 정의 한 것이며, 이러한 용어에 의하여 각 구성의 형상 및 위치가 제한되는 것은 아니다. 본 발명의 실시 예에 따르면, 대차 형태로써 소정의 적재대가 구비되는, 스마트 화물입하장치에 있어서, 상기 대차 형태의 몸체를 구성하는 프레임; 상기 프레임의 상부에서 소정의 면적을 가지는 평판 형태로 구비되 는 적재베이스; 상기 프레임에 고정되며, 적재대상물 중 가장 큰 높이를 가지는 적재대상물의 높이보다 높은 위치에 형성되는 카메라지지대; 상기 카메라지지대의 일측에 고정되는 카메라; 상기 적재베이스 의 하부에서 적재베이스와 평행한 평판 형태로 구비되는 라벨프린터거치대; 상기 라벨프린터거치대 에 거치되는 라벨프린터; 상기 라벨프린터거치대의 하부에 구비되는 수납공간; 상기 프레임의 일측에 형성되는 손잡이; 상기 프레임의 하단에 구비되는 바퀴; 및 소정의 제어신호를 발생시키는 제 어부;를 포함하고, 상기 적재대는: 상기 적재베이스로부터 소정의 거리만큼 이격되어 구비되되, 중심을기준으로 적재베이스에 대해 회전 가능하도록 구비되는 회전판; 상기 회전판을 회전시키는 모터; 및 상기 회전판에 적재된 적재대상물의 무게를 측정하는 무게센서;를 포함하여, 상기 회전판이 모터에 의 해 일정한 속도로 회전할 때, 회전판에 적재된 적재대상물의 정면, 배면, 좌측면, 우측면 및 평면이 카메라 에 의해 영상으로 촬영되는, 스마트 화물입하장치를 제공한다. 상기 기재에서 대차란, 일반적으로 산업 현장에서 사용되는 손잡이, 적재대 및 바퀴를 포함하는 형태의 장치를 의미할 수 있으며, 이와 더불어 AGV와 같이 자동화 기기로써 자율주행이나 소정의 라인을 따라 주행 가능한 라 인 트레이서 등의 구성과 균등한 구성을 의미할 수 있다. 이에 따라, 본 발명의 실시 예에 따른 스마트 화물입 하장치는 자율주행이 가능한 형태로 구성될 수도 있다. 상기 기재 중 \"적재대상물 중 가장 큰 높이를 가지는 적재대상물\"은, 해당 창고/물류센터에 입고되는 화물 중 가장 큰 높이를 가지는 화물을 의미하며, 이는 본 발명의 명세서를 참조하여 본 발명의 기술적 사상을 실시하는 통상의 기술자가용이하게 설계할 수 있는 범위이므로 구체적인 치수 범위는 기재하지 않는다. 상기 카메라는 '사시도' 형태로 적재대상물을 촬영할 수 있다. 여러 각도에서 촬영된 적재대상물의 화상/이 미지를 합성함으로써 적재대상물의 전체적인 형상을 파악할 수 있다. 상기 손잡이는 자율주행형, AGV형 등의 실시 예에서는 생략될 수 있다. 상기 회전판은 다양한 크기의 박스(상자, 적재대상물, 화물)를 적재할 수 있도록 소정의 장방형 평판 형태 로 구성될 수 있다. 이 때, 장방형의 꼭지점 부분은 사고를 방지하기 위하여 라운드지도록 구성되는 것이 바람 직하다. 적재대상물을 회전판 위에 적재한 상태에서 카메라를 작동시키고, 카메라가 작동중인 상태에서 회전 판을 천천히(소정의 속도) 회전시킴으로써 적재대상물의 5 방향(정면, 배면, 좌측면, 우측면 및 평면) 형상 을 취득할 수 있다. 회전판의 회전 속도는 3 RPM 이하의 (상대적으로) 낮은 속도인 것이 바람직하다. 회전속도가 너무 빠른 경 우에는 영상으로부터 유의미한 데이터를 추출하기 어려워지며, 편심하중이 있는 적재대상물의 경우에는 전복사 고도 발생할 수 있다. 또한, 상기 제어부는: 상기 적재대상물의 무게를 측정하는 단계; 촬영된 상기 영상을 일정 시간 간격마다 캡쳐 하는 단계; 캡쳐된 이미지들로부터 POI를 추출하는 단계; 서로 다른 캡쳐된 이미지 간에 POI를 서로 매칭시키는 단계; 매칭된 POI를 기준으로 캡쳐된 이미지들을 합성하는 단계; 합성된 이미지로부터 적재대상물의 가로, 세로 및 높이를 측정하는 단계; 캡쳐된 이미지들에 대해 광학 문자 인식 모듈을 적용하여 캡쳐된 이미지로부터 문자 를 인식하는 단계; 인식된 문자들을 미리 학습된 인공지능 모델에 입력하여 인식된 문자들로부터 송장 내용을 추출하는 단계; 상기 적재대상물의 무게, 가로, 세로, 높이 및 송장 내용을 화물관리서버에 전송하는 단계; 및 상기 화물관리서버로부터 적재대상물의 적재위치를 수신받아, 상기 적재위치로 이동하는 단계;에 따라 제어될 수 있다. 상기 도 2에 도시된 바와 같이, 적재대상물의 일측(정면)부터 360도 회전하며 촬영된 화상으로부터, 일정 간격 (일정 각도)마다 이미지를 캡쳐하여 이미지로부터 POI를 추출한다. POI란, Point Of Interest의 약자이며, 이미지 인식 알고리즘에서 박스의 각 꼭지점을 인식할 때 이 꼭지점들을 POI로써 지정할 수 있다. 이 때, 도 2의 정면 사시도에서는 적재대상물 평면의 네 점, 적재대상물 정면의 네 점(상부 두 점은 평면의 두 점과 겹침(같은 지점을 의미). 이하, 겹치는 POI에 대한 서술은 생략함)이 POI로써 추출될 수 있다. 정면 사시도로부터 60도 가량 회전한 상태의 사시도에서는 적재대상물 평면의 네 점, 적재대상물 정면의 네 점, 적재대상물 우측면의 네 점이 POI로써 추출될 수 있다. 정면 사시도로부터 210도 가량 회전한 상태의 사시도에서는 적재대상물 평면의 네 점, 적재대상물 배면의 네 점, 적재대상물 좌측면의 네 점이 POI로써 추출될 수 있다. 상기 POI들을 이미지 합성 알고리즘에서의 합성 기준점으로 지정할 수 있으며, 합성된 이미지로부터 길이를 측 정함으로써 적재대상물의 제원을 확인할 수 있다. 이 때, 적재대상물의 길이는, 회전판의 치수에 대한 상대 적인 크기를 비교함으로써 미터법 등의 규격화된 치수로써 계산될 수 있다.송장은 적재대상물에 따라 부착되는 위치가 다를 수 있으나, 본 발명의 실시 예에 따르면 5개 면에 대해 송 장 인식이 가능하므로, 송장이 부착된 면을 회전판에 접촉시키지만 않는다면(송장 부착면이 저 면인 경우) 송장으로부터 정보를 취득할 수 있다. 그리고, 상기 무게센서는: 상기 회전판의 하부에서, 회전축을 기준으로 방사상으로 다수개 배치되고, 상기 적재대는: 상기 회전판의 하부에, 회전축을 기준으로 방사상으로 배치되는 다수개의 감쇠장치 ; 및 상기 감쇠장치의 탄성력을 조절하는 감쇠조절장치;를 더 포함하고, 상기 감쇠장치는: 상기 회 전판과 접하는 지점에서 회전판의 회전에 따라 구름마찰하도록 구비되는 볼롤러; 및 상기 볼롤러 의 하부에 구비되는 스프링;을 포함하고, 상기 감쇠조절장치는: 상기 볼롤러의 하부에 결합되는 스 프링권취부; 상기 스프링권취부의 하부에 연결되는 감쇠조절축; 상기 감쇠조절축을 회전시키는 감쇠조절모터; 및 상기 감쇠조절축이 관통하도록 소정의 통공이 형성되며, 상기 스프링의 일단을 고정 지지하는 스프링지지판;을 포함하여, 상기 회전판에 가해지는 적재대상물의 편심하중에 따라 다수 개의 감쇠장치 각각의 탄성력이 조절되도록 구성될 수 있다. 도 4에 도시된 바와 같은 형태의 감쇠장치가 도 3에서와 같이 회전축을 중심으로 방사상으로 배치될 수 있다. 이 때, 해당 물류센터의 특성에 따라 장방형 적재대상물이 많고 그 적재대상물들의 장방형 양단부분에서 의 편심하중이 심한 경우에는, 회전판의 양 끝 부분에 감쇠장치를 배치하여 하중을 지지하도록 구성할 수도 있다. 이 때, 회전판의 회전을 고려하여, 회전판이 일정 각도 회전했을 때에도 회전판의 양 끝 부분이 지지되도록 적재베이스에 감쇠장치들을 배치하는 것이 바람직하다. 감쇠장치 상단에 위치한 볼롤러는 스프링권취부, 볼롤러 및 감쇠조절축 결합체가 감쇠조절 모터에 의해 회전되더라도 회전 각도와 상관없이 회전판을 구름마찰 지지할 수 있다. 볼롤러의 볼 부분을 지지하는 지지체는 스프링권취부와 고정결합될 수 있다. 감쇠조절모터는 감쇠조절축을 회전시키며, 감쇠조절축에 고정된 스프링권취부가 회전함에 따라 스프링의 단부가 스프링권취부에 감겨들어가거나 풀려날 수 있다. 이렇게 스프링의 길이를 조절함 으로써 스프링이 회전판에 가하는 탄성력의 크기를 조절할 수 있다. 감쇠조절축이 회전하더라도 스프링은 스프링지지판에 고정된 상태이므로, 스프링은 회전하지 않고 스프링권취부만이 회전함에 따라 스프링이 스프링권취부에 권취되거나 권출될 수 있다. 스프링지지판은 적재베이스 등에 고정결합 되는 것이 바람직하다. 아울러, 상기 수납공간의 상부에 배치되는 수평거리조절장치; 상기 수평거리조절장치의 단부에 연결되는 수 직거리조절장치; 상기 수직거리조절장치의 단부에 연결되는 소형진공펌프; 및 상기 소형진공펌프로부터 신장되 는 흡착관;을 포함하여, 상기 라벨프린터에서 지면에 수직한 방향으로 출력된 라벨을 흡착관으로 흡착하고, 상기 라벨을 적재대상물의 라벨부착지점까지 이송시키도록 수평거리조절장치 및 수직거리조절장치를 제어하고, 상기 라벨이 라벨부착지점까지 이송되었을 때, 수평거리조절장치를 제어하여 라벨을 적재대상물에 부착시킨 뒤 소형진공펌프의 작동을 중지함으로써 라벨을 적재대상물에 부착시키도록 구성될 수 있다. 상기 수평거리조절장치 및 수직거리조절장치는 길이/거리/높이를 조절하는 리프트장치 등 공지된 구성을 적용할 수 있다. 소형진공펌프는 출력이 강할 필요는 없으며, 종이 소재의 라벨을 흡착할 수 있는 정도의 출력만을 가지는 것으 로 족하다. 라벨프린터는 소형진공펌프가 라벨을 반듯하게 흡착시킬 수 있도록 수직 방향(지면 방향)으로 라벨을 출력하 는 것이 바람직하다. 비접착면에 흡착관을 맞댄 상태에서 소형진공펌프를 작동시킴으로써 라벨을 라벨프린터로부터 분리하고, 적 재대상물 부근으로 이송시킬때까지 고정할 수 있다. 상기 라벨부착지점은 카메라에 의해 확인될 수 있다. 적재대상물의 대부분은 육면체 형태의 박스이므로, 카 메라에서 촬영되는 지점이 라벨부착지점이 있는 정면이 되도록 회전판을 회전시킨 상태에서 라벨부착지 점을 지정한다. 이후 회전판을 90도 회전시킨 상태로 수직거리조절장치 및 수평거리조절장치를 작동시킴으 로써 정확한 위치에 라벨을 부착할 수 있다. 상기 수평거리조절장치에는 좌우 방향으로의 위치 조절이 가능한 좌우거리조절장치가 연결될 수 있으며, 이를 통해 흡착관(또는 라벨)을 3축 방향에 대해 이동시킬 수 있다. 또한, 상기 스마트 화물입하장치를 이용하는, 스마트 화물입하 관리시스템에 있어서, 상기 스마트 화물입하장치 로부터 적재대상물의 무게, 가로, 세로, 높이 및 송장 내용을 전송받는 화물관리서버;를 포함하고, 상기 화물관 리서버는: 1) 입하 사이클마다 입하창고 내부의 현재 적재 현황을 갱신하는 단계; 2) 상기 현재 적재 현황이 갱 신된 후, 입하 예정 적재대상물들에 대해 제1권장적재위치를 지정 및 갱신하여 룩업테이블에 저장하는 단계; 3) 상기 적재대상물의 무게, 가로, 세로 및 높이 값을 기준으로, 상기 제1권장적재위치에의 적재적합성을 판별하는 단계; 4) 상기 적재적합성이 부적합한 것으로 판별되는 경우에는, 현재 입하 사이클 이외의 입하 사이클에 입하 예정인 적재대상물의 제2권장적재위치 중 제1권장적재위치로부터 가장 가까운 제2권장적재위치를 제1권장적재위 치로 재지정하는 단계; 및 상기 제1권장적재위치의 적재적합성이 적합한 것으로 판별될 때까지 상기 3) 및 4) 단계를 반복하는 단계;에 따라 제어되는, 스마트 화물입하 관리시스템을 제공한다. 입하 사이클이란, 소정의 시간 간격 또는 화물이 한 번에 다수 입고되는 회차를 의미할 수 있다. 예를 들어, 1 시간에 한 번을 하나의 입하 사이클로 지정하거나, 기차/화물차 등이 물류센터 등(입하창고)에 도착하여 그 차 량으로부터 하역된 하물들을 입하하는 것을 하나의 입하 사이클로 지정할 수 있다. 입하창고 내부의 현재 적재 현황은, 입하창고 시설물 내부에 설치된 다수의 카메라 등을 이용하여 확인되거나, 적재대에 설치된 적외선 센서 등에 의해 확인될 수 있다. 창고 내부의 현재 적재 현황을 확인하는 것은 공지된 기술이므로 상세한 설명은 생략한다. 갱신된 현재 적재 현황을 기반으로, 가장 먼저 도착할 입하 예정 적재대상물들을 적재할 위치를 지정할 수 있으 며, 이 때 적재대의 크기, 높이, 견딜 수 있는 하중, 현재 적재된 화물들의 제원 등을 종합적으로 고려하여 지 정될 수 있다. 입하 예정 적재대상물의 로트번호, 품번, 박스번호, 바코드번호 등 소정의 식별자(ID)에 대하여 제1권장적재위 치의 식별자를 지정하여 룩업테이블에 저장할 수 있다. 룩업테이블이란, 데이터베이스나 스프레드시트와 같이 적재대상물의 식별자와 권장적재위치의 식별자를 대응시 켜 저장할 수 있으며, 적재대상물의 식별자로부터 권장적재위치의 식별자를 읽어올 수 있는 것을 의미한다. 이 를 위하여 컴퓨터, 서버 등의 소정의 처리장치가 필요하다. 권장적재위치의 식별자를 통해 데이터베이스로부터 어느 창고(건물)의 어느 적재대의 몇 번째 층, 몇 번째 칸인 지 등을 조회/확인할 수 있다. 이를 적재위치의 좌표를 확인한 뒤, 스마트 화물입하장치를 해당 위치로 자동으 로 이동시킬 수 있다."}
{"patent_id": "10-2021-0180211", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 은 본 발명의 실시 예에 따른 스마트 화물입하장치를 나타낸 사시도이다. 도 2 는 적재대상물이 회전할 때의 각 면과 POI의 예시를 나타낸 도면이다. 도 3 은 본 발명의 실시 예에 따른 스마트 화물입하장치의 회전판을 나타낸 도면이다.도 4 는 본 발명의 실시 예에 따른 스마트 화물입하장치의 감쇠장치를 나타낸 도면이다. 도 5 는 본 발명의 실시 예에 따른 스마트 화물입하 관리시스템의 화물관리서버 제어 방법을 나타낸 순서도이다."}
