{"patent_id": "10-2022-0030705", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0133558", "출원번호": "10-2022-0030705", "발명의 명칭": "소프트웨어 동작 감지 장치 및 방법", "출원인": "국방과학연구소", "발명자": "안성현"}}
{"patent_id": "10-2022-0030705", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "하나 이상의 소프트웨어가 구비된 전자 기기의 전자파 신호를 획득하는 단계;상기 전자 기기의 기종, 상기 전자 기기에 구비된 소프트웨어의 종류, 상기 소프트웨어의 동작을 위한 프로토콜의 종류 및 상기 소프트웨어의 동작을 위한 하드웨어 모듈의 종류 중 적어도 하나에 기반하여 감지 대상이 되는동작 주파수 대역을 식별하는 단계;상기 동작 주파수 대역 내에서 상기 전자파 신호의 변화를 감지하는 단계; 및상기 전자파 신호의 변화에 기반하여, 상기 전자 기기, 상기 전자 기기에서 실행된 소프트웨어 및 세부 기능과관련된 동작 정보를 특정하는 단계를 포함하는, 동작 감지 방법."}
{"patent_id": "10-2022-0030705", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1항에 있어서,상기 전자파 신호를 획득하는 단계는,계측 기기에 구비되며, 상기 전자 기기의 일부분과 직접 연결되어 상기 전자파 신호를 탐지하는 프로브(probe)를 이용하여 수행되는 것을 특징으로 하는, 동작 감지 방법."}
{"patent_id": "10-2022-0030705", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1항에 있어서,상기 전자파 신호를 획득하는 단계는,주 계측 기기에 구비되어, 상기 전자파 신호를 무선으로 탐지하며 탐지된 전자파 신호를 상기 주 계측 기기와연동된 보조 계측 기기로 전송하는 스마트 프로브(smart probe)를 이용하여 수행되는 것을 특징으로 하는, 동작감지 방법."}
{"patent_id": "10-2022-0030705", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1항에 있어서,상기 감지하는 단계는,상기 동작 주파수 대역 내에서의 상기 전자파 신호의 세기, 주기, 파장 및 주기성(periodicity) 붕괴 여부 중적어도 하나에 기반하여 상기 전자파 신호의 변화를 감지하는 것을 특징으로 하는, 동작 감지 방법."}
{"patent_id": "10-2022-0030705", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1항에 있어서,상기 감지하는 단계는,상기 동작 주파수 대역 내에서 상기 전자파 신호의 세기 변화 및 주기성 붕괴를 감지하는 것을 특징으로 하고,상기 특정하는 단계는,상기 전자파 신호의 세기 변화에 기반하여 상기 전자 기기에서 카메라 애플리케이션의 실행을 특정하는 단계;및상기 전자파 신호의 주기성 붕괴에 기반하여 상기 카메라 애플리케이션의 사진 촬영 기능이 실행된 시점을 특정하는 단계를 포함하는, 동작 감지 방법."}
{"patent_id": "10-2022-0030705", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2023-0133558-3-청구항 1항에 있어서,상기 특정하는 단계는,상기 전자파 신호의 변화 이후의 신호 패턴을 특정하는 단계;복수의 패턴 데이터를 포함하는 데이터베이스에 접근하여 상기 특정된 신호 패턴과 대응하는 패턴 데이터를 탐색하는 단계; 및상기 탐색 결과에 기반하여 상기 동작 정보를 특정하는 단계를 포함하는, 동작 감지 방법."}
{"patent_id": "10-2022-0030705", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1항에 있어서,상기 특정하는 단계는,상기 전자파 신호의 변화 이후의 신호 패턴을 특정하는 단계;복수의 패턴 데이터를 이용하여 사전 학습된 인공지능(AI; Artificial Intelligence) 기반의 탐지 모델에 상기특정된 신호 패턴을 입력하여 탐지 결과를 획득하는 단계; 및상기 탐지 결과에 기반하여 상기 동작 정보를 특정하는 단계를 포함하는, 동작 감지 방법."}
{"patent_id": "10-2022-0030705", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1항에 있어서,상기 동작 감지 방법은,기 설정된 시간 동안 특정된 동작 정보를 저장하는 단계; 및상기 저장된 동작 정보에 기반하여, 하나 이상의 전자 기기의 소프트웨어 동작에 관한 히스토리 정보를 생성하는 단계를 더 포함하는, 동작 감지 방법."}
{"patent_id": "10-2022-0030705", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "소프트웨어의 동작 감지를 위한 장치로서,트랜시버, 명령어를 저장하는 메모리 및 프로세서를 포함하고,상기 프로세서는, 상기 트랜시버 및 상기 메모리와 연결되어,하나 이상의 소프트웨어가 구비된 전자 기기의 전자파 신호를 획득하고,상기 전자 기기의 기종, 상기 전자 기기에 구비된 소프트웨어의 종류, 상기 소프트웨어의 동작을 위한 프로토콜의 종류 및 상기 소프트웨어의 동작을 위한 하드웨어 모듈의 종류 중 적어도 하나에 기반하여 감지 대상이 되는동작 주파수 대역을 식별하고,상기 동작 주파수 대역 내에서 상기 전자파 신호의 변화를 감지하고,상기 전자파 신호의 변화에 기반하여, 상기 전자 기기, 상기 전자 기기에서 실행된 소프트웨어 및 세부 기능과관련된 동작 정보를 특정하는, 동작 감지 장치."}
{"patent_id": "10-2022-0030705", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "비일시적 컴퓨터 판독 가능한 저장 매체(non-transitory computer readable storage medium)로서,컴퓨터 판독 가능 명령어들을 저장하도록 구성되는 매체를 포함하고,상기 컴퓨터 판독 가능 명령어들은 프로세서에 의해 실행되는 경우 상기 프로세서가:하나 이상의 소프트웨어가 구비된 전자 기기의 전자파 신호를 획득하는 단계;상기 전자 기기의 기종, 상기 전자 기기에 구비된 소프트웨어의 종류, 상기 소프트웨어의 동작을 위한 프로토콜의 종류 및 상기 소프트웨어의 동작을 위한 하드웨어 모듈의 종류 중 적어도 하나에 기반하여 감지 대상이 되는공개특허 10-2023-0133558-4-동작 주파수 대역을 식별하는 단계;상기 동작 주파수 대역 내에서 상기 전자파 신호의 변화를 감지하는 단계; 및상기 전자파 신호의 변화에 기반하여, 상기 전자 기기, 상기 전자 기기에서 실행된 소프트웨어 및 세부 기능과관련된 동작 정보를 특정하는 단계를 포함하는 동작 감지 방법을 수행하도록 하는, 비일시적 컴퓨터 판독 가능한 저장 매체."}
{"patent_id": "10-2022-0030705", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "소프트웨어의 동작 감지를 위한 장치 및 방법이 개시된다. 본 개시에 따르면, 동작 감지 장치는 전자 기기의 동 작 주파수 대역을 식별하고, 동작 주파수 대역 내에서 전자 기기의 전자파 신호의 변화를 감지하여, 전자 기기, 전자 기기에서 실행된 소프트웨어 및 세부 기능과 관련된 동작 정보를 특정한다."}
{"patent_id": "10-2022-0030705", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 소프트웨어의 동작을 감지하기 위한 기술에 관한 것으로, 구체적으로 소프트웨어의 동작 시 발생하는 전자파를 분석하는 기술에 관한 것이다."}
{"patent_id": "10-2022-0030705", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기술의 발전에 따라 다양한 종류의 전자 기기가 하나로 통합되고, 자연스레 한 기기를 통해 많은 소프트웨어를 이용하고, 많은 기능을 구현할 수 있게 되었다. 그러나, 이에 따라 하나의 기기만으로도 다양한 범죄에 손쉽게 악용될 소지가 있어, 개인의 프라이버시를 지키 고 보안을 철저히 하기 위해서는 기기 내 소프트웨어의 세부 기능 각각에 대한 동작을 정확히 감지할 필요가 있 다. 다만, 기존의 방법론으로는 소프트웨어 자체의 활성화 여부만을 구분할 수 있고 소프트웨어의 동작에 따른 세부 기능을 구분하기는 어려워, 기기 사용자가 소프트웨어를 실행했다는 사실을 알 수 있을지언정, 소프트웨어를 통 해 무엇을 했는지 파악할 수 없다는 한계가 존재했다."}
{"patent_id": "10-2022-0030705", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 상술한 문제점을 해결하기 위해 제안된 것으로, 전자 기기의 소프트웨어 자체의 활성화 여부에 더하 여, 소프트웨어의 동작에 따른 세부 기능의 수행을 식별하는 방법 및 이를 이용한 장치를 제공하는 것을 목적으 로 한다. 보다 구체적으로, 본 개시는 전자 기기의 전자파 신호의 변화에 따라 전자 기기에서 실행된 소프트웨어 및 세부 기능을 특정하는 방법 및 이를 이용한 장치를 제공하는 것을 목적으로 한다. 본 개시에 의해 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 이하의 실시 예들로부터 또 다른 기술적 과제들이 유추될 수 있다."}
{"patent_id": "10-2022-0030705", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "개시되는 일 실시예에 따른 동작 감지 방법은, 하나 이상의 소프트웨어가 구비된 전자 기기의 전자파 신호를 획 득하는 단계; 상기 전자 기기의 기종, 상기 전자 기기에 구비된 소프트웨어의 종류, 상기 소프트웨어의 동작을 위한 프로토콜의 종류 및 상기 소프트웨어의 동작을 위한 하드웨어 모듈의 종류 중 적어도 하나에 기반하여 감 지 대상이 되는 동작 주파수 대역을 식별하는 단계; 상기 동작 주파수 대역 내에서 상기 전자파 신호의 변화를 감지하는 단계; 및 상기 전자파 신호의 변화에 기반하여, 상기 전자 기기, 상기 전자 기기에서 실행된 소프트웨 어 및 세부 기능과 관련된 동작 정보를 특정하는 단계를 포함한다. 일 실시예에 따르면, 상기 전자파 신호를 획득하는 단계는, 계측 기기에 구비되며, 상기 전자 기기의 일부분과 직접 연결되어 상기 전자파 신호를 탐지하는 프로브(probe)를 이용하여 수행되는 것을 특징으로 할 수 있다. 일 실시예에 따르면, 상기 전자파 신호를 획득하는 단계는, 주 계측 기기에 구비되어, 상기 전자파 신호를 무선 으로 탐지하며 탐지된 전자파 신호를 상기 주 계측 기기와 연동된 보조 계측 기기로 전송하는 스마트 프로브 (smart probe)를 이용하여 수행되는 것을 특징으로 할 수 있다. 일 실시예에 따르면, 상기 감지하는 단계는, 상기 동작 주파수 대역 내에서의 상기 전자파 신호의 세기, 주기, 파장 및 주기성(periodicity) 붕괴 여부 중 적어도 하나에 기반하여 상기 전자파 신호의 변화를 감지하는 것을특징으로 할 수 있다. 일 실시예에 따르면, 상기 감지하는 단계는, 상기 동작 주파수 대역 내에서 상기 전자파 신호의 세기 변화 및 주기성 붕괴를 감지하는 것을 특징으로 하고, 상기 특정하는 단계는, 상기 전자파 신호의 세기 변화에 기반하여 상기 전자 기기에서 카메라 애플리케이션의 실행을 특정하는 단계; 및 상기 전자파 신호의 주기성 붕괴에 기반 하여 상기 카메라 애플리케이션의 사진 촬영 기능이 실행된 시점을 특정하는 단계를 포함할 수 있다. 일 실시예에 따르면, 상기 특정하는 단계는, 상기 전자파 신호의 변화 이후의 신호 패턴을 특정하는 단계; 복수 의 패턴 데이터를 포함하는 데이터베이스에 접근하여 상기 특정된 신호 패턴과 대응하는 패턴 데이터를 탐색하 는 단계; 및 상기 탐색 결과에 기반하여 상기 동작 정보를 특정하는 단계를 포함할 수 있다. 일 실시예에 따르면, 상기 특정하는 단계는, 상기 전자파 신호의 변화 이후의 신호 패턴을 특정하는 단계; 복수 의 패턴 데이터를 이용하여 사전 학습된 인공지능(AI; Artificial Intelligence) 기반의 탐지 모델에 상기 특정 된 신호 패턴을 입력하여 탐지 결과를 획득하는 단계; 및 상기 탐지 결과에 기반하여 상기 동작 정보를 특정하 는 단계를 포함할 수 있다. 일 실시예에 따르면, 상기 동작 감지 방법은, 기 설정된 시간 동안 특정된 동작 정보를 저장하는 단계; 및 상기 저장된 동작 정보에 기반하여, 하나 이상의 전자 기기의 소프트웨어 동작에 관한 히스토리 정보를 생성하는 단 계를 더 포함할 수 있다. 개시되는 일 실시예에 따른 동작 감지 장치는, 트랜시버, 명령어를 저장하는 메모리 및 프로세서를 포함하고, 상기 프로세서는, 상기 트랜시버 및 상기 메모리와 연결되어, 하나 이상의 소프트웨어가 구비된 전자 기기의 전 자파 신호를 획득하고, 상기 전자 기기의 기종, 상기 전자 기기에 구비된 소프트웨어의 종류, 상기 소프트웨어 의 동작을 위한 프로토콜의 종류 및 상기 소프트웨어의 동작을 위한 하드웨어 모듈의 종류 중 적어도 하나에 기 반하여 감지 대상이 되는 동작 주파수 대역을 식별하고, 상기 동작 주파수 대역 내에서 상기 전자파 신호의 변 화를 감지하고, 상기 전자파 신호의 변화에 기반하여, 상기 전자 기기, 상기 전자 기기에서 실행된 소프트웨어 및 세부 기능과 관련된 동작 정보를 특정한다. 개시되는 일 실시예에 따른 비일시적 컴퓨터 판독 가능 저장 매체는, 컴퓨터 판독 가능 명령어들을 저장하도록 구성되는 매체를 포함하고, 상기 컴퓨터 판독 가능 명령어들은 프로세서에 의해 실행되는 경우 상기 프로세서가: 하나 이상의 소프트웨어가 구비된 전자 기기의 전자파 신호를 획득하는 단계; 상기 전자 기기의 기 종, 상기 전자 기기에 구비된 소프트웨어의 종류, 상기 소프트웨어의 동작을 위한 프로토콜의 종류 및 상기 소 프트웨어의 동작을 위한 하드웨어 모듈의 종류 중 적어도 하나에 기반하여 감지 대상이 되는 동작 주파수 대역 을 식별하는 단계; 상기 동작 주파수 대역 내에서 상기 전자파 신호의 변화를 감지하는 단계; 및 상기 전자파 신호의 변화에 기반하여, 상기 전자 기기, 상기 전자 기기에서 실행된 소프트웨어 및 세부 기능과 관련된 동작 정보를 특정하는 단계를 포함하는 동작 감지 방법을 수행하도록 한다. 기타 실시예들의 구체적인 사항들은 상세한 설명 및 도면들에 포함되어 있다."}
{"patent_id": "10-2022-0030705", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시에 따르면, 전자 기기에서 실행된 소프트웨어에 대한 특정에서 더 나아가 실제 실행된 세부적인 기능을 특정함으로써, 전자파 신호의 계측만으로 전자 기기가 어느 시점에 어떻게 동작했는지 쉽게 파악할 수 있다. 보다 구체적으로, 본 개시에 따르면 스마트폰의 카메라 애플리케이션을 이용하여 사진이 촬영된 시점을 특정함 으로써, 제3자가 원치 않는 불법적인 촬영이 시도되었음을 쉽게 인지할 수 있다."}
{"patent_id": "10-2022-0030705", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "발명의 효과는 이상에서 언급한 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 청구범위의 기재로부 터 당해 기술 분야의 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0030705", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "실시 예들에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들 을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 설명 부분에서 상세히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지는 의 미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에 기재된 \"...부\", \"...모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하고, 이는 하드웨어 또 는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있으며, 도시된 예와 달리 구체적 동 작에 있어 명확히 구분되지 않을 수 있다. 명세서 전체에서 기재된 \"a, b, 및 c 중 적어도 하나\"의 표현은, 'a 단독', 'b 단독', 'c 단독', 'a 및 b', 'a 및 c', 'b 및 c', 또는 'a, b, 및 c 모두'를 포괄할 수 있다. 이하에서 언급되는 \"전자 기기\"는 네트워크를 통해 서버나 타 단말에 접속할 수 있는 컴퓨터나 휴대용 단말로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱(desktop), 랩톱(laptop) 등을 포함하고, 휴대용 단말은 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, IMT(International Mobile Telecommunication), CDMA(Code Division Multiple Access), W-CDMA(W-Code Division Multiple Access), LTE(Long Term Evolution) 등의 통신 기반 단말, 스마트폰, 태블릿 PC 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 이하의 설명에 있어서, 신호 또는 정보의 \"전송\", \"통신\", \"송신\", \"수신\" 기타 이와 유사한 의미의 용어는 일 구성요소에서 다른 구성요소로 신호 또는 정보가 직접 전달되는 것뿐만이 아니라 다른 구성요소를 거쳐 전달되 는 것도 포함한다. 특히 신호 또는 정보를 일 구성요소로 \"전송\" 또는 \"송신\"한다는 것은 그 신호 또는 정보의 최종 목적지를 지시 하는 것이고 직접적인 목적지를 의미하는 것이 아니다. 이는 신호 또는 정보의 \"수신\"에 있어서도 동일하다. 또 한 본 명세서에 있어서, 2 이상의 데이터 또는 정보가 \"관련\"된다는 것은 하나의 데이터(또는 정보)를 획득하면, 그에 기초하여 다른 데이터(또는 정보)의 적어도 일부를 획득할 수 있음을 의미한다. 또한, 제1, 제2 등의 용어는 다양한 구성 요소들을 설명하는데 사용될 수 있지만, 상기 구성 요소들은 상기 용 어들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성 요소를 다른 구성 요소로부터 구별하는 목적으 로 사용될 수 있다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성 요소는 제2 구성 요소로 명명될 수 있고, 유사 하게 제2 구성 요소도 제1 구성 요소로 명명될 수 있다. 실시 예를 설명함에 있어서 본 발명이 속하는 기술 분야에 익히 알려져 있고 본 발명과 직접적으로 관련이 없는 기술 내용에 대해서는 설명을 생략한다. 이는 불필요한 설명을 생략함으로써 본 발명의 요지를 흐리지 않고 더 욱 명확히 전달하기 위함이다. 마찬가지 이유로 첨부 도면에 있어서 일부 구성요소는 과장되거나 생략되거나 개략적으로 도시되었다. 또한, 각 구성요소의 크기는 실제 크기를 전적으로 반영하는 것이 아니다. 각 도면에서 동일한 또는 대응하는 구성요소에 는 동일한 참조 번호를 부여하였다. 본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시 예들에 한정되는 것이 아니라 서"}
{"patent_id": "10-2022-0030705", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시 예들은 본 발명의 개시가 완전하도록 하고, 본 발명이속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 처리 흐름도 도면들의 각 블록과 흐름도 도면들의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수행될 수 있 음을 이해할 수 있을 것이다. 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터 또는 기타 프 로그램 가능한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 또는 기타 프로그램 가능한 데 이터 프로세싱 장비의 프로세서를 통해 수행되는 그 인스트럭션들이 흐름도 블록(들)에서 설명된 기능들을 수행 하는 수단을 생성하게 된다. 이들 컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하기 위해 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 지향할 수 있는 컴퓨터 이용 가능 또는 컴퓨터 판독 가능 메모리에 저장되는 것도 가능하므로, 그 컴퓨터 이용 가능 또는 컴퓨터 판독 가능 메모리에 저장된 인스트럭션 들은 흐름도 블록(들)에서 설명된 기능을 수행하는 인스트럭션 수단을 내포하는 제조 품목을 생산하는 것도 가 능하다. 컴퓨터 프로그램 인스트럭션들은 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에 탑재되 는 것도 가능하므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 일련의 동작 단계들이 수 행되어 컴퓨터로 실행되는 프로세스를 생성해서 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 수 행하는 인스트럭션들은 흐름도 블록(들)에서 설명된 기능들을 실행하기 위한 단계들을 제공하는 것도 가능하다. 또한, 각 블록은 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 실행 예들에서는 블록들에서 언급된 기 능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예컨대, 잇달아 도시되어 있는 두 개의 블록들 은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 블록들이 때때로 해당하는 기능에 따라 역순으로 수행되는 것도 가능하다. 아래에서는 첨부한 도면을 참고하여 본 개시의 실시 예에 대하여 본 개시가 속하는 기술 분야에서 통상의 지식 을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 개시는 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시 예에 한정되지 않는다. 이하에서는 도면을 참조하여 본 개시의 실시 예들을 상세히 설명한다. 도 1은 일 실시예에 따른 동작 감지 시스템을 설명하기 위한 개략적인 구성도이다. 도시된 바와 같이, 일 실시예에 따른 동작 감지 시스템은 동작 감지 장치 및 전자 기기를 포함 한다. 또한, 도 1에 도시된 구성요소들 외에 다른 범용적인 구성요소들이 더 포함될 수 있음은 본 실시예와 관"}
{"patent_id": "10-2022-0030705", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "련된 기술분야에서 통상의 지식을 가진 자라면 이해할 수 있다. 동작 감지 장치는 전자 기기에서 발생하는 전자파 신호를 입력으로 하여, 감지 대상인 전자 기기 를 식별하거나, 전자 기기에서 실행된 소프트웨어의 동작을 감지하는 장치를 의미한다. 일 실시예에 따르면, 동작 감지 장치는 유선 또는 무선의 네트워크를 통해 전자 기기의 전자파 신호 를 획득할 수 있다. 보다 구체적으로, 전자 기기의 전자파 신호는 동작 감지 장치에 포함된 계측 유 닛을 이용하여 계측될 수도 있고, 실시예에 따라서는 동작 감지 장치와는 별도의 계측 기기를 통해 계측된 다음, 계측 기기와 동작 감지 장치 사이에서 유선 또는 무선의 네트워크를 통해 전송될 수도 있다. 일 실시예에 따르면, 동작 감지 장치는 전자 기기의 전자파 신호를 사용자가 인지할 수 있는 형태로 출력하는 출력부(예를 들어, 디스플레이)를 포함할 수 있다. 다른 실시예에 따르면, 동작 감지 장치는 동작 감지 장치와 연동된 외부 출력 장치(예를 들어, 모니 터)를 이용하여 전자 기기의 전자파 신호를 사용자가 인지할 수 있는 형태로 출력할 수 있다. 한편, 동작 감지 장치 및 전자 기기 사이의 입출력을 전송하기 위해 사용되는 유선 또는 무선의 네트 워크는 근거리 통신망(Local Area Network; LAN), 광역 통신망(Wide Area Network; WAN), 부가가치 통신망 (Value Added Network; VAN), 이동 통신망(mobile radio communication network), 위성 통신망 및 이들의 상호 조합을 포함하며, 도 1에 도시된 각 네트워크 구성 주체가 서로 원활하게 통신을 할 수 있도록 하는 포괄적인 의미의 데이터 통신망이며, 유선 인터넷, 무선 인터넷 및 모바일 무선 통신망을 포함할 수 있다. 무선 통신은 예를 들어, 무선 랜(Wi-Fi), 블루투스, 블루투스 저 에너지(Bluetooth low energy), 지그비, WFD(Wi-Fi Direct), UWB(ultra wideband), 적외선 통신(IrDA, infrared Data Association), NFC(Near FieldCommunication) 등이 있을 수 있으나, 이에 한정되는 것은 아니다. 이상과 관련하여, 이하 도면들을 통해 보다 상세히 설명하기로 한다. 도 2는 일 실시예에 따른 동작 감지 방법을 설명하기 위한 흐름도이다. 도 2에 도시된 방법은 예를 들어, 상술한 동작 감지 장치에 의해 수행될 수 있다. 단계 S210에서, 동작 감지 장치는 하나 이상의 소프트웨어가 구비된 전자 기기의 전자파 신호를 획득 할 수 있다. 일 실시예에 따르면, 동작 감지 장치는 계측 기기에 구비되며 전자 기기의 일부분과 직접 연결되어 전자 기기의 전자파 신호를 탐지하는 프로브(probe)를 이용하여 전자 기기의 전자파 신호를 획득할 수 있다. 다른 실시예에 따르면, 동작 감지 장치는 주 계측 기기에 구비되어 전자 기기의 전자파 신호를 무선 으로 탐지하며 탐지된 전자파 신호를 주 계측 기기와 연동된 보조 계측 기기로 전송하는 스마트 프로브(smart probe)를 이용하여 전자 기기의 전자파 신호를 획득할 수 있다. 이때, 예시적으로 상기 스마트 프로브는 전선 타입 프로브, 대기용 프로브, 침투용 프로브 및 표면용 프로브 중 어느 하나일 수 있으며, 주 계측 기기는 상기 스마트 프로브에 전원을 공급하는 배터리 및 하우징을 포함할 수 있다. 또한, 예시적으로 보조 계측 기기 는 탐지된 전자파 신호를 사용자가 인지 가능한 형태로 출력하는 출력 장치일 수 있으며, 예컨대 동작 감지 장 치가 보조 계측 기기로 기능할 수 있다. 다만, 프로브와 관련하여 상술한 실시예들은 예시적인 것으로, 동작 감지 장치는 전자 기기의 전자파 신호 획득을 위하여 프로브 외의 다양한 디바이스를 사용할 수 있다. 단계 S220에서, 동작 감지 장치는 전자 기기의 기종, 전자 기기에 구비된 소프트웨어의 종류, 해당 소프트웨어의 동작을 위한 프로토콜의 종류 및 해당 소프트웨어의 동작을 위한 하드웨어 모듈의 종류 중 적어도 하나에 기반하여 감지 대상이 되는 동작 주파수 대역을 식별할 수 있다. 예를 들어, 동작 감지 장치는 전자 기기의 기종(예컨대, 삼성 갤럭시 S8 또는 애플 아이폰 X)을 기준 으로 각 기종의 동작 주파수 대역을 식별할 수 있다. 다른 예로서, 동작 감지 장치는 전자 기기의 기종을 1차 기준으로, 각 기종에서 카메라 애플리케이션 이 실행되는 케이스를 2차 기준으로 하여, 각 기종에서 카메라 애플리케이션 실행 시의 동작 주파수 대역을 식 별할 수 있다. 또 다른 예로서, 동작 감지 장치는 전자 기기의 기종을 1차 기준으로, 각 기종에서 카메라 애플리케 이션이 실행되는 케이스를 2차 기준으로, 각 기종에 장착된 카메라 하드웨어 모듈의 모델 번호(model number)를 3차 기준으로 하여, 각 기종에서 카메라 애플리케이션 실행 시 카메라 하드웨어 모듈 별 동작 주파수 대역을 식 별할 수 있다. 추가적인 실시예에 따르면, 동작 감지 장치는 전자 기기의 기종, 전자 기기에 구비된 소프트웨 어의 종류 및 해당 소프트웨어의 동작을 위한 하드웨어 모듈의 종류에 더하여, 해당 소프트웨어의 세부 기능을 추가로 고려하여 동작 주파수 대역을 식별할 수 있다. 예를 들어, 동작 감지 장치는 동작 감지 장치는 전자 기기의 기종을 1차 기준으로, 각 기종에서 카메라 애플리케이션이 실행되는 케이스를 2차 기준으로, 각 기종에서 사진 촬영 기능이 실행되는 케이스를 3차 기준으로, 각 기종에 장착된 카메라 하드웨어 모듈의 모델 번호를 4차 기준으로 하여, 각 기종에서 카메라 애플 리케이션을 통한 사진 촬영 기능 실행 시 카메라 하드웨어 모듈 별 동작 주파수 대역을 식별할 수 있다. 다른 실시예에 따르면, 동작 감지 장치는 전자 기기에 구비된 시스템 소프트웨어의 종류를 1차 기준 으로, 해당 시스템 소프트웨어의 동작을 위한 프로토콜의 종류를 2차 기준으로 하여, 각 기종에서 와이파이(Wi- Fi)를 이용한 데이터 전송, 블루투스(Bluetooth)를 이용한 데이터 전송, 근거리 무선 통신(NFC; Near Field Communication)을 이용한 데이터 전송, 무선이동통신(예컨대, 5G, 4G(LTE 포함), 3G, 2G 등)을 이용한 데이터 전송과 관련된 동작 주파수 대역을 식별할 수 있다. 단계 S230에서, 동작 감지 장치는 식별한 동작 주파수 대역 내에서 전자파 신호의 변화를 감지할 수 있다. 일 실시예에 따르면, 동작 감지 장치는 전자 기기의 동작 주파수 대역 내에서의 전자파 신호의 세기, 주기, 파장 및 주기성(periodicity) 붕괴 여부 중 적어도 하나에 기반하여 전자 기기의 전자파 신호의 변 화를 감지할 수 있다. 예를 들어, 동작 감지 장치는 전자 기기의 동작 주파수 대역 내에서의 전자파 신호의 세기가 기 설정 된 임계 데시벨을 초과했는지 여부를 감지할 수 있다. 다른 예로서, 동작 감지 장치는 전자 기기의 동작 주파수 대역 내에서 새로운 주기 또는 파장을 갖는 전자파 신호가 발생했는지 여부를 감지할 수 있다. 또 다른 예로서, 동작 감지 장치는 전자 기기의 동작 주파수 대역 내에서 전자파 신호의 기존 주기성 이 붕괴했는지 여부를 감지할 수 있다. 단계 S240에서, 동작 감지 장치는 전자파 신호의 변화에 기반하여, 동작 감지의 대상이 되는 전자 기기 , 전자 기기에서 실행된 소프트웨어 및 세부 기능과 관련된 동작 정보를 특정할 수 있다. 예를 들어, 동작 감지 장치는 전자 기기의 동작 주파수 대역 내에서의 전자파 신호의 세기가 기 설정 된 제1 임계 데시벨 이상일 경우 와이파이를 이용한 데이터 전송이 이루어졌음을 나타내는 동작 정보를 특정할 수 있다. 다른 예로서, 동작 감지 장치는 전자 기기의 동작 주파수 대역 내에서의 전자파 신호의 세기가 기 설 정된 제2 임계 데시벨 이상일 경우 블루투스를 이용한 데이터 전송이 이루어졌음을 나타내는 동작 정보를 특정 할 수 있다. 또 다른 예로서, 동작 감지 장치는 전자 기기의 동작 주파수 대역 내에서 특정 주기를 갖는 전자파 신호가 N회(이때, N은 자연수) 이상 발생할 경우, 전자 기기를 이용한 근거리 무선 통신 또는 마그네틱 보 안 전송(MST; Magnetic Secure Transmission)이 이루어졌음을 나타내는 동작 정보를 특정할 수 있다. 또 다른 예로서, 동작 감지 장치는 특정 시점에서 전자 기기의 동작 주파수 대역 내 전자파 신호의 주기성이 붕괴한 경우, 해당 시점에 전자 기기의 디스플레이에 대한 터치가 이루어졌음을 나타내는 동작 정보를 특정할 수 있다. 도 3은 동작 감지 방법이 적용되는 예시를 설명하기 위한 흐름도이다. 도 3에 도시된 방법은 예를 들어, 상술한 동작 감지 장치에 의해 수행될 수 있다. 단계 S310에서, 동작 감지 장치는 하나 이상의 소프트웨어가 구비된 전자 기기의 전자파 신호를 획득 할 수 있다. 단계 S320에서, 동작 감지 장치는 전자 기기의 기종, 전자 기기에 구비된 소프트웨어의 종류, 해당 소프트웨어의 동작을 위한 프로토콜의 종류 및 해당 소프트웨어의 동작을 위한 하드웨어 모듈의 종류 중 적어도 하나에 기반하여 감지 대상이 되는 동작 주파수 대역을 식별할 수 있다. 단계 S330에서, 동작 감지 장치는 식별한 동작 주파수 대역 내에서 전자파 신호의 세기 변화 및 주기성 붕 괴를 감지할 수 있다. 단계 S340에서, 동작 감지 장치는 전자파 신호의 세기 변화에 기반하여 전자 기기에서 카메라 애플리 케이션의 실행을 특정할 수 있다. 단계 S350에서, 동작 감지 장치는 전자파 신호의 주기성 붕괴에 기반하여 카메라 애플리케이션의 사진 촬 영 기능이 실행된 시점을 특정할 수 있다. 이를 통해, 동작 감지 장치는 전자 기기를 통한 허용되지 않은 사진 촬영이 수행되었는지, 수행되었 다면 그 수행 시점을 특정할 수 있어, 불법 촬영을 비롯한 일련의 기기 오용 행위에 대해 제재를 가할 수 있다. 도 4는 제1 실시예에 따라 동작 정보를 특정하는 단계를 보다 구체적으로 설명하기 위한 흐름도이다. 도 4에 도시된 방법은 예를 들어, 상술한 동작 감지 장치에 의해 수행될 수 있다. 단계 S410에서, 동작 감지 장치는 하나 이상의 소프트웨어가 구비된 전자 기기의 전자파 신호를 획득 할 수 있다. 단계 S420에서, 동작 감지 장치는 전자 기기의 기종, 전자 기기에 구비된 소프트웨어의 종류, 해당 소프트웨어의 동작을 위한 프로토콜의 종류 및 해당 소프트웨어의 동작을 위한 하드웨어 모듈의 종류 중 적어도 하나에 기반하여 감지 대상이 되는 동작 주파수 대역을 식별할 수 있다. 단계 S430에서, 동작 감지 장치는 식별한 동작 주파수 대역 내에서 전자파 신호의 변화를 감지할 수 있다. 단계 S440에서, 동작 감지 장치는 전자파 신호의 변화 이후의 신호 패턴을 특정할 수 있다. 단계 S450에서, 동작 감지 장치는 복수의 패턴 데이터를 포함하는 데이터베이스에 접근하여 특정된 신호 패턴과 대응하는 패턴 데이터를 탐색할 수 있다. 일 실시예에 따르면, 동작 감지 장치는 패턴 데이터와 특정된 신호 패턴 사이에서, 동작 주파수 내 파형의 개형의 유사도에 기반하여 특정된 신호 패턴과 대응하는 패턴 데이터를 탐색할 수 있다. 예를 들어, 동작 감지 장치는 패턴 데이터의 동작 주파수 내 신호의 주기와 특정된 신호 패턴의 동작 주파 수 내 신호의 주기를 비교하여 주기가 동일한 파형이 N개(이때, N은 자연수) 이상인 경우 해당 패턴 데이터를 특정된 신호 패턴과 대응되는 것으로 판단할 수 있다. 다른 예로서, 동작 감지 장치는 패턴 데이터의 동작 주파수 내 신호의 세기와 특정된 신호 패턴의 동작 주 파수 내 신호의 세기를 비교하여 임계 데시벨 이상의 세기를 갖는 신호의 발생 횟수가 동일한 경우, 해당 패턴 데이터를 특정된 신호 패턴과 대응되는 것으로 판단할 수 있다. 다만, 탐색과 관련하여 상술한 실시예들은 예시적인 것으로, 실시예에 따라 동작 감지 장치는 두 가지 이 상의 요소를 유사도 계산 시 함께 고려할 수 있다. 또한, 동작 감지 장치는 패턴 데이터의 파형과 특정된 신호 패턴의 파형을 정규화한 후, 정규화된 두 파형을 비교하여 두 파형 사이의 유사도를 계산할 수도 있다. 예 컨대, 동작 감지 장치는 두 파형 사이의 유사도 계산에 앞서, 특정된 신호 패턴의 세기를 복수의 패턴 데 이터가 갖는 신호의 세기에 따라 정규화할 수 있다. 단계 S460에서, 동작 감지 장치는 탐색 결과에 기반하여 전자 기기에서 실행된 소프트웨어 및 세부 기능과 관련된 동작 정보를 특정할 수 있다. 일 실시예에 따르면, 동작 감지 장치는 특정된 신호 패턴과 대응하는 패턴 데이터를 탐색하고, 탐색된 패 턴 데이터와 매칭되는 동작 정보를 특정된 신호 패턴에 따른 동작 정보로 특정할 수 있다. 보다 구체적으로, 동작 감지 장치는 탐색된 패턴 데이터에 라벨링(labeling)된 '실행된 소프트웨어의 종류' 및 '실행된 소프트웨어 세부 기능'을 참조하여, 특정된 신호 패턴에 따른 동작 정보를 특정할 수 있다. 도 5는 제2 실시예에 따라 동작 정보를 특정하는 단계를 보다 구체적으로 설명하기 위한 흐름도이다. 도 5에 도시된 방법은 예를 들어, 상술한 동작 감지 장치에 의해 수행될 수 있다. 단계 S510에서, 동작 감지 장치는 하나 이상의 소프트웨어가 구비된 전자 기기의 전자파 신호를 획득 할 수 있다. 단계 S520에서, 동작 감지 장치는 전자 기기의 기종, 전자 기기에 구비된 소프트웨어의 종류, 해당 소프트웨어의 동작을 위한 프로토콜의 종류 및 해당 소프트웨어의 동작을 위한 하드웨어 모듈의 종류 중 적어도 하나에 기반하여 감지 대상이 되는 동작 주파수 대역을 식별할 수 있다. 단계 S530에서, 동작 감지 장치는 식별한 동작 주파수 대역 내에서 전자파 신호의 변화를 감지할 수 있다. 단계 S540에서, 동작 감지 장치는 전자파 신호의 변화 이후의 신호 패턴을 특정할 수 있다. 단계 S550에서, 동작 감지 장치는 복수의 패턴 데이터를 이용하여 사전 학습된 인공지능(AI; Artificial Intelligence) 기반의 탐지 모델에 특정된 신호 패턴을 입력하여 탐지 결과를 획득할 수 있다. 일 실시예에 따르면, 동작 감지 장치는 복수의 패턴 데이터 및 각 패턴 데이터의 레이블(label)을 통해 지 도 학습(supervised learning)된 탐지 모델을 이용하여 탐지 결과를 획득할 수 있다.다른 실시예에 따르면, 동작 감지 장치는 복수의 패턴 데이터를 분류하여 둘 이상의 클러스터(cluster)를 형성하고, 특정된 신호 패턴을 특정 클러스터로 분류하도록 비 지도 학습(Unsupervised learning)된 탐지 모델 을 이용함으로써 탐지 결과를 획득할 수 있다. 이때, 비 지도 학습의 알고리즘으로는 K-means 알고리즘, DBSCAN 알고리즘 등이 이용될 수 있으나, 반드시 이에 한정되는 것은 아니다. 또 다른 실시예에 따르면, 동작 감지 장치는 복수의 패턴 데이터를 전처리하고 각 데이터의 특징을 추출함 으로써 비 지도 학습된 탐지 모델을 이용함으로써 탐지 결과를 획득할 수 있다. 이때, 비 지도 학습의 알고리즘 으로는 mean-shift 알고리즘이 이용될 수 있으나, 반드시 이에 한정되는 것은 아니다. 단계 S560에서, 동작 감지 장치는 탐지 결과에 기반하여 전자 기기에서 실행된 소프트웨어 및 세부 기능과 관련된 동작 정보를 특정할 수 있다. 일 실시예에 따르면, 동작 감지 장치는 탐지 모델이 탐지 결과로서 특정된 신호 패턴에 대응하는 것으로 판단한 패턴 데이터에 대해, 해당 패턴 데이터에 라벨링 된 동작 정보를 특정된 신호 패턴에 따른 동작 정보로 특정할 수 있다. 도 6은 동작 감지 방법을 이용한 추가적인 실시예를 설명하기 위한 흐름도이다. 도 6에 도시된 방법은 예를 들어, 상술한 동작 감지 장치에 의해 수행될 수 있다. 단계 S610에서, 동작 감지 장치는 하나 이상의 소프트웨어가 구비된 전자 기기의 전자파 신호를 획득 할 수 있다. 단계 S620에서, 동작 감지 장치는 전자 기기의 기종, 전자 기기에 구비된 소프트웨어의 종류, 해당 소프트웨어의 동작을 위한 프로토콜의 종류 및 해당 소프트웨어의 동작을 위한 하드웨어 모듈의 종류 중 적어도 하나에 기반하여 감지 대상이 되는 동작 주파수 대역을 식별할 수 있다. 단계 S630에서, 동작 감지 장치는 식별한 동작 주파수 대역 내에서 전자파 신호의 변화를 감지할 수 있다. 단계 S640에서, 동작 감지 장치는 전자파 신호의 변화에 기반하여, 동작 감지의 대상이 되는 전자 기기 , 전자 기기에서 실행된 소프트웨어 및 세부 기능과 관련된 동작 정보를 특정할 수 있다. 단계 S650에서, 동작 감지 장치는 기 설정된 시간 동안 특정된 동작 정보를 저장할 수 있다. 일 실시예에 따르면, 동작 감지 장치는 기 설정된 시간 동안 특정된 동작 정보를 동작 감지 장치 내 부의 저장 공간에 저장할 수 있다. 다른 실시예에 따르면, 동작 감지 장치는 기 설정된 시간 동안 특정된 동작 정보를 동작 감지 장치 외부의 저장 매체 또는 서버에 저장할 수 있다. 예컨대, 동작 감지 장치는 일련의 특정된 동작 정보를 클 라우드 서버로 전송하거나, 동작 감지 장치와 연동된 로컬 DB에 저장할 수도 있다. 한편, 일 실시예에 따르면, 동작 감지 장치는 기 설정된 시간 동안 특정된 동작 정보를 동작 정보 간의 연 관성에 기초하여 분류된 형태로 저장할 수 있다. 구체적으로, 동작 감지 장치는 각 동작 정보에 상응하는 소프트웨어의 종류를 기준으로 일련의 특정된 동 작 정보를 분류, 저장할 수 있다. 또한 구체적으로, 동작 감지 장치는 각 동작 정보에 상응하는 소프트웨어의 종류를 1차적 기준으로, 각 소 프트웨어의 세부 기능을 2차적 기준으로 하여 일련의 특정된 동작 정보를 분류, 저장할 수도 있다. 예를 들어, 동작 감지 장치는 카메라 애플리케이션의 실행에 상응하는 복수의 동작 정보들을, 카메라 애플 리케이션의 사진 촬영 기능에 상응하는 동작 정보와 동영상 촬영 기능에 상응하는 동작 정보로 분류하여 저장할 수 있다. 단계 S660에서, 동작 감지 장치는 단계 S650을 통해 저장된 동작 정보에 기반하여, 하나 이상의 전자 기기 의 소프트웨어 동작에 관한 히스토리 정보를 생성할 수 있다. 일 실시예에 따르면, 동작 감지 장치는 단계 S650을 통해 저장된 동작 정보를 이용하여, 각 동작 정보에 상응하는 '실행된 소프트웨어 및 세부 기능'과 해당 세부 기능의 '동작 시점'을 매칭하여 히스토리 정보를 생성할 수 있다. 다른 실시예에 따르면, 동작 감지 장치는 각 동작 정보에 상응하는 '실행된 소프트웨어 및 세부 기능', 해 당 세부 기능의 '동작 시점' 및 해당 소프트웨어 또는 세부 기능의 '위법성 여부'를 매칭하여 히스토리 정보를 생성할 수도 있다. 이때, '위법성 여부'는 각 소프트웨어 또는 각 세부 기능 별로 정의된 합법-위법 판단 테이 블에 기반하여 가려질 수 있으며, '위법성 여부'의 판단 주체는 동작 감지 장치가 될 수도 있고, 실시예에 따라서는 별도의 장치에 의해 판단된 이후 '위법성 여부'의 판단 결과가 동작 감지 장치로 전송될 수도 있 다. 상기 도시된 흐름도 도 2 내지 도 6에서는 상기 방법을 복수 개의 단계로 나누어 기재하였으나, 적어도 일부의 단계들은 순서를 바꾸어 수행되거나, 다른 단계와 결합되어 함께 수행되거나, 생략되거나, 세부 단계들로 나뉘 어 수행되거나, 또는 도시되지 않은 하나 이상의 단계가 부가되어 수행될 수 있다. 도 7은 전자파 신호가 변화하는 양상을 나타내는 예시도이다. 도 7의 (a) 내지 (c)의 가로축은 전자파 신호가 계측된 시간을, 세로축은 전자파 신호의 세기를 나타내며, 세로 축에 도시된 전자파 신호의 범위는 동작 주파수 대역으로 전제한다. 먼저 도 7의 (a)는 전자 기기의 홈 화면에서 카메라 애플리케이션이 실행되지 않은 경우의 전자파 신호를 나타낸 것으로, 시간의 경과에 따른 전자파 신호의 세기가 비교적 일정하고, 별도의 패턴을 보이지 않는 것을 확인할 수 있다. 한편 도 7의 (b)는 전자 기기에서 카메라 애플리케이션이 실행된 후 대기 상태일 때의 전자파 신호를 나타 낸 것으로, 시간이 경과함에 따라 일정한 주기로 비교적 세기가 센 전자파 신호가 계측됨을 확인할 수 있다. 이 때, 카메라 애플리케이션의 실행에 따라 새로이 계측되는 전자파 신호 패턴의 주기는 전자 기기 주변의 조 도가 클수록 짧아질 수 있다. 한편 도 7의 (c)의 2는 전자 기기에서 카메라 애플리케이션이 실행된 후 사진 촬영 기능이 실행된 경우의 전자파 신호를 나타낸 것으로, 카메라 애플리케이션의 대기 상태에 해당하는 도 7의 (c)의 1에 비하여 비교적 지속 시간이 긴 전자파 신호가 계측됨을 확인할 수 있다. 이를 통해, 동작 감지 장치는 도 7의 (c)의 2의 신호가 발생한 시점을 사진이 촬영된 시점으로 특정할 수 있다. 이로부터 유추할 수 있듯이, 전자 기기에 구비된 특정 소프트웨어의 동작에 따라서 도 7의 (b)나 (c)에 도 시된 것처럼 특유한 전자파 신호의 변화가 나타날 수 있다. 비록 도 7에서는 일정한 주기로 신호 세기의 변화가 나타났으나, 실시예에 따라서는 특정 소프트웨어의 동작에 따라 특정한 주파수 대역(예컨대, 동작 주파수 대 역)에서의 신호 세기가 기 설정된 임계치 이상으로 계측될 수도 있다. 도 8은 일 실시예에 따른 동작 감지 장치를 설명하기 위한 블록도이다. 동작 감지 장치는 일 실시예에 따라, 트랜시버, 프로세서 및 메모리를 포함할 수 있다. 동 작 감지 장치는 트랜시버를 통하여 기타 외부 장치 등과 연결되고, 데이터를 교환할 수 있다. 프로세서는 도 1 내지 도 7을 통하여 전술한 적어도 하나의 방법을 수행할 수 있다. 메모리는 도 1 내지 도 7을 통하여 전술한 적어도 하나의 방법을 수행하기 위한 정보를 저장할 수 있다. 메모리는 휘발성 메모리 또는 비휘발성 메모리일 수 있다. 프로세서는 프로그램을 실행하고, 정보를 제공하기 위해 동작 감지 장치를 제어할 수 있다. 프로세서 에 의하여 실행되는 프로그램의 코드는 메모리에 저장될 수 있다. 프로세서는 트랜시버 및 메모리와 연결되어, 하나 이상의 소프트웨어가 구비된 전자 기기 의 전자파 신호를 획득하고, 전자 기기의 기종, 전자 기기에 구비된 소프트웨어의 종류 및 상기 소프 트웨어의 동작을 위한 하드웨어 모듈의 종류 중 적어도 하나에 기반하여 감지 대상이 되는 동작 주파수 대역을 식별하고, 동작 주파수 대역 내에서 전자파 신호의 변화를 감지하고, 전자파 신호의 변화에 기반하여, 전자 기 기에서 실행된 소프트웨어 및 세부 기능과 관련된 동작 정보를 특정할 수 있다.또한 일 실시예에 따른 동작 감지 장치는 사용자에게 정보를 제공할 수 있는 인터페이스를 더 포함할 수 있다. 도 8에 도시된 동작 감지 장치는 본 실시예와 관련된 구성요소들만이 도시되어 있다. 따라서, 도 8에 도시"}
{"patent_id": "10-2022-0030705", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "된 구성요소들 외에 다른 범용적인 구성요소들이 더 포함될 수 있음을 본 실시예와 관련된 기술분야에서 통상의 지식을 가진 자라면 이해할 수 있다. 전술한 실시예들에 따른 장치는 프로세서, 프로그램 데이터를 저장하고 실행하는 메모리, 디스크 드라이브와 같 은 영구 저장부(permanent storage), 외부 장치와 통신하는 통신 포트, 터치 패널, 키(key), 버튼 등과 같은 사 용자 인터페이스 장치 등을 포함할 수 있다. 소프트웨어 모듈 또는 알고리즘으로 구현되는 방법들은 상기 프로 세서상에서 실행 가능한 컴퓨터가 읽을 수 있는 코드들 또는 프로그램 명령들로서 컴퓨터가 읽을 수 있는 기록 매체 상에 저장될 수 있다. 여기서 컴퓨터가 읽을 수 있는 기록 매체로 마그네틱 저장 매체(예컨대, ROM(read- only memory), RAM(random-Access memory), 플로피 디스크, 하드 디스크 등) 및 광학적 판독 매체(예컨대, 시 디롬(CD-ROM), 디브이디(DVD: Digital Versatile Disc)) 등이 있다. 컴퓨터가 읽을 수 있는 기록 매체는 네트 워크로 연결된 컴퓨터 시스템들에 분산되어, 분산 방식으로 컴퓨터가 판독 가능한 코드가 저장되고 실행될 수 있다. 매체는 컴퓨터에 의해 판독가능하며, 메모리에 저장되고, 프로세서에서 실행될 수 있다. 본 실시 예는 기능적인 블록 구성들 및 다양한 처리 단계들로 나타내어질 수 있다. 이러한 기능 블록들은 특정 기능들을 실행하는 다양한 개수의 하드웨어 또는/및 소프트웨어 구성들로 구현될 수 있다. 예를 들어, 실시 예 는 하나 이상의 마이크로프로세서들의 제어 또는 다른 제어 장치들에 의해서 다양한 기능들을 실행할 수 있는, 메모리, 프로세싱, 로직(logic), 룩 업 테이블(look-up table) 등과 같은 직접 회로 구성들을 채용할 수 있다. 구성 요소들이 소프트웨어 프로그래밍 또는 소프트웨어 요소들로 실행될 수 있는 것과 유사하게, 본 실시 예는 데이터 구조, 프로세스들, 루틴들 또는 다른 프로그래밍 구성들의 조합으로 구현되는 다양한 알고리즘을 포함하 여, C, C++, 자바(Java), 어셈블러(assembler) 등과 같은 프로그래밍 또는 스크립팅 언어로 구현될 수 있다. 기능적인 측면들은 하나 이상의 프로세서들에서 실행되는 알고리즘으로 구현될 수 있다. 또한, 본 실시 예는 전자적인 환경 설정, 신호 처리, 메시지 처리, 및/또는 데이터 처리 등을 위하여 종래 기술을 채용할 수 있다. \"메커니즘\", \"요소\", \"수단\", \"구성\"과 같은 용어는 넓게 사용될 수 있으며, 기계적이고 물리적인 구성들로서 한정되는 것은 아니다. 상기 용어는 프로세서 등과 연계하여 소프트웨어의 일련의 처리들(routines)의 의미를 포함할 수 있다. 전술한 실시예들은 일 예시일 뿐 후술하는 청구항들의 범위 내에서 다른 실시예들이 구현될 수 있다."}
{"patent_id": "10-2022-0030705", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 동작 감지 시스템을 설명하기 위한 개략적인 구성도이다. 도 2는 일 실시예에 따른 동작 감지 방법을 설명하기 위한 흐름도이다. 도 3은 동작 감지 방법이 적용되는 예시를 설명하기 위한 흐름도이다. 도 4는 제1 실시예에 따라 동작 정보를 특정하는 단계를 보다 구체적으로 설명하기 위한 흐름도이다.도 5는 제2 실시예에 따라 동작 정보를 특정하는 단계를 보다 구체적으로 설명하기 위한 흐름도이다. 도 6은 동작 감지 방법을 이용한 추가적인 실시예를 설명하기 위한 흐름도이다. 도 7은 전자파 신호가 변화하는 양상을 나타내는 예시도이다. 도 8은 일 실시예에 따른 동작 감지 장치를 설명하기 위한 블록도이다."}
