{"patent_id": "10-2022-0121895", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0043217", "출원번호": "10-2022-0121895", "발명의 명칭": "폐마스크를 활용한 섬유보강 콘크리트의 제조방법", "출원인": "동서대학교 산학협력단", "발명자": "김대건"}}
{"patent_id": "10-2022-0121895", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "폐기물로부터 폐마스크를 선별하고, 선별된 폐마스크로부터 재활용 섬유를 추출하는 폐마스크 재활용 섬유 추출단계;골재와 시멘트를 건조상태에서 혼합하는 골재-시멘트 혼합단계;혼합된 상기 골재와 시멘트로 물과 혼화제를 투입하면서 혼합하는 물-혼화제 투입단계;상기 골재, 시멘트, 물 및 혼화제를 교반하는 1차 교반단계;교반된 상기 골재, 시멘트, 물 및 혼화제로 상기 재활용 섬유를 투입하면서 혼합하는 재활용 섬유 투입단계;상기 골재, 시멘트, 물 및 혼화제를 교반하는 2차 교반단계;를 포함하는 것을 특징으로 하는 폐마스크를 활용한섬유보강 콘크리트의 제조방법."}
{"patent_id": "10-2022-0121895", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 폐마스크 재활용 섬유 추출단계는,폐마스크가 포함된 폐기물이 수집되는 폐기물 수집단계;수집된 폐기물이 분류용 이송컨베이어(100)로 투입되는 폐기물 투입단계;상기 분류용 이송컨베이어(100)을 따라 폐기물이 이동하는 과정에서 폐기물이 상기 분류용 이송컨베이어(100)의전단부위 폭방향으로 분산 배치되도록 하여 폐기물을 구성하는 개별물품이 서로 겹쳐지게 되는 부위가 최소화되는 폐기물 분산배치 유도단계;분산 배치된 폐기물에 대한 인공지능 영상인식을 수행하여 영상정보 내 폐마스크를 식별하는 폐마스크식별단계;식별된 폐마스크에 대한 라벨링을 수행하여 폐마스크 선별용 영상정보를 산출하는 폐마스크 라벨링단계;상기 분류용 이송컨베이어(100)의 후단부위에 설치되는 폐마스크 선별로봇(200)으로 폐마스크 선별용 영상정보가 전달되고, 폐마스크 선별용 영상정보에 따라 상기 폐마스크 선별로봇(200)이 상기 분류용 이송컨베이어(100)의 표면으로부터 폐마스크를 선별하게 되는 폐마스크 선별단계;상기 폐마스크 선별로봇(200)로부터 선별된 폐마스크가 진공흡입기(300)와 파쇄가공장치(400)를 순차 통과하면서 폐마스크가 설정크기 이하로 파쇄되는 폐마스크 파쇄단계;폐마스크 파쇄물로부터 섬유 소재만을 추출하여 섬유보강 콘크리트에 사용될 재활용 섬유을 수집하는 섬유소재추출단계;를 포함하는 것을 특징으로 하는 폐마스크를 활용한 섬유보강 콘크리트의 제조방법."}
{"patent_id": "10-2022-0121895", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 폐마스크 재활용 섬유 추출단계에서 추출되는 상기 재활용 섬유를 물에 투입하는 재활용 섬유 물투입단계;재활용 섬유가 수용되어 있는 물에 와류나 불규칙 유동을 발생시키면서 재활용 섬유에 부착된 이물질이 분리되도록 한 후, 설정시간 동안 정적인 상태를 유지하면서 분리된 이물질만을 수집하여 배출시키는 이물질제거단계;를 더 포함하고,이물질이 제거된 재활용 섬유와 물을 상기 재활용 섬유 투입단계에서 투입하게 되는 것을 특징으로 하는 폐마스공개특허 10-2024-0043217-3-크를 활용한 섬유보강 콘크리트의 제조방법."}
{"patent_id": "10-2022-0121895", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 폐마스크를 활용한 섬유보강 콘크리트의 제조방법을 제공한다. 이와 같은 본 발명에 따른 폐마스크를 활용한 섬유보강 콘크리트의 제조방법은 마스크의 나일론계 폴리아미드 성분이 건설용 섬유보강재 성분과 일치하 는 것을 이용하여 폐기된 마스크로부터 섬유소재를 추출하여 콘크리트의 구성성분으로 투입함으로써 폐마스크의 매립-처리에 따른 환경오염이나 비용증대를 감소시킬 수 있도록 하고, 폐기물 자원 재활용에 따른 탄소중립을 실 현할 수 있을 뿐만 아니라, 폐마스크 처리공정과 재활용 섬유소재 추출공정과 섬유보강 콘크리트 제조공정이 유 기적으로 결합되면서 공정합리화가 도모되어 개별적으로 각각의 공정을 운용했을 때와 대비하여 비용절감과 생산 성 향상을 실현할 수 있도록 한다."}
{"patent_id": "10-2022-0121895", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 폐마스크를 활용한 섬유보강 콘크리트의 제조방법에 관한 것으로, 좀더 구체적으로는 마스크의 나일 론계 폴리아미드 성분이 건설용 섬유보강재 성분과 일치하는 것을 이용하여 폐기된 마스크로부터 섬유소재를 추 출하여 콘크리트의 구성성분으로 투입함으로써 폐마스크의 매립-처리에 따른 환경오염이나 비용증대를 감소시킬 수 있고, 폐기물 자원 재활용에 따른 탄소중립을 실현할 수 있을 뿐만 아니라, 폐마스크 처리공정과 재활용 섬 유소재 추출공정과 섬유보강 콘크리트 제조공정이 유기적으로 결합되면서 공정합리화가 도모되어 개별적으로 각 각의 공정을 운용했을 때와 대비하여 비용절감과 생산성 향상을 실현할 수 있는 폐마스크를 활용한 섬유보강 콘 크리트의 제조방법에 관한 것이다."}
{"patent_id": "10-2022-0121895", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "섬유보강 콘크리트(Fiber Reinforced Concrete)에 관한 연구는 주로 콘크리트의 낮은 인장력과 변형력으로 인해 깨지기 쉬운 약점을 보완하는 방안으로 연구되어 왔다. 현재까지 알려진 보강섬유를 종류별로 간단히 설명하면 아래의 [표 1]과 같다 표 1 보강섬유 종류 특징 강섬유 - 강 섬유는 강선을 자르거나, 강판을 꺾거나, 용해하여 추출함으로써 생산. - 초기 강 섬유는 매우 부드러웠으나, 시멘트와의 접착력이 충분하지 못하여, 최 근에는 길이 또는 단부의 형상을 변형함. - 강 섬유가 콘크리트 표면에 노출되면 녹이 발생하지만, 콘크리트 내부에서는 구 조적으로 높은 내구성을 나타냄. 유리섬유 - 유리섬유는 용해된 유리에서 필라멘트 형태로 추출. - 보통의 붕규산 유리(E-glass)나 실리카 유리(A-glass)는 알칼리 성분에 의한 화학 침식으로 섬유의 강도를 저하시키므로 지루코니아(ZrO2)가 16~20% 함유된 내 알칼리(AR) 유리 섬유가 개발됨. 석면섬유 - 석면섬유는 석면시멘트 파이프와 건축 자재를 생산하면서 개발되기 시작함. - 시멘트의 큰 부피를 대체하고 섬유 결합력이 견고하여 내부식, 내마모성이 우수 하며, 시멘트 매트릭스와 호환성이 좋음. - 석면섬유 생산, 가공시 발암물질 발견. - 현재는 건강상 위험과 엄격해진 환경 법규로 인해 대부분 다름 섬유들로 대체됨. 합성 화학섬유- 합성 화학섬유는 최근에 급격히 보편화 됨. - 대부분의 합성 화학섬유는 콘크리트보다 탄성계수가 낮아 수축 균열을 감소시키 는데 효과적임. - 낮은 탄성계수를 갖는 섬유로 폴리프로필렌 섬유가 일반적이지만, 나일론 섬유 와 폴리에틸렌 섬유도 사용됨. - 탄소 섬유와 아라미드 섬유는 높은 탄성계수를 갖으며 큰 인장력 때문에 매우 효과적이지만 비용이 높음. 천연섬유 - 자이잘마, 황마, 야마, 부들, 사탕수수 등의 천연섬유가 사용됨. - 습기나 알칼리에 의해 성능이 저하되지만, 세계적으로 저가의 건축자재로 많이 사용됨. - 셀룰로스(펄프) 섬유는 다른 천연섬유에 비해 높은 탄성계수와 인장력이 있어, 석면의 대체섬유로 널리 사용됨. 위의 보강섬유 중 폴리프로필렌(PP) 섬유는 화재 발생에 따른 고강도 콘크리트 또는 초고강도 콘크리트의 폭렬 현상을 저감시키기 위해 적용되기도 한다. 고강도 콘크리트의 폭렬현상은 수증기압과 열응력의 복합작용에 의해 나타나는 취성파괴 현상으로서, 화재시 급격한 온도상승에 따라 부재 표면의 콘크리트가 탈락하거나 박리되는현상을 말한다. 콘크리트의 폭렬은 물시멘트비가 낮아 조직이 치밀한 고강도콘크리트에서 열에 의한 내부 수증 기가 외부로 빠져나가지 못하고 팽창 한계점에 이르렀을 때 콘크리트가 폭발하는 것이므로 PP섬유를 콘크리트 조성물에 혼입시킴으로써 화재시 폭렬 발생 전에 PP섬유가 녹아 시멘트 매트릭스에 수증기가 통할 수 있는 미세 공을 형성시킴으로써 폭렬을 방지할 수 있는 것이다. 전술한 바와 같이 콘크리트 내에 섬유를 혼입하는 기술에 대해서는 오랫동안 다양하게 연구되고 실용화되어 왔 다. 그러나, 콘크리트 매트릭스 내에 폐마스크로부터 추출되는 섬유 소재를 혼입하는 방안이 연구된 바는 없다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허공보 등록번호 제10-1165289호 \"폴리아미드 섬유를 포함하는 고강도 내화 콘 크리트\" (특허문헌 0002) 대한민국 등록특허공보 등록번호 제10-1008322호 \"직경과 용융점 차이를 갖는 섬유와 분말로 구성된 복합소재폭렬방지재 및 이 폭렬방지재를 이용한 고강도 내화 콘크리트\""}
{"patent_id": "10-2022-0121895", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서 본 발명은 콘크리트에 사용되는 섬유소재의 다변화를 위한 기술개발의 일환으로서, 마스크의 나일론계 폴리아미드 성분이 건설용 섬유보강재 성분과 일치하는 것을 이용하여 폐기된 마스크로부터 섬유소재를 추출하 여 콘크리트의 구성성분으로 투입함으로써 폐마스크의 매립-처리에 따른 환경오염이나 비용증대를 감소시킬 수 있도록 하고, 폐기물 자원 재활용에 따른 탄소중립을 실현할 수 있도록 하는 새로운 형태의 폐마스크를 활용한 섬유보강 콘크리트의 제조방법을 제공하는 것을 목적으로 한다. 또한 본 발명은 폐마스크 재활용 섬유 추출단계, 골재-시멘트 혼합단계, 물-혼화제 투입단계, 1차 교반단계, 재 활용 섬유 투입단계, 2차 교반단계를 기본으로 하고, 재활용 섬유 물 투입단계와 이물질 제거단계를 거친 재활 용 섬유와 물을 재활용 섬유 투입단계에서 투입하는 공정을 제공함으로써 폐마스크 처리공정, 재활용 섬유소재 추출공정, 섬유보강 콘크리트 제조공정이 유기적으로 결합되도록 하고, 이를 통해 공정합리화가 도모되면서 개 별적으로 각각의 공정을 운용했을 때와 대비하여 비용절감과 생산성 향상을 실현할 수 있는 새로운 형태의 폐마 스크를 활용한 섬유보강 콘크리트의 제조방법을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2022-0121895", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 목적을 달성하기 위한 본 발명의 특징에 의하면, 본 발명은 폐기물로부터 폐마스크를 선별하고, 선별된 폐마스크로부터 재활용 섬유를 추출하는 폐마스크 재활용 섬유 추출단계; 골재와 시멘트를 건조상태에서 혼합하 는 골재-시멘트 혼합단계; 혼합된 상기 골재와 시멘트로 물과 혼화제를 투입하면서 혼합하는 물-혼화제 투입단 계; 상기 골재, 시멘트, 물 및 혼화제를 교반하는 1차 교반단계; 교반된 상기 골재, 시멘트, 물 및 혼화제로 상 기 재활용 섬유를 투입하면서 혼합하는 재활용 섬유 투입단계; 상기 골재, 시멘트, 물 및 혼화제를 교반하는 2 차 교반단계;를 포함하는 것을 특징으로 하는 폐마스크를 활용한 섬유보강 콘크리트의 제조방법을 제공한다. 이와 같은 본 발명에 따른 폐마스크를 활용한 섬유보강 콘크리트의 제조방법에서 상기 폐마스크 재활용 섬유 추 출단계는, 폐마스크가 포함된 폐기물이 수집되는 폐기물 수집단계; 수집된 폐기물이 분류용 이송컨베이어 로 투입되는 폐기물 투입단계; 상기 분류용 이송컨베이어을 따라 폐기물이 이동하는 과정에서 폐기물이 상기 분류용 이송컨베이어의 전단부위 폭방향으로 분산 배치되도록 하여 폐기물을 구성하는 개별물품이 서로 겹쳐지게 되는 부위가 최소화되는 폐기물 분산배치 유도단계; 분산 배치된 폐기물에 대한 인공지능 영상인식을 수행하여 영상정보 내 폐마스크를 식별하는 폐마스크 식별단계; 식별된 폐마스크에 대한 라벨링을 수행하여 폐 마스크 선별용 영상정보를 산출하는 폐마스크 라벨링단계; 상기 분류용 이송컨베이어의 후단부위에 설치되 는 폐마스크 선별로봇으로 폐마스크 선별용 영상정보가 전달되고, 폐마스크 선별용 영상정보에 따라 상기 폐마스크 선별로봇이 상기 분류용 이송컨베이어의 표면으로부터 폐마스크를 선별하게 되는 폐마스크 선별단계; 상기 폐마스크 선별로봇로부터 선별된 폐마스크가 진공흡입기와 파쇄가공장치를 순차 통과하면서 폐마스크가 설정크기 이하로 파쇄되는 폐마스크 파쇄단계; 폐마스크 파쇄물로부터 섬유 소재만을 추 출하여 섬유보강 콘크리트에 사용될 재활용 섬유을 수집하는 섬유소재 추출단계;를 포함할 수 있다. 이와 같은 본 발명에 따른 폐마스크를 활용한 섬유보강 콘크리트의 제조방법은 상기 폐마스크 재활용 섬유 추출 단계에서 추출되는 상기 재활용 섬유를 물에 투입하는 재활용 섬유 물 투입단계; 재활용 섬유가 수용되어 있는 물에 와류나 불규칙 유동을 발생시키면서 재활용 섬유에 부착된 이물질이 분리되도록 한 후, 설정시간 동안 정 적인 상태를 유지하면서 분리된 이물질만을 수집하여 배출시키는 이물질 제거단계;를 더 포함하고, 이물질이 제 거된 재활용 섬유와 물을 상기 재활용 섬유 투입단계에서 투입할 수 있다."}
{"patent_id": "10-2022-0121895", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의한 폐마스크를 활용한 섬유보강 콘크리트의 제조방법에 의하면, 폐마스크를 콘크리트 제조에 활용 하게 됨에 따라, 폐마스크의 매립-처리에 따른 환경오염이나 비용증대를 감소시키게 되는 효과가 있으며, 폐기 물 자원 재활용에 따른 탄소중립이 실현되는 효과도 있을 뿐만 아니라, 폐마스크 처리공정과 재활용 섬유소재 추출공정과 섬유보강 콘크리트 제조공정이 유기적으로 결합되면서 공정합리화가 도모되므로, 개별적으로 각각의 공정을 운용했을 때와 대비하여 비용절감과 생산성 향상이 실현되는 효과가 있다."}
{"patent_id": "10-2022-0121895", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시예를 첨부된 도면에 의거하여 상세히 설명한다. 한편, 도면과 상세한 설명에서 이 분야의 종사자들이 용이하게 알 수 있는 구성 및 작용에 대한 도시 및 언급은 간략히 하거나 생략하였다. 특히 도면의 도시 및 상세한 설명에 있어서 본 발명의 기술적 특징과 직접적으로 연관되지 않는 요소의 구체적인 기술적 구 성 및 작용에 대한 상세한 설명 및 도시는 생략하고, 본 발명과 관련되는 기술적 구성만을 간략하게 도시하거나 설명하였다. 본 발명의 실시예에 따른 폐마스크를 활용한 섬유보강 콘크리트의 제조방법은 도 1에서와 같이 폐마스크 재활용 섬유 추출단계, 골재-시멘트 혼합단계, 물-혼화제 투입단계, 1차 교반단계, 재활용 섬유 투입단계, 2차 교반단 계를 포함하는 구성으로 이루어진다.폐마스크 재활용 섬유 추출단계는 폐기물로부터 폐마스크를 선별하고, 선별된 폐마스크로부터 재활용 섬유를 추 출하는 단계이다. 여기서 본 발명의 실시예에 따른 폐마스크 재활용 섬유 추출단계는 도 2에서와 같이 폐기물 수집단계, 폐기물 투입단계, 폐기물 분산배치 유도단계, 폐마스크 식별단계, 폐마스크 라벨링단계, 폐마스크 선 별단계, 폐마스크 파쇄단계, 섬유소재 추출단계를 포함한다. 폐기물 수집단계는 폐마스크가 포함된 폐기물이 수집되는 단계이다. 폐기물 투입단계는 수집된 폐기물이 분류용 이송컨베이어로 투입되는 단계이다. 폐기물 분산배치 유도단계는 분류용 이송컨베이어을 따라 폐기물이 이동하는 과정에서 폐기물이 분류용 이 송컨베이어의 전단부위 폭방향으로 분산 배치되도록 하여 폐기물을 구성하는 개별물품이 서로 겹쳐지게 되 는 부위가 최소화되는 단계이다. 이를 위하여 분류용 이송컨베이어의 선단부위에는 컨베이어 상부 표면으 로부터 설정높이만큼 이격된 틈새공간 형성용 프레임이 폭방향으로 설치될 수 있다. 틈새공간 형성용 프레임은 분류용 이송컨베이어의 상부 표면에 근접되어 좁은 틈새공간을 형성함으로써 폐기물이 틈새공간 형성용 프 레임을 통과하는 과정에서 폭방향으로의 분산을 유도하게 된다. 폐마스크 식별단계는 분산 배치된 폐기물에 대한 인공지능 영상인식을 수행하여 영상정보 내 폐마스크를 식별하 는 단계이다. 인공지능 영상인식은 분류용 이송컨베이어의 상부 표면에 대한 부감 촬영으로 생성되는 영상 프레임에 대한 영상분석을 통해 수행되는데, 폐마스크에 대한 딥러닝 기반 인식알고리즘을 적용하여 폐마스크를 식별하게 된다. 폐마스크 라벨링단계는 식별된 폐마스크에 대한 라벨링을 수행하여 폐마스크 선별용 영상정보를 산출하는 단계 이다. 즉 인공지능 영상인식을 통해 폐마스크로 식별되는 영상프레임 내 오브젝트를 특정하여 라벨링을 수행하 게 되고, 라벨링 정보를 추가한 영상정보를 폐마스크 선별용 영상정보가 산출하게 된다. 폐마스크 선별단계는 도 4에서와 같이 분류용 이송컨베이어의 후단부위에 설치되는 폐마스크 선별로봇 으로 폐마스크 선별용 영상정보가 전달되고, 폐마스크 선별용 영상정보에 따라 폐마스크 선별로봇이 분류용 이송컨베이어의 표면으로부터 폐마스크를 선별하게 되는 단계이다. 폐마스크 파쇄단계는 폐마스크 선별로봇로부터 선별된 폐마스크가 도 5에서와 같이 진공흡입기와 파 쇄가공장치를 순차 통과하면서 폐마스크가 설정크기 이하로 파쇄되는 단계이다. 섬유소재 추출단계는 폐마스크 파쇄물로부터 섬유 소재만을 추출하여 섬유보강 콘크리트에 사용될 재활용 섬유 을 수집하는 단계이다. 골재-시멘트 혼합단계는 골재와 시멘트를 건조상태에서 혼합하는 단계이다. 물-혼화제 투입단계는 혼합된 골재와 시멘트로 물과 혼화제를 투입하면서 혼합하는 단계이다. 1차 교반단계는 골재, 시멘트, 물 및 혼화제를 교반하는 단계이다. 재활용 섬유 투입단계는 교반된 골재, 시멘트, 물 및 혼화제로 재활용 섬유를 투입하면서 혼합하는 단계이다. 여기서 본 발명의 실시예에 따른 폐마스크를 활용한 섬유보강 콘크리트의 제조방법은 도 3에서와 같이 재활용 섬유 물 투입단계와 이물질 제거단계를 수행하게 되는데, 재활용 섬유 물 투입단계는 폐마스크 재활용 섬유 추 출단계에서 추출되는 재활용 섬유를 물에 투입하는 단계이다. 이물질 제거단계는 재활용 섬유가 수용되어 있는 물에 와류나 불규칙 유동을 발생시키면서 재활용 섬유에 부착 된 이물질이 분리되도록 한 후, 설정시간 동안 정적인 상태를 유지하면서 분리된 이물질만을 수집하여 배출시키 는 단계이다. 이와 같이 이물질이 제거된 재활용 섬유와 물이 재활용 섬유 투입단계에서 투입된다.2차 교반단계는 골재, 시멘트, 물 및 혼화제를 교반하는 단계이다. 여기서, 본 발명의 실시예에 따른 폐마스크를 활용한 섬유보강 콘크리트의 제조방법에서 시멘트는 물시멘트비 (W/C)로 40~44.5%로 투입되는데, 물시멘트비(W/C)는 시멘트 중량에 대한 물의 비율이다. 그리고 골재는 잔골재 비율(S/a) 43~47%에 따라 투입되는데, 잔골재 비율은 전체 골재에 대한 잔골재의 용적비 율이다. 또한 혼화제는 콘크리트 배합의 유동성을 증가시킬 수 있는 감수제로서, 시멘트 중량에 대해 0.50~0.62%로 투입 된다. 특히 재활용 섬유는 비중 0.80~0.92, 길이 15~30mm, 직경 0.6~1.3mm로 형성되고, 콘크리트의 부피 대비 0.5~2.5%로 혼합된다. 상기와 같이 구성된 본 발명의 실시예에 따른 폐마스크를 활용한 섬유보강 콘크리트의 제조방법은 마스크의 나 일론계 폴리아미드 성분이 건설용 섬유보강재 성분과 일치하는 것을 이용하여 폐기된 마스크로부터 섬유소재를 추출하여 콘크리트의 구성성분으로 투입하게 되므로, 폐마스크의 매립-처리에 따른 환경오염이나 비용증대를 감 소시킬 수 있게 되고, 폐기물 자원 재활용에 따른 탄소중립을 실현할 수 있게 된다. 또한 본 발명의 실시예에 따른 폐마스크를 활용한 섬유보강 콘크리트의 제조방법은 폐마스크 재활용 섬유 추출단계, 골재-시멘트 혼합단 계, 물-혼화제 투입단계, 1차 교반단계, 재활용 섬유 투입단계, 2차 교반단계를 기본으로 하고, 재활용 섬유 물 투입단계와 이물질 제거단계를 거친 재활용 섬유와 물을 재활용 섬유 투입단계에서 투입하는 공정을 제공하므로, 폐마스크 처리공정, 재활용 섬유소재 추출공정, 섬유보강 콘크리트 제조공정이 유기적으로 결합되 도록 하고, 이를 통해 공정합리화가 도모되면서 개별적으로 각각의 공정을 운용했을 때와 대비하여 비용절감과 생산성 향상을 실현할 수 있게 된다. 상술한 바와 같은, 본 발명의 실시예에 따른 폐마스크를 활용한 섬유보강 콘크리트의 제조방법을 상기한 설명 및 도면에 따라 도시하였지만, 이는 예를 들어 설명한 것에 불과하며 본 발명의 기술적 사상을 벗어나지 않는 범위 내에서 다양한 변화 및 변경이 가능하다는 것을 이 분야의 통상적인 기술자들은 잘 이해할 수 있을 것이다."}
{"patent_id": "10-2022-0121895", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 폐마스크를 활용한 섬유보강 콘크리트의 제조방법의 기본 순서도; 도 2는 본 발명의 실시예에 따른 재활용 섬유 추출단계의 순서도; 도 3은 본 발명의 실시예에 따른 폐마스크를 활용한 섬유보강 콘크리트의 제조방법에서 재활용 섬유로터 이물질 을 제거하는 과정을 보여주기 위한 도면; 도 4는 본 발명의 실시예에 따른 폐마스크를 활용한 섬유보강 콘크리트의 제조방법에서 사용될 수 있는 분류용 이송컨베이어와 폐마스크 선별로봇의 예시도; 도 5는 본 발명의 실시예에 따른 폐마스크를 활용한 섬유보강 콘크리트의 제조방법에서 사용될 수 있는 진공흡 입기와 파쇄가공장치의 예시도이다."}
