{"patent_id": "10-2021-0094743", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0013815", "출원번호": "10-2021-0094743", "발명의 명칭": "디지털 악보 관리 시스템 및 방법", "출원인": "주식회사 휴머닛", "발명자": "서미현"}}
{"patent_id": "10-2021-0094743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자단말기에 실행되는 뮤직관리앱을 통하여 요청된 악보정보에 대해 디지털 악보 변환 및 생성된 디지털 악보를 제공하고, 디지털 악보에 대한 편집, 공유, 뮤직 재생 기능을 제공하는 관리서버를 포함하되, 상기 관리서버는 상기 악보정보의 이미지 학습을 통해 악보정보에 포함된 객체를 인식하여 디지털 악보 변환을수행하며, 상기 악보정보는 음표, 쉼표, 오선지의 음표 위치, 조성, 코드, 계이름, 가사 중 적어도 어느 하나를 포함하는디지털 악보 관리 시스템."}
{"patent_id": "10-2021-0094743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 관리서버는상기 사용자단말기에 실행되는 뮤직관리앱과 연동하기 위해 적어도 하나 이상의 호환되는 응용 프로그램을 제어할 인터페이스인 API를 포함하는 앱연동부;상기 악보정보를 토대로 악보에 포함된, 음표, 쉼표, 오선지의 음표 위치, 조성, 코드, 계이름, 가사(텍스트)에따라 인식하고, 디지털 악보의 오선지로 옮겨 디지털 악보로 변환시키는 악보변환부;디지털 악보로 변환된 악보에 대한 관리 서비스를 제공하며, 뮤직관리앱을 통하여 악보 편집 기능을 제공하고,편집된 악보의 공유 기능을 통하여 요청된 팀원, 친구나 지인이 소지한 사용자단말기와 해당 악보에 대한 다운로드 권한을 제공하여 공유하는 악보관리부;수집된 악보정보, 디지털 악보, 개인정보, 결제정보, 이벤트정보에 대해서 개인별로 통계자료를 생성하여 제공하는 통계학습부;악보정보, 디지털 악보, 개인정보, 결제 정보를 저장하는 데이터베이스를 포함하는 디지털 악보 관리 시스템."}
{"patent_id": "10-2021-0094743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 악보변환부는이미지 형태의 악보정보로부터 원하는 객체를 인식하기 위해 인공지능 학습 알고리즘인 객체 인식 알고리즘에의해 학습함으로써, 해당 객체를 정확히 인식하고 추출하며,각 악보에 포함된 객체 단위로 세분화하여 디지털 악보의 악보정보를 변환하는 작업은 악보정보의 이미지 전처리 과정과, 악보정보 분석 과정, 분석 결과에 대한 후처리 과정, 변환된 디지털 악보에 대한 결과 출력 과정을거치는 것을 특징으로 하는 디지털 악보 관리 시스템."}
{"patent_id": "10-2021-0094743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 악보관리부는해당 디지털 악보에 대한 뮤직 재생 기능을 제공하여 비트에 맞춰 악기 시연을 수행할 수 있으며, 각각의 연주자들의 연주시 메트로놈을 맞추기 위해 통신 지연에 따른 시간 동기화 기능을 제공하는 디지털 악보 관리 시스템.공개특허 10-2023-0013815-3-청구항 5 사용자단말기에서 실행되는 뮤직관리앱과 연동하여 디지털 악보 관리 기능을 제공하는 디지털 악보 관리 방법에있어서,상기 사용자단말기에서 뮤직관리앱이 실행되는 단계;실행된 뮤직관리앱은 관리서버에 악보정보를 제공하여 디지털 악보 변환 생성을 요청하는 단계;상기 관리서버 또는 뮤직관리앱은 사용자 요청된 악보정보를 토대로 디지털 악보 변환을 수행하는 단계;변환이 모두 완료되면, 변환된 디지털 악보를 사용자단말기 화면에 출력하여 제공하고, 사용자단말기는 제공받은 디지털 악보에 대한 편집 기능을 수행하는 단계를 포함하는 디지털 악보 관리 방법."}
{"patent_id": "10-2021-0094743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,또한 사용자 요청에 따라 디지털 악보에 대한 공유 서비스를 제공받아 적어도 하나 이상의 사용자단말기에 해당디지털 악보를 제공하여 공유하는 단계;또한 공유된 악보에 대해서 악보에 대한 뮤직 재생을 수행할 수 있으며, 악보 공유를 통하여 시연을 진행하는경우, 박자 동기화를 위해 통신 지연을 고려한 오차 보정을 통하여 메트로놈 동기화 기능을 제공하는 단계를 더 포함하는 디지털 악보 관리 방법."}
{"patent_id": "10-2021-0094743", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항 또는 제6항의 디지털 악보 관리 방법을 수행하는 컴퓨터에서 실행 가능한 기록매체에 저장된 어플리케이션."}
{"patent_id": "10-2021-0094743", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 디지털 악보 관리 시스템은 사용자단말기에 실행되는 뮤직관리앱을 통하여 요청된 악보정보에 대해 디지털 악보 변환 및 생성된 디지털 악보를 제공하고, 디지털 악보에 대한 편집, 공유, 뮤직 재 생 기능을 제공하는 관리서버를 포함하되, 상기 관리서버는 상기 악보정보의 이미지 학습을 통해 악보정보에 포 함된 객체를 인식하여 디지털 악보 변환을 수행하며, 상기 악보정보는 음표, 쉼표, 오선지의 음표 위치, 조성, 코드, 계이름, 가사(텍스트) 중 적어도 어느 하나를 포함할 수 있다."}
{"patent_id": "10-2021-0094743", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 디지털 악보 관리 시스템 및 방법에 관한 것으로, 더욱 상세하게는 뮤직관리앱을 통하여 요청된 악보 정보에 대해 디지털 악보 변환 및 생성된 디지털 악보를 제공할 수 있는 디지털 악보 관리 시스템 및 방법에 관 한 것이다."}
{"patent_id": "10-2021-0094743", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "종이악보가 많아질수록 무게는 늘어가고 연주정보에 대한 잦은 메모로 악보 훼손, 악보 편곡 불가능 등의 종이 악보의 문제점을 보완할 필요가 있다. 최근 클라우드 기반 스트리밍 서비스로 언제 어디서든 악보를 찾아볼 수 있고, 사용자가 가지고 있는 이미지 악 보를 스캔하여 사용할 수 있는 서비스를 제공하고 있다. 그러나, 기존의 서비스에서는 단순히 악보에 대한 정보만으로 출력하여 제공하고, 악보 메모 편집 기능, 편집된 악보의 공유, 공유된 악보를 이용한 시연(동기화 필요) 기능 등 사용자 편의 기능을 다양하게 제공해주지 못해 서비스 만족도나 질이 떨어지는 문제가 있었다. 또한, 디지털 악보 생성시에도 악보의 이미지를 생성하는 과정에서 음표나 쉼표 등이 누락되거나 잘못 오기재되 는 경우가 빈번하여 신뢰도가 낮은 문제가 있었다. 따라서, 전술한 문제를 해결하기 위하여 디지털 악보 생성시 신경망 학습에 의해 이루어지고, 다양한 사용자 편 의 기능을 제공할 수 있는 디지털 악보 관리 시스템 및 방법에 대한 연구가 필요하게 되었다. 선행기술문헌 특허문헌(특허문헌 0001) 한국등록특허 제10-1168510호(2012년07월18일 등록)"}
{"patent_id": "10-2021-0094743", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 디지털 악보 생성시 신경망 학습에 의해 이루어지고, 다양한 사용자 편의 기능으로서, 뮤직관 리앱을 통하여 요청된 악보정보에 대해 디지털 악보 변환 및 생성된 디지털 악보를 제공하고, 디지털 악보에 대 한 편집, 공유, 뮤직 재생 기능을 제공할 수 있는 디지털 악보 관리 시스템 및 방법을 제공하는 것이다."}
{"patent_id": "10-2021-0094743", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 디지털 악보 관리 시스템은, 사용자단말기에 실행되는 뮤직관리앱을 통하여 요청된 악보정보에 대해 디지털 악보 변환 및 생성된 디지털 악보를 제공하고, 디지털 악보에 대한 편집, 공유, 뮤직 재생 기능을 제공하는 관리서버를 포함하되, 상기 관리서버는 상기 악보정보의 이미지 학습을 통해 악보정보에 포함된 객체를 인식하여 디지털 악보 변환을 수행하며, 상기 악보정보는 음표, 쉼표, 오선지의 음표 위치, 조성, 코드, 계이름, 가사(텍스트) 중 적어도 어느 하나를 포함한다. 상기 관리서버는 상기 사용자단말기에 실행되는 뮤직관리앱과 연동하기 위해 적어도 하나 이상의 호환되는 응용 프로그램을 제어할 인터페이스인 API를 포함하는 앱연동부; 상기 악보정보를 토대로 악보에 포함된, 음표, 쉼표, 오선지의 음표 위치, 조성, 코드, 계이름, 가사(텍스트)에 따라 인식하고, 디지털 악보의 오선지로 옮겨 디지털 악보로 변환시키는 악보변환부; 디지털 악보로 변환된 악보에 대한 관리 서비스를 제공하며, 뮤직관리앱 을 통하여 악보 편집 기능을 제공하고, 편집된 악보의 공유 기능을 통하여 요청된 팀원, 친구나 지인이 소지한 사용자단말기와 해당 악보에 대한 다운로드 권한을 제공하여 공유하는 악보관리부; 수집된 악보정보, 디지털 악 보, 개인정보, 결제정보, 이벤트정보에 대해서 개인별로 통계자료를 생성하여 제공하는 통계학습부; 악보정보, 디지털 악보, 개인정보, 결제 정보를 저장하는 데이터베이스를 포함한다. 상기에 있어서, 상기 악보변환부는 이미지 형태의 악보정보로부터 원하는 객체(음표, 쉼표 등)를 인식하기 위해 인공지능 학습 알고리즘인 객체 인식 알고리즘에 의해 학습함으로써, 해당 객체를 정확히 인식하고 추출하며, 각 악보에 포함된 객체 단위로 세분화하여 디지털 악보의 악보정보를 변환하는 작업은 악보정보의 이미지 전처 리 과정(객체 인식할 수 있도록 해상도와 밝기 등 이미지 조정 및 이미지 포멧 변환 과정)과, 악보정보 분석 과 정, 분석 결과에 대한 후처리(악보 변환) 과정, 결과(변환된 디지털 악보) 출력 과정을 거치는 것을 특징으로 한다. 상기 악보관리부는 해당 디지털 악보에 대한 뮤직 재생 기능을 제공하여 비트(리듬)에 맞춰 악기 시연을 수행할 수 있으며, 각각의 연주자들의 연주시 메트로놈(박자)을 맞추기 위해 통신 지연에 따른 시간 동기화 기능을 제 공한다. 본 발명의 일 실시예에 따른 디지털 악보 관리 방법은, 사용자단말기에서 실행되는 뮤직관리앱과 연동하여 디지 털 악보 관리 기능을 제공하는 디지털 악보 관리 방법에 있어서, 상기 사용자단말기에서 뮤직관리앱이 실행되는 단계; 실행된 뮤직관리앱은 관리서버에 악보정보를 제공하여 디지털 악보 변환 생성을 요청하는 단계; 상기 관 리서버 또는 뮤직관리앱은 사용자 요청된 악보정보를 토대로 디지털 악보 변환을 수행하는 단계; 변환이 모두 완료되면, 변환된 디지털 악보를 사용자단말기 화면에 출력하여 제공하고, 사용자단말기는 제공받은 디지털 악 보에 대한 편집 기능을 수행하는 단계를 포함한다. 상기에 있어서, 또한 사용자 요청에 따라 디지털 악보에 대한 공유 서비스를 제공받아 적어도 하나 이상의 사용 자단말기에 해당 디지털 악보를 제공하여 공유하는 단계; 또한 공유된 악보에 대해서 악보에 대한 뮤직 재생을 수행할 수 있으며, 악보 공유를 통하여 시연을 진행하는 경우, 박자 동기화를 위해 통신 지연을 고려한 오차 보 정을 통하여 메트로놈 동기화 기능을 제공하는 단계를 더 포함한다. 상기 디지털 악보 관리 방법은, 컴퓨터에서 실행 가능한 기록매체에 저장된 어플리케이션에 의해 수행된다."}
{"patent_id": "10-2021-0094743", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 이미지 형태의 악보정보로부터 원하는 객체(음표, 쉼표 등)를 인식하기 위해 인공지능 학습 알고리즘인 객체 인식 알고리즘에 의해 학습함으로써, 해당 객체를 정확히 인식하고 추출할 수 있으며, 학습을 통해 누락, 오기재 등에 대한 오류를 줄이고, 완성도 높은 디지털 악보를 생성할 수 있는 장점이 있다. 또한, 뮤직관리앱을 통하여 요청된 악보정보에 대해 디지털 악보 변환 및 생성된 디지털 악보를 제공하고, 디지 털 악보에 대한 편집, 공유, 뮤직 재생 기능을 제공하여 디지털 악보 생성시 신경망 학습에 의해 이루어짐으로 써, 다양한 사용자 편의 기능을 제공하여 디지털 악보 관리 및 활용에 도움을 줄 수 있는 장점이 있다."}
{"patent_id": "10-2021-0094743", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여 본 발명의 구체적인 실시예를 상세하게 설명한다. 다만, 본 발명의 사상은 제시되 는 실시예에 제한되지 아니하고, 본 발명의 사상을 이해하는 당업자는 동일한 사상의 범위 내에서 다른 구성요 소를 추가, 변경, 삭제 등을 통하여, 퇴보적인 다른 발명이나 본 발명 사상의 범위 내에 포함되는 다른 실시예 를 용이하게 제안할 수 있을 것이나, 이 또한 본원 발명 사상 범위 내에 포함된다고 할 것이다. 또한, 각 실시 예의 도면에 나타나는 동일한 사상의 범위 내의 기능이 동일한 구성요소는 동일한 참조부호를 사용하여 설명한 다. 본 명세서에서 ‘사용자단말기’는 휴대성 및 이동성이 보장된 무선 통신 장치일 수 있으며, 예를 들어 스 마트폰, 태블릿 PC 또는 노트북 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치일 수 있다. 또한, ‘사용자단말기’는 통신망을 통해 다른 단말기 또는 서버 등에 접속할 수 있는 PC 등의 유선 통신 장치인 것도 가능하다. 또한, 통신망은 단말기들 및 서버들과 같은 각각의 노드 상호 간에 정보 교환 이 가능한 연결 구조를 의미하는 것으로, 근거리 통신망(LAN: Local Area Network), 광역 통신망(WAN: Wide Area Network), 인터넷(WWW: World Wide Web), 유무선 데이터 통신망, 전화망, 유무선 텔레비전 통신망 등을 포함한다. 무선 데이터 통신망의 일례에는 3G, 4G, 5G, 3GPP(3rd Generation Partnership Project), LTE(Long Term Evolution), WIMAX(World Interoperability for Microwave Access), 와이파이(Wi-Fi), 블루투스 통신, 적외선 통신, 초음파 통신, 가시광 통신(VLC: Visible Light Communication), 라이파이(LiFi) 등이 포함되나 이에 한 정되지는 않는다. 도 1은 본 발명의 일 실시예에 따른 디지털 악보 관리 시스템의 구성을 보인 블록도이며, 도 2는 도 1의 디지털 악보 관리 시스템의 세부 구성을 보인 블록도이며, 도 3은 도 2의 악보변환부의 세부 구성을 보인 블록도이다. 본 발명의 디지털 악보 관리 시스템은 도 1에 도시된 바와 같이, 사용자단말기에서 실행되는 뮤직관리앱 과 통신망을 통하여 연동하는 관리서버를 포함한다. 여기서 뮤직관리앱은, 관리서버에서 제공하는 디지털 악보 생성 및 관리에 대한 전반적 서비스를 제 공하는 어플리케이션으로서, 상술한 다양한 단말기에서 실행될 수 있는 어플리케이션이며, 관리서버는 제 공한 단말기에 따라 다양한 버전이나 형태로 어플리케이션을 제공할 수 있다. 관리서버는 뮤직관리앱을 통하여 요청된 악보정보에 대해 디지털 악보 변환 및 생성된 디지털 악보를 제공하고, 디지털 악보에 대한 편집, 공유, 뮤직 재생 기능 등을 제공한다. 또한 관리서버는 웹기반으로 홈페이지를 통하여 악보정보에 대해 디지털 악보 변환 및 생성된 디지털 악보 를 제공하고, 디지털 악보에 대한 편집, 공유, 뮤직 재생 기능 등을 제공할 수도 있다.또한 관리서버는 상술한 기능을 수행하기 위해 도 2를 참조하면, 앱연동부, 악보변환부, 악보관 리부, 통계학습부 및 데이터베이스를 더 포함한다. 앱연동부는 사용자단말기에 실행되는 뮤직관리앱과 연동하기 위해 적어도 하나 이상의 호환되는 응용 프로그램을 제어할 인터페이스인 API를 포함할 수 있다. 여기서 API(Application Programming Interface, 응용 프로그램 프로그래밍 인터페이스)는 응용 프로그램에서 사용할 수 있도록, 운영 체제나 프로그래밍 언어가 제공하는 기능을 제어할 수 있게 만든 인터페이스를 의미하 며, 본 발명에서는 뮤직관리앱과 관리서버 프로그램 간에 연동하여 디지털 악보 생성 요청, 변환, 변 환된 악보 출력(표시), 악보 편집, 악보 공유, 뮤직 재생 기능 등을 위한 사용자 인터페이스를 제공할 수 있다. 악보변환부는 이미지 형태로 이루어진 악보정보로부터 디지털 악보로 변환하는 기능을 수행한다. 악보정보는 사용자가 뮤직관리앱을 통하여 제공할 수 있으며, 예컨대 종이 악보의 스캔본이나 수기로 작성 된 악보 등이 될 수 있다. 악보변환부는 악보정보를 토대로 악보에 포함된, 음표, 쉼표, 오선지의 음표 위치, 조성, 코드, 계이름, 가사(텍스트) 등에 따라 인식하고, 디지털 악보의 오선지로 옮겨 도 5와 같이 디지털 악보로 변환시킬 수 있다. 이와 같이 이미지 형태의 악보정보로부터 원하는 객체(음표, 쉼표 등)를 인식하기 위해 인공지능 학습 알고리즘 인 객체 인식 알고리즘에 의해 학습함으로써, 해당 객체를 정확히 인식하고 추출할 수 있다. 각 악보에 포함된 객체 단위로 세분화하여 디지털 악보의 악보정보를 변환하는 작업은 악보정보의 이미지 전처 리 과정(객체 인식할 수 있도록 해상도와 밝기 등 이미지 조정 및 이미지 포멧 변환 과정)과, 악보정보 분석 과 정, 분석 결과에 대한 후처리(악보 변환) 과정, 결과(변환된 디지털 악보) 출력 과정 등 여러 단계를 거처 최종 분석 결과를 도출하며, 이를 위해 도 3을 참조하면, 악보변환부는 전처리부, 분석부, 후처리부 , 이미지학습부, 결과제공부를 더 포함할 수 있다. 특히 악보정보 분석 과정에서는 예를 들어 객체 인식 알고리즘에서 미리 음표이미지를 학습시키고, 도 7과 같은 음표 종류 구분 및 판단 과정을 거쳐 음표를 인식할 수 있으며, 음표 이외에도 정해진 알고리즘에 의해 객체들 을 인식할 수 있다. 또한 상술한 악보 변환의 구체적 과정이 1 싸이클(Cycle)로 이루어져 완전한 디지털 악보를 생성하며, 도 5에 는 악보 완성 퍼센트로 생성하는데 걸리는 시간을 도시하고 있으며, 악보정보량에 따라 악보당 분석 총 소요시 간이 오래 걸릴 수 있다. 그런데 앱이나 웹을 통하여 다중 사용자가 악보 변환 서비스를 사용할 경우 1 싸이클 과정이 완료될 때까지 다 른 사용자들은 대기 상태에 있게 되어 업무 효율성이 현저히 떨어지게 되므로, 관리서버는 이를 해결하기 위하여 다공정(Multi-Process) 개념을 도입한다. 즉 각 단계를 독립된 과정으로 분리하여 한 사용자의 1 분석 Cycle이 진행되는 도중에도 시차를 두고 중복되지 않는 다른 단계의 과정을 수행시킴으로써, 분석 소요시간을 줄여 효율을 증가시킬 수 있다. 나아가, 이와 같은 다공정 개념은 다량의 업무 집중시에 각 단계 처리 과정을 각각 다른 서버로 처리하는 다중 서버 처리 시스템으로도 확장하여 관리할 수도 있다. 나아가 악보변환부는 구체적으로 예를 들어 악보정보의 이미지로부터 객체 인식 알고리즘인 CNN 알고리즘 을 적용하여 객체를 인식할 수 있다. CNN 알고리즘은 합성곱 연산을 통하여 객체를 인식시키는 신경망 알고리즘으로, 본 발명에서는 특히 객체 위치 를 검출하는데 탁월하도록 딥러닝 회귀 방법을 사용한 R-CNN(Region-based Convolutional Neural Networks) 알 고리즘을 이용하여 객체를 인식하는 것이 적합할 수 있다. 여기서 R-CNN 알고리즘은 먼저 후보영역을 생성하고 이를 기반으로 CNN을 학습시켜 영상 내 객체의 위치를 찾아 내는 신경망 알고리즘으로, 객체인식과정은 입력된 영상에서 선택적 탐색을 이용하여 후보 영역 생성하는 과정 과, 생성된 각 후보 영역들을 동일한 크기로 변환하고, CNN을 통해 특징을 추출하는 과정과, 추출된 특징을 이 용하여 후보 영역 내의 객체를 SVM(Support Vector Machine)을 이용하여 분류하는 과정을 포함한다. 후보 영역 의 위치는 정확하지 않기 때문에 최종적으로 회귀 학습을 통해 객체 영역 박스 위치를 정확히 보정할 수 있다. 또한 다른 신경망 알고리즘으로 Fast R-CNN, R-FCN, YOLO(You only Look Once), 텐서플로(TensorFlow), SSD(Single Shot MultiBox Detector) 등이 있는데, 상술한 신경망 알고리즘을 추가로 적용하거나 R-CNN을 대체 하여 적용할 수 있으며, 상술한 신경망 알고리즘을 적용하여 다중 객체를 동시에 인식시켜 객체 인식 속도를 향 상시킬 수도 있다. 나아가, 객체 인식율을 높이기 위해 에이다부스트(AdaBoost), 서포트 벡터 머신(Support Vector Machine: SVM), 선형판별식 해석(Linear Disciminant Analysis: LDA), 주성분 분석(Principal Component Analusis: PCA) 등의 알고리즘이 추가로 이용될 수도 있으며, 이러한 알고리즘 기법들은 모두 외형에 기반하여 인식대상 영역을 식별하는 것으로, 트레이닝에 사용될 악보정보에 대한 이미지들의 집합에 의해 트레이닝된 모델을 이용해서 객 체 주위의 영역을 검출하며, 여러 주변의 제약 조건들이 트레이닝을 통해 극복되어지기 때문에 결과적으로 객체 인식 정확도와 신뢰도를 높일 수 있다. 또한 SVM이란 클래시피케이션(classification), 리그레션(regression), 특이점 판별(outliers detection) 등에 주로 사용되는 지도 학습(Supervised Learning) 머신 러닝 방법 중 하나이다. 예를 들어, 두 그룹의 데이터셋을 구분하는 여러 가지 방법 중에 각 그룹의 최대 거리에 있는 중간지점을 정확하게 구분할 수 있는 것이 분류정확 도를 높일 수 있는 최적의 방법이라고 할 수 있다. 나아가 악보변환부는 악보정보에 포함된 음표, 쉼표, 오선지의 위치, 조성, 코드, 계이름, 가사(텍스트) 등의 특징 데이터를 이용하며 상술한 SVM 외에 CNN, LSTM RNN(Long Short Term Memory RNN), 어텐션 알고리즘 (Attention mechanism)의 조합을 통해 심층학습을 수행하도록 구성된다. 여기서 어텐션 알고리즘은 인코더와 디코더로 이루어져 있으며, 인코더에서는 LSTM의 히든 스테이트를 행렬로 만들고, 디코더에서는 히든 스테이트 중 중요한 스테이트를 강조할 수 있으며, 이러한 방법은 일정 거리 이상의 중요한 출력벡터에 집중할 수 있게 만들어, 불필요한 학습량을 줄이고, neural machine translation(NMT)에서 훌륭한 성능을 보여줄 수 있다. 따라서 악보변환부는 세부 구성인 이미지학습부를 통하여 악보정보에 대한 이미지 학습을 수행하도록 하며, 디지털 악보 생성 결과를 산출하기 위한 악보정보에 대한 이미지 학습 모델로서, CNN, LSTM RNN, 어텐션 알고리즘을 조합한 모델(CLA 모델)을 이용할 수 있다. 여기서 CLA 모델은 국소적인 특징의 파악에 유리한 CNN, 순차적인 데이터 처리에 유리한 LSTM RNN, 중요한 정보 에 집중할 수 있게 하는 어텐션 메커니즘의 장점을 이용하여 단순히 SVM이나 CNN을 사용한 모델에 비해 보다 우 수한 성능을 유도할 수 있게 된다. 예를 들어 CLA 모델은 악보정보에 포함되는 음표, 쉼표, 오선지의 위치, 조성, 코드, 계이름, 가사(텍스트)의 특징 추출 과정에서 80차원의 mel spectrogram으로 변환하고 3초 단위의 300 프레임셋이 모델에 입력된다. 모델은 CNN 레이어(layer)로 스펙트럼의 공간적(spatial)인 특성을 추출하고, LSTM레이어로 시간적(temporal)인 정보를 추출한 후 Attention 레이어로 지역적인 특성을 집중하여 정보를 수집한다. CNN 레이어는 Convolution 연산과 max pooling을 두 번씩 반복하는 레이어이다. 예를 들어 CNN 레이어는 입력된 spectrogram를 분석하여 조금 더 악보정보의 이미지 학습에 적합한 특징을 추출 하기 위한 작업을 하는데 사용될 수 있다. 이는 convolution 연산과 max pooling을 통해 이루어지며, convolution 연산은 입력된 데이터의 국소적인 부분에서 연산을 통해 필요한 특징을 추출하는 과정이다. 또한 Max pooling 연산은 데이터의 차원을 축소하며 동시에 필요한 특징만을 남겨놓는 과정으로 이후에 진행될 LSTM 및 어텐션 레이어의 계산 복잡도를 낮추는 역할을 한다. LSTM 레이어에서 LSTM은 Recurrent Neural Network(RNN) 아키텍처의 한 종류로, 일반적으로 RNN을 지칭할 경우, LSTM 구조로 이루어져 있을 정도로 많이 사용되는 구조이다. CLA 모델에서는 CNN 레이어를 통해 얻어진 특징벡터에서 시간적 정보를 얻는데 사용된다. 이는 RNN이 가지는 시 퀀스 정보 처리 능력을 사용하여 장거리의 정보를 처리하여야 알 수 있는 악보정보의 미세한 이미지(예컨대 구 분하기 힘든 16음표와 8분음표의 구분이나 세븐스코드나 메이너마이너 세븐코드의 구분 등) 학습시 설정된 임계 수준을 초과하는 학습 과정을 위해서이다. 또한 어텐션 레이어는 어텐션 메커니즘을 활용하여 만들어진 레이어로 CNN및 LSTM을 통하여 얻어진 정보 벡터에 서 최종적인 판단을 하기 위한 컨텍스트 벡터를 만드는 용도로 사용된다. 어텐션 메커니즘의 입력은 LSTM레이어의 출력 H=h1, h2, h3, …, hT, hi=(p1, p2, …, pC)이며 웨이트 파라메터 q=(q1, q2, q3, …, qC)를 사용하여 원하는 출력(악보정보 이미지 학습 결과값)을 계산할 수 있다. 이와 같은 학 습 결과로 악보정보로부터 디지털 악보를 완성하기 위한 음표, 쉼표, 오선지의 위치, 조성, 코드, 계이름, 가 사(텍스트) 등을 구분하여 판단하고, 디지털 악보 변환에 활용하는데 이용될 수 있다. 악보관리부는 디지털 악보로 변환된 악보에 대한 관리 서비스를 제공할 수 있으며, 사용자는 디지털 악보 를 데이터베이스에 저장하여 클라우드 기반으로 관리할 수 있으며, 필요시 저장된 디지털 악보를 개인 저 장 공간으로 다운로드할 수 있으며, 뮤직관리앱을 통하여 악보 편집 기능을 제공받을 수도 있다. 또한 편집된 악보의 공유 기능을 통하여 요청된 팀원, 친구나 지인 등이 소지한 사용자단말기와 해당 악보 에 대한 다운로드 권한을 제공하여 공유할 수 있다. 또한 이때, 해당 악보에 대한 뮤직 재생 기능을 제공하여 비트(리듬)에 맞춰 악기 시연을 수행할 수 있으며, 각 각의 연주자들의 연주시 중요한 메트로놈(박자)을 맞추기 위해 통신 지연에 따른 시간 동기화 기능을 제공할 수 있다. 구체적으로, Host(팀리더)와 Client(팀원)의 각 사용자단말기는 통신망 통신상황에 따른 동기화 오차 가 발생하고, 이는 메트로놈 동기화시 비트(Beat) 불일치의 결과로 이어진다. 이를 해결하기 위하여 Host가 메트로놈 비트(Beat) 정보를 Client에 직접 전달하지 않고, 각 사용자단말기(10 0)별 표준시를 real-time clock으로 수신한 후 Host의 Beat 수신 시간과의 오차를 연산하고 이를 이용하여 역산 으로 비트 시간을 보정하는 방식으로 해결할 수 있다. 이를 위하여 음악 연주전 3초 정도의 Down-Counter 시간을 두고 이때 동기화 오차 보정 작업을 수행함이 바람직 하다. 또한, 악보관리부는 도 6을 참조하면, 디지털 악보에 필요한 메모를 기입할 수 있는 디지털 메모 기능을 제공할 수 있으며, 디지털 메모는 뮤직관리앱의 악보 위에 터치 방식 또는 키보드 입력에 의해 이루어질 수 있으며 해당 메모정보에 대해서 객체 인식 알고리즘 등을 활용하여 인식하고, Vector로 변환하여 디지털 악 보에 저장하여 관리할 수 있다. 또한 여기서 메모 동기화는 Host(팀리더)의 메모를 실시간으로 Client(팀원)의 사용자단말기에 표시 (Display)하는 기술로서, 각 사용자단말기별 화면 해상도(Resolution)의 차이로 동일한 위치에 표시 (Display)되지 않는 문제가 발생할 수 있으므로, 이를 해결하기 위하여 각 메모를 단위 그룹으로, 표시 위치를 전체 화면이 아닌 오선지 기준으로, 상대적 위치로 변환하여 저장하고 동기화를 구성할 수도 있다. 이때 Host의 화면 해상도(Resolution)정보도 함께 client와 동기화하여 각 Client의 해상도와 비율을 연산하여 상대적 위치를 보정함으로서 최적의 메모 동기화를 구성함이 바람직하다. 통계학습부는 수집된 악보정보, 디지털 악보, 개인정보, 결제정보(예 : 변환 수수료, 악보 구매), 이벤트 정보(데이터 송수신 정보) 등에 대해서 개인별로 통계자료를 생성하여 제공할 수 있으며, 구체적으로 악보 변환 내역, 디지털 악보 내역, 결제 내역, 악보 편집 내역, 악보 공유 내역 등을 제공받을 수 있으며, 인공지능 추천 학습 알고리즘 등을 기반으로 제공받은 악보정보를 토대로 추천할 음악이나 악보, 무료 악보 등에 대한 제안 서 비스를 제공할 수도 있다. 데이터베이스는 악보정보, 악보정보를 토대로 변환된 디지털 악보, 편집된 악보, 회원 로그인 인증을 위한 개인정보, 결제 수행시 결제 정보 등을 회원별로 저장하여 관리할 수 있다. 나아가 뮤직관리앱은 사용자단말기에서 상술한 관리서버의 세부 기능을 수행할 수 있도록 이미 지 학습 알고리즘 등이 내장된 제어부를 포함한 임베디드 형태로 구현될 수도 있으며, 앱자체가 스탠드 얼론 형 태로 상술한 기능이 소프트웨어 형태로 구현될 수도 있다. 도 4는 본 발명의 일 실시예에 따른 디지털 악보 관리 방법의 순서도이다. 먼저 사용자단말기에서 뮤직관리앱을 실행한다(S401). 실행된 뮤직관리앱은 관리서버에 악보정보를 제공하여 디지털 악보 변환 생성을 요청한다(S402). 관리서버 또는 뮤직관리앱은 사용자 요청된 악보정보를 토대로 디지털 악보 변환을 수행한다(S403). 변환이 모두 완료되면, 변환된 디지털 악보를 사용자단말기 화면에 출력하여 제공하고, 사용자단말기(10 0)는 제공받은 디지털 악보에 대한 편집 기능을 수행할 수 있다(S404). 또한 사용자 요청에 따라 디지털 악보에 대한 공유 서비스를 제공받아 적어도 하나 이상의 사용자단말기에 해당 디지털 악보를 제공하여 공유할 수 있다(S405). 또한 공유된 악보에 대해서 악보에 대한 뮤직 재생을 수행할 수 있으며, 악보 공유를 통하여 시연을 진행하는 경우, 악기 박자 동기화를 위해 통신 지연을 고려한 오차 보정을 통하여 메트로놈 동기화 기능을 제공한다 (S406). 나아가 본 발명의 디지털 악보 관리 방법은 컴퓨터와의 결합을 통해 실행시키기 위한 저장매체에 저장된 컴퓨터 프로그램으로 구현되거나, 이 컴퓨터 프로그램이 동작하는 컴퓨터 하드웨어(사용자단말기 등)에 탑재되는 모듈 형태로 구현될 수 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리, SSD(Solid State Drive) 등과 같은 프로 그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러 에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다."}
{"patent_id": "10-2021-0094743", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 디지털 악보 관리 시스템의 구성을 보인 블록도이다. 도 2는 도 1의 디지털 악보 관리 시스템의 세부 구성을 보인 블록도이다. 도 3은 도 2의 악보변환부의 세부 구성을 보인 블록도이다. 도 4는 본 발명의 일 실시예에 따른 디지털 악보 관리 방법의 순서도이다. 도 5는 뮤직관리앱을 통하여 디지털 악보 변환 과정 예시를 보여주는 도면이다. 도 6은 뮤직관리앱을 통하여 메모 편집 기능을 제공하는 예시를 보여주는 도면이다. 도 7은 디지털 악보 생성시 음표 구분 및 판단 과정을 설명한 예시를 보여주는 도면이다."}
