{"patent_id": "10-2019-0152709", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0063965", "출원번호": "10-2019-0152709", "발명의 명칭": "2차 전지의 성능 평가 지원 장치, 성능 평가 데이터 저장 및 분석 시스템 및 그의 이용 방법", "출원인": "(주)오렌지아이", "발명자": "이형진"}}
{"patent_id": "10-2019-0152709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "충방전기(cycler) 평가 장비를 이용하여 2차 전지의 성능을 평가하는 것을 지원하는 장치로서,평가 장비로부터의 단위별 검사 및 평가가 종료된 결과 데이터인 프로파일을 전송받는 프로파일 PC를 포함하며,상기 프로파일 PC는 상기 프로파일을 처리하는 에이전트 모듈을 더 포함하며,상기 에이전트 모듈은,상기 충방전기 평가 장비로부터 상기 프로파일을 전송받았는지의 여부를 확인하기 위해, 신규 파일 생성에 대해파일 생성 이벤트 정보를 감지하고, 당해 신규 생성 파일이 프로파일인지의 여부를 체크하고, 프로파일인 경우작업 리스트에 추가하는 데이터 모니터링 처리; 및상기 수신된 프로파일의 내용에 대해 파싱(parsing)을 행하고, 당해 프로파일의 형식이 표준화되어 있는지의 여부를 판단하여, 표준화되지 않은 것이면 당해 프로파일에 대해 표준화 변환을 행하고, 표준화되어 있는 것이면당해 프로파일을 외부의 타 장치에서 저장할 수 있도록 외부에 출력하는 데이터 저장 처리를 행하는 것을 특징으로 하는 2차 전지의 성능 평가 지원 장치."}
{"patent_id": "10-2019-0152709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 에이전트 모듈은,상기 외부의 타 장치에 출력할 데이터를 이용하여, 또는 상기 외부의 타 장치에 이미 출력되어 있는 데이터를당해 타 장치로부터 수신하여, 검사 및 평가의 타입을 분류하고, 상기 파싱된 프로파일에 대해 상기 분류된 타입별로 요약 알고리즘을 수행하고, 당해 프로파일의 요약된 데이터를 외부의 타 장치에서 저장할 수 있도록 외부에 출력하는 데이터 요약 처리를 추가로 행하며,상기 타입은 충전(charge), 방전(discharge), 레스트(rest) 중의 적어도 하나를 포함하는 것을 특징으로 하는 2차 전지의 성능 평가 지원 장치."}
{"patent_id": "10-2019-0152709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 데이터 저장 처리는, 상기 수신된 프로파일의 파일명에 대해 파싱(parsing)을 행하여, 평가 및 검사에 대한 기본 정보를 생성하고,상기 기본 정보를 조합한 데이터베이스 키 값을 생성하는 것을 더 포함하며,상기 기본 정보는 평가/검사명, 장비명, 채널, 스텝, 싸이클, 시간 중의 적어도 하나의 데이터를 포함하며,상기 데이터베이스 키 값은 상기 프로파일 내용과 연계되며 유니크하게 결정되는 것을 특징으로 하는 2차 전지의 성능 평가 지원 장치."}
{"patent_id": "10-2019-0152709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 에이전트 모듈은,싸이클을 구성하는 여러개의 스텝에 대한 요약 레코드값을 정상일 때와 비정상일 때를 딥러닝 학습하고, 당해 학습에 따라, 실시간 4개 스텝 요약이 끝나는 시점에서 상기 딥러닝 학습 결과를 프로세싱하여, 바로 해당공개특허 10-2021-0063965-3-싸이클에 오류가 있는지 검출하는 것을 특징으로 하는 2차 전지의 성능 평가 지원 장치."}
{"patent_id": "10-2019-0152709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 에이전트 모듈은,(a) 싸이클 평가가 정상 진행중인지 패턴 오류를 예측하는 딥러닝 학습을 행하고, (b) 소정의 갯수의 싸이클 요약이 끝나는 시점에서 상기 딥러닝 학습 결과를 프로세싱하여, 평가가 오류없이 제대로 실행되고 있는지 예측하며,상기 (a)는, 정상일 때의 연속된 '소정갯수-n'개 싸이클 요약을 입력하고, 정상일 때의 연속된 '소정갯수+n'개싸이클 요약을 출력으로 학습하여, 상기 차이인 '2n'개 싸이클에 대한 패턴에 대해 딥러닝 학습하여, 평가 오류예측 AI(인공지능)를 생성하고, 지금까지의 n개의 흐름에 대해, n+1번째, n+2번째, ..., n+n번째, 각각 진행시학습된 정답과 차이가 멀어지면 오류 예측 가능성이 높아지는 것이며, 상기 (b)는, 실시간 '소정갯수-n'개 싸이클 요약이 끝나는 시점에서, 오류 예측 AI를 프로세싱하는 것을 특징으로 하는 2차 전지의 성능 평가 지원 장치."}
{"patent_id": "10-2019-0152709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "2차 전지의 성능 평가 데이터 저장 및 분석 시스템으로서,제1항 내지 제5항 중 어느 한 항에 기재된 성능 평가 지원 장치로부터의 상기 외부 출력 데이터를 입력으로서수신하여, 복수의 평가 장비로부터의 평가 결과인 상기 프로파일을 통합적으로 수집 및 저장하는 통합 수집/저장 데이터베이스 서버;상기 통합 수집/저장 데이터베이스 서버로부터의 데이터를 입력으로서 수신하여, 당해 수신받은 데이터에 대해통계 처리를 행하는 데이터 분석 서버로서, 상기 통계 처리는 데이터 수집량, 데이터 기반 평가 장비 가동율,데이터 처리율 중의 적어도 하나에 대한 처리를 포함하는, 데이터 분석 서버; 및상기 데이터 분석 서버로부터의 데이터를 입력으로서 수신하여, 당해 수신받은 데이터에 대해 수집된 데이터의검색 기능 또는 데이터 시각화 기능을 제공하는 관리/시각화 서버를 포함하는 2차 전지의 성능 평가 데이터 저장 및 분석 시스템."}
{"patent_id": "10-2019-0152709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 데이터 분석 서버는,싸이클을 구성하는 여러개의 스텝에 대한 요약 레코드값을 정상일 때와 비정상일 때를 딥러닝 학습하고, 당해 학습에 따라, 실시간 4개 스텝 요약이 끝나는 시점에서 상기 딥러닝 학습 결과를 프로세싱하여, 바로 해당싸이클에 오류가 있는지 검출하는 것을 특징으로 하는 2차 전지의 성능 평가 데이터 저장 및 분석 시스템."}
{"patent_id": "10-2019-0152709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 데이터 분석 서버는,(a) 싸이클 평가가 정상 진행중인지 패턴 오류를 예측하는 딥러닝 학습을 행하고, (b) 소정의 갯수의 싸이클 요약이 끝나는 시점에서 상기 딥러닝 학습 결과를 프로세싱하여, 평가가 오류없이 제대로 실행되고 있는지 예측하며,상기 (a)는, STEP 1) 정상일 때의 연속된 '소정갯수-n'개 싸이클 요약을 입력하고, 정상일 때의 연속된 '소정갯수+n'개 싸이클 요약을 출력으로 학습하여, 상기 차이인 '2n'개 싸이클에 대한 패턴에 대해 딥러닝 학습하여,평가 오류 예측 AI(인공지능)를 생성하는 것을 특징으로 하는 2차 전지의 성능 평가 데이터 저장 및 분석 시스공개특허 10-2021-0063965-4-템."}
{"patent_id": "10-2019-0152709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항 내지 제5항 중 어느 한 항에 기재된 2차 전지의 성능 평가 지원 장치의 이용 방법으로서, 상기 충방전기 평가 장비로부터 상기 프로파일을 전송받았는지의 여부를 확인하기 위해, 신규 파일 생성에 대해파일 생성 이벤트 정보를 감지하고, 당해 신규 생성 파일이 프로파일인지의 여부를 체크하고, 프로파일인 경우작업 리스트에 추가하는 데이터 모니터링 처리 단계;상기 수신된 프로파일의 내용에 대해 파싱(parsing)을 행하고, 당해 프로파일의 형식이 표준화되어 있는지의 여부를 판단하여, 표준화되지 않은 것이면 당해 프로파일에 대해 표준화 변환을 행하고, 표준화되어 있는 것이면당해 프로파일을 외부의 타 장치에서 저장할 수 있도록 외부에 출력하는 데이터 저장 처리 단계; 및상기 외부의 타 장치에 출력할 데이터를 이용하여, 또는 상기 외부의 타 장치에 이미 출력되어 있는 데이터를당해 타 장치로부터 수신하여, 검사 및 평가의 타입을 분류하고, 상기 파싱된 프로파일에 대해 상기 분류된 타입별로 요약 알고리즘을 수행하고, 당해 프로파일의 요약된 데이터를 외부의 타 장치에서 저장할 수 있도록 외부에 출력하는 데이터 요약 처리 단계를 포함하는 것을 특징으로 하는 2차 전지의 성능 평가 지원 장치의 이용 방법."}
{"patent_id": "10-2019-0152709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제6항에 기재된 2차 전지의 성능 평가 데이터 저장 및 분석 시스템의 이용 방법으로서,상기 통합 수집/저장 데이터베이스 서버가, 상기 성능 평가 지원 장치로부터의 상기 외부 출력 데이터를 입력으로서 수신하여, 복수의 평가 장비로부터의 평가 결과인 상기 프로파일을 통합적으로 수집 및 저장하는 단계;상기 데이터 분석 서버가, 상기 통합 수집/저장 데이터베이스 서버로부터의 데이터를 입력으로서 수신하여, 당해 수신받은 데이터에 대해 통계 처리를 행하는 단계; 및상기 관리/시각화 서버가, 상기 데이터 분석 서버로부터의 데이터를 입력으로서 수신하여, 당해 수신받은 데이터에 대해 수집된 데이터의 검색 기능 또는 데이터 시각화 기능을 제공하는 단계를 포함하는 2차 전지의 성능 평가 데이터 저장 및 분석 시스템의 이용 방법."}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "충방전기(cycler) 평가 장비를 이용하여 2차 전지의 성능을 평가하는 것을 지원하는 장치가 제공된다. 이 장치 는 평가 장비로부터의 단위별 검사 및 평가가 종료된 결과 데이터인 프로파일을 전송받는 프로파일 PC를 포함하 며, 상기 프로파일 PC는 상기 프로파일을 처리하는 에이전트 모듈을 더 포함한다. 상기 에이전트 모듈은, 상기 충방전기 평가 장비로부터 상기 프로파일을 전송받았는지의 여부를 확인하는 데이터 모니터링 처리; 및 당해 프로파일의 형식이 표준화되어 있는지의 여부를 판단하여, 필요시 표준화를 행하고 당해 프로파일을 외부의 타 장치에서 저장할 수 있도록 외부에 출력하는 데이터 저장 처리를 행한다."}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 2차 전지의 성능 평가 지원 장치, 성능 평가 데이터 저장 및 분석 시스템 및 그의 이용 방법에 대한 것이다. 구체적으로는, 2차 전지 제조 산업 현장에서 제품의 개발 또는 제조 공정을 통해 제조된 제품에 대하 여, 연구/개발 또는 생산자가 충방전기 평가 장비를 통해 제품 성능을 평가하고 결과를 획득하기 위한 과정으로, 평가 결과 프로파일 수집/저장 프로세스 및 데이터 분석 프로세스를 포함하는 자동화된 시스템에 대 한 것이다."}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기존의 2차 전지 제조 산업 현장의 품질 평가 데이터 수집은, 평가자가 평가 장비의 시스템에 직접 접근하여 개 별적으로 평가 원본 데이터를 USB 등 이동 저장 매체 또는 네트워크 상의 공유 디렉토리 복사를 통해 원본 데이 터를 복사/획득하는 번거로움이 있어, 이를 해결하기 위한 방법이 필요하다."}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이는 여러 장비 제조사의 평가 장비를 사용하는 경우 제조사별로 데이터 인터페이스가 달라, 업무가 비효율적일 뿐만 아니라, 데이터가 표준화되어 있지 않아 데이터 해석시 오류를 범할 가능성이 존재하는 등 여러 어려움이 있어, 데이터의 표준화가 필요하다. 이를 위해, 2차 전지 품질 평가시 결과 데이터에 대한 표준화 항목을 제시하고, 이를 기반으로 표준화된 프로파 일을 생성하도록 가이드하여, 데이터의 자동 수집, 저장이 용이하도록 하는 것이 필요하다. 다수의 평가 장비에서 발생하는 데이터는 평가 방법에 따라 데이터 생성 개수와 용량이 다양하고, 생성 시간 등 도 다양하여, 이를 통합적으로 관리하기 위한 데이터 관리 시스템이 필요하다. 기존의 평가자들은 오프라인으로 수집한 원본 데이터에 대해 엑셀의 수식 또는 매크로 등을 이용하여 데이터의 분석 업무를 수행하는데, 이러한 원본 데이터의 양이 많을 경우 반복적인 분석 업무에 많은 비용과 시간을 소비"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "하게 되는 어려움 점이 있어, 자동화된 데이터 요약 및 분석에 대한 방법이 필요하다. 2차 전지를 위한 충방전기 평가는 충전, 방전 등의 평가 스텝(step)과 여러 스텝을 포함하는 싸이클(cycle) 등 의 단위로 구성되며, 이러한 다수의 시계열 기반 (time-series) 원본 파일을 연계하여 데이터 분석시, 데이터의 분리, 결합 등을 위한 전처리 작업에도 많은 시간이 소요된다. 이러한 데이터의 빠른 검색, 내용 확인 등의 내용 기반 업무 처리 프로세스가 필요하며, 데이터 편집 툴을 통해 데이터의 이동, 삭제, 분리, 결합 등의 기능 이 포함된 소프트웨어 기능이 필요하다."}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 의하면, 충방전기(cycler) 평가 장비를 이용하여 2차 전지의 성능을 평가하는 것을 지원하는 장치로 서, 평가 장비로부터의 단위별 검사 및 평가가 종료된 결과 데이터인 프로파일을 전송받는 프로파일 PC를 포함 하며, 상기 프로파일 PC는 상기 프로파일을 처리하는 에이전트 모듈을 더 포함하며, 상기 에이전트 모듈은, 상 기 충방전기 평가 장비로부터 상기 프로파일을 전송받았는지의 여부를 확인하기 위해, 신규 파일 생성에 대해 파일 생성 이벤트 정보를 감지하고, 당해 신규 생성 파일이 프로파일인지의 여부를 체크하고, 프로파일인 경우 작업 리스트에 추가하는 데이터 모니터링 처리; 및 상기 수신된 프로파일의 내용에 대해 파싱(parsing)을 행하 고, 당해 프로파일의 형식이 표준화되어 있는지의 여부를 판단하여, 표준화되지 않은 것이면 당해 프로파일에 대해 표준화 변환을 행하고, 표준화되어 있는 것이면 당해 프로파일을 외부의 타 장치에서 저장할 수 있도록 외 부에 출력하는 데이터 저장 처리를 행하는 것을 특징으로 하는 2차 전지의 성능 평가 지원 장치가 제공된다. 바람직하게는, 상기 에이전트 모듈은, 상기 외부의 타 장치에 출력할 데이터를 이용하여, 또는 상기 외부의 타 장치에 이미 출력되어 있는 데이터를 당해 타 장치로부터 수신하여, 검사 및 평가의 타입을 분류하고, 상기 파"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "싱된 프로파일에 대해 상기 분류된 타입별로 요약 알고리즘을 수행하고, 당해 프로파일의 요약된 데이터를 외부"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 3, "content": "의 타 장치에서 저장할 수 있도록 외부에 출력하는 데이터 요약 처리를 추가로 행하며, 상기 타입은 충전 (charge), 방전(discharge), 레스트(rest) 중의 적어도 하나를 포함한다. 바람직하게는, 상기 데이터 저장 처리는, 상기 수신된 프로파일의 파일명에 대해 파싱(parsing)을 행하여, 평가 및 검사에 대한 기본 정보를 생성하고, 상기 기본 정보를 조합한 데이터베이스 키 값을 생성하는 것을 더 포함 하며, 상기 기본 정보는 평가/검사명, 장비명, 채널, 스텝, 싸이클, 시간 중의 적어도 하나의 데이터를 포함하 며, 상기 데이터베이스 키 값은 상기 프로파일 내용과 연계되며 유니크하게 결정된다."}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 4, "content": "바람직하게는, 상기 에이전트 모듈은, 싸이클을 구성하는 여러개의 스텝에 대한 요약 레코드값을 정상일 때와"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 5, "content": "비정상일 때를 딥러닝 학습하고, 당해 학습에 따라, 실시간 4개 스텝 요약이 끝나는 시점에서 상기 딥러닝 학습 결과를 프로세싱하여, 바로 해당 싸이클에 오류가 있는지 검출한다. 바람직하게는, 상기 에이전트 모듈은, (a) 싸이클 평가가 정상 진행중인지 패턴 오류를 예측하는 딥러닝 학습을"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 6, "content": "행하고, (b) 소정의 갯수의 싸이클 요약이 끝나는 시점에서 상기 딥러닝 학습 결과를 프로세싱하여, 평가가 오"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 7, "content": "류없이 제대로 실행되고 있는지 예측하며, 상기 (a)는, 정상일 때의 연속된 '소정갯수-n'개 싸이클 요약을 입력"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 8, "content": "하고, 정상일 때의 연속된 '소정갯수+n'개 싸이클 요약을 출력으로 학습하여, 상기 차이인 '2n'개 싸이클에 대 한 패턴에 대해 딥러닝 학습하여, 평가 오류 예측 AI(인공지능)를 생성하고, 지금까지의 n개의 흐름에 대해, n+1번째, n+2번째, ..., n+n번째, 각각 진행시 학습된 정답과 차이가 멀어지면 오류 예측 가능성이 높아지는 것"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 9, "content": "이며, 상기 (b)는, 실시간 '소정갯수-n'개 싸이클 요약이 끝나는 시점에서, 오류 예측 AI를 프로세싱한다. 본 발명에 의하면, 2차 전지의 성능 평가 데이터 저장 및 분석 시스템으로서, 전술의 성능 평가 지원 장치로부 터의 상기 외부 출력 데이터를 입력으로서 수신하여, 복수의 평가 장비로부터의 평가 결과인 상기 프로파일을 통합적으로 수집 및 저장하는 통합 수집/저장 데이터베이스 서버; 상기 통합 수집/저장 데이터베이스 서버로부 터의 데이터를 입력으로서 수신하여, 당해 수신받은 데이터에 대해 통계 처리를 행하는 데이터 분석 서버로서, 상기 통계 처리는 데이터 수집량, 데이터 기반 평가 장비 가동율, 데이터 처리율 중의 적어도 하나에 대한 처리 를 포함하는, 데이터 분석 서버; 및 상기 데이터 분석 서버로부터의 데이터를 입력으로서 수신하여, 당해 수신받은 데이터에 대해 수집된 데이터의 검색 기능 또는 데이터 시각화 기능을 제공하는 관리/시각화 서버를 포함 하는 2차 전지의 성능 평가 데이터 저장 및 분석 시스템이 제공된다."}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 10, "content": "바람직하게는, 상기 데이터 분석 서버는, 싸이클을 구성하는 여러개의 스텝에 대한 요약 레코드값을 정상일 때"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 11, "content": "와 비정상일 때를 딥러닝 학습하고, 당해 학습에 따라, 실시간 4개 스텝 요약이 끝나는 시점에서 상기 딥러닝 학습 결과를 프로세싱하여, 바로 해당 싸이클에 오류가 있는지 검출한다. 바람직하게는, 상기 데이터 분석 서버는, (a) 싸이클 평가가 정상 진행중인지 패턴 오류를 예측하는 딥러닝 학"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 12, "content": "습을 행하고, (b) 소정의 갯수의 싸이클 요약이 끝나는 시점에서 상기 딥러닝 학습 결과를 프로세싱하여, 평가 가 오류없이 제대로 실행되고 있는지 예측하며, 상기 (a)는, STEP 1) 정상일 때의 연속된 '소정갯수-n'개 싸이"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 13, "content": "클 요약을 입력하고, 정상일 때의 연속된 '소정갯수+n'개 싸이클 요약을 출력으로 학습하여, 상기 차이인 '2n' 개 싸이클에 대한 패턴에 대해 딥러닝 학습하여, 평가 오류 예측 AI(인공지능)를 생성한다. 본 발명에 의하면, 전술한 2차 전지의 성능 평가 지원 장치의 이용 방법으로서, 상기 충방전기 평가 장비로부터 상기 프로파일을 전송받았는지의 여부를 확인하기 위해, 신규 파일 생성에 대해 파일 생성 이벤트 정보를 감지 하고, 당해 신규 생성 파일이 프로파일인지의 여부를 체크하고, 프로파일인 경우 작업 리스트에 추가하는 데이 터 모니터링 처리 단계; 상기 수신된 프로파일의 내용에 대해 파싱(parsing)을 행하고, 당해 프로파일의 형식이 표준화되어 있는지의 여부를 판단하여, 표준화되지 않은 것이면 당해 프로파일에 대해 표준화 변환을 행하고, 표준화되어 있는 것이면 당해 프로파일을 외부의 타 장치에서 저장할 수 있도록 외부에 출력하는 데이터 저장 처리 단계; 및 상기 외부의 타 장치에 출력할 데이터를 이용하여, 또는 상기 외부의 타 장치에 이미 출력되어 있는 데이터를 당해 타 장치로부터 수신하여, 검사 및 평가의 타입을 분류하고, 상기 파싱된 프로파일에 대해"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 14, "content": "상기 분류된 타입별로 요약 알고리즘을 수행하고, 당해 프로파일의 요약된 데이터를 외부의 타 장치에서 저장할"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 15, "content": "수 있도록 외부에 출력하는 데이터 요약 처리 단계를 포함하는 것을 특징으로 하는 2차 전지의 성능 평가 지원 장치의 이용 방법이 제공된다. 본 발명에 의하면, 전술한 2차 전지의 성능 평가 데이터 저장 및 분석 시스템의 이용 방법으로서, 상기 통합 수 집/저장 데이터베이스 서버가, 상기 성능 평가 지원 장치로부터의 상기 외부 출력 데이터를 입력으로서 수신하 여, 복수의 평가 장비로부터의 평가 결과인 상기 프로파일을 통합적으로 수집 및 저장하는 단계; 상기 데이터 분석 서버가, 상기 통합 수집/저장 데이터베이스 서버로부터의 데이터를 입력으로서 수신하여, 당해 수신받은 데이터에 대해 통계 처리를 행하는 단계; 및 상기 관리/시각화 서버가, 상기 데이터 분석 서버로부터의 데이터 를 입력으로서 수신하여, 당해 수신받은 데이터에 대해 수집된 데이터의 검색 기능 또는 데이터 시각화 기능을 제공하는 단계를 포함하는 2차 전지의 성능 평가 데이터 저장 및 분석 시스템의 이용 방법이 제공된다."}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이러한 평가 장비의 결과 데이터 수집, 저장, 분석, 시각화 등 일련의 과정을 온라인 시스템화하고, 다수의 장 비 연계를 위한 데이터 표준화를 진행한다면, 기존 연구/개발자 또는 생산자 들의 업무 효율과 정확성 등의 향 상에 기여할 것으로 생각한다."}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "다른 다양한 형태로 구현될 것이며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하며, 본 발명이 속하는기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 도 1은 본 발명에 따른 시스템의 구성을 간략히 나타내는 구성도이다. 평가장비 폐쇄망은 기존의 평가장비들(110, 120, 130)이 존재하는 네트워크로, 평가데이터 자동 저장/분석 시스템과 연동하는 구성이며, 평가장비 1개(110, 120, 130의 각각)에는 평가를 위한 다수의 슬롯(이를 채 널이나 셀이라고도 함, 일예로 슬롯은 128개일 수 있음)이 존재하며, 평가장비(110, 120, 130의 각각) 당 컨트 롤 PC가 예컨대 1개씩(각각 210, 220, 230) 존재하고, 이러한 다수의 평가장비(110, 120, 130)로부터 생성되는 측정 데이터는 컨트롤 PC(210, 220, 230)를 통해 프로파일 PC(310, 320)로 전달되는 구조를 갖는다. 참고로, 프로파일 PC(310, 320)는 청구항에서 '2차 전지의 성능 평가 지원 장치'로 표현되는 경우도 있다. 다만, 컨트롤 PC(210~230)는 평가장비(110~130)로부터의 평가 정보(프로파일, 원본 프로파일, 프로파일 원본이 라고도 칭함)를 전달함에 있어서 매개 역할을 하는 것이므로, 굳이 컨트롤 PC를 기재하지 않고, 도 1에서, 평가 장비(110~130)로부터 프로파일 PC(310, 320)으로 평가 정보가 전달된다고 표현하여도 무방할 것이다. 즉, 후 술할 도 2에서와 같이, 컨트롤 PC가 생략되거나 또는 평가/검사 장비(110', 120')에 컨트롤 PC가 포함되거나 또 는 적어도 그 기능이 포함되었다고 볼 수도 있다. 본 발명에 있어 데이터 수집의 시작은, 프로파일 PC(310, 320)에 전달되는 평가 원본 프로파일에 대해 데이터 수집 에이전트 소프트웨어 모듈(또는 에이젠트 모듈이라고도 함, 도 1에 기재된 '에이전트 S/W'에 해당)이 담당 해서 통합 수집/저장 데이터베이스에 적재하는 구조이며, 이러한 에이전트 소프트웨어(에이전트 S/W)와 저 장 서버는 다(多):1 관계를 가질 수 있다. 도 1에는 일예로 에이전트 S/W와 저장 서버가 2:1인 것이 도 시되어 있으나 이에 한정되는 것은 아니다. 프로파일 PC(310, 320)의 에이전트 S/W(에이전트 소프트웨어 모듈)는 데이터 모니터링 프로세스, 데이터 수집"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "프로세스, 데이터 요약 프로세스 등의 기능을 하여, 평가 원본 데이터 저장, 요약 데이터 저장 등을 수행한다. 이렇게 저장된 데이터를 이용해서 데이터 수집 현황 분석 프로세스, 데이터 검색 프로세스, 데이터 편집 프로세 스 등을 데이터 분석 서버를 통해 수행한다. 사용자의 요청에 의한 데이터 차트, 데이터 테이블 등의 시각화 출력 및 시스템 관리 업무 로직 등은 관리/시각 화 서버를 통해 수행한다. 이하, 도 1을 참조하여 더욱 상세히 설명한다. 평가장비 1-1, 평가장비 1-2, 평가장비 #1-3과 같이 복수의 평가장비가 도시되어 있다. 이들 평가장비(110, 120, 130)는 2차 전지의 충전과 방전의 성능을 시험 및 평가하는 장비이다. 평가장비끼리 명확 히 구분이 필요한 경우는 평가장비 1-1, 평가장비 1-2, 평가장비 1-3으로 표시하고, 어느 평가장비라도 무방한 경우는 단순히 평가장비라고만 기재할 수도 있다. 이하 설명할 컨트롤 PC 1-1, 1-2, 1-3, 프로파일 PC 1, 2 등에 대해서도 동일하다. 도 1에는 3개의 평가장비(110, 120, 130)만이 도시되어 있으나, 도 1에 \"확장\"이라고 표시된 바와 같이, 또다른 평가장비가 추가로 존재할 수 있다. 일반화하면, N개의 평가장비가 존재하는 것으로 볼 수 있을 것이다. 각각의 평가장비(110, 120, 130)는 각각 대응되는 컨트롤 PC(210, 220, 230)를 갖는다. 예컨대, 평가장비 1- 1에는 컨트롤 PC 1-1이 매칭되어 있고, 평가장비 1-2에는 컨트롤 PC 1-2가 매칭되어 있고, 평가장비 1-3에는 컨트롤 PC 1-3이 매칭되어 있다. 이들 컨트롤 PC(210, 220, 230)는 프로파일 PC 1에 프로파일을 전달한다. 여기서, 프로파일이란, 정해진 스케줄에 따라 단위별 검사/평가가 종료된 결과를 말한다. 달리 표현하면, 프로파일이란, 평가장비의 충방전 기(cycler)를 통해 나오는 다채널의 평가결과 원본 파일을 말한다. 도 1에서는 평가장비(110, 120, 130)의 컨트롤 PC(210, 220, 230)가 프로파일 PC 1에 연결된 것이 일예로 서 도시되어 있으나, 평가장비(110, 120, 130) 외에도 미도시의 다른 평가장비가 존재할 수 있고, 당해 미도시 의 다른 평가장비는 프로파일 PC 2에 연결되어 있을 수 있다. 그리고, 미도시의 또다른 평가장비가 미도 시의 다른 프로파일 PC에 연결되어 있을 수 있다. 그리고, 프로파일 PC 1, 프로파일 PC 2로부터의 데이터는 데이터베이스(410; 통합 수집/저장 DB 서버)에 저장될 수 있다. 물론 다른 프로파일 PC가 더 존재한다면, 프로파일 PC 1, 프로파일 PC 2뿐만 아니라 당해 다른 프로파일 PC로부터의 데이터도 또한 데이터베이스에 전달될 수 있음은 물론이다. 이는 평가장비 1-3 및 컨트롤 PC 1-3 아래에 \"확장\"이라고 표시된 것 및 프로파일 PC 2 아래에 \"확장\"이라고 표시된 것으로부터도 이해될 수 있을 것이다. 그리고, 3개의 평가장비(110, 120, 130)가 하나의 프로파일 PC에 대응되어 있으나, 이는 일예이고 이에 한 정되는 것은 아니다. 각각의 프로파일 PC(310, 320)에는 에이전트 소프트웨어(S/W)가 설치되어 있고, 이를 프로파일 PC에서의 에이전 트 소프트웨어 모듈이라 부를 수 있다. 이 에이전트 소프트웨어는 데이터 모니터링, 데이터 저장 처리, 데이"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "터 요약 처리를 행할 수 있으며, 이들 각각의 상세에 대해서는 후술하기로 한다. 평가장비(110~130), 컨트롤 PC(210~230), 프로파일 PC(310, 320) 등을 통틀어 평가설비 폐쇄망에 포함되 는 것으로 볼 수 있다."}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "프로파일 PC(310, 320)로부터의 데이터(예컨대, 프로파일 원본 데이터 또는 프로파일 요약 데이터)는 평가 데이 터 자동 저장/분석 시스템으로 송신된다. 평가 데이터 자동 저장/분석 시스템은, 도 1에 도시된 바 와 같이, 통합 수집/저장 DB 서버, 데이터 분석 WAS 서버, 관리/시각화 WEB 서버를 포함한다. 이들 각각의 서버(410, 420, 430)의 구성 및 기능에 대해서는 후술하기로 한다. 평가 데이터 자동 저장/분석 시스템으로부터의 데이터(평가 결과 데이터)는 사용자 PC 1, 사용자 PC, 사용자 PC으로 송신된다. 이들 사용자 PC(510~530)는 개발/제조 평가 업무망에 포함되는 것으로 볼 수 있다. 도 1에서 사용자 PC 아래에 \"확장\"이라고 기재된 것으로부터도 알 수 있듯이, 사용자 PC는 3개에 한정되는 것은 아니며, 필요한 갯수만큼의 사용자 PC가 추가로 존재할 수 있다. 도 2는 데이터의 생성 및 저장의 흐름을 간략히 나타내는 도면이다. 도 1에 도시된 평가장비 1-1 및 컨트롤 PC 1-1을 편의상 도 2에서는 평가/검사 장비 1(110')로 나타 낸다. 마찬가지로, 도 1에 도시된 평가장비 1-2 및 컨트롤 PC 1-2를 편의상 도 2에서는 평가/검사 장비 2(120')로 나타낸다. 평가/검사 장비(110', 120') 각각에 따른 스케줄에 의해 단위별 평가/검사가 종료된 결과는 '프로파일' 이라 하 며, 지정된 프로파일 PC(310, 320)에 전송된다. 이 때, 평가/검사 장비(110', 120')와 프로파일 PC의 관계는 N:1(도 1의 예에서는 3:1, 도 2의 예에서는 2:1)이며, 1개의 평가/검사 장비는 M개의 평가/검사 채널을 갖는다. 즉, 프로파일 PC(310, 320)에 전송되는 프로파일은 매 수초, 수분마다 최대 M×N개 프로파일이 생성된다. 평가/검사 스케줄은 사용방법에 따라 다양 하기 때문에, 프로파일의 생성 주기는 비선형이 된다. 따라서, 프로파일이 생성되는지에 대한 파일 모니터링 을 통해 데이터를 수집하게 된다. 먼저, 데이터 생성에 대해 살펴보면 다음과 같다. [데이터 생성] STEP 1) N개의 평가/검사 장비(110', 120')가 1개의 프로파일 PC에 연결된다(1개의 평가/검사 장비(110') 내부에는 M개의 평가/검사 채널이 존재한다). STEP 2) 스케줄에 의해 평가/검사를 진행한다. STEP 3) 단위별 평가/검사 결과를 프로파일 PC에 송신한다(예컨대, 수초, 수분 간격) STEP 4) 지정된 여러 개의 단위별 평가/검사가 완료되어야 1번의 검사가 끝난다. SETP 5) 이러한 검사를 수십, 수백번 반복한다. 즉, 도 1 또는 도 2에 나타나는 바와 같이, 평가/검사 장비(110', 120')에 의해 평가/검사가 행해지고 평가 결 과 데이터(프로파일)가 생성된다. 그리고, 도 1, 도 2의 프로파일 PC(310, 320)에서는 이하의 데이터 모니터링 및 데이터 처리(데이터 저장 처리"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "및 데이터 요약 처리)를 행한다.도 3은 프로파일 PC(310, 320)가 행하는 데이터 모니터링의 흐름을 나타내는 도면이다. [데이터 모니터링] STEP 1) 전술(상기 [데이터 생성]의 STEP 3 참조)한 바와 같이, 평가/검사 장비(110', 120')에서 프로파일 PC로 프로파일을 송신한다(단계 3010). STEP 2) 신규 생성 파일에 대해 '파일 생성' 이벤트 정보를 시스템으로부터 통지 받는다(단계 3020, 3030, 3040). STEP 3) 파일 정보를 필터링하여, 해당 파일이 프로파일인지 체크한다(단계 3050). STEP 4) 파일 위치와 파일명 정보를 작업 리스트에 추가한다(단계 3060). STEP 5) 작업 리스트에 추가된 데이터에 대해 주기적으로 데이터 처리를 진행한다(단계 3070). 상기 STEP 2)에서 시스템으로부터 통지받는다는 것은, 예컨대, 프로파일 PC 자체의 프로파일 PC(310, 320) 자체 의 파일 처리 시스템으로부터 통지받는다(프로파일 PC가 자체적으로 검지한다)는 것일 수 있다. 예를 들면, 윈도우 OS, 또는 리눅스 OS 등에서 제공되는 자체 파일시스템의 파일 생성, 변경, 삭제 등의 이벤트를 수신받을 수 있다. 또한, 이러한 시스템은 모니터링 대상 파일의 개수가 많거나, 빈번하거나, 탐색의 깊이가 깊거나(트 리 구조에서 생각하면 하위 노드가 깊은 경우) 하면, 시스템 부하가 커져서, 프로파일 PC(310, 320)의 처리가 실시간이 되기 어려워질 수도 있으므로(단일 모니터링 프로세스 로직), 이를 해결하기 위해, 모니터링 대상의 노드를 여러개로 분할하여 처리할 수 있는(즉, 부하 분산) 다중 스레드, 다중 코어 방식의 처리를 통해, 시스템 자원을 효과적으로 극대화하여 사용할 수 있다."}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "상기 STEP 5)에서의 데이터 처리라 함은, 예컨대 데이터 저장 처리(단계 3080) 및 데이터 요약 처리(단계 309 0)를 포함할 수 있으며, 그 상세는 후술하는 바와 같다. 도 4는 데이터 저장 처리를 상세히 설명하기 위한 도면이다. [데이터 저장 처리] 이 데이터 저장 처리는 도 3의 데이터 처리(단계 3070)의 일예로서 도 3에서 데이터 저장 처리(단계 3080)으로 표시되어 있다. 그 상세는 아래와 같다. STEP 1) 프로파일 파일명에 대해 데이터 파싱을 수행한다(단계 4010). STEP 2) 평가/검사명, 장비명, 채널, Step, Cycle, 시간 등의 평가/검사 기본 정보를 생성한다(단계 4020, 4030). STEP 3) 기본 정보를 조합한 데이터베이스 키 값을 생성한다(단계 4040). STEP 4) 프로파일 파일 내용 파싱을 수행한다(단계 4050). STEP 5) 파일 내용 원본에 대하여 표준화 변환을 수행한다(단계 4060, 4070). STEP 6) 데이터베이스에 저장한다(단계 4080). 상기 STEP 3)에서, 파일명 파싱을 통해, 데이터베이스 키값을 생성하며, 이는 프로파일 내용(원본)과 연계되어 저장된다. 빅데이터를 처리함에 있어, 이러한 키값의 설정은, 빠른 검색 및 저장 효율화 등을 수행할 수 있게 한다. 파일명 파싱을 통해 유니크한 조합을 만들기 위해, 예컨대, 장비업체코드, 장비ID, 장비 내(內) 채널 ID, 검사명, 시료번호, 스텝번호, 싸이클번호 등을 조합하면, 해당 검사/평가 파일의 유니크한 키값을 만들 수 있다. 상기 STEP 5)에서 표준화 변환을 행하고 있음을 볼 수 있다. 이와 관련하여, 도 1의 컨트롤 PC(210, 220, 230)에서 프로파일 PC(310, 320)로 프로파일을 전송하는데, 도 1에서 \"표준화된 프로파일\"을 전송한다고 기재되 어 있다. 당해 기재와 같이 표준화된 프로파일을 전송하는 것이 바람직하지만, 상황에 따라서는 당해 도 1에 기재된 바와 같은 \"표준화된 프로파일\"이 아니라 단지 \"(장비마다 다소 상이할 수 있는 형식의) 프로파일\"이 전 송되는 경우도 있을 수 있다. 이와 관련하여서는 하기의 , 와 같이 두 가지의 경우를 나누어서 처리할 수 있다. 표준화된 프로파일에 대해서는 본 발명의 통상의 로직으로 처리한다. 즉, 본 발명의 시스템이, 도 1의 컨 트롤 PC(210, 220, 230)에서 프로파일 PC(310, 320)로 전송된 프로파일이 표준화된 것이라고 판단하면, 표준 프"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "로파일 ⇒ 프로파일 파싱(단계 4050 등) (⇒ 필요시 또는 선택적으로, 도 5에서 후술할 프로파일 요약) ⇒ 저장 (단계 4080, 5040 등)의 절차를 거친다. 표준화되지 않은 프로파일에 대해서는 표준화 변환 후 본 발명의 통상의 로직으로 처리한다. 즉, 본 발명 의 시스템이, 도 1의 컨트롤 PC(210, 220, 230)에서 프로파일 PC(310, 320)로 전송된 프로파일이 표준화되지 않 은 것이라고 판단하면, 비표준 프로파일 ⇒ 표준화 변환(단계 4070 등) ⇒ 프로파일 파싱(단계 4050 등) (⇒ 필"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "요시 또는 선택적으로, 도 5에서 후술할 프로파일 요약) ⇒ 저장(단계 4080, 5040 등)의 절차를 거친다. 또한, 도 4에 나타난 바와 같이 단계 4010~4040과 단계 4050~4070은 병행하여 진행될 수 있다. 도 4에서 단계 4090은 프로파일 내용(파일 내용)의 매 행을 처리함을 의미한다. 즉, 마지막 행이면 처리가 완 료되는 것이고, 마지막 행이 아니면 단계 4050으로 돌아가서 (마지막 행이 될 때까지) 처리를 반복한다는 의미 이다."}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 10, "content": "도 5는 데이터 요약 처리를 상세히 설명하기 위한 도면이다."}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "[데이터 요약 처리]"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "이 데이터 요약 처리는 도 3의 데이터 처리(단계 3070)의 일예로서 도 3에서 데이터 요약 처리(단계 3090)으로 표시되어 있다. 그 상세는 아래와 같다. STEP 1) 데이터 원본을 입력한다(단계 5010). STEP 2) 검사/평가 타입을 분류한다(단계 5020)."}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "STEP 3) 타입에 맞는 요약 알고리즘을 수행한다(단계 5031, 5032, 5033). STEP 4) 데이터베이스에 저장한다(단계 5040). STEP 5) 데이터 원본의 처음 행부터 마지막 행까지 이동하면서 위 STEP 2~STEP 4를 반복한다(단계 5050). 상기 STEP 1)에서 데이터 원본이라 함은 도 4([데이터 저장 처리]의 설명)의 단계 4080에서 파싱되어 데이터베 이스에 저장된 것을 말한다. 즉, 데이터베이스의 레코드가 데이터 원본이라고 볼 수 있다. 상기 STEP 2), STEP 3)에서 타입(평가 타입)은 예컨대, 도 5에 기재된 charge(충전), discharge(방전), rest"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 14, "content": "(레스트(휴지))이다. 이러한 타입에 따라서 요약 알고리즘을 달리한다. 상기 charge, discharge, rest의 1회씩(내지 적은 횟수)의 테스트는 step(또는 step summary)이며, 여러개의 step이 모이면 cycle(또는 cycle summary)이 된다. 도 4의 단계 4080와 도 5의 단계 5040에서 데이터베이스에 저장하는 동작을 행한 바 있다. 이때의 데이터베이 스는 도 1 또는 도 2의 데이터베이스(410; 통합 수집/저장 DB 서버)에 해당한다."}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 15, "content": "앞에서는 프로파일 PC(310, 320)가 데이터 요약 처리를 행하는 것으로 설명하였으나, 실시예에 따라서는 프로파 일 PC(310, 320)는 도 4에 나타난 데이터 저장 처리만을 행하고, 당해 처리에 의해 데이터베이스에 저장된"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 16, "content": "프로파일을 이용하여 데이터 분석 WAS 서버가 데이터 요약 처리를 행하여 당해 요약 데이터가 데이터베이 스에 저장되는 것도 가능하다. 본 발명에 따른 동작을 가장 개괄적으로 나타내는 도 1로 다시 돌아가서 설명한다. 도 1에서, 다수의 충방전기 평가 장비(110~130)로부터 생성되는 평가결과 파일 데이터를 수집함에 있어, 서버- 클라이언트 통신기반의 소프트웨어를 통해 자동으로 데이터를 통합 수집하며, 원본 파일 및 파일 내용에 대해 데이터베이스에 실시간으로 자동 저장한다."}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 17, "content": "평가결과 원본 데이터는 데이터 요약 프로세스(단계 3090, 단계 5010~5050)를 통해, 다수의 요약 항목으로 데이"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 18, "content": "터가 가공되며, 평가의 스텝(Step), 싸이클(Cycle) 단위로 요약/저장된다. 도 1에서, 데이터 분석 WAS(Web Application Server) 서버에서의 데이터 통계 프로세스를 통해, 데이터 수집양, 데이터 기반 평가장비 가동율, 데이터 처리율 등 데이터 처리에 대한 통계 기반 분석을 수행하여 결과 를 저장한다. 이 결과의 저장은 다시 데이터베이스에 행해질 수 있다. 도 1에서, 관리/시각화 WEB 서버에서, 수집데이터 현황, 장비 현황, 수집 프로세스 상태 정보 등 시스템 관리를 위한 대시보드 형태의 시각화 소프트웨어를 사용자 PC(510~530)를 통해 제공한다. 도 1에서, 관리/시각화 WEB 서버에서, 수집데이터의 검색 방법, 결과 데이터 뷰, 데이터 항목의 X축, Y축 선택을 통한 차트 그래프 등의 데이터 시각화 화면 등을 소프트웨어를 통해 제공한다."}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 19, "content": "본 발명의 시스템(100, 400, 500)을 통해 사용자는 평가 결과 원본에 대한 데이터 자동 수집 결과 제공 및 요약"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 20, "content": "알고리즘에 의한 자동 요약 데이터 제공, 사용자 정의에 따른 다양한 데이터 시각화 결과 등을 제공받아, 제조 제품의 평가 측정 및 품질 결과 판단을 위한 시스템으로 사용 가능하다. 본 발명에 의하면, 기존의 2차 전지 개발/제조 현장에서 제품의 평가데이터를 이용하기 위한 절차상의 번거로움 과 어려움, 데이터가 공유되지 못해 기업의 생산성이 하락하는 문제 등에 대해, 이러한 문제를 데이터의 저장, 활용 관점에서 접근하여, 데이터 수집, 저장, 분석, 시각화 등의 자동화된 시스템(100, 400, 500)을 구성하며, 이를 통해 업무의 효율화를 이루기 위한 시스템 및 관련 방법이 제공된다. 구체적으로, 기존에 오프라인에서 평가장비 데이터를 사용하던 평가자들을 위해, 평가결과 원본파일의 수집 및 저장, 분석 등을 자동으로 수행하는 시스템이 제공된다. 도 1에서, 본 발명의 시스템은 충방전기(Cycler; 110~130(평가 장비))를 통해 나오는 다채널의 평가결과 원본파 일(프로파일)이 저장되는 '프로파일 PC(310, 320)' 에서, 데이터를 실시간 수집하는 에이전트 소프트웨어 모듈 (에이전트 S/W)과, 통합 데이터 저장을 위한 데이터베이스 서버, 데이터 분석 알고리즘이 포함된 데이터 분석 WAS (Web Application Server) 서버, 데이터 원본 및 분석 결과 시각화 등의 서비스를 위한 서비스 WEB 서버 등으로 구성된다. 도 1에서, 평가 장비(110~130)인 충방전기(110~130)를 공급하는 다수 장비 업체는 독자적인 데이터 포맷과 항목 들을 가지고있다. 이러한 서로 다른 데이터를 수집하기 위해, 표준화된 평가항목을 설계하고 프로토콜을 정의 하여 서로 다른 장비 업체들도 표준화된 평가결과 원본을 생성하도록 한다. 표준화된 평가 항목은, 시간순에 의한 순차번호, 측정 시간, 반복 측정 번호, 측정 타입 구분, 측정값 1, 측정 값 2, …, 측정값 n 등으로 구성한다. 도 1에서, 프로파일 PC(310, 320)에서, 데이터 수집을 위한 에이전트 소프트웨어 모듈(에이전트 S/W)의 실시간 파일 모니터링 기능은, 원본 프로파일 데이터가 모이는 특정 디렉토리 및 하위 디렉토리를 실시간 감시하는 프 로세스이며, 신규로 생성되고 있는 프로파일 데이터의 파일 리스트를 구성한다. 도 1에서, 에이전트 소프트웨어 모듈(에이전트 S/W)의 태스크는 생성된 파일리스트를 주기적으로 읽어와서, 표 준화된 형태의 파일명 파싱을 통해 기본적인 데이터 정보를 획득하고 메모리에 저장한다. 또한 위 파일리스트의 파일들을 순차적으로 접근하여, 해당 파일의 내용을 오픈하고 내용을 표준화된 프로토콜 에 맞게 파싱한다. 여기서 파일의 내용은 평가 결과 원본 내용을 뜻한다. 평가 결과 파일의 내용은 시간순에 따른 해당 측정/검사의 결과값이며, 적게는 수 초에서 많게는 수 일의 시간 만큼 데이터가 기록되어 있고, 평가 결과 저장 프로세스는 이러한 데이터를 데이터베이스에 저장한다."}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 21, "content": "결과 원본의 시계열 데이터는 세밀한 데이터 분석을 위해 필요하지만, 일반적인 분석에서는 데이터의 요약을 필"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 22, "content": "요로 하게 되며, 평가 결과 요약 프로세스(도 3의 단계 3090, 도 5 참조)는 이러한 원본 데이터에 대한 표준화"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 23, "content": "된 요약을 계산하는 알고리즘 뿐만 아니라, 연구/개발자만의 개인화된 요약 알고리즘 등의 적용을 통해 결과를 생성하고 데이터베이스에 저장한다."}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 24, "content": "저장된 원본 데이터(도 3의 단계 3080, 도 4 참조)와 요약 분석 결과 데이터(도 3의 단계 3090, 도 5 참조)는 시각화 프로세스를 통해 사용자에게 전달된다. 도 1에서, 관리/시각화 WEB 서버는, 일별 데이터 수집 현황, 수집 소프트웨어 모듈 현황, 평가장비 현황 등에 대한 정보를 평가/관리자 입장에서 한눈에 파악 가능한 표, 차트 형태의 그래프로 제공하는 대쉬보드 (Dashboard) 시각화를 생성한다. 도 1에서, 관리/시각화 WEB 서버는, 장비 별, 채널 별, 날짜 별 등 다양한 검색 옵션을 통한 데이터 검색 프로세스 및 검색 결과를 위한 테이블 데이터 시각화를 생성한다. 도 1에서, 관리/시각화 WEB 서버는, 평가결과 원본을 수집하는 에이전트 소프트웨어 모듈(에이전트 S/W)의 활동 상태를 실시간 파악하고 관리할 수 있는 에이전트 관리 시각화를 생성한다.도 1에서, 관리/시각화 WEB 서버는, 다수의 평가장비(110~130)에 대한 활동 상태를 실시간 파악하고, 그 장비 활용률에 대한 측정을 수집된 데이터 기반으로 정확하게 제공 가능한 평가장비 관리 시각화를 생성한다. 수집되는 평가 원본 데이터는 시계열 특징을 갖는 데이터로 평가 방법에 따라 여러 파일로 나뉘어져 있고, 기존 의 사용자들은 데이터 분석을 위해 평가 스텝 단위, 싸이클 단위로 데이터를 묶어서 분석하고 있었다. 관리/ 시각화 WEB 서버는, 이를 시스템화하여 수십, 수백의 데이터 원본에서 사용자가 검색한 데이터에 대해, 데 이터 간 연결/추가, 데이터 분리/삭제 등을 용이하게 하기 위한 데이터 편집 모듈을 제공하고, 편집된 데이터에 대한 시각화를 위해, 데이터 범위 선택, 가로축 항목 선택, 세로축 항목 선택, 차트 종류 선택 등의 기능을 제 공하는 편집기 모듈을 제공한다. 도 1에서, 관리/시각화 WEB 서버에서의 이러한 사용자정의 데이터 편집 및 분석의 결과물은 데이터에 대한 차트 시각화, 데이터 테이블 시각화 등이 있으며, 사용자로 하여금 다수의 시각화 결과물을 생성할 수 있도록 기능을 제공한다. 또한 이러한 관리/시각화 WEB 서버의 시각화 결과물에 대한 리포트 형태의 화면 레이아웃 구성, pdf 등의 문서 저장 기능, 인쇄 기능 등을 제공한다. 본 발명은, 2차 전지 제조에 있어 제품의 평가를 위한 충방전기 데이터의 수집부터 저장, 분석, 시각화에 이르 는 일련의 작업을 시스템화하여 제공함으로써, 사용자들의 기존 어려움과 비효율적인 문제를 해결하고, 나아가 데이터를 공유하고 활용함으로써 기업 및 개인의 업무 역량 향상에도 도움이 될 수 있을 것으로 기대된다. 도 6은 충방전 평가/검사 과정에서 오류 검출을 위한 과정에 대한 도면이다. 본 발명에서의 데이터에 대해 추가적으로 설명하자면 다음과 같다. 원본(원본 프로파일, 프로파일 원본) : 충방전의 평가 원본으로 시계열 데이터 (분단위 또는 초단위)이며, 1개 파일은 1개 스텝으로 정의된다."}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 25, "content": "스텝 요약(step summary) : 1개 파일(스텝)을 1개의 레코드로 요약한다(데이터의 시작/끝, 평균, 합산, 특 정 조건일 때 값 등)."}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 26, "content": "싸이클 요약 : 스텝은 '충전(charge)', '방전(discharge)', '레스트(rest)'의 3개의 타입이 있고, 1 싸이 클의 정의는 평가방법마다 다를 수 있지만, 기본적으로는 '충전 스텝 - 레스트 스텝 - 방전 스텝 - 레스트"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 27, "content": "스텝'의 4개 스텝이 1 싸이클이다. 이러한 여러 스텝을 1개의 레코드로 요약한다. 평가는 이러한 싸이클을 예컨대 수백번 수행하는 것이다. 본 발명에 따른 오류 검출은 (A) 싸이클 오류 검출과 (B) 평가 오류 검출을 포함한다. 이하, 각각에 대해 설 명한다. (A) 싸이클 오류 AI"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 28, "content": "도 6(A)를 참조하여 설명한다. 이는 싸이클을 구성하는 여러개의 스텝에 대한 요약 레코드값을 정상일 때와 비정상일 때를 학습하여, 해당 싸이클이 오류인지를 실시간 판단할 수 있도록 인공지능을 개발하는 것이다. [학습 단계]"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 29, "content": "STEP 1) 정상일 때의 연속된 4개 스텝 요약을 입력하고, 그에 따른 출력을 1로 한다(단계 6010)."}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 30, "content": "STEP 2) 비정상일 때의 연속된 4개 스텝 요약을 입력하고, 그에 따른 출력을 0으로 한다(단계 6020). STEP 3) 상기 STEP 1)과 2)를 반복하여 딥러닝 학습하여 오류 검출 AI를 생성한다(단계 6030). [인퍼런스 단계]"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 31, "content": "실시간 4개 스텝 요약이 끝나는 시점에서, 상기 [학습 단계]의 STEP 1), 2), 3)을 거친 오류 검출 AI를 프로세 싱함으로써, 바로 해당 싸이클에 오류가 있는지 검출 가능하다(단계 6040). (B) 평가 오류 AI 도 6(B)를 참조하여 설명하다. 이는, 싸이클 평가가 정상 진행중인지 패턴 오류를 예측하여, 불필요한 평가를 방지하는 인공지능을 개발하는 것이다.[학습 단계]"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 32, "content": "STEP 1) 정상일 때의 연속된 t-5개 싸이클 요약을 입력하고, 정상일 때의 연속된 t+5개 싸이클 요약을 출력으로 학습한다(단계 7010). STEP 2) 상기 차이인 10개 싸이클에 대한 패턴에 대해 딥러닝 학습하여, 평가 오류 예측 AI를 생성한다. 즉, 지금까지 5개의 흐름에 대해, 6번째, 7번째...10번째, 각각 진행시 학습된 정답과 차이가 멀어지면 오류 예측 가능성이 높아지는 것으로 볼 수 있다(단계 7020). [인퍼런스 단계]"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 33, "content": "STEP 1) 실시간 t-5개 싸이클 요약이 끝나는 시점에서, 오류 예측 AI를 프로세싱한다(단계 7030). STEP 2) t+5개 싸이클이 예측된다(단계 7040). STEP 3) 실시간으로 예측값과 t+5 실측값의 차이를 계산하여, 평가가 오류없이 제대로 실행되고 있는지 예측 가 능하다(단계 7050). 위 설명에서 t-5, t+5 등은 임의로 정한 일예이고, 반드시 5라는 숫자에 한정될 필요는 없다. 상기 예의 't- 5'에서, t는 소정갯수, 5는 n이라고 일반화할 수 있을 것이다. 전술한 싸이클 오류 AI와 평가 오류 AI는 처리 능력이나 상황에 따라, 도 1의 프로파일 PC(310, 320)가 실행하 거나 및/또는 도 1의 데이터 분석 WAS 서버가 실행할 수 있을 것이다. 한편, 도 1에 별개의 도면 부호가 부여된 각각의 장치들은 반드시 물리적으로 별개의 장치여야만 하는 것은 아 니고 예컨대, 서버(410, 420, 430)는 1개의 장치일 수도 있고, 2개 또는 그 이상의 장치에 기능이 분산된 것일 수도 있다. 이상 첨부된 도면을 참조하여 본 발명의 실시예들을 설명하였으나, 본 발명은 상기 실시예들에 한정되는 것이"}
{"patent_id": "10-2019-0152709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 34, "content": "아니라 서로 다른 다양한 형태로 제조될 수 있으며, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자는 본 발명의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이 해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으 로 이해해야만 한다."}
{"patent_id": "10-2019-0152709", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 시스템의 구성을 간략히 나타내는 구성도이다. 도 2는 데이터의 생성 및 저장의 흐름을 간략히 나타내는 도면이다. 도 3은 프로파일 PC(310, 320)가 행하는 데이터 모니터링의 흐름을 나타내는 도면이다. 도 4는 데이터 저장 처리를 상세히 설명하기 위한 도면이다."}
{"patent_id": "10-2019-0152709", "section": "도면", "subsection": "도면설명", "item": 2, "content": "도 5는 데이터 요약 처리를 상세히 설명하기 위한 도면이다. 도 6은 충방전 평가/검사 과정에서 오류 검출을 위한 과정에 대한 도면이다."}
