{"patent_id": "10-2021-0108646", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0026706", "출원번호": "10-2021-0108646", "발명의 명칭": "챗봇을 이용한 중고거래 자동판매 서비스 제공 시스템", "출원인": "주식회사 팜코브", "발명자": "양정환"}}
{"patent_id": "10-2021-0108646", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "채팅창에 대화형 챗봇을 작동시켜 상품정보, 배송예약, 결제를 포함하는 거래진행에 요구되는 질의사항에 대해자동응답하고, 판매자가 요구하는 판매기간, 판매상품의 희망가격을 포함하는 판매조건과, 상품의 실거래가격,상품의 현재수요롤 포함하는 상품의 가격에 영향을 줄 수 있는 요소를 반영하여 판매가격을 책정하고 책정된 가격으로 자동판매를 수행하는 서버를 포함하고, 서버는 판매자 단말기로부터 판매상품에 관한 정보가 입력되면 데이터베이스의 상품정보로부터 입력된 판매상품정보와동일하거나 유사한 상품을 탐색하여 해당 상품의 현재시세, 과거시세, 유사 카테고리 및 브랜드의 시세, 판매상품정보에 관해 타 이용자가 조회한 횟수, 판매상품에 관한 타 이용자의 문의횟수, 잔여판매기간을 포함하는 요소 중 어느 하나 이상을 고려하여 판매상품의 중고가격을 추정하는 가격추정모듈 을 포함하는 챗봇을 이용한 중고거래 자동판매 서비스 제공 시스템."}
{"patent_id": "10-2021-0108646", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 서버는 구매자 단말기로부터 제시한 판매가격에 대한 가격협상을 요청하는 문구가 감지되면 미리 프로그램화된 알고리즘에 따라 해당 상품의 가격을 다시 조정하여 조정된 판매가를 채팅창에 제공하는 가격협상대응모듈을 포함하는 챗봇을 이용한 중고거래 자동판매 서비스 제공 시스템."}
{"patent_id": "10-2021-0108646", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,서버는가격이 조정되거나 가격하락율에 변화가 있거나 판매기간을 포함하는 조건에 해당하는 상품의 경우에는 변경사항이 있을 때마다 사용자 단말기 상에 상품을 확인할 수 있는 위치를 변동시켜 노출시키도록 하는 것을 포함하는 챗봇을 이용한 중고거래 자동판매 서비스 제공 시스템."}
{"patent_id": "10-2021-0108646", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 챗봇을 이용한 중고거래 자동판매 서비스 제공 시스템에 관한 것이다. 보다 상세하게는, 구매자에 상 품정보를 안내하고, 가격조정요구에 대응하며, 결제 및 배송예약을 포함하는 중고거래 진행과정에 요구되는 전반 적인 중고거래과정을 대화형 채팅 로봇을 통해 진행할 수 있도록 하는 챗봇을 이용한 중고거래 자동판매 서비스 (뒷면에 계속)"}
{"patent_id": "10-2021-0108646", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 챗봇을 이용한 중고거래 자동판매 서비스 제공 시스템에 관한 것이다. 보다 상세하게는, 구매자에 상 품정보를 안내하고, 가격조정요구에 대응하며, 결제 및 배송예약을 포함하는 중고거래 진행과정에 요구되는 전 반적인 중고거래과정을 대화형 채팅 로봇을 통해 진행할 수 있도록 하는 챗봇을 이용한 중고거래 자동판매 서비 스 제공 시스템에 관한 것이다."}
{"patent_id": "10-2021-0108646", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "스마트폰 이용자 중 중고거래 애플리케이션 이용자 수의 증가 추이가 해마다 점진적으로 증가하여 거대한 전자 상거래 시장을 형성하고 있는 추세이다. 종래의 중고거래에 있어서 거래방법은 판매자와 구매자가 직접 연락을 취하여 가격, 거래방식, 결제 과정을 포 함하는 전체 거래과정에 있어서 거래당사자가 직접 처리해야만 하며, 판매와 구매를 위한 협상과정에서 많은 피 로도가 발생되는 문제점이 있다. 또한, 중고거래를 위해서는 개인 간 정보가 공유되어야 함에 따라 개인정보 노출로 인한 각종 범죄와 그에 따른 불안감이 가중되고 있다. 이러한 종래의 중고거래 행위과정에서 발생되는 문제점을 해결하기 위하여, 거래당사자가 직접 처리해야 하는 과정을 자동화 방식으로 처리할 수 있도록 하는 새로운 플랫폼의 개발이 요구된다. 선행기술문헌 : KR 등록특허공보 제10-2100339호(2020.4.22.공고)"}
{"patent_id": "10-2021-0108646", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위해 안출된 것으로, 구매자에 상품정보를 안내하고, 가격조정요구에 대응하며, 결제 및 배송예약을 포함하는 중고거래 진행과정에 요구되는 전반적인 중고거래과정을 대화형 채팅 로봇을 통해 진행할 수 있도록 하는 챗봇을 이용한 중고거래 자동판매 서비스 제공 시스템을 제공하는 데 그 목 적이 있다."}
{"patent_id": "10-2021-0108646", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위해 안출된 본 발명에 따른 챗봇을 이용한 중고거래 자동판매 서비스 제공 시스템은 채 팅창에 대화형 챗봇을 작동시켜 상품정보, 배송예약, 결제를 포함하는 거래진행에 요구되는 질의사항에 대해 자 동응답하고, 판매자가 요구하는 판매기간, 판매상품의 희망가격을 포함하는 판매조건과, 상품의 실거래가격, 상 품의 현재수요롤 포함하는 상품의 가격에 영향을 줄 수 있는 요소를 반영하여 판매가격을 책정하고 책정된 가격 으로 자동판매를 수행하는 서버를 포함하고, 서버는 판매자 단말기로부터 판매상품에 관한 정보가 입력되면 데 이터베이스의 상품정보로부터 입력된 판매상품정보와 동일하거나 유사한 상품을 탐색하여 해당 상품의 현재시세, 과거시세, 유사 카테고리 및 브랜드의 시세, 판매상품정보에 관해 타 이용자가 조회한 횟수, 판매상 품에 관한 타 이용자의 문의횟수, 잔여판매기간을 포함하는 요소 중 어느 하나 이상을 고려하여 판매상품의 중 고가격을 추정하는 가격추정모듈을 포함할 수 있다. 또한, 서버는 구매자 단말기로부터 제시한 판매가격에 대한 가격협상을 요청하는 문구가 감지되면 미리 프로그 램화된 알고리즘에 따라 해당 상품의 가격을 다시 조정하여 조정된 판매가를 채팅창에 제공하는 가격협상대응모 듈을 포함할 수 있다. 또한, 서버는 가격이 조정되거나 가격하락율에 변화가 있거나 판매기간을 포함하는 조건에 해당하는 상품의 경 우에는 변경사항이 있을 때마다 사용자 단말기 상에 상품을 확인할 수 있는 위치를 변동시켜 노출시키도록 하는 것을 포함할 수 있다."}
{"patent_id": "10-2021-0108646", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면 판매자와 구매자가 불필요한 가격 협상 과정 없이 대화형 챗봇을 통해 사전에 설정된 판매기 간을 바탕으로 기간 내 적정금액으로 거래를 성사시키도록 하여 거래 당사자 간의 가격 협상으로 인한 거래 피 로도를 낮출 수 있도록 하는 효과가 있다. 또한, 본 발명에 의하면 거래가격 형성을 위한 다양한 요소를 데이터베이스화하여 이를 기반으로 판매상품의 예 상가격을 제공함으로써 구매자와 판매자 간 가격에 대한 불만과 불신을 최소화할 수 있도록 하는 효과가 있다. 또한, 본 발명에 의하면 거래 당사자가 불필요한 거래정보를 상대측 거래 당사자에게 노출하지 않고 거래가 이 루어질 수 있도록 하여 거래 시 발생되는 개인정보 노출문제로 인한 사고를 최소화할 수 있도록 하는 효과가 있 다."}
{"patent_id": "10-2021-0108646", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 바람직한 실시예를 첨부된 도면들을 참조하여 상세히 설명한다. 우선 각 도면의 구성 요소들에 참조 부호를 부가함에 있어서, 동일한 구성 요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동 일한 부호를 가지도록 하고 있음에 유의해야 한다. 또한, 본 발명을 설명함에 있어, 관련된 공지 구성 또는 기 능에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략한다. 또한, 이하에서 본 발명의 바람직한 실시예를 설명할 것이나, 본 발명의 기술적 사상은 이에 한정하거나 제한되 지 않고 당업자에 의해 변형되어 다양하게 실시될 수 있음은 물론이다. 도 1은 본 발명의 바람직한 실시예에 따른 챗봇을 이용한 중고거래 자동판매 서비스 제공 시스템의 개념도이고, 도 2는 본 발명의 바람직한 실시예에 따른 챗봇을 이용한 중고거래 자동판매 서비스 제공 시스템의 구성도이며, 도 3은 본 발명의 바람직한 실시예에 따른 챗봇을 이용한 중고거래 자동판매 서비스 제공 시스템에서 대화형 챗 봇을 통해 구매자의 질문에 답변하는 예시화면을 나타낸 도면이고, 도 4는 본 발명의 바람직한 실시예에 따른 챗봇을 이용한 중고거래 자동판매 서비스 제공 시스템에서 대화형 챗봇을 통해 가격 협상이 이루어지는 과정을 나타낸 예시화면이며, 도 5 내지 도 6은 본 발명의 바람직한 실시예에 따른 챗봇을 이용한 중고거래 자동판매 서비스 제공 시스템에서 판매자 단말기에서 상품을 등록하는 절차를 나타낸 예시화면이다. 본 발명의 바람직한 실시예에 따른 챗봇을 이용한 중고거래 자동판매 서비스 제공 시스템은 거래당사자인 구매자와 판매자가 대화형 챗봇을 통해 채팅창에서 거래를 진행하되, 대화형 챗봇이 작동되어 구매자 및 판매자 로부터 판매상품의 상품정보, 가격정보를 포함하는 거래절차와 수반되는 질의사항에 대응하고, 판매자가 설정한 판매조건을 반영하여 자동판매를 수행하는 기술에 관한 것이다. 이때, 대화형 챗봇은 채팅창에 가격 네고(neg o)에 대한 구매자의 요청이 감지되면 가격조정을 위한 대응을 수행한다. 이에 따라, 판매자는 구매자와 불필요한 협상과정없이 사전에 설정된 판매조건만을 입력하면 판매 기간 내에 거 래를 성사시킬 수 있음에 따라 거래 피로도를 크게 낮출 수 있다는 장점이 있다. 판매자 및 구매자가 입력한 자연어를 분석하여 사용자의 의도에 적합한 답변을 도출하도록 하며, 사용자가 입력 한 자연어를 분석 및 해석하는 과정은 종래의 자연어 처리방식을 이용하여 진행되므로 이에 대한 구체적인 설명 은 생략한다. 이하에서는, 본 발명의 바람직한 실시예에 따른 챗봇을 이용한 중고거래 자동판매 서비스 제공 시스템의 각 구성요소에 대해 상세히 설명한다. 도 1 내지 도 6을 참조하면, 본 발명의 바람직한 실시예에 따른 챗봇을 이용한 중고거래 자동판매 서비스 제공 시스템은 판매자 단말기, 구매자 단말기,및 서버, 및 데이터베이스를 포함하여 구성 된다. 판매자 단말기는 서버에 접속하여 판매하고자 하는 상품정보를 등록하도록 한다. 구체적으로, 판매자 단말기는 판매자가 원하는 판매상품의 종류, 판매희망기간, 판매상품 픽업일정, 판매상품 중량을 포함하는 판매상품정보를 등록할 수 있도록 한다. 판매자 단말기를 통해 판매상품을 등록하는 과정에서 데이터베이스의 상품정보와 연동되어 사용자가 판매하고자 하는 상품정보를 입력하면 입력된 상품과 동일하거나 유사한 상품정보를 데이터베이스로부터 탐색하여 사용자에게 제공한다. 데이터베이스는 중고가격을 형성하기 위해 요구되는 정보를 데이터베이스화한 것으로, 이러한 정보를 기반 으로 상품의 가격을 추정하도록 한다. 데이터베이스는 신규상품에 관한 정보, 중고상품에 관한 정보, 중고시세정보, 과거거래정보, 각 상품의 최 저가, 각 상품의 실거래가, 인기도, 카테고리 내 브랜드순위, 상품 별 가격 변동에 결정적 요인을 주는 가격변 동요인정보를 포함하는 상품정보가 저장된다. 상품정보는 일정 주기를 두고 갱신된다. 여기서, 중고가격을 형성하기 위해 요구되는 정보는 중고시세, 과거거래정보, 상품의 실거래가, 인기도 등이 해 당될 수 있다. 또한, 판매자 단말기는 주소, 상품픽업시간을 포함하는 발송정보를 입력할 수 있다. 이때, 판매자 단말기 에는 판매기간 및 상품의 최저가격, 가격변동범위를 포함하는 판매조건을 설정하면 설정된 조건값에 따라 서버에 의해 상품이 자동으로 판매되는 자동판매상품등록 기능이 포함된다. 구매자 단말기는 서버에 접속하여 서버에서 제공하는 채팅창을 통해 판매자 단말기가 등록 한 판매상품을 확인하고 구매를 진행한다. 구매자 단말기를 통해 구매를 진행하는 과정에서 채팅창에서는 대화형 챗봇이 작동되어 구매자가 요청하는 질의사항에 대한 답변이 이루어질 수 있도록 한다. 구매자 단말기는 서버로부터 가격 책정이 완료된 금액이 채팅창에 출력되면 판매가격에 대한 네고 (nego)를 요청하는 문구를 입력하여 가격 조정을 요청할 수 있다. 서버는 채팅창에 대화형 챗봇을 작동시켜 상품정보, 배송예약, 결제를 포함하는 거래진행에 요구되는 질의 사항에 대해 자동응답하고, 판매자가 요구하는 판매기간, 판매상품의 희망가격을 포함하는 판매조건과, 상품의 실거래가격, 상품의 현재수요롤 포함하는 상품의 가격에 영향을 줄 수 있는 요소를 반영하여 판매가격을 책정하 고 책정된 가격으로 자동판매를 수행한다. 예컨대, 서버는 대화형 챗봇을 통해 판매상품에 관한 스펙정보를 안내하고, 구매자로부터 판매상품에 관한 가격문의가 있을 경우 가격정보를 안내하며, 가격협상을 요청하는 경우 가격협상에 대응하고, 배송예약과 결제 에 관한 질의사항에 대해 응답하고 절차에 대해 안내한다. 구체적으로, 서버는 상품정보 제공모듈, 가격추정모듈, 가격협상대응모듈, 거래정보 비식 별화처리모듈을 포함하여 이루어진다. 상품정보 제공모듈은 데이터베이스와 연동되어 사용자로부터 문의받은 상품에 관한 정보를 데이터베 이스의 상품정보로부터 탐색하여 답변한다. 또한, 사용자가 문의한 내용을 분석하여 상품정보로부터 탐색 되지 않는 정보라고 판단되면 포털사이트를 통해 검색된 결과를 제공한다. 예를 들면, 사용자가 특정 브랜드의 유모차의 무게정보가 궁금하다는 문의내용이 입력되면 데이터베이스의 상품정보로부터 해당 브랜드의 유모차의 무게정보를 색출하여 채팅창에 무게정보를 출력한다. 또 다른 예시로, 사용자가 특정 브랜드의 유모차의 색상이 궁금하다는 문의내용이 입력되면 데이터베이스 의 상품정보로부터 유모차의 색상정보를 탐색하여 채팅창에 색상정보를 출력한다. 만약, 사용자가 상품을 오래 사용한 후에 변색 우려가 있는 지에 관한 문의내용을 입력하였고, 위의 문의내용이 상품정보로부터 탐색되지 않는 정보인 경우 에는 상품정보로부터 도출될 수 없다고 판단하고 포털사이트를 연동 시켜 포털사이트의 검색결과를 제공한다. 가격추정모듈은 사용자의 검색빈도, 거주지역, 신규상품의 가격, 중고시세, 경쟁상품을 포함하는 요소를 고려하여 상품의 중고가격을 추정한다. 구체적으로, 가격추정모듈은 판매자 단말기로부터 판매하고자 하는 상품에 관한 정보가 입력되면 데 이터베이스의 상품정보로부터 입력된 판매값과 동일하거나 유사한 상품을 탐색하여 추출하고 중고거래가격 추정모델을 이용하여 상품의 예상판매가격을 추정한다. 여기서, 중고거래가격 추정모델은 상품의 중고거래가격에 영향을 줄 수 있는 다양한 요소들을 반영하여 중고거 래가격을 추정하여 제시하는 인공지능 기반의 알고리즘으로, 상품의 현재시세, 과거시세, 유사 카테고리 및 브 랜드의 시세, 사용자의 검색빈도, 거주지역, 사용자의 상품조회횟수, 이용자의 상품문의횟수를 포함하는 조건 중 어느 하나 이상을 고려하여 판매상품의 예상판매가격을 추정하는 알고리즘이다. 예컨대, 가격추정모듈은 포털사이트에서 실시간으로 검색되는 상품들의 지역별 검색량을 확인하여 해당 지 역에 상품 검색량이 높으면 구매자 또는 판매자가 많을 것으로 추정할 수 있다. 가격협상대응모듈은 구매자로부터 가격조정을 요청하는 문구가 감지되면 대화형 챗봇이 작동하여 구매자의 요구에 응하여 가격협상을 진행한다. 가격협상대응모듈은 해당 상품이 가격협상이 가능한 상품인지 확인하고, 가격협상이 가능하다고 판단되면 인공지능 기반의 중고가격 조정 알고리즘을 이용하여 상품의 판매가격을 조정하여 1차 제시한 판매가격으로부터 조정된 값을 채팅창에 제시한다. 이때, 중고가격 조정 알고리즘은 상품의 판매가격에 변동성을 줄 수 있는 요소들을 반영하여 판매가격을 자동으 로 조정하여 제시한 알고리즘이다. 여기서, 상품의 판매가격에 변동성을 줄 수 있는 요소는 상품에 대한 현재 수요, 사용자가 상품을 조회한 횟수, 상품과 관련되어 거래가 진행되고 있는 채팅방 개설수, 상품의 노출시간, 상품의 최초등록시간, 동일상품 등록 건수, 판매기간을 포함한다. 예컨대, 가격협상대응모듈은 해당 상품이 실시간 거래되고 있는 가격을 확인하여 거래되고 있는 가격보다 판매자가 등록한 희망판매가가 높을 경우에는 자동으로 가격을 하락시켜 가격을 조정한다. 채팅창에는 평균 중고시세, 판매가, 네고가를 수치와 그래프 등 시각화된 형태로 출력하여 구매자가 직관적으로 확인이 가능하도록 한다. 가격협상대응모듈은 목표한 판매기간까지 복수 회에 거쳐 재조정된 상품의 판매가격을 갱신하여 출력시킨 다. 예컨대, 1시간, 6시간, 12시간, 24시간과 같이 일정 주기를 두고 상품의 판매가격이 업데이트될 수 있다. 예컨대, 특정 상품과 관련되어 거래가 진행되고 있는 채팅방 개설수를 확인하여 채팅방 개설수가 높을 경우 현 재 해당 상품에 대한 수요가 많을 것으로 추정할 수 있다. 중고가격조정 알고리즘에 의해 가격이 조정되거나 가격하락율에 변화가 있거나 판매기간을 포함하는 조건에 해 당하는 상품의 경우에는 변경사항이 있을 때마다 사용자 단말기 상에 상품을 확인할 수 있는 위치를 변동시켜 노출시키도록 한다. 상기 과정을 거쳐 구매자와 가격이 협상되면 상품의 구매를 위한 결제 및 배송절차가 진행된다. 거래정보 비식별화처리모듈은 거래 당사자인 판매자 또는 구매자 측 단말기로부터 입력된 거래정보에서 개 인정보를 비식별화처리하여 상대측 거래당사자에게 제공하는 모듈로, 거래에 요구되는 개인정보를 암호화 처리 를 통해 상대측 거래당사자에게 노출하지 않고 필요한 정보만을 선택적으로 노출시켜 개인정보의 유출을 방지하 고 개인정보를 보호하도록 한다. 보다 구체적으로, 거래정보 비식별화처리모듈은 거래 당사자인 판매자 또는 구매자 단말기로부터 입 력된 개인정보를 수집하여 가명화처리하여 데이터베이스에 저장하고, 전체 거래정보 중 거래 상대 측에 노 출되는 전화번호, 주소, 계좌번호를 포함하는 개인정보를 추출하여 개인정보의 일부분에 대해서 비식별화 처리 한 다음, 비식별화처리된 거래정보를 거래 상대측 단말기에 제공하도록 한다. 예컨대, 거래정보 중 비식별화 처리되는 정보는 성명, 전화번호, 발송주소, 계좌번호를 포함하는 개인정보이고, 비색별화처리되지 않는 정보는 가격, 발송일시, 상품가격, 상품종류, 상품금액, 부피 및 무게, 거래방법이 포함 된다. 이에 따라, 구매자 단말기에는 판매자 단말기로부터 입력된 정보 중 판매자의 성명, 전화번호, 발송주소, 계좌 번호를 포함하는 개인정보와 관련된 정보는 일부가 비식별화처리되어 노출되지 않은 상태로 출력된다. 이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위 내에서 다양한 수정, 변경 및 치환이 가능할 것이다. 따라서, 본 발명에 개시된 실시예 및 첨부된 도면들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이고, 이러한 실시예 및 첨부된 도면에 의하여 본 발명의 기술 사상의 범위 가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범 위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2021-0108646", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 바람직한 실시예에 따른 챗봇을 이용한 중고거래 자동판매 서비스 제공 시스템의 개념도, 도 2는 본 발명의 바람직한 실시예에 따른 챗봇을 이용한 중고거래 자동판매 서비스 제공 시스템의 구성도, 도 3은 본 발명의 바람직한 실시예에 따른 챗봇을 이용한 중고거래 자동판매 서비스 제공 시스템에서 대화형 챗 봇을 통해 구매자의 질문에 답변하는 예시화면을 나타낸 도면, 도 4는 본 발명의 바람직한 실시예에 따른 챗봇을 이용한 중고거래 자동판매 서비스 제공 시스템에서 대화형 챗 봇을 통해 가격 협상이 이루어지는 과정을 나타낸 예시화면, 도 5 내지 도 6은 본 발명의 바람직한 실시예에 따른 챗봇을 이용한 중고거래 자동판매 서비스 제공 시스템에서 판매자 단말기에서 상품을 등록하는 절차를 나타낸 예시화면이다."}
