{"patent_id": "10-2019-0050333", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0126549", "출원번호": "10-2019-0050333", "발명의 명칭": "맞춤형 스포츠 대리 지도자 매칭 시스템 및 방법", "출원인": "김흥환", "발명자": "김흥환"}}
{"patent_id": "10-2019-0050333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 하나의 의뢰자단말로부터 유무선통신망을 통하여 스포츠 종목에 대한 강의 요청을 받아 강의 요청 리스트를 생성하고,적어도 하나의 지도자단말과 연결되어 강의 가능한 스포츠 종목 및 대리 지도자 프로필을 입력받고,상기 강의 요청 리스트에서 상기 입력받은 강의 가능한 스포츠 종목에 따라 해당 지도자단말을 상기 의뢰자단말과 매칭시켜 주고, 해당 지도자단말에서 입력받은 대리 지도자 프로필을 매칭된 의뢰자단말에 제공하는 중계서버;를 포함하는 맞춤형 스포츠 대리 지도자 매칭 시스템."}
{"patent_id": "10-2019-0050333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 중계서버는상기 의뢰자단말에서 입력받은 대리 지도자 프로필을 토대로 경력별, 나이별, 강의가능지역별 또는 이름별로 조회 가능하도록 강의 리스트를 제공하는 맞춤형 스포츠 대리 지도자 매칭 시스템."}
{"patent_id": "10-2019-0050333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 중계서버는상기 의뢰자단말로부터 스포츠 종목에 대한 강의 요청을 받아 강의 요청 리스트를 생성하고, 상기 지도자단말에서 입력받은 대리 지도자 프로필을 매칭된 의뢰자단말에 제공하는 서비스제공부;상기 의뢰자단말 또는 지도자단말에 설치된 매칭 어플리케이션과 연동하여, 상기 서비스제공부를 통하여 매칭서비스가 이루어지도록 매칭 어플리케이션을 제공하는 앱연동부;상기 의뢰자단말의 강의 요청받은 요청정보와, 상기 지도자단말로부터 입력받은 대리 지도자 프로필에 포함된스포츠 종목, 경력, 나이, 강의가능지역 및 강의료를 토대로 동일한 조건의 매칭을 수행하는 매칭부;를 포함하는 맞춤형 스포츠 대리 지도자 매칭 시스템."}
{"patent_id": "10-2019-0050333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 중계서버는회원에 대한 매칭 서비스를 위하여 의뢰자 및 대리 지도자의 회원정보를 입력받아 회원 가입을 수행하는 회원가입부;회원가입된 회원정보를 토대로 매칭 서비스를 위한 로그인 인증을 수행하는 로그인인증부;상기 의뢰자단말로부터 강의 요청된 요청정보 및 매칭된 지도자단말의 대리 지도자 프로필을 토대로 분석정보를생성하고, 해당 의뢰자단말에 대한 분석정보를 이용하여 다음 대리 지도자 매칭시, 해당 의뢰자에 적합한 맞춤형 대리 지도자를 매칭시켜 주는 분석부;상기 의뢰자단말 또는 지도자단말에서 구매 가능한 가상머니를 제공하고, 가상머니로 매칭 수수료에 대한 결제서비스를 수행하는 결제관리부;를 더 포함하는 맞춤형 스포츠 대리 지도자 매칭 시스템.공개특허 10-2020-0126549-3-청구항 5 적어도 하나의 의뢰자단말과 유무선통신망을 통하여 연결된 중계서버에서 상기 의뢰자단말로부터 스포츠 종목에대한 강의 요청을 받아 강의 요청 리스트를 생성하는 단계;상기 중계서버는 적어도 하나의 지도자단말과 연결되어 강의 가능한 스포츠 종목 및 대리 지도자 프로필을 입력받는 단계;상기 중계서버는 상기 강의 요청 리스트에서 상기 입력받은 강의 가능한 스포츠 종목에 따라 해당 지도자단말을상기 의뢰자단말과 매칭시켜 주는 단계;상기 중계서버는 해당 지도자단말에서 입력받은 대리 지도자 프로필을 매칭된 의뢰자단말에 제공하는 단계;를 포함하는 맞춤형 스포츠 대리 지도자 매칭 방법."}
{"patent_id": "10-2019-0050333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 중계서버는 상기 의뢰자단말에서 입력받은 대리 지도자 프로필을 토대로 경력별, 나이별, 강의가능지역별또는 이름별로 조회 가능하도록 강의 리스트를 제공하는 단계를 더 포함하는 맞춤형 스포츠 대리 지도자 매칭 방법."}
{"patent_id": "10-2019-0050333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서,상기 의뢰자단말의 강의 요청받은 요청정보와, 상기 지도자단말로부터 입력받은 대리 지도자 프로필에 포함된스포츠 종목, 경력, 나이, 강의가능지역 및 강의료를 토대로 동일한 조건의 매칭을 수행하는 단계를 더 포함하는 맞춤형 스포츠 대리 지도자 매칭 방법."}
{"patent_id": "10-2019-0050333", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 맞춤형 대리 지도자 매칭는 적어도 하나의 의뢰자단말로부터 유무선통신망을 통하여 스포츠 종목에 대한 강의 요청을 받아 강의 요청 리스트를 생성하고, 적어도 하나의 지도자단말과 연결되어 강의 가능한 스포츠 종목 및 대리 지도자 프로필을 입력받고, 상기 강의 요청 리스트에서 상기 입력받은 강의 가능한 스포츠 종목에 따라 해당 지도자단말을 상기 의뢰자단말과 매칭시켜 주고, 해당 지도자단말에서 입력받은 대리 지도자 프로필을 매칭된 의뢰자단말에 제공하는 중계서버;를 포함한다."}
{"patent_id": "10-2019-0050333", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 맞춤형 스포츠 대리 지도자 매칭 시스템 및 방법에 관한 것으로, 더욱 상세하게는 스포츠 지도자가 부득이한 사정으로 강의를 진행 할 수 없을 경우, 스포츠 지도를 대리하여 진행할 수 있는 지도자를, 지도자가 직접 혹은 스포츠 시설에서 강의 요청 조건에 맞는 대리 스포츠 지도자를 맞춤형으로 매칭시켜 주는 맞춤형 스 포츠 대리 지도자 매칭 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2019-0050333", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "필라테스, 요가, 헬스, 줌바, 댄스스포츠, 골프 등의 다양한 종목에 대한 스포츠 시설은 다양한 연령이나 계층 이 이용할 수 있으며, 해당 종목에 대하여 시설을 구비하고 각 종목 별로 강의를 진행할 수 있다. 그러나, 스포츠 시설에서 다양한 종목의 강의에 대응하여 강의를 진행하는 대리 지도자, 강의를 수강하는 회원 그리고 회원이 학생인 경우 강의의 진행 상태를 확인하기 원하는 보호자와 같은 다양한 유저 그룹들을 만족시킬 수 있는 수준의 시스템은 개발에 많은 시간과 비용의 소요를 요구한다. 또한, 각 스포츠 시설마다 전문 지도자를 섭외하기는 쉽지 않으며, 시설에 상주하게 되면 강의가 적은 상황에서 는 많은 인건비가 소요되어 스포츠 시설의 운영에 막대한 자금이 필요한 상황이다. 이에 전문 지도자를 갖추고 있지 않더라도 근처에 위치한 전문 대리 지도자를 초빙하여 강의를 쉽게 진행할 수 있고, 개인(지도자)이 직접 강의 요청을 통하여 원하는 강의를 맞춤형으로 제공받을 수 있는 온라인 대리 지도 자 매칭 시스템이 구축될 필요성이 있다. 선행기술문헌 특허문헌(특허문헌 0001) 대한민국 공개특허 제10-2017-98773호(2017.08.30.공개)"}
{"patent_id": "10-2019-0050333", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 스포츠 종목에 대한 강의 요청을 하고, 매칭 어플리케이션을 통하여 강의 요청 리스트를 제공 받는 의뢰자단말과, 강의 요청 리스트에서 입력받은 강의 가능한 스포츠 종목에 따라 해당 지도자단말을 상기 의뢰자단말과 매칭시켜 주고, 해당 지도자단말에서 입력받은 대리 지도자 프로필을 매칭된 의뢰자단말에 제공하 는 중계서버를 이용하여 의뢰자의 강의 요청 조건에 맞는 대리 지도자를 맞춤형으로 매칭시켜 줄 수 있는 맞춤 형 스포츠 대리 지도자 매칭 시스템 및 방법을 제공하는 것이다."}
{"patent_id": "10-2019-0050333", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 맞춤형 스포츠 대리 지도자 매칭 시스템은 적어도 하나의 의뢰자단말로부터 유무선 통신망을 통하여 스포츠 종목에 대한 강의 요청을 받아 강의 요청 리스트를 생성하고, 적어도 하나의 지도자단 말과 연결되어 강의 가능한 스포츠 종목 및 대리 지도자 프로필을 입력받고, 상기 강의 요청 리스트에서 상기 입력받은 강의 가능한 스포츠 종목에 따라 해당 지도자단말을 상기 의뢰자단말과 매칭시켜 주고, 해당 지도자단 말에서 입력받은 대리 지도자 프로필을 매칭된 의뢰자단말에 제공하는 중계서버;를 포함한다. 상기에 있어서, 상기 중계서버는 상기 의뢰자단말에서 입력받은 대리 지도자 프로필을 토대로 경력별, 나이별, 강의가능지역별 또는 이름별로 조회 가능하도록 강의 리스트를 제공한다. 상기에 있어서, 상기 중계서버는 상기 의뢰자단말로부터 스포츠 종목에 대한 강의 요청을 받아 강의 요청 리스 트를 생성하고, 상기 지도자단말에서 입력받은 대리 지도자 프로필을 매칭된 의뢰자단말에 제공하는 서비스제공 부; 상기 의뢰자단말 또는 지도자단말에 설치된 매칭 어플리케이션과 연동하여, 상기 서비스제공부를 통하여 매 칭 서비스가 이루어지도록 매칭 어플리케이션을 제공하는 앱연동부; 상기 의뢰자단말의 강의 요청받은 요청정보 와, 상기 지도자단말로부터 입력받은 대리 지도자 프로필에 포함된 스포츠 종목, 경력, 나이, 강의가능지역 및 강의료를 토대로 동일한 조건의 매칭을 수행하는 매칭부;를 포함한다. 상기에 있어서, 상기 중계서버는 회원에 대한 매칭 서비스를 위하여 의뢰자 및 대리 지도자의 회원정보를 입력 받아 회원 가입을 수행하는 회원가입부; 회원가입된 회원정보를 토대로 매칭 서비스를 위한 로그인 인증을 수행 하는 로그인인증부; 상기 의뢰자단말로부터 강의 요청된 요청정보 및 매칭된 지도자단말의 대리 지도자 프로필 을 토대로 분석정보를 생성하고, 해당 의뢰자단말에 대한 분석정보를 이용하여 다음 대리 지도자 매칭시, 해당 의뢰자에 적합한 맞춤형 대리 지도자를 매칭시켜 주는 분석부; 상기 의뢰자단말 또는 지도자단말에서 구매 가능 한 가상머니를 제공하고, 가상머니로 매칭 수수료에 대한 결제 서비스를 수행하는 결제관리부; 를 더 포함한다. 본 발명의 일 실시예에 따른 맞춤형 스포츠 대리 지도자 매칭 방법은, 적어도 하나의 의뢰자단말과 유무선통신 망을 통하여 연결된 중계서버에서 상기 의뢰자단말로부터 스포츠 종목에 대한 강의 요청을 받아 강의 요청 리스 트를 생성하는 단계; 상기 중계서버는 적어도 하나의 지도자단말과 연결되어 강의 가능한 스포츠 종목 및 대리 지도자 프로필을 입력받는 단계; 상기 중계서버는 상기 강의 요청 리스트에서 상기 입력받은 강의 가능한 스포 츠 종목에 따라 해당 지도자단말을 상기 의뢰자단말과 매칭시켜 주는 단계; 상기 중계서버는 해당 지도자단말에 서 입력받은 대리 지도자 프로필을 매칭된 의뢰자단말에 제공하는 단계;를 포함한다. 상기에 있어서, 상기 중계서버는 상기 의뢰자단말에서 입력받은 대리 지도자 프로필을 토대로 경력별, 나이별, 강의가능지역별 또는 이름별로 조회 가능하도록 강의 리스트를 제공하는 단계를 더 포함한다. 상기에 있어서, 상기 의뢰자단말의 강의 요청받은 요청정보와, 상기 지도자단말로부터 입력받은 대리 지도자 프 로필에 포함된 스포츠 종목, 경력, 나이, 강의가능지역 및 강의료를 토대로 동일한 조건의 매칭을 수행하는 단 계를 더 포함한다."}
{"patent_id": "10-2019-0050333", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 맞춤형 스포츠 대리 지도자 매칭 시스템 및 방법은 의뢰자의 강의 요청 조건에 맞는 대리 지도자를 맞춤형으로 매칭시켜줄 수 있는 장점이 있다.또한 스포츠 시설에서 전문 지도자를 갖추고 있지 않더라도 근처에 위치한 전문 대리 지도자를 초빙하여 강의를 제공할 수 있으며, 개인(의뢰자)이 직접 강의 요청을 통하여 대리 강의를 맞춤형으로 제공할 수 있는 장점이 있 다. 또한 스포츠 시설 관점에서는 전문 지도자를 상주시키지 않아도 전문 대리 지도자를 개인(의뢰자)이 직접 어플 리케이션을 통하여 초빙하여 강의를 진행할 수 있어, 인력 구축 및 구인 비용이 소요되지 않는 장점이 있다. 또한, 강의에 필요한 지도자가 개인 사정으로 강의를 진행하지 못하는 경우에도, 대신해줄 대리 지도자를 어플 리케이션을 통하여 요청하고, 이를 대리 지도자가 수락함으로써, 대리 강의를 쉽게 수행할 수 있는 장점이 있다."}
{"patent_id": "10-2019-0050333", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여 본 발명의 구체적인 실시예를 상세하게 설명한다. 다만, 본 발명의 사상은 제시되 는 실시예에 제한되지 아니하고, 본 발명의 사상을 이해하는 당업자는 동일한 사상의 범위 내에서 다른 구성요 소를 추가, 변경, 삭제 등을 통하여, 퇴보적인 다른 발명이나 본 발명 사상의 범위 내에 포함되는 다른 실시예 를 용이하게 제안할 수 있을 것이나, 이 또한 본원 발명 사상 범위 내에 포함된다고 할 것이다. 또한, 각 실시 예의 도면에 나타나는 동일한 사상의 범위 내의 기능이 동일한 구성요소는 동일한 참조부호를 사용하여 설명한 다. 도 1은 본 발명의 일 실시예에 따른 맞춤형 대리 지도자 매칭의 전체 구성을 보인 블록도이며, 도 2는 도 1의 중계서버의 세부 구성을 보인 블록도이다. 본 발명의 일 실시예에 따른 맞춤형 스포츠 대리 지도자 매칭 시스템은 도 1에 도시된 바와 같이, 적어도 하나 의 의뢰자단말, 중계서버, 적어도 하나의 지도자단말을 포함한다. 의뢰자단말은 특정 스포츠 종목에 대한 대리 강의를 원하는 각 의뢰자마다 개별적으로 구비되어 유무선통 신망을 통하여 중계서버와 연결되고, 중계서버에서 제공되는 매칭 어플리케이션을 이용하여 스 포츠 종목에 대한 강의 요청을 수행한다. 특히 의뢰자단말은 강의 요청시 요청할 스포츠 종목, 대리 지도자 나이, 강의가능지역, 경력, 강의료를 포 함한 요청정보를 입력하여 입력된 내용에 부합하는 조건 매칭이 이루어지도록 한다. 여기서 의뢰자는 지도자(부득이한 사정으로 대리 지도자를 요청하는 사람) 또는 수강이 필요한 수강자가 될 수 있으며, 스포츠 종목은 예컨대 필라테스, 요가, 헬스, 줌바, 댄스스포츠, 골프 등이 될 수 있다. 또한, 요청정 보에는 상기 스포츠 종목 등의 정보 외에도 강의 내용, 강의 클래스, 대리 지도자 평점 등이 포함될 수도 있다. 대리 지도자 평점은 대리 지도자에 대한 평점을 부여하는 것으로서, 대리 강의 제공 후 해당 대리 지도자에 대 한 평가 지표가 될 수 있으며, 이를 위해 도 6에 도시된 바와 같은 화면을 의뢰자단말에 제공할 수 있다. 또한 의뢰자단말은 매칭 어플리케이션에서 회원가입을 통하여 회원 로그인 인증 수행 후 강의 요청 및 매 칭된 대리 지도자 프로필을 제공받을 수 있으며, 나아가 강의 수료 후 해당 대리 지도자에 대한 대리 지도자 평 점을 부여할 수도 있다. 여기서 매칭 어플리케이션은 의뢰자단말과 지도자단말에 설치될 수 있으며, 중계서버에서 제공 되어 중계서버의 앱연동부를 통하여 연계 가능한 프로그램이다. 특히, 매칭 어플리케이션은 의뢰자단말에서 원하는 조건의 강의에 필요한 대리 지도자를 찾기 위해 다양한 메뉴를 제공할 수 있으며, 예컨대 도 4에 도시된 바와 같이 천사 찾기(대리 지도자 찾기), 천사 되기(대리 지도 자 요청), 천사 정보(대리 지도자 프로필)등이 포함될 수 있다. 천사 찾기 메뉴를 입력하면, 세부 화면으로 전환될 수 있으며, 원하는 조건의 강의 요청을 위해 스포츠 종목, 강의 장소, 강의 일시, 강의료를 입력할 수 있다. 여기서 강의장소는 미리 가능한 강의 장소를 선택지 형태로 제공하는 것이 바람직하며, 예컨대 스포츠 종목에 해당하는 스포츠 시설이 될 수 있다. 이를 테면, 필라테스나 요가의 경우, 필라테스 강습소나 요가 학원이 될 수 있고, 골프의 경우 골프 연습장이나 클럽이 될 수 있다. 중계서버는 의뢰자단말로부터 스포츠 종목에 대한 강의 요청을 받아 강의 요청 리스트를 생성하고, 상기 지도자단말에서 입력받은 대리 지도자 프로필을 매칭된 의뢰자단말에 제공하며, 의뢰자단말 또는 지도자단말에 설치된 매칭 어플리케이션과 연동하여, 상기 서비스제공부를 통하여 매칭 서비스를 제공하도록 매칭 어플리케이션을 제공한다. 또한 중계서버는 의뢰자단말의 강의 요청받은 요청정보와, 상기 지도자단말로부터 입력받은 대 리 지도자 프로필에 포함된 스포츠 종목, 경력, 대리 지도자 나이, 강의가능지역 및 강의료를 토대로 동일한 조 건의 자동 매칭을 수행할 수 있으며, 나아가 상기 의뢰자단말에서 입력받은 대리 지도자 프로필을 토대로 경력별, 대리 지도자 나이별, 강의가능지역별 또는 이름별로 조회 가능하도록 강의 리스트를 제공할 수 있다. 이외에도 입력받은 요청정보에 따라 강의료, 강의장소 등 특정 파라미터 순으로 정렬하여 조회하는 기능을 제공 할 수 있다. 여기서 대리 지도자 프로필은 대리 지도자에 대한 프로필 정보로서, 스포츠 종목, 경력, 대리 지도자 나이, 강 의가능지역 및 강의료를 기본적으로 포함할 수 있으며, 추가로 대리 지도자 평점, 강의 가능 클래스, 자격 취득 사항, 주소, 학력 등이 포함될 수도 있다. 중계서버는 세부적으로 도 2에 도시된 바와 같이, 서비스제공부, 앱연동부, 회원가입부, 로그인인증부, 매칭부, 분석부, 결제관리부, 회원정보 DB, 분석정보 DB, 결제정보 DB를 더 포함한다. 서비스제공부는 의뢰자단말로부터 스포츠 종목에 대한 강의 요청을 받아 강의 요청 리스트를 생성하 고, 상기 지도자단말에서 입력받은 대리 지도자 프로필을 매칭된 의뢰자단말에 제공하는 매칭 서비스 를 수행한다. 앱연동부는 의뢰자단말 또는 지도자단말에 설치된 매칭 어플리케이션과 연동하여, 상기 서비스 제공부를 통하여 매칭 서비스가 이루어지도록 매칭 어플리케이션을 제공할 수 있다. 회원가입부는 회원에 대한 매칭 서비스를 위하여 의뢰자 및 대리 지도자의 회원정보를 입력받아 회원 가입 을 수행한다. 로그인인증부는 회원가입된 회원정보를 토대로 매칭 서비스를 위한 로그인 인증을 수행한다. 매칭부는 의뢰자단말의 강의 요청받은 요청정보와, 상기 지도자단말로부터 입력받은 대리 지도 자 프로필에 포함된 스포츠 종목, 경력, 대리 지도자 나이, 강의가능지역 및 강의료를 토대로 동일한 조건의 매 칭을 수행하는 역할을 한다. 분석부는 의뢰자단말로부터 강의 요청된 요청정보 및 매칭된 지도자단말의 대리 지도자 프로필을 토 대로 분석정보를 생성하고, 해당 의뢰자단말에 대한 분석정보를 이용하여 다음 대리 지도자 매칭시, 해당 의뢰자에 적합한 맞춤형 추천 대리 지도자를 매칭시켜 주는 역할을 수행할 수 있다. 구체적으로 맞춤형 대리 지도자 추천을 위한 분석정보를 생성하기 위해 의뢰자의 강의 유형에 따른 유사도 분석 을 이용한 인공지능 알고리즘을 활용할 수 있다. 이를 테면, 다음 수학식 1과 같이, 의뢰자단말에서 강의 요청시, 의뢰자를 행으로 하고, 요청정보 또는 대 리 지도자 프로필에 포함된 스포츠 종목, 대리 지도자 나이, 강의가능지역, 경력, 강의료 또는 대리 지도자 평 점을 열(항목)로 설정한 다음, 코사인 또는 상관관계 유사도(similarity)를 계산하고 계산된 결과 유사한 항목 (k-nearest neighbors)을 추천하는 방식을 이용할 수 있다.수학식 1"}
{"patent_id": "10-2019-0050333", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "예를 들면, 과거 강의 요청된 종목이 필라테스이고, 대리 지도자 나이가 30대 초반이고, 강의료가 10만원 이하 였다면, 상기 수학식 1을 이용하여 유사도를 계산하고, 이와 가장 유사한 조건의 다른 대리 지도자를 추천해주 는 것이다. 이때, 가장 유사하고 적합한 대리 지도자를 추천하기 위해서는 과거에 입력된 모든 요청정보 및 대리 지도자 프 로필을 빅데이터화하여 저장하거나 다른 유사한 조건으로 강의 요청한 의뢰자단말의 요청정보를 활용할 수 도 있다. 나아가 유사도 계산 방식 이외에 상호 작용 행렬의 차원을 줄이고 k 개의 잠재 구성 요소가 있는 두 개 이상의 작은 행렬로 근사하며, 해당 행과 열을 곱하면 사용자 별 항목의 등급을 예측할 수 있는 행렬인수분해(matrix factorization) 방법을 활용할 수도 있다. 또한 자주 소비되는 항목이 그래프의 가장자리와 연결되는 연관 규칙(association rule)이나, 마이닝 규칙 (mining rule)을 활용하여 가능한 빈번 항목 집합의 상태 공간을 탐구하고 빈번하지 않은 검색 공간의 분기를 제거하며, 자주 사용되는 항목 집합은 규칙을 생성하는 데 사용되며 이러한 규칙은 추천(권장) 사항을 생성할 수도 있다. 예를 들면, 수많은 강의에 대한 요청정보를 토대로 규칙을 추출하고, 과거의 요청정보(스포츠 종목, 대리 지도자 나이, 강의가능지역, 경력, 강의료 또는 대리 지도자 평점 등)를 기준으로 일정한 규칙이 존재하는 대리 지도자를 추천할 수 있다. 나아가, 최초 가입한 의뢰자의 경우 대리 지도자 추천에 필요한 요청정보 및 대리 지도자 프로필 정보가 부족하 더라도 유사한 조건의 의뢰자의 요청정보 및 대리 지도자 프로필을 이용하여 생성된 분석정보를 활용하여 상술 한 알고리즘 등(k-nearest neighbors, matrix factorization, association rule, mining rule 등)에 의해 적응 적으로 적용 가능하게 하는 것이 바람직하다. 결제관리부는 도 5에 도시된 바와 같이 의뢰자단말 또는 지도자단말에서 구매 가능한 가상머니 를 제공하고, 가상머니로 매칭 수수료에 대한 결제 서비스를 수행한다. 나아가 결제관리부는 가상머니 결제 외에 가상계좌 입금 방식, 카드 결제 방식 등을 채용할 수 있으며, 이 를 위해 별도의 결제대행서버와 연계할 수도 있다. 회원정보 DB는 회원가입부를 통하여 입력받은 회원정보를 회원별로 저장할 수 있다. 분석정보 DB는 분석부로부터 생성된 분석정보를 저장하고 관리할 수 있다. 결제정보 DB는 결제관리부를 통하여 가상머니 결제가 이루어져, 그 결과로 결제정보가 생성되면 결제 정보를 제공받아 결제 건마다 개별로 저장될 수 있다. 지도자단말은 의뢰자단말을 통하여 강의 요청받은 강의 요청 리스트에서 자신이 강의 가능한 강의에 대하여 강의를 수행할 수 있도록 대리 지도자 프로필을 제공할 수 있다. 대리 지도자 프로필에는 스포츠 종목,경력, 나이, 강의가능지역 및 강의료가 포함될 수 있으며, 추가로 강의 내용, 강의 가능 클래스, 대리 지도자 평점 등이 포함될 수도 있다. 여기서, 지도자단말 또는 의뢰자단말의 형태는 어플리케이션을 설치할 수 있는 단말기로서, 예컨대 스마트 폰, 패블릿 폰, 태블릿 등이 될 수 있다. 나아가 중계서버는 의뢰자단말의 스포츠 종목에 대한 강의 요청 후, 중계서버에 의해 대리 지도 자 프로필에 따라 자동 매칭 방식 이외에 지도자단말에서 직접 강의 수락을 하는 수동 매칭 방식을 채용할 수도 있다. 예를 들어, 의뢰자단말에 입력되어 제공되는 강의 요청 리스트를 확인한 지도자단말에서 리스트 목록에서 강의 가능한 해당 목록을 선택하여 수동 매칭이 이루어질 수 있다. 이때, 지도자단말의 목록 선택 후 해당 강의 제공에 대한 수락 여부를 확인하기 위해 해당 의뢰자단말에 수락정보를 전송하여 수락정보를 확인한 해당 의뢰자단말의 수락시 수동 매칭이 완료되도록 하는 것이 바람직하다. 도 3은 본 발명의 일 실시예에 따른 맞춤형 대리 지도자 매칭의 순서도이다. 먼저, 의뢰자단말에서 강의 요청을 하면, 중계서버는 해당 강의와 기존에 요청된 다른 강의와 함께 목록화된 강의 요청 리스트를 생성한다(S100). 생성된 강의 요청 리스트는 의뢰자단말의 매칭 어플리케이션을 통하여 확인할 수 있다. 또한, 중계서버는 지도자단말로부터 강의 가능한 스포츠 종목 및 대리 지도자 프로필을 입력받는다 (S102). 중계서버는 지도자단말로부터 입력된 스포츠 종목 및 대리 지도자 프로필을 토대로 의뢰자단말 로부터 요청된 강의에 부합하는 조건 매칭을 수행한다(S104). 중계서버는 조건 매칭시, 매칭된 강의를 요청한 의뢰자단말에 해당 강의를 제공할 대리 지도자의 지 도자단말에서 제공한 대리 지도자 프로필을 제공한다(S106). 강의 매칭이 성사된 후 의뢰자단말에서는 가상머니를 이용하여 온라인 결제를 수행함으로써, 거래를 완료 한다(S108, S110)."}
{"patent_id": "10-2019-0050333", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 맞춤형 스포츠 대리 지도자 매칭 시스템의 전체 구성을 보인 블록도이다. 도 2는 도 1의 중계서버의 세부 구성을 보인 블록도이다. 도 3은 본 발명의 일 실시예에 따른 맞춤형 스포츠 대리 지도자 매칭 방법의 순서도이다. 도 4는 도 1의 의뢰자단말에 제공되는 매칭 어플리케이션의 메인 화면 예시이다. 도 5는 도 1의 의뢰자단말에 제공되는 매칭 어플리케이션의 가상머니 결제 화면 예시이다. 도 6은 도 1의 의뢰자단말에 제공되는 매칭 어플리케이션의 평점 화면 예시이다."}
