{"patent_id": "10-2019-0106560", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0026152", "출원번호": "10-2019-0106560", "발명의 명칭": "반려 동물 보험과 연계하여, 온라인 상에서 구현되는 반려 동물용 생활 서비스 제공 플랫폼의", "출원인": "주식회사 스페컴", "발명자": "이재현"}}
{"patent_id": "10-2019-0106560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "반려 동물 보험과 연계하여, 온라인 상에서 구현되는 반려 동물용 생활 서비스 제공 플랫폼의 구축 방법- 상기반려 동물용 생활 서비스 제공 플랫폼은, 통신망을 통하여 통신 가능하도록 구성된, 상기 반려 동물 보험에 가입한 가입자들 각각을 위한 하나 이상의 가입자 단말, 보험사 서버, 상기 반려 동물 보험에 가맹한 가맹 동물병원들 각각을 위한 하나 이상의 가맹 병원 단말, 반려 동물을 위한 상품 또는 서비스를 판매하려는 판매자들각각을 위한 하나 이상의 판매자 단말, 및 반려 동물용 생활 서비스의 제공을 지원하는 서비스 제공 서버를 포함하도록 구성됨 -으로서,상기 서비스 제공 서버가,상기 통신망을 통하여, 각 보험 계정별로, 상기 가입자 단말로부터 상기 보험사 서버로 제공되는, 보험 관련 정보를 수신하고, 상기 수신된 보험 관련 정보를 상기 보험 계정과 연관지어 저장하는 단계- 상기 보험 관련 정보는, 상기 보험 계정에 대응하는 상기 가입자의 신상 정보 및 상기 보험 계정에 대응하는 피보험 반려 동물의 신상 정보를 포함함 -;각각의 가맹 병원 단말로부터 수집된, 대응하는 상기 가맹 동물 병원에 관한 정보를, 각 가맹 동물 병원과 연관지어 저장하는 단계- 상기 가맹 동물 병원에 관한 정보는, 상기 가맹 동물 병원의 주소, 장비 보유 현황 및 수의사 이력 사항을 포함함 -;상기 통신망을 통하여, 상기 각 가맹 병원 단말로부터, 상기 각 피보험 반려 동물에 관한 진료 기록 및 보험금청구 정보를 수신하고, 상기 수신된 정보를 상기 보험 계정 및 상기 가맹 동물 병원과 각각 연관지어 저장하는단계; 및상기 통신망을 통하여, 상기 각 판매자 단말로부터, 상기 각 판매자의 신상 및 이력 정보를 수신 및 저장하는단계를 포함하는, 반려 동물용 생활 서비스 제공 플랫폼 구축 방법."}
{"patent_id": "10-2019-0106560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 가입자의 신상 정보는, 상기 가입자의 주소, 연령, 직업 및 동거가족 정보 중 적어도 하나를 포함하고, 상기 피보험 반려 동물의 신상 정보는, 상기 피보험 반려 동물의 종류, 품종, 나이, 병력, 습성, 알러지 여부및 종류 중 적어도 하나를 포함하는, 반려 동물용 생활 서비스 제공 플랫폼 구축 방법."}
{"patent_id": "10-2019-0106560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 서비스 제공 서버가, 상기 가맹 병원 단말로부터 수신 및 저장되는 진료 기록 및 보험금 청구 정보를 분석하고, 상기 분석된 결과로부터 상기 수의사 이력 사항을 갱신하는 단계를 더 포함하는, 반려 동물용 생활 서비스 제공 플랫폼 구축 방법."}
{"patent_id": "10-2019-0106560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 서비스 제공 서버가, 상기 가맹 병원 단말로부터 수신 및 저장되는 진료 기록 및 보험금 청구 정보를 분석하고, 상기 분석된 결과로부터 상기 저장된 피보험 반려 동물의 병력을 갱신하는 단계를 더 포함하는, 반려 동물용 생활 서비스 제공 플랫폼 구축 방법.공개특허 10-2021-0026152-3-청구항 5 제2항에 있어서,상기 통신망을 통하여, 상기 서비스 제공 서버가, 상기 각 판매자 단말로부터, 판매하려는 상품 또는 서비스에관한 정보를 수신하는 단계;상기 서비스 제공 서버가, 상기 상품 또는 서비스에 관한 정보를, 상기 가입자의 신상 정보 및 상기 피보험 반려 동물의 신상 정보 중 적어도 하나와 비교하는 단계; 및상기 비교 결과에 기초해서, 상기 통신망을 통하여, 상기 서비스 제공 서버가, 상기 상품 또는 서비스에 관한추천 정보를 상기 가입자 단말로 제공하는 단계를 더 포함하는, 반려 동물용 생활 서비스 제공 플랫폼 구축 방법."}
{"patent_id": "10-2019-0106560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 판매하려는 상품은 사료 또는 간식이고, 상기 판매자 단말로부터 수신되는 상기 상품에 관한 정보는, 원재료 식품 정보, 첨가물 정보, 및 특수 목적 제조 여부 중 적어도 하나를 포함하며, 상기 서비스 제공 서버가, 상기 상품에 관한 정보를, 상기 피보험 반려 동물의 병력, 알러지 여부 및 종류 중적어도 하나와 비교하는 단계를 더 포함하는, 반려 동물용 생활 서비스 제공 플랫폼 구축 방법."}
{"patent_id": "10-2019-0106560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서,상기 판매하려는 서비스는 돌봄 서비스이고, 상기 판매자 단말로부터 수신되는 상기 서비스에 관한 정보는, 돌봄 제공 시간 및 범위를 포함하며, 상기 서비스 제공 서버가, 상기 서비스에 관한 정보를, 상기 가입자의 직업 및 동거가족 형태와 비교하는 단계를 더 포함하는, 반려 동물용 생활 서비스 제공 플랫폼 구축 방법."}
{"patent_id": "10-2019-0106560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제5항에 있어서,상기 판매하려는 서비스는 교정 교육 서비스이고, 상기 판매자 단말로부터 수신되는 상기 서비스에 관한 정보는, 교정 교육 대상 정보를 포함하며, 상기 서비스 제공 서버가, 상기 서비스에 관한 정보를, 상기 피보험 반려 동물의 습성과 비교하는 단계를 더 포함하는, 반려 동물용 생활 서비스 제공 플랫폼 구축 방법."}
{"patent_id": "10-2019-0106560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 통신망을 통하여, 상기 서비스 제공 서버가, 상기 가입자 단말로부터, 상기 피보험 반려 동물의 건강 증상에 관한 질의를 수신하는 단계;상기 질의에 기초하여, 상기 서비스 제공 서버가, 상기 피보험 반려 동물의 건강 증상을 분석하는 단계;상기 서비스 제공 서버가, 상기 피보험 반려 동물의 건강 증상을 분석한 결과와, 상기 가맹 동물 병원에 관한정보를 비교하는 단계; 상기 비교 결과에 기초해서, 상기 서비스 제공 서버가, 하나 이상의 가맹 동물 병원을 선정하는 단계;상기 통신망을 통하여, 상기 선정된 하나 이상의 가맹 동물 병원으로 상기 질의를 전달하는 단계;공개특허 10-2021-0026152-4-상기 하나 이상의 가맹 동물 병원으로부터 상기 질의에 대한 답변을 수신하는 단계; 및상기 통신망을 통하여, 상기 가입자 단말로, 상기 하나 이상의 가맹 동물 병원으로부터 상기 질의에 대한 답변과, 해당 가맹 동물 병원에 관한 정보를 제공하는 단계를 더 포함하는, 반려 동물용 생활 서비스 제공 플랫폼구축 방법."}
{"patent_id": "10-2019-0106560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 질의에 기초하여, 상기 서비스 제공 서버가, 상기 피보험 반려 동물의 건강 증상을 분석하는 단계는, 인공지능 기반의 텍스트 또는 이미지 분석에 기초하여 수행되는, 반려 동물용 생활 서비스 제공 플랫폼 구축 방법."}
{"patent_id": "10-2019-0106560", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "하나 이상의 명령어가 수록된 컴퓨터 판독 가능 기록 매체로서, 상기 하나 이상의 명령어는 컴퓨터에 의해 실행될 경우, 상기 컴퓨터로 하여금 제1항 내지 제10항 중 어느 한 항의 방법을 수행하게 하는, 컴퓨터 판독 가능기록 매체."}
{"patent_id": "10-2019-0106560", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "반려 동물 보험과 연계하여, 온라인 상에서 구현되는 반려 동물용 생활 서비스 제공 플랫폼의 구축 방법- 상기 반려 동물용 생활 서비스 제공 플랫폼은, 통신망을 통하여 통신 가능하도록 구성된, 상기 반려 동물 보험에 가입 한 가입자들 각각을 위한 하나 이상의 가입자 단말, 보험사 서버, 상기 반려 동물 보험에 가맹한 가맹 동물 병원 (뒷면에 계속)"}
{"patent_id": "10-2019-0106560", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는, 온라인 상에서, 반려 동물 보험과 연계하여 온라인을 통해 제공되는, 반려 동물을 위한 생활 서비스 의 제공 플랫폼의 구축에 관한 것이다."}
{"patent_id": "10-2019-0106560", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "근래, 고령화와 1-2인 가구 증가 등 가족 구조가 변화하면서 반려 동물을 키우는 가정이 점점 더 늘어나는 추세 이다. 한 통계에 따르면, 2015년 기준으로 반려 동물을 키우는 가구는 우리나라 전체 가구 수의 21.8%로, 즉 다섯 가구 중 한 가구가 반려 동물을 키우고 있는 것으로 나타나고 있다. 반려 동물을 가족처럼 생각하는, 이 른바 '펫팸족'이 증가하면서, 반려 동물 관련 소비 또한 크게 증가하고 있다. 그에 따라, 반려 동물 관련 산업 이 점점 더 활성화되어 가고 있으며, 특히 반려 동물의 건강에 대한 관심 증대에 따라 반려 동물 관련 의료 시 장이 최근 크게 성장하고 있다. 나아가, 반려 동물의 건강 관리에 따른 비용 부담이 커짐에 따라, 반려 동물 보험 시장도 날로 성장하고 있으며, 최근에는 온라인을 통한 직접 가입형 펫보험 서비스가 개시된 바 있다."}
{"patent_id": "10-2019-0106560", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는, 반려 동물의 보험 가입과 서비스를 온라인을 통해 구현하고, 이를 기초로 수집될 수 있는 각종 정보 를 활용한 반려 동물 생활 서비스 제공 플랫폼의 구축을 제공하고자 한다."}
{"patent_id": "10-2019-0106560", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 특징에 의하면, 반려 동물 보험과 연계하여, 온라인 상에서 구현되는 반려 동물용 생활 서비스 제 공 플랫폼의 구축 방법이 제공된다. 본 개시의 반려 동물용 생활 서비스 제공 플랫폼은, 통신망을 통하여 통신 가능하도록 구성된, 상기 반려 동물 보험에 가입한 가입자들 각각을 위한 하나 이상의 가입자 단말, 보험사 서 버, 상기 반려 동물 보험에 가맹한 가맹 동물 병원들 각각을 위한 하나 이상의 가맹 병원 단말, 반려 동물을 위 한 상품 또는 서비스를 판매하려는 판매자들 각각을 위한 하나 이상의 판매자 단말, 및 반려 동물용 생활 서비 스의 제공을 지원하는 서비스 제공 서버를 포함하도록 구성된다. 본 개시에 의한 방법에 의하면, 서비스 제공 서버가, 상기 통신망을 통하여, 각 보험 계정별로, 상기 가입자 단말로부터 상기 보험사 서버로 제공되는, 보험 관련 정보를 수신하고, 상기 수신된 보험 관련 정보를 상기 보험 계정과 연관지어 저장하는 단계- 상기 보험 관 련 정보는, 상기 보험 계정에 대응하는 상기 가입자의 신상 정보 및 상기 보험 계정에 대응하는 피보험 반려 동 물의 신상 정보를 포함함 -; 각각의 가맹 병원 단말로부터 수집된, 대응하는 상기 가맹 동물 병원에 관한 정보 를, 각 가맹 동물 병원과 연관지어 저장하는 단계- 상기 가맹 동물 병원에 관한 정보는, 상기 가맹 동물 병원의 주소, 장비 보유 현황 및 수의사 이력 사항을 포함함 -; 상기 통신망을 통하여, 상기 각 가맹 병원 단말로부터,상기 각 피보험 반려 동물에 관한 진료 기록 및 보험금 청구 정보를 수신하고, 상기 수신된 정보를 상기 보험 계정 및 상기 가맹 동물 병원과 각각 연관지어 저장하는 단계; 및 상기 통신망을 통하여, 상기 각 판매자 단말 로부터, 상기 각 판매자의 신상 및 이력 정보를 수신 및 저장하는 단계를 포함한다. 본 개시의 일 실시예에 의하면, 상기 가입자의 신상 정보는, 상기 가입자의 주소, 연령, 직업 및 동거가족 정보 중 적어도 하나를 포함하고, 상기 피보험 반려 동물의 신상 정보는, 상기 피보험 반려 동물의 종류, 품종, 나이, 병력, 습성, 알러지 여부 및 종류 중 적어도 하나를 포함할 수 있다. 본 개시의 일 실시예에 의하면, 상기 서비스 제공 서버가, 상기 가맹 병원 단말로부터 수신 및 저장되는 진료 기록 및 보험금 청구 정보를 분석하고, 상기 분석된 결과로부터 상기 저장된 수의사 이력 사항을 갱신하는 단계 를 더 포함할 수 있다. 본 개시의 일 실시예에 의하면, 상기 서비스 제공 서버가, 상기 가맹 병원 단말로부터 수신 및 저장되는 진료 기록 및 보험금 청구 정보를 분석하고, 상기 분석된 결과로부터 상기 저장된 피보험 반려 동물의 병력을 갱신하 는 단계를 더 포함할 수 있다. 본 개시의 일 실시예에 의하면, 상기 통신망을 통하여, 상기 서비스 제공 서버가, 상기 각 판매자 단말로부터, 판매하려는 상품 또는 서비스에 관한 정보를 수신하는 단계; 상기 서비스 제공 서버가, 상기 상품 또는 서비스 에 관한 정보를, 상기 가입자의 신상 정보 및 상기 피보험 반려 동물의 신상 정보 중 적어도 하나와 비교하는 단계; 및 상기 비교 결과에 기초해서, 상기 통신망을 통하여, 상기 서비스 제공 서버가, 상기 상품 또는 서비스 에 관한 추천 정보를 상기 가입자 단말로 제공하는 단계를 더 포함할 수 있다. 본 개시의 일 실시예에 의하면, 상기 판매하려는 상품은 사료 또는 간식이고, 상기 판매자 단말로부터 수신되는 상기 상품에 관한 정보는, 원재료 식품 정보, 첨가물 정보, 및 특수 목적 제조 여부 중 적어도 하나를 포함하며, 상기 서비스 제공 서버가, 상기 상품에 관한 정보를, 상기 피보험 반려 동물의 병력, 알러지 여부 및 종류 중 적어도 하나와 비교하는 단계를 더 포함할 수 있다. 본 개시의 일 실시예에 의하면, 상기 판매하려는 서비스는 돌봄 서비스이고, 상기 판매자 단말로부터 수신되는 상기 서비스에 관한 정보는, 돌봄 제공 시간 및 범위를 포함하며, 상기 서비스 제공 서버가, 상기 서비스에 관 한 정보를, 상기 가입자의 직업 및 동거가족 형태와 비교하는 단계를 더 포함할 수 있다. 본 개시의 일 실시예에 의하면, 상기 판매하려는 서비스는 교정 교육 서비스이고, 상기 판매자 단말로부터 수신 되는 상기 서비스에 관한 정보는, 교정 교육 대상 정보를 포함하며, 상기 서비스 제공 서버가, 상기 서비스에 관한 정보를, 상기 피보험 반려 동물의 습성과 비교하는 단계를 더 포함할 수 있다. 본 개시의 일 실시예에 의하면, 상기 통신망을 통하여, 상기 서비스 제공 서버가, 상기 가입자 단말로부터, 상 기 피보험 반려 동물의 건강 증상에 관한 질의를 수신하는 단계; 상기 질의에 기초하여, 상기 서비스 제공 서버 가, 상기 피보험 반려 동물의 건강 증상을 분석하는 단계; 상기 서비스 제공 서버가, 상기 피보험 반려 동물의 건강 증상을 분석한 결과와, 상기 가맹 동물 병원에 관한 정보를 비교하는 단계; 상기 비교 결과에 기초해서, 상기 서비스 제공 서버가, 하나 이상의 가맹 동물 병원을 선정하는 단계; 상기 통신망을 통하여, 상기 선정된 하나 이상의 가맹 동물 병원으로 상기 질의를 전달하는 단계; 상기 하나 이상의 가맹 동물 병원으로부터 상기 질의에 대한 답변을 수신하는 단계; 및 상기 통신망을 통하여, 상기 가입자 단말로, 상기 하나 이상의 가맹 동 물 병원으로부터 상기 질의에 대한 답변과, 해당 가맹 동물 병원에 관한 정보를 제공하는 단계를 더 포함할 수 있다. 본 개시의 일 실시예에 의하면, 상기 질의에 기초하여, 상기 서비스 제공 서버가, 상기 피보험 반려 동물의 건 강 증상을 분석하는 단계는, 인공지능 기반의 텍스트 또는 이미지 분석에 기초하여 수행될 수 있다. 본 개시의 다른 특징에 의하면, 하나 이상의 명령어가 수록된 컴퓨터 판독 가능 기록 매체로서, 상기 하나 이상 의 명령어는 컴퓨터에 의해 실행될 경우, 상기 컴퓨터로 하여금 전술한 방법들 중 어느 하나의 방법을 수행하게 하는, 컴퓨터 판독 가능 기록 매체가 제공된다."}
{"patent_id": "10-2019-0106560", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "반려 동물의 보험 가입과 서비스를 온라인을 통해 구현하고, 이를 기초로 수집될 수 있는 각종 정보를 활용한 반려 동물 생활 서비스 제공 플랫폼이 제공된다. 본 개시의 실시예들에 의하면, 온라인을 통한 보험 가입 및 보험금 청구 과정에서 수집되는 각종 정보에 기초하여, 피보험 반려 동물을 위하여 적합한 병원, 상품 또는 서비스 정보가 자동으로 추출될 수 있다."}
{"patent_id": "10-2019-0106560", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부 도면을 참조하여 본 개시의 실시예에 관하여 상세히 설명한다. 이하에서는, 본 개시의 요지를 불필 요하게 흐릴 우려가 있다고 판단되는 경우, 이미 공지된 기능 및 구성에 관한 구체적인 설명을 생략한다. 또한, 이하에서 설명하는 내용은 어디까지나 본 개시의 일 실시예에 관한 것일 뿐 본 개시가 이로써 제한되는 것은 아님을 알아야 한다. 본 명세서에서 사용되는 용어는 단지 특정한 실시예를 설명하기 위해 사용되는 것으로 본 개시를 한정하려는 의 도에서 사용된 것이 아니다. 예를 들면, 단수로 표현된 구성요소는 문맥상 명백하게 단수만을 의미하지 않는다 면 복수의 구성요소를 포함하는 개념으로 이해되어야 한다. 또한, 본 개시의 명세서에서, '포함하다' 또는 '가 지다' 등의 용어는 명세서 상에 기재된 특징, 숫자, 단계, 동작, 구성 요소, 부분품 또는 이들을 조합한 것이 존재함을 지정하려는 것일 뿐이고, 이러한 용어의 사용에 의해 하나 또는 그 이상의 다른 특징들이나 숫자, 단 계, 동작, 구성 요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 배제하려는 것은 아니다. 본 명세서에 기재된 실시예에 있어서 '부'는 적어도 하나의 기능이나 동작을 수행하는 기능적 부분을 의미하며, 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 '부'는, 특정한 하드웨어로 구현될 필요가 있는 '부'를 제외하고는, 적어도 하나의 소프트웨어 모듈로 일체화되 어 적어도 하나의 프로세서로 구현될 수 있다. 덧붙여, 달리 정의되지 않는 한 기술적 또는 과학적인 용어를 포함하여, 본 명세서에서 사용되는 모든 용어들은 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에 의 해 일반적으로 이해되는 것과 동일한 의미를 가진다. 일반적으로 사용되는 사전에 정의된 용어들은, 관련 기술 의 문맥상 의미와 일치하는 의미를 갖는 것으로 해석되어야 하며, 본 개시의 명세서에서 명백하게 달리 정의하 지 않는 한 과도하게 제한 또는 확장하여 해석되지 않는다는 점을 알아야 한다.이하, 첨부된 도면을 참조하여, 본 개시의 실시예에 대해 구체적으로 설명하기로 한다. 도 1은, 본 개시의 일 실시예에 따른, 보험 연계형 반려 동물 생활 서비스 제공 플랫폼의 구성을 개략적으 로 도시한 도면이다. 도시된 바에 의하면, 서비스 제공 플랫폼은, 통신망, 복수의 가입자 단말 , 복수의 가맹 병원 단말, 복수의 상품/서비스 판매자 단말, 복수의 펫택시 단말, 보험사 서버, 및 서비스 제공 서버를 포함한다. 본 개시의 일 실시예에 의하면, 서비스 제공 플랫폼에 포함된 복수의 가입자 단말, 복수의 가맹 병원 단말, 복수의 상품/서비스 판매자 단말, 복수의 펫택시 단말, 보험사 서버, 및 서비스 제 공 서버는, 통신망을 통하여, 소정의 프로토콜에 따라 서로 통신 가능하도록 배치되어 있다. 본 개 시의 일 실시예에 의하면, 통신망은 통상의 유선 또는 무선의 인터넷 망일 수 있다. 본 개시의 다른 실시 예에 의하면, 통신망은 임의의 다른 프로토콜에 따른 공용 또는 전용 망을 포함할 수 있다. 본 개시의 일 실시예에 의하면, 복수의 가입자 단말 각각은, 보험 가입을 통해 서비스 제공 플랫폼에 가입한, 보험 가입자(예컨대, 각 피보험 반려 동물 보호자) 각각이 보유한 통신 가능 단말일 수 있다. 본 개시 의 일 실시예에 의하면, 복수의 가입자 단말 각각은, 예컨대 보험 가입자의 휴대 전화, 스마트폰, 태블릿 PC, 데스크탑, 랩탑, 음성인식 스피커 등 다양한 유형의 전자 단말일 수 있다. 보험 가입자는, 자신의 가입자 단말을 이용해서 통신망을 통해 가맹 병원 단말, 상품/서비스 판매자 단말, 펫택시 단말 , 보험사 서버, 서비스 제공 서버 등과 통신할 수 있고, 필요한 서비스를 요청 및 수신할 수 있 다. 본 개시의 일 실시예에 의하면, 복수의 가맹 병원 단말은, 서비스 제공 플랫폼에 가입한 각 동물 병 원에 설치된 각종 형태의 통신 단말일 수 있다. 본 개시의 일 실시예에 의하면, 각 가맹 병원 단말은, 해 당 동물 병원에서 행하여지는 각 진료 행위에 관한 정보, 예컨대 진료를 받은 반려 동물 정보, 반려 동물 보험 정보, 진료 기록, 처방 내역, 결제 정보 등의 입력을 수신하고 이들 각 정보를 저장할 수 있다. 본 개시의 일 실시예에 의하면, 가맹 병원 단말은, 통신망을 통하여, 외부의 가입자 단말, 보험사 서버, 서비스 제공 서버 등과 통신할 수 있다. 본 개시의 일 실시예에 의하면, 복수의 가맹 병원 단말 각 각은, 예컨대 해당 동물 병원 담당 수의사 또는 병원 관계자의 데스크탑, 랩탑, 태블릿 PC, 스마트폰 등 다양한 유형의 전자 단말일 수 있다. 본 개시의 일 실시예에 의하면, 가맹 병원 단말은, 통신망을 통하여 외부로/로부터 정보를 송신 또는 수신할 경우 그 송신 또는 수신되는 정보를 암호화 또는 복호화할 수 있다. 본 도면에서는, 2개의 가맹 병원 단말이 포함되는 것으로 도시되었으나, 본 개시가 이로써 제한되지는 않 는다. 본 개시의 다른 실시예에 의하면, 더 많거나 적은 수의 가맹 병원 단말이 서비스 제공 플랫폼에 포 함될 수 있음을 알아야 한다. 본 개시의 일 실시예에 의하면, 복수의 상품/서비스 판매자 단말 및 복수의 펫택시 단말 각각은, 서 비스 제공 플랫폼에 가입한 각 상품 또는 서비스 판매자, 및 펫택시업자 각각이 보유한 각종 형태의 통신 단말일 수 있다. 본 개시의 일 실시예에 의하면, 복수의 상품/서비스 판매자 단말 및 복수의 펫택시 단말 각각은, 예컨대 각 상품 또는 서비스 판매자, 및 펫택시업자의 휴대 전화, 스마트폰, 태블릿 PC, 데스크 탑, 랩탑, 음성인식 스피커 등 다양한 유형의 전자 단말일 수 있다. 각 상품 또는 서비스 판매자, 및 펫택시업 자는, 자신의 단말을 이용해서 통신망을 통해 가입자 단말 및 서비스 제공 서버 등과 통신할 수 있다. 본 개시의 일 실시예에 의하면, 보험사 서버는, 온라인 반려 동물용 보험 서비스를 제공하는 보험사의 서 버 장치일 수 있다. 본 개시의 일 실시예에 의하면, 보험사 서버는, 통신망을 통하여, 각 가입자 단 말과의 사이에서 필요한 정보를 송수신할 수 있다. 본 개시의 일 실시예에 의하면, 반려 동물용 보험의 각 계정별로, 가입자 및 피보험 반려 동물에 관한 정보, 보험 약정 사항, 진료 기록, 보험금 청구 및 정산 기록 등 관련 정보를 기록한 데이터베이스를 보관 및 갱신할 수 있다. 본 개시의 일 실시예에 의하면, 반려 동물용 보험의 가입자와 보험사 서버 사이의 각종 정보 송수신, 예컨대 보험 가입을 위한 정보의 송수신(가입자 정보, 보험 약관정보 등), 진료 기록 및 보험금 청구와 보험금 정산 정보의 송수신 등은, 후술하는 바와 같이 서비스 제공 서버를 거쳐서 이루어질 수 있으며, 다만 본 개시가 이로써 제한되는 것은 아니다. 본 개시 의 다른 실시예에 의하면, 각 보험 가입자의 가입자 단말과 보험사 서버 간에 통신망을 통하여 송수신되는 정보들이 서비스 제공 서버에 의해 모니터링될 수 있다. 본 도면 및 개시에서는, 보험사 서버 와 서비스 제공 서버가 공간적으로 분리된 별도의 개체로서 주로 설명되었으나 본 개시가 이로써 제 한되는 것은 아니다. 본 개시의 다른 실시예에 의하면, 보험사 서버와 서비스 제공 서버는 물리적으로 하나의 개체일 수도 있음을 알아야 한다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 통신망을 통하여, 각 가입자 단말과 통신 하고, 이를 통해 각 고객의 보험 가입을 지원할 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버 는, 각 가입자 단말로부터 보험 가입 요청을 수신하고, 그 수신된 요청에 기초하여 보험사 서버(16 0)와 가입자 단말 사이에서 해당 고객을 위한 보험 가입 절차를 중계할 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 보험 가입을 희망하는 가입자 단말 및/또는 보험사 서버로부터, 보험 가입을 위하여 필요한 정보, 보험 상품 선택 정보, 피보험 반려 동물과 보호자(가입자)의 신상 정보, 보험 약관 정보 등 다양한 정보를 획득하고 그 획득된 정보를 저장할 수 있다. 본 개시의 일 실시예에 의하면, 서비 스 제공 서버는, 보험 가입이 이루어지는 단계 뿐만 아니라 그 이후에도, 가입자에 관하여 변경된 정보(예 컨대, 주소의 변경, 연락처의 변경 등)가 있을 경우, 그러한 정보를 가입자 단말로부터 수신 및 저장할 수 있음을 알아야 한다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 각 동물 병원을 위한 서비스 제공 플랫폼으로의 가입 절차를 지원할 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 서비스 제공 플랫폼 에 가입하고자 하는 병원의 병원 단말로부터 해당 동물 병원에 관한 정보, 예컨대 해당 병원의 위치 (주소), 해당 병원의 수의사 학력, 이력사항, 병원 보유 장비 현황 등의 정보를 수신하고, 수신된 정보를 저장 할 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 서비스 제공 플랫폼에 대한 가 입이 이루어지는 단계 뿐만 아니라 그 이후에도, 각 병원에 관하여 변경된 정보(예컨대, 병원의 의사 현황 변경, 장비 보유 현황 변경 등)가 있을 경우, 그러한 정보를 가맹 병원 단말로부터 수신 및 저장할 수 있 음을 알아야 한다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 서비스 제공 플랫폼에 가입한 가맹 동물 병원들 을, 각 가맹 병원 단말로부터 수집 및 축적된 정보에 기초하여, 카테고리별로 분류할 수 있다. 예컨대, 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 각 병원의 장비 보유 현황이나 수의사 이력 사항 등 에 기초하여, 각 진료과별 전문 병원을 선정할 수 있고, 그러한 정보를 저장할 수 있다. 본 개시의 일 실시예 에 의하면, 예컨대 안과 수술용 장비를 갖추고 있는 병원은 안과 전문 병원으로 선정될 수 있고, 슬개골 탈골 수술 장비를 갖춘 병원은 정형외과 전문 병원으로 선정될 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 각 보험 가입자(즉, 플랫폼의 각 가입 고객)에 관한 보험금 청구 절차를 지원 또한 모니터링할 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버 는, 예컨대 보험 가입자가 방문 및 진료를 받은 가맹 병원 단말이 통신망을 통해 보험사 서버 로 보험금 청구를 진행하고자 할 때, 그러한 청구 과정에서 필요한 정보, 예컨대 피보험 반려 동물 식별 정보, 진료 기록, 질병 및 처방 내역, 결제 금액 정보 등을 가입자 단말로부터 수신하여 보험사 서버(16 0)로 전달할 수 있고, 이때 가맹 병원 단말로부터 획득된 전술한 각 정보를 저장할 수 있다. 본 개시의 다른 실시예에 의하면, 서비스 제공 서버가 가맹 병원 단말의 보험금 청구 과정에서 보험사 서버 와 가맹 병원 단말 간 중계 역할을 하는 대신, 가맹 병원 단말과 보험사 서버 간 송수신되 는 정보를 중간에서 획득 및 저장할 수도 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 보 험금 청구와 관련하여 보험사 서버와 가맹 병원 단말 간에 송수신된 정보, 예컨대 피보험 반려 동물 에 관한 진료 또는 수술 기록 등에 기초하여, 서비스 제공 서버가 저장하고 있는 피보험 반려 동물에 관한 정보(예컨대, 피보험 반려 동물 병력 사항) 및 가맹 동물 병원에 관한 정보(예컨대, 가맹 동물 병원의 의사 이 력 사항)를 갱신할 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 통신망을 통하여 가입자 단말로부터, 반려 동물의 건강 상태에 관련된 질의를 수신할 수 있다. 본 개시의 일 실시예에 의하면, 수신된 질의는 소정의 텍 스트 및/또는 사진 정보를 포함할 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 수신된 질의에 대한 분석을 통해, 현재 수신된 질의가 어떤 카테고리에 속하는가(예컨대, 안과, 정형외과, 내과 등 어 떤 진료과에 관한 것인가, 수술에 관한 것인가, 예방접종에 관한 것인가 등)를 정할 수 있다. 본 개시의 일 실 시예에 의하면, 이러한 질의에 대한 분석은, 인공지능에 기반한 텍스트 분석 및/또는 이미지 분석에 의해 이루 어질 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 소정의 기준에 따라, 플랫폼 내의 하나 이상의 병원을 선정할 수 있고, 선정된 병원의 각 가맹 병원 단말로 해당 질의를 전달할 수 있다. 본 개시의 일 실시예에 의하면, 소정의 기준은, 예컨대 전술한 가입자로부터 수신된 질의의 분석 결과, 질의를 보낸 가입자단말 관련 정보(예컨대, 가입자 단말과 관련하여 저장된 보험 계정의 주소 정보 및 반려 동물 질병 이력 정보 등), 각 병원의 주소지, 병원 관련 정보(예컨대, 전술한 병원 카테고리 정보 등) 등일 수 있다. 본 개시의 일 실시예에 의하면, 예컨대 가입자 단말로부터 수신된 질의가 슬개골 탈골에 관한 것이라고 판정 된 경우, 서비스 제공 서버는 텍스트/이미지 분석 등을 통해 해당 질의가 정형외과 수술에 관한 것임을 판 정할 수 있고, 해당 가입자 단말에 관련하여 저장된 주소지 정보로부터 소정 거리 이내 그리고/또는 정형 외과 전문 병원으로 분류된 하나 이상의 병원을 선정할 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 선정된 하나 이상의 병원으로, 가입자 단말로부터 수신된 질의를 전달할 수 있고, 해당 가맹 병원 단말들을 통하여 입력된 수의사의 답변 정보들을 다시 수신할 수 있다. 본 개시의 일 실시예에 의하 면, 서비스 제공 서버는, 수신된 답변 정보들을 해당 가입자 단말로 전달하되, 각 답변을 제공한 병 원 관련 정보(예컨대, 해당 병원의 카테고리 정보, 의사 이력 사항, 장비 보유 현황 등의 정보)를 함께 전달할 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 반려 동물용 상품/서비스를 판매하고자 하는 판매자 및/또는 펫택시업자를 위한 서비스 제공 플랫폼으로의 가입 절차를 지원할 수 있다. 본 개시의 일 실시예 에 의하면, 서비스 제공 서버는, 서비스 제공 플랫폼에 가입하고자 하는 상품/서비스 판매자 및/또는 펫택시업자의 각 판매자 단말 및/또는 펫택시 단말로부터 해당 판매자 및/또는 펫택시업자에 관한 정 보, 예컨대 상품/서비스 판매자의 신상 및 이력 정보, 펫택시업자의 신상 및 이력 정보 등을 수신하고, 수신된 각 정보를 저장할 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 서비스 제공 플랫폼 에 대한 가입이 이루어지는 단계 뿐만 아니라 그 이후에도, 판매자 및/또는 펫택시업자에 관하여 변경된 정보(예컨대, 주소의 변경, 연락처의 변경, 차량 번호 변경, 이력사항 변경 등)가 있을 경우, 그러한 정보를 각 판매자 단말 및 펫택시 단말로부터 수신 및 저장할 수 있음을 알아야 한다. 본 개시의 일실시예에 의하면, 서비스 제공 플랫폼 상에서 판매 제공될 수 있는 상품은, 사료, 간식, 생활 용품 등 각종 반려 동 물을 위한 다양한 상품일 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 플랫폼 상에서 판매 제공 될 수 있는 서비스는, 반려 동물에 대한 돌봄(펫시팅) 서비스, 반려 동물 교육 서비스 등을 포함한 각종 반려 동물 생활 관련 서비스일 수 있다. 본 개시의 일 실시에에 의하면, 서비스 제공 서버는, 서비스 제공 플랫폼 내의 각 상품/서비스 판매 자 단말로부터, 판매하고자 하는 상품/서비스에 관한 정보(예컨대, 상품 정보, 서비스 조건 등)를 수신 및 저장할 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 상품/서비스 판매자 단말로부 터 수신된 각 상품/서비스에 관한 정보(예컨대 사료나 간식 상품의 경우 그 명칭, 사진, 원료 식품명, 각종 첨 가물 정보 등 각종 정보 등일 수 있고, 돌봄 서비스의 경우 돌봄 제공 가능 시간 및 범위 등의 정보일 수 있 음)를 분석하고, 분석 결과에 기초한 소정의 상품/서비스 추천 결과를 가입자 단말로 전송할 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 가입자 단말 관련 정보, 예컨대 해당 반려 동물의 질병 이력 정보, 알러지 정보 등과, 상품 정보의 분석 결과 등에 기초하여 추천 상품을 선정하고 선정된 추천 상품 정보를 가입자 단말로 전송할 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 가입자 단말 관련 정보, 예컨대 해당 반려 동물의 보호자 직업 정보, 가족형태 등과, 판매자 단말로 부터 수신된 동물 돌봄 서비스 조건을 비교 분석하고, 분석 결과에 기초하여 돌봄 서비스 추천 결과를 가입자 단말로 전송할 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 각 펫택시 단말로부터 해당 단말의 위치 정보를 지속적으로 수신 및 갱신할 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 통신망을 통하여, 가입자 단말로부터 펫택시 호출 요청을 수신할 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 펫택시 호출 요청과 함께, 해당 가입자 단말의 위치 정보를 함께 수신할 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 수신된 가입자 단말의 위치로부터 소정 거리 이내 의 펫택시 단말로 펫택시 호출 요청을 전달할 수 있다. 도 2는, 도 1의 서비스 제공 서버의 개략적 기능 구성을 도시한 기능 블록도이다. 도시된 바에 의하면, 서비스 제공 서버는, 정보 송수신부, 정보 처리부, 보험 계정별 정보 데이터베이스, 가맹 병원 정보 데이터베이스, 상품/서비스 정보 데이터베이스, 직업 분석표, 및 결체 처리부를 포함한다. 본 개시의 일 실시예에 의하면, 정보 송수신부는, 서비스 제공 서버가, 도 1의 통신망을 통하여, 외부와 통신할 수 있게 한다. 본 개시의 일 실시예에 의하면, 정보 송수신부는, 도 1의 통신망 의 프로토콜에 따라, 서비스 제공 서버가 외부로 정보를 전송하거나 외부로부터 정보를 수신할 수 있게 한다. 본 개시의 일 실시예에 의하면, 정보 송수신부는, 외부와의 정보 송수신 시, 필요에 따라 정보 의 암호화 및 복호화 기능을 수행할 수 있다. 본 개시의 일 실시예에 의하면, 정보 처리부는, 정보 송수신부를 통하여 수신된 정보에 대한 분석 및 처리를 수행하고, 그에 기초하여 후술하는 보험 계정별 정보 데이터베이스, 가맹 병원 정보 데이터베이스 , 상품/서비스 정보 데이터베이스 등을 필요에 따라 적절히 갱신할 수 있다. 본 개시의 일 실시예에 의하면, 정보 처리부는, 예컨대 가입자 단말로부터의 요청에 의하거나 기타 다른 기준에 의해, 보험 계정별 정보 데이터베이스, 가맹 병원 정보 데이터베이스, 상품/서비스 정보 데이터베이스 등에 저장된 정보들을 검색 및 분석하고, 필요한 적절한 동작을 수행할 수 있다. 본 개시의 일실시예에 의하면, 정 보 처리부는, 인공지능에 기반한 자연어 분석, 이미지 분석 등의 기능을 지원할 수 있다. 본 개시의 일 실시예에 의하면, 보험 계정별 정보 데이터베이스는, 보험사 서버가 제공하는 반려 동 물 보험에 가입한 각 보험 계정별로 관련 정보가 저장된 데이터베이스일 수 있다. 본 개시의 일 실시예에 의하 면, 보험 계정별 정보 데이터베이스는, 통신망을 통하여 가입자 단말과 보험사 서버 간에 보험 가입이 이루어지는 단계에서, 보험사 서버(또는 서비스 제공 서버)로부터의 요청에 따라 또는 가입자 단말 측의 선택에 의하여, 가입자 단말로부터 제출된 각종 정보, 예컨대 반려동물 종류, 품종, 나이, 주요 병력 등 반려 동물 신상 정보와, 보호자 나이, 직업(직업군), 주소지, 수입, 동거가족 형태 등 보호자(가입자) 신상 정보 등을 수신 및 저장할 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버 는, 보험 가입 이후 가맹 동물 병원을 통한 피보험 반려 동물에 대한 검사/진료/수술 등이 이루어진 후 가맹 동물 병원으로부터의 보험금 청구 절차가 통신망을 통해 진행되는 경우, 그러한 보험금 청구 와 관련된 정보를 수신할 수 있다. 본 개시의 일 실시예에 의하면, 보험 계정별 정보 데이터베이스는, 보 험금 청구와 관련하여 수신된 정보, 예컨대 각 피보험 반려 동물에 관한 검사/진료/수술 기록을 반영하도록 갱 신될 수 있다. 본 개시의 일 실시예에 의하면, 보험 계정별 정보 데이터베이스에 저장되는 정보의 적어도 일부는 암호화되어 저장될 수 있으며, 본 개시가 이로써 제한되는 것은 아니다. 본 개시의 일 실시예에 의하면, 가맹 병원 정보 데이터베이스는, 서비스 제공 플랫폼에 가입한 동물 병원들에 관하여 수집된 정보가 기록된 데이터베이스일 수 있다. 본 개시의 일 실시예에 의하면, 병원 정보 데 이터베이스는, 예컨대 각 병원의 원장 학력, 이력사항, 병원 보유 장비 현황 등의 정보를 저장할 수 있다. 본 개시의 일 실시예에 의하면, 가맹 병원 정보 데이터베이스는, 해당 가맹 동물 병원으로부터의 보험금 청구 기록들을 저장할 수 있으며, 또한 보험금 청구와 관련된 정보에 기초하여 갱신될 수 있다. 본 개시의 일 실시예에 의하면, 상품/서비스 정보 데이터베이스는, 각 상품/서비스 판매자 단말로부 터 수신된 각종 상품/서비스별 정보를 저장한 데이터베이스일 수 있다. 본 개시의 일 실시예에 의하면, 본 플 랫폼 상에서 소정의 상품, 예컨대 사료를 판매하고자 하는 판매자는, 해당 판매자 단말를 통해 판매 희망 상품 정보를 입력할 수 있고, 이렇게 입력된 정보는 통신망을 통하여 서비스 제공 서버의 상품/ 서비스 정보 데이터베이스에 수집 및 기록될 수 있다. 본 개시의 일 실시예에 의하면, 본 플랫폼 상 에서 동물 돌봄 서비스를 제공하고자 하는 사람이, 자신의 판매자 단말을 통해. 자신의 신상 정보, 예컨대 나이, 경력, 주소 등의 정보와, 자신이 제공할 수 있는 서비스 종류 및 유형, 예컨대 동물 돌봄 가능 시간, 산 책 유무, 운동 유무, 목욕 서비스 제공 유무 등의 정보를 입력할 수 있고, 이렇게 입력된 정보는 통신망을 통하여 서비스 제공 서버의 상품/서비스 정보 데이터베이스에 수집 및 기록될 수 있다. 본 개시의 일 실시예에 의하면, 본 플랫폼 상에서 펫택시 서비스를 제공하고자 하는 펫택시업자는, 자신의 펫택시 단 말을 통해. 자신의 신상 정보, 예컨대 나이, 운전경력, 주소 등의 정보와, 차종, 차량 번호 등 펫택시 관 련 정보를 입력할 수 있고, 이렇게 입력된 정보는 통신망을 통하여 서비스 제공 서버의 상품/서비스 정보 데이터베이스에 수집 및 기록될 수 있다. 본 개시의 일 실시예에 의하면, 직업 분석표는, 알려진 대부분의 직업들을 포함한 표일 수 있다. 본 개시 의 일 실시예에 의하면, 직업 분석표는,, 각 직업에 관한 특징 정보, 예컨대 통상적인 근무시간(예컨대, 주 52시간, 주 40시간 등), 근무형태(재택, 출근, 상근, 비상근, 파트타임 등), 여가시간(예를 들어, 집에서 보 내는 시간), 정신적 피로도, 신체 피로도, 평균 소득수준 등 다양한 특징 정보를 포함한 표일 수 있다. 본 개 시의 일 실시예에 의하면, 직업 분석표는, 각종 통계 조사 등으로부터 획득된 정보에 기초하여 미리 준비 된 것일 수 있다. 본 개시의 일 실시예에 의하면, 보험 가입 단계에서 가입자 단말로부터 제공되는 가입 자 정보 중 가입자의 직업(직업군)과, 직업 분석표를 비교함으로써, 해당 가입자의 여가시간이나 피로도 정보 등 부가적인 특징 정보를 획득할 수 있다. 본 개시의 일 실시예에 의하면, 이와 같이 획득된 부가적인 특 징 정보는, 보험 계정별 정보 데이터베이스에서 해당 보험 계정과 연관되어 저장될 수 있으며, 본 개시가이로써 제한되는 것은 아니다. 본 개시의 일 실시예에 의하면, 결제 처리부는, 서비스 제공 플랫폼 상에서 이루어지는 상품 판매, 서비스 제공, 펫택시 이용 등에 대하여, 가입자 단말과 판매자 단말 및/또는 펫택시 단말 사이 에서의 결제 처리를 중계할 수 있다. 본 개시의 일실시예에 의하면, 결제 처리부의 중계 동작은 당업계에 알려진 다양한 방식에 따를 수 있으며, 본 개시에서는 구체적인 설명을 생략하기로 한다. 도 3은, 본 개시의 일 실시예에 따라, 반려 동물 보호자가 자신의 가입자 단말을 통해 보험사 서버가 제공하는 반려 동물 보험에 가입하고, 그에 따라 서비스 제공 플랫폼에 가입하는 과정을 지원하는 서비스 제공 서버의 동작 과정을 개략적으로 보여주는 동작 흐름도이다. 본 개시의 일 실시예에 의하면, 반려 동물을 양육하는 반려 동물 보호자는 임의의 루트(예컨대, 동물 병원에 의 한 소개 등)를 통하여 온라인 반려 동물 보험에 대해 접하고, 자신의 가입자 단말(예컨대, 자신의 스마트 폰 등)을 통해 서비스 제공 서버에 액세스하여 보험 가입의 요청을 제출할 수 있다(단계 302). 단계(30 2)에서, 가입자 단말로부터 보험 가입의 요청을 수신한 서비스 제공 서버는, 보험사 서버로부터 획득하거나 자신이 보유하고 있는 보험 상품 정보를 가입자 단말로 전송할 수 있다(단계 304). 본 개시의 일 실시예에 의하면, 서비스 제공 서버는 또한 가입자 단말에 대해 보험 가입에 필요한 각 종 정보를 요청할 수 있다(단계 306). 예컨대, 서비스 제공 서버는, 원하는 보험 상품 선택 정보(예컨대, 어떤 보장 범위 및 조건의 어떤 보험 상품에 가입할 것인지 등)와 함께, 피보험 반려 동물과 보호자의 신상 정 보, 예컨대 반려동물 종류, 품종, 나이, 주요 병력, 알러지 정보 등의 반려 동물 신상 정보, 보호자 나이, 직업 (직업군), 주소지, 수입, 가족형태 등 보호자 신상 정보를 요청할 수 있다. 서비스 제공 서버는, 가입자 단말로부터 이러한 보험 가입에 관한 각종 정보를 수신 및 저장하는 한편, 서비스 제공 서버 상에 대 응하는 보험 계정을 생성하여 보험 가입 절차를 완료할 수 있다(단계 308). 도 4은, 본 개시의 일 실시예에 따라, 반려 동물 보험 및 서비스 제공 플랫폼에 가입한 후 피보험 반려 동 물에 대한 진료나 검사 등이 이루어지고, 그에 따른 보험금 정산 절차가 서비스 제공 플랫폼 상에서 진행 되는 과정을 모니터링하는 서비스 제공 서버의 동작 과정을 개략적으로 보여주는 동작 흐름도이다. 본 개시의 일 실시예에 의하면, 보험 가입을 완료한 후 반려 동물 보호자는, 서비스 제공 플랫폼에 가입되 어 있는 가맹 동물 병원 중 임의의 동물 병원에 방문하여, 피보험 반려 동물에 관한 알러지 검사 등 각종 검사, 진료, 수술 등을 받을 수 있다. 본 개시의 일 실시예에 의하면, 피보험 반려 동물이 방문하여 검사 및 진료를 받은 가맹 동물 병원의 수의사 또는 병원 관계자는, 해당 병원의 가맹 병원 단말을 통하여 그러한 피보험 반려 동물의 검사 및 진료 기록을 저장할 수 있다. 본 개시의 일 실시예에 의하면, 해당 동물 병원의 수의사 또는 관계자는, 해당 가맹 병원 단말을 통하여 통신망을 통해, 서비스 제공 서버에 액세스할 수 있고, 서비스 제공 서버에 대해 보험금 정산 요청을 전송할 수 있다(단계 402). 본 개시의 일 실시예에 의하면, 보험금 정산 요청을 전송한 후, 가맹 동물 병원의 수의사 또는 병원 관계자는 해당 가맹 병원 단말 을 통해 그 결제 대금에 관한 정보와 함께 검사 및 진료 기록에 관한 정보도 서비스 제공 서버에 제 공할 수 있다(단계 404). 이러한 검사 및 진료 기록을 수신한 서비스 제공 서버는 그 수신된 정보를 이용 해서 관련 데이터베이스를 갱신할 수 있다(단계 406). 본 개시의 일 실시예에 의하면, 검사 및 진료 기록을 수 신한 서비스 제공 서버는, 예컨대 보험 계정별 정보 데이터베이스 상의 각 보험 계정에 관한 정보(예 를 들어, 피보험 반려 동물의 병력 기록, 알러지 유무 및 종류 등)를 기록 및 갱신할 수 있다. 본 개시의 일 실시예에 의하면, 검사 및 진료 기록을 수신한 서비스 제공 서버는, 예컨대 가맹 병원 정보 데이터베이스 의 해당 병원에 관한 기록(예를 들어, 해당 병원의 담당 수의사의 이력 사항 등)을 기록 및 갱신할 수 있 다. 본 도면에서, 가맹 병원은 그 가맹 병원 단말을 통해 서비스 제공 서버에 대해 보험금 청구를 진행하 는 것으로 설명되고 있으나, 본 개시가 이로써 제한되는 것은 아니다. 본 개시의 다른 실시예에 의하면, 가맹 병원은 그 가맹 병원 단말을 통해 보험사 서버에 직접 액세스하고 보험사 서버에 대해 보험금 청구를 진행할 수도 있음을 알아야 한다. 도 5는, 본 개시의 일 실시예에 따라, 서비스 제공 플랫폼에 가입한 반려 동물용 상품 판매자의 판매자 단 말로부터 상품에 관한 정보를 수신 및 분석하여 각 보험 가입자(즉, 각 피보험 반려 동물)를 위한 추천 상 품 목록을 제공하며, 그 제공된 추천 상품 목록을 토대로 가입자 단말과 판매자 단말 간 상품 판매가 이루어지도록 지원하는, 서비스 제공 서버의 동작 과정을 개략적으로 보여주는 동작 흐름도이다.본 개시의 일 실시예에 의하면, 반려 동물용 상품, 예컨대 사료나 간식 등을 비롯한 각종 상품을 판매하고자 하 는 판매자로서 서비스 제공 플랫폼에 가입한 판매자는, 자신의 판매자 단말을 통하여 판매를 희망하 는 상품의 상품 정보를 서비스 제공 서버에 제공할 수 있다(단계 502). 상품 정보로는, 예컨대 사료나 간 식의 원료 식품명, 각종 첨가물 등의 정보가 포함될 수 있으며, 본 개시가 이로써 제한되는 것은 아니다. 본 개시의 일 실시예에 의하면, 예컨대 특수한 목적에 맞게 조제된 사료나 간식(예를 들어, 소화 불량이나 수술후 기력 저하 상태의 반려 동물을 위한 사료나 간식 등)의 경우, 서비스 제공 서버에 그러한 정보가 제공될 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는 수신한 상품 정보를 상품/서비스 정보 데이 터베이스에 저장할 수 있다(단계 504). 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 수신 및 저장된 상품 정보와, 각 피보험 반려 동물에 관하여 수집되고 보험 계정별 정보 데이터베이스에 저장된 정보(예컨대, 피보험 반려 동물의 양육자로부터 가입자 단말을 통해 제공된 정보, 병원 방문 기록들과 검사 및 진료 기록 정보, 알러지 정보 등을 포함하 며, 이로써 제한되는 것은 아님)에 기초하여, 각 피보험 반려 동물에 적합한 상품, 예컨대 적절한 사료나 간식 정보 등을 검색할 수 있다(단계 506). 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 알러지별 기 피 식품에 관한 정보를 미리 저장해두고, 앞서 수신된 각각의 반려 동물을 위한 사료나 간식 상품의 정보, 예컨 대 원료 식품명이나 첨가물 정보와, 각 반려 동물별로 수집된 정보, 예컨대 각 반려 동물의 알러지 정보를 비교 분석하여, 각 반려 동물별 기피 사료 및 간식을 필터링 아웃해낸 사료 목록을 생성할 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는 또한 판매자 단말로부터 제공된 정보들에 기초하여, 각 반려 동물별로 추천할 만한 상품(예컨대, 최근에 수술을 마친 반려 동물에 대해서는 수술 후 회복기 반려 동물을 위 한 특수 제조 사료)을 특별히 선택할 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 이와 같이 각 반려 동물에 관하여 수집된 정보를 기초로, 그 반려 동물에 적합하지 않은 상품은 제외하고/하거나 해 당 반려 동물에 특별히 적합한 상품은 특별히 추천하는 형태의 상품 추천 목록을 각 가입자 단말로 제공할 수 있다(단계 508). 본 개시의 일 실시예에 의하면, 미리 정해진 소정의 규칙에 따라, 이러한 상품 추천 목록 이 생성 및 제공될 수 있다. 본 개시의 일 실시예에 의하면, 상품 추천 목록을 수신한 반려 동물 양육자는 자신의 가입자 단말을 통해 그 추천 상품 목록 중에서 하나의 상품을 선택할 수 있고, 서비스 제공 서버는 그러한 선택 정보를 수신할 수 있다(단계 510). 본 개시의 일 실시예에 의하면, 가입자 단말로부터의 상품 선택 정보가 수신된 경우, 서비스 제공 서버는, 그러한 사실을 판매자 단말로 통지하여 양자간 상품 구매 절차가 진행되도록 할 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버가 그러한 상품 구매 절차에서 중계 역할을 할 수 있으며, 다만 본 개시가 이로써 제한되는 것은 아니다. 도 6은, 본 개시의 일 실시예에 따라, 서비스 제공 플랫폼에 가입한 반려 동물용 서비스 판매자의 판매자 단말로부터 판매되는 서비스에 관한 정보를 수신 및 분석하여 각 보험 가입자(즉, 각 피보험 반려 동물)를 위한 추천 서비스 목록을 제공하며, 그 제공된 추천 서비스 목록을 토대로 가입자 단말과 판매자 단말 간 서비스 약정이 이루어지도록 지원하는, 서비스 제공 서버의 동작 과정을 개략적으로 보여주는 동 작 흐름도이다. 본 개시의 일 실시예에 의하면, 반려 동물용 서비스, 예컨대 돌봄(펫시팅) 서비스나 반려 동물 교육 서비스 등 을 제공하고자 하는 서비스 판매자(예컨대, 펫시터 또는 훈련사)로서 서비스 제공 플랫폼에 가입한 판매자 는, 자신의 판매자 단말을 통하여 자신이 판매를 희망하는 서비스(예컨대, 돌봄이나 교육 서비스)에 관한 정보를 서비스 제공 서버에 제공할 수 있다(단계 602). 서비스에 관한 정보로는, 예컨대 돌봄 서비스의 경우 돌봄 제공 가능 시간 및 범위(예를 들어, 산책이나 목욕 포함 여부 등), 또는 교정 교육 서비스의 경우 그 교정 교육의 대상이 되는 반려 동물 습성 정보 등의 정보가 포함될 수 있으며, 본 개시가 이로써 제한되는 것은 아니다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는 수신한 서비스 정보를 상품/서비스 정보 데 이터베이스에 저장할 수 있다(단계 604). 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 각 피보험 반려 동물에 관하여 수집되고 보험 계정별 정보 데이터베이스에 저장된 정보(예컨대, 피보험 반려 동물의 양육자로부터 가입자 단말을 통해 제 공된 정보, 병원 방문 기록들과 검사 및 진료 기록 정보 등을 포함하며, 이로써 제한되는 것은 아님)에 기초하 여, 각 피보험 반려 동물에 적합한 서비스 필요 요건, 예컨대 적절한 돌봄 또는 교육 서비스 필요 요건을 도출 해낼 수 있다(단계 606). 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 피보험 반려 동물의 보호 자, 즉 보험 가입자의 직업 및 동거가족 형태 등을 기초로, 소정의 기준에 따라, 해당 피보험 반려 동물을 위한 돌봄 서비스 필요 요건을 결정할 수 있다(예컨대, 무슨 요일에 몇시간 돌봄 필요, 목욕 제공 필요, 산책 제공필요 등). 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 예컨대 보험 가입자의 직업 정보와 직업 분석표 상 해당 직업에 관한 정보를 기준으로, 그 피보험 반려 동물을 위한 돌봄 서비스 필요 요건을 도출 해낼 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 예컨대 피보험 반려 동물의 습성 정 보를 기준으로, 그 피보험 반려 동물을 위한 교정 교육 서비스 필요 요건을 도출해낼 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 결정된 피보험 반려 동물을 위한 서비스 필요 요건과, 판매자 단말로부터 제공되어 상품/서비스 정보 데이터베이스에 저장된 정보들을 비교하고, 각 반려 동물별로 추천할 만한 하나 이상의 서비스를 특별히 선택할 수 있다(단계 608). 본 개시의 일 실시예 에 의하면, 서비스 제공 서버는, 이와 같이 각 피보험 반려 동물을 위하여 선택된 하나 이상의 서비스들의 추천 목록을 생성하고, 이를 각 가입자 단말로 제공할 수 있다(단계 610). 본 개시의 일 실시예에 의하면, 미리 정해진 소정의 규칙에 따라, 이러한 서비스 추천 목록이 생성 및 제공될 수 있다. 본 개시의 일 실시예에 의하면, 서비스 추천 목록을 수신한 반려 동물 양육자는 자신의 가입자 단말을 통 해 그 추천 서비스 목록 중에서 하나의 서비스를 선택할 수 있고, 서비스 제공 서버는 그러한 선택 정보를 수신할 수 있다(단계 612). 본 개시의 일 실시예에 의하면, 가입자 단말로부터의 서비스 선택 정보가 수 신된 경우, 서비스 제공 서버는, 그러한 사실을 판매자 단말로 통지하여 양자간 서비스 약정 절차가 진행되도록 할 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버가 그러한 서비스 약정 절차에 서 중계 역할을 할 수 있으며, 다만 본 개시가 이로써 제한되는 것은 아니다. 도 7은, 본 개시의 일 실시예에 따라, 서비스 제공 서버가, 서비스 제공 플랫폼에 가입한 반려 동물 양육자의 가입자 단말로부터의 요청에 기초하여, 해당 피보험 반려 동물을 위한 추천 병원 목록을 생성 및 제공하는 과정을 개략적으로 보여주는 동작 흐름도이다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 가입자 단말로부터 피보험 반려 동물의 건강 상 태에 관한 질의를 수신할 수 있다(단계 702). 본 개시의 일 실시예에 의하면, 예컨대 반려 동물 양육자는 자신 의 반려 동물의 건강 상태에 염려되는 상황이 발생하였을 때, 건강 상태에 관한 질의를 서비스 제공 서버 에 제공할 수 있다. 본 개시의 일 실시예에 의하면, 그러한 건강 상태에 관한 질의는, 소정의 텍스트 및/또는 이미지 정보를 포함할 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 가입자 단말로부터 반려 동물 양육자로부터 피 보험 반려 동물의 건강 상태에 관한 질의를 수신한 경우, 그 수신된 질의가 어떤 카테고리에 속하는가(예컨대, 안과, 정형외과, 내과 등 어떤 진료과에 관한 것인가, 수술에 관한 것인가, 예방접종에 관한 것인가 등)를 정할 수 있다(단계 704). 본 개시의 일 실시예에 의하면, 이러한 질의에 대한 분석은, 인공지능에 기반한 텍스트 분 석 및/또는 이미지 분석에 의해 이루어질 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 소정의 기준에 따라, 하나 이상의 병원을 선정할 수 있다(단계 706). 본 개시의 일 실시예에 의하면, 소정의 기준은, 예컨대 전술한 보험 가입자로부터 수신된 질 의의 분석 결과, 즉 분류된 질의 카테고리에 부합하는지(예컨대, 안과 질환으로 분류된 경우에는 안과 전문 병 원), 질의를 보낸 가입자 단말 관련 정보(예컨대, 가입자 단말과 관련하여 저장된 보험 계정의 주소 정보 및 반려 동물 질병 이력 정보 등)에 부합하는지, 각 병원의 주소지가 어디인지(예컨대, 가입자 단말 의 주소지로부터 소정 범위 이내인지), 기타 병원 관련 정보(예컨대, 전술한 병원 카테고리 정보 등) 등일 수 있다. 본 개시의 일 실시예에 의하면, 예컨대 가입자 단말로부터 수신된 질의가 슬개골 탈골에 관한 것이 라고 판정된 경우, 서비스 제공 서버는 텍스트/이미지 분석 등을 통해 해당 질의가 정형외과 수술에 관한 것임을 판정할 수 있고, 해당 가입자 단말에 관련하여 저장된 주소지 정보로부터 소정 거리 이내 그리고/ 또는 정형외과 전문 병원으로 분류된 하나 이상의 병원을 선정할 수 있다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 선정된 하나 이상의 병원으로, 가입자 단말로부 터 수신된 질의를 전달할 수 있다(딘계 708). 그러한 질의를 전달 받은 가맹 병원 단말은, 해당 병원의 의사나 관계자에게 열람될 수 있도록 해당 질문을 단말 상에 표시할 수 있다. 본 개시의 일 실시예에 의하면, 질문을 확인한 수의사 등이 가맹 병원 단말을 통해 답변을 입력하면, 그 입력된 답변은 다시 서비스 제공 서버로 제공될 수 있다(단계 710). 본 개시의 일 실시예에 의하면, 하나 이상의 가맹 병원 단말로부터 답변을 수신한 서비스 제공 서버 는, 그 수신된 답변들을 가입자 단말로 제공할 수 있다(단계 712). 본 개시의 일 실시예에 의하면, 수신 된 답변들이 가입자 단말에 제공될 경우, 해당 병원에 관한 정보(예컨대, 병원 위치, 전문 병원 여부 등에관한 표시)가 함께 가입자 단말로 함께 전달될 수 있음을 알아야 한다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 수신된 답변들과 병원에 관한 정보를 제공할 때, 펫택시 호출 여부를 묻는 선택 항목 을 함께 제공할 수 있다. 가입자 단말을 통하여 전술한 답변(및 병원 정보)을 수신한 반려 동물 양육자는, 자신의 주소지 및 해당 반려 동물의 질환을 고려한 병원 정보와, 각 병원의 의사가 제공한 답변을 토 대로, 병원 방문 여부에 대한 결정을 내릴 수 있다. 본 개시의 일 실시예에 의하면, 반려 동물 양육자는, 방문 하고자 하는 병원을 선택한 경우, 펫택히 호출 선택을 통해 용이하게 펫택시 서비스를 이용할 수 있다. 도 8은, 본 개시의 일 실시예에 따라, 서비스 제공 서버가 서비스 제공 플랫폼에 가입한 각 가입자 단말과 펫택시 단말 간 서비스를 중개하는 과정을 개략적으로 보여주는 동작 흐름도이다. 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 서비스 제공 플랫폼에 가입한 펫택시의 각 단말 위치를 계속하여 추적할 수 있다(단계 802). 본 개시의 일 실시예에 의하면, 서비스 제공 서버는, 가입자 단말로부터 펫택시 호출 요청을 수신할 수 있다(단계 804). 본 개시의 일 실시예에 의하면, 가입자 단말 로부터 서비스 제공 서버로 제공되는 펫택시 호출은, 해당 가입자 단말의 위치 정보를 포함할 수 있다. 본 개시의 일 실시예에 의하면, 가입자 단말로부터의 펫택시 호출은, 목적지 정보 및 기타 결제 정보(예컨대, 카드 번호 등)를 더 포함할 수 있다. 본 개시의 일 실시예에 의하면, 펫택시 호출 요청을 수신한 서비스 제공 서버는, 그 호출이 들어온 가입자 단말의 위치 정보를 토대로, 해당 위치로부터 소정 범 위 내에 존재하는 것으로 판단된 펫택시들을 선택하고, 해당 선택된 펫택시들에 대해 호출 요청을 제공할 수 있 다(단계 806). 본 개시의 일 실시예에 의하면, 호출 요청을 수신한 펫택시업자는 자신의 단말을 통해 해 당 호출에 대한 수락 응답을 서비스 제공 서버로 전달(단계 808)하고, 해당 가입자 단말의 소재지로 이동할 수 있다. 본 개시의 일 실시예에 의하면, 펫택시 이용의 과금 및 결제 절차가 서비스 제공 서버의 중재 하에 온라인 상에서 이루어질 수도 있으나, 본 개시가 이로써 제한되는 것은 아니다. 본 개시의 다른 실 시예에 의하면, 펫택시의 이용, 과금 및 결제의 과정은 통상적인 오프라인 상의 과정에 따라 이루어질 수 있음 을 알아야 한다. 당업자라면 알 수 있듯이, 본 개시는 본 명세서에서 기술된 예시에 한정되는 것이 아니라 본 개시의 범주를 벗 어나지 않는 범위 내에서 다양하게 변형, 재구성 및 대체될 수 있다. 예를 들어, 본원에 기술된 다양한 기술들 은 하드웨어 또는 소프트웨어, 또는 하드웨어와 소프트웨어의 조합에 의해 구현될 수 있다. 본 개시의 일 실시예에 따른 컴퓨터 프로그램은, 컴퓨터 프로세서 등에 의해 판독 가능한 저장 매체, 예컨대 EPROM, EEPROM, 플래시 메모리장치와 같은 비휘발성 메모리, 내장형 하드 디스크와 착탈식 디스크 같은 자기 디 스크, 광자기 디스크, 및 CDROM 디스크 등을 포함한 다양한 유형의 저장 매체에 저장된 형태로 구현될 수 있다. 또한, 프로그램 코드(들)는 어셈블리어나 기계어로 구현될 수 있고, 전기 배선이나 케이블링, 광섬유, 또는 기 타 임의의 다른 형태의 전송 매체를 통해 전송되는 형태로 구현될 수도 있다. 본 개시의 진정한 사상 및 범주에 속하는 모든 변형 및 변경을 이하의 특허청구범위에 의해 모두 포괄하고자 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8"}
{"patent_id": "10-2019-0106560", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은, 본 개시의 일 실시예에 따른, 보험 연계형 반려 동물 생활 서비스 제공 플랫폼의 구성을 개략적으 로 도시한 도면이다. 도 2는, 도 1의 서비스 제공 서버의 개략적 기능 구성을 도시한 기능 블록도이다. 도 3은, 본 개시의 일 실시예에 따라, 반려 동물 보호자가 자신의 가입자 단말을 통해 보험사 서버가 제공하는 반려 동물 보험에 가입하고, 그에 따라 서비스 제공 플랫폼에 가입하는 과정을 지원하는 서비스 제공 서버의 동작 과정을 개략적으로 보여주는 동작 흐름도이다. 도 4은, 본 개시의 일 실시예에 따라, 반려 동물 보험 및 서비스 제공 플랫폼에 가입한 후 피보험 반려 동 물에 대한 진료나 검사 등이 이루어지고, 그에 따른 보험금 정산 절차가 서비스 제공 플랫폼 상에서 진행 되는 과정을 모니터링하는 서비스 제공 서버의 동작 과정을 개략적으로 보여주는 동작 흐름도이다. 도 5는, 본 개시의 일 실시예에 따라, 서비스 제공 플랫폼에 가입한 반려 동물용 상품 판매자의 판매자 단 말로부터 상품에 관한 정보를 수신 및 분석하여 각 보험 가입자(즉, 각 피보험 반려 동물)를 위한 추천 상 품 목록을 제공하며, 그 제공된 추천 상품 목록을 토대로 가입자 단말과 판매자 단말 간 상품 판매가 이루어지도록 지원하는, 서비스 제공 서버의 동작 과정을 개략적으로 보여주는 동작 흐름도이다. 도 6은, 본 개시의 일 실시예에 따라, 서비스 제공 플랫폼에 가입한 반려 동물용 서비스 판매자의 판매자 단말로부터 판매되는 서비스에 관한 정보를 수신 및 분석하여 각 보험 가입자(즉, 각 피보험 반려 동물)를 위한 추천 서비스 목록을 제공하며, 그 제공된 추천 서비스 목록을 토대로 가입자 단말과 판매자 단말 간 서비스 약정이 이루어지도록 지원하는, 서비스 제공 서버의 동작 과정을 개략적으로 보여주는 동 작 흐름도이다. 도 7은, 본 개시의 일 실시예에 따라, 서비스 제공 서버가, 서비스 제공 플랫폼에 가입한 반려 동물 양육자의 가입자 단말로부터의 요청에 기초하여, 해당 피보험 반려 동물을 위한 추천 병원 목록을 생성 및 제공하는 과정을 개략적으로 보여주는 동작 흐름도이다. 도 8은, 본 개시의 일 실시예에 따라, 서비스 제공 서버가 서비스 제공 플랫폼에 가입한 각 가입자 단말과 펫택시 단말 간 서비스를 중개하는 과정을 개략적으로 보여주는 동작 흐름도이다."}
