{"patent_id": "10-2021-0091577", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0011034", "출원번호": "10-2021-0091577", "발명의 명칭": "단말에서의 사용자 정보 클러스터링 방법, 그리고 이를 이용한 인구통계학적 정보 추정 방법", "출원인": "주식회사 카카오", "발명자": "김용완"}}
{"patent_id": "10-2021-0091577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 하나의 프로세서에 의해 동작하는 서버의 동작 방법으로서,표본 단말들로부터 사용자 동의를 받은 인구통계학적 정보를 수집하고, 지정한 클러스터링 규칙으로 사용자 정보를 클러스터링한 클러스터 식별자를 획득하는 단계,상기 표본 단말들로부터 수집한 인구통계학적 정보와 클러스터 식별자를 기초로, 클러스터 식별자별 인구통계학적 정보를 매핑하는 단계,임의 단말로부터, 상기 클러스터링 규칙으로 사용자 정보를 클러스터링한 결과인 특정 클러스터 식별자를 수신하는 단계, 그리고상기 클러스터 식별자별 인구통계학적 정보를 기초로, 상기 특정 클러스터 식별자를 가진 상기 임의 단말의 인구통계학적 정보를 추정하는 단계를 포함하는 동작 방법."}
{"patent_id": "10-2021-0091577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에서,상기 특정 클러스터 식별자를 수신하는 단계는상기 임의 단말로부터 상기 특정 클러스터 식별자를 포함하는 콘텐츠 요청을 수신하는, 동작 방법."}
{"patent_id": "10-2021-0091577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에서,추정한 인구통계학적 정보를 기초로 추출한 타게팅 정보를 상기 임의 단말로 제공하는 단계를 더 포함하는, 동작 방법."}
{"patent_id": "10-2021-0091577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에서,상기 클러스터링 규칙은클러스터링 대상, 클러스터링 알고리즘, 그리고 클러스터 수를 포함하는 클러스터링 파라미터를 포함하는, 동작방법."}
{"patent_id": "10-2021-0091577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에서,상기 클러스터링 대상은각 단말에서 실행되는 어플리케이션에서 수집할 수 있는 사용자 정보로 지정되는, 동작 방법."}
{"patent_id": "10-2021-0091577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에서,상기 클러스터링 대상은소셜 미디어 어플리케이션에서 이용 중인 오픈 채팅방 목록/비즈니스 채널 목록, 친구 목록, 또는 친구와의 메시지 교환 횟수인, 동작 방법.공개특허 10-2023-0011034-3-청구항 7 적어도 하나의 프로세서에 의해 동작하는 서버의 동작 방법으로서,단말들로 사용자 정보의 클러스터링을 위한 클러스터링 규칙을 전송하고, 상기 클러스터링 규칙으로 사용자 정보를 클러스터링하여 획득된 클러스터 식별자들을 수신하는 클러스터링 라운드를 진행하는 단계,상기 클러스터링 라운드에서 획득한 클러스터별 단말 밀도를 기초로, 클러스터 조정이 필요한지 판단하는 단계,그리고상기 클러스터 조정이 필요한 경우, 클러스터 수가 변경된 새로운 클러스터링 규칙을 생성하고, 상기 새로운 클러스터링 규칙을 이용하여 상기 클러스터링 라운드를 반복하는 단계를 포함하는 동작 방법."}
{"patent_id": "10-2021-0091577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에서,상기 클러스터 조정이 필요한지 판단하는 단계는k-익명성 기준을 만족하지 못하는 클러스터가 있으면 상기 클러스터 조정이 필요하다고 판단하는, 동작 방법."}
{"patent_id": "10-2021-0091577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에서,상기 클러스터 조정이 필요한지 판단하는 단계는기준 이상의 과밀 클러스터가 있으면 상기 과밀 클러스터를 세부적으로 클러스터링하는 클러스터 조정이 필요하다고 판단하는, 동작 방법."}
{"patent_id": "10-2021-0091577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에서,표본 단말들로부터 사용자 동의를 받은 인구통계학적 정보를 수집하고, 상기 표본 단말들에서 상기 클러스터 조정된 클러스터링 규칙으로 사용자 정보를 클러스터링한 클러스터 식별자를 수집해서, 각 클러스터 식별자에 인구통계학적 정보를 레이블링하는 단계를 더 포함하는, 동작 방법."}
{"patent_id": "10-2021-0091577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에서,임의 단말로부터, 상기 클러스터 조정된 클러스터링 규칙으로 사용자 정보를 클러스터링한 결과인 특정 클러스터 식별자를 수신하는 단계, 그리고상기 표본 단말들로부터 획득한 클러스터 식별자별 인구통계학적 정보를 기초로, 상기 특정 클러스터 식별자를가진 상기 임의 단말의 인구통계학적 정보를 추정하는 단계를 더 포함하는, 동작 방법."}
{"patent_id": "10-2021-0091577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에서,추정한 인구통계학적 정보를 기초로 추출한 타게팅 정보를 상기 임의 단말로 제공하는 단계를 더 포함하는, 동작 방법."}
{"patent_id": "10-2021-0091577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "적어도 하나의 프로세서에 의해 동작하는 단말의 동작 방법으로서,공개특허 10-2023-0011034-4-클러스터링 규칙에 따라 사용자 정보를 추출하고, 상기 사용자 정보를 클러스터링하는 단계,상기 클러스터링을 통해 획득한 클러스터 식별자를 서버로 전송하는 단계, 그리고상기 서버로부터, 상기 클러스터 식별자에 레이블링된 인구통계학적 정보로 타게팅된 정보를 수신하는 단계를포함하고, 상기 클러스터링 규칙은 클러스터링 대상, 클러스터링 알고리즘, 그리고 클러스터 수를 포함하는 클러스터링 파라미터를 포함하는, 동작방법."}
{"patent_id": "10-2021-0091577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에서,상기 클러스터링 대상은각 단말에서 실행되는 어플리케이션에서 수집할 수 있는 사용자 정보로 지정되는, 동작 방법."}
{"patent_id": "10-2021-0091577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에서,상기 클러스터링 대상은 상기 소셜 미디어 어플리케이션에서 이용 중인 오픈 채팅방 목록/비즈니스 채널 목록이고, 상기 클러스터링 알고리즘은 인구통계학적 정보에 해당하는 오픈 채팅방 목록/비즈니스 채널 목록이 분류된 룰(rule)을 이용한 분류 알고리즘인, 동작 방법."}
{"patent_id": "10-2021-0091577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제14항에서,상기 클러스터링 대상은 상기 소셜 미디어 어플리케이션의 친구 목록이고,상기 클러스터링 알고리즘은 해시 함수를 이용한 클러스터링 알고리즘인, 동작 방법."}
{"patent_id": "10-2021-0091577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제14항에서,상기 클러스터링 대상은 상기 소셜 미디어 어플리케이션에서 친구와의 메시지 교환 횟수이고, 상기 클러스터링 알고리즘은 친구를 단어로 취급하는 토픽 모델링을 이용한 클러스터링 알고리즘인, 동작 방법."}
{"patent_id": "10-2021-0091577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "적어도 하나의 프로세서에 의해 동작하는 서버의 동작 방법으로서,표본 단말들에게, 로컬 클러스터링 모델을 제공하고, 클러스터링 대상에 해당하는 사용자 정보로부터, 입력받은인구통계학적 정보 또는 상기 입력받은 인구통계학적 정보에 해당하는 클러스터 식별자가 추정되도록 상기 로컬클러스터링 모델의 학습을 요청하는 단계,상기 표본 단말들에서 학습된 로컬 클러스터링 모델들을 기초로 하나의 글로벌 클러스터링 모델을 생성하는 단계,상기 글로벌 클러스터링 모델을, 인구통계학적 정보의 추정 대상 단말들에게 전송하는 단계, 그리고임의 단말로부터, 상기 글로벌 클러스터링 모델에서 추정된 인구통계학적 정보 또는 특정 클러스터 식별자를 포함하는 콘텐츠 요청을 수신하는 단계, 그리고클러스터 식별자별로 레이블링된 인구통계학적 정보를 이용하여, 상기 콘텐츠 요청에 대한 타게팅 정보를 추출하는 단계공개특허 10-2023-0011034-5-를 포함하는 동작 방법."}
{"patent_id": "10-2021-0091577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에서,상기 임의 단말로부터, 상기 글로벌 클러스터링 모델에서 추정된 인구통계학적 정보를 수신한 경우, 상기 추정된 인구통계학적 정보에 해당하는 상기 특정 클러스터 식별자를 상기 임의 단말로 전송하는 단계를 더 포함하는, 동작 방법."}
{"patent_id": "10-2021-0091577", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제18항에서,상기 글로벌 클러스터링 모델은설치된 단말에서 획득된 사용자 정보를 입력받고, 입력받은 사용자 정보에 해당하는 인구통계학적 정보 또는 입력받은 사용자 정보에 해당하는 클러스터 식별자를 추정하는 인공지능 모델인, 동작 방법."}
{"patent_id": "10-2021-0091577", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "서버가 인구통계학적 정보를 추정하는 방법으로서, 표본 단말들로부터 사용자 동의를 받은 인구통계학적 정보를 수집하고, 지정한 클러스터링 규칙으로 사용자 정보를 클러스터링한 클러스터 식별자를 획득하는 단계, 상기 표 본 단말들로부터 수집한 인구통계학적 정보와 클러스터 식별자를 기초로, 클러스터 식별자별 인구통계학적 정보 를 저장하는 단계, 임의 단말로부터, 상기 클러스터링 규칙으로 사용자 정보를 클러스터링한 결과인 특정 클러스 터 식별자를 수신하는 단계, 그리고 상기 클러스터 식별자별 인구통계학적 정보를 기초로, 상기 특정 클러스터 식별자를 가진 상기 임의 단말의 인구통계학적 정보를 추정하는 단계를 포함한다."}
{"patent_id": "10-2021-0091577", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 인구통계학적 정보 추정에 관한 것이다."}
{"patent_id": "10-2021-0091577", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인구통계학적 정보(demographic information)는 성별, 연령, 지역 등과 같은 인구통계정보로서, 인구통계학적 특성에 따라 사용자 성향이 달라지므로, 사용자 맞춤형 서비스를 제공하기 위해서 사용자의 인구통계학적 정보 를 알아내는 것이 매우 중요하다. 종래에는 중앙 서버가 사용자 정보를 수집하고, 사용자 정보를 분석하여 사용자의 성별, 연령 등을 추정하였다. 하지만, 정확한 인구통계학적 정보를 추정하기 위해서는 많은 사용자 정보를 수집해야 하는데, 개인정보 보호가 중요하게 여겨지면서 사용자 정보 수집이 쉽지 않다. 또한, 중앙 서버가 성별, 연령, 지역 등과 같은 해상도 낮 은 정보를 얻기 위해서 대량의 사용자 정보를 수집하고 분석해야 하므로, 중앙 집중식 인구통계학적 정보 추정 은 상당히 비효율적이다. 최근에는 연합학습(Federated Learning)을 통한 추천 기술이 연구되고 있다. 하지만, 연합학습 기반 추천 기술 은 개인정보 보호를 위해 사용자 식별키를 사용하지 않고, 오직 특징(feature)만을 보고 추천한다. 따라서, 추 천에서 가장 중요한 요소 중 하나인 인구통계학적 정보를 활용한 타겟팅이 불가능하다."}
{"patent_id": "10-2021-0091577", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 단말에서의 클러스터링 방법, 그리고 이를 이용한 인구통계학적 정보 추정 방법 및 서버를 제공하는 것이다. 본 개시는 단말들이 개별적으로 사용자 정보를 클러스터링한 결과를 서버로 전송하고, 서버는 클러스터별로 레 이블링된 인구통계학적 정보를 이용하여, 단말의 인구통계학적 정보를 추정하는 방법을 제공하는 것이다."}
{"patent_id": "10-2021-0091577", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "한 실시예에 따라 적어도 하나의 프로세서에 의해 동작하는 서버의 동작 방법으로서, 표본 단말들로부터 사용자 동의를 받은 인구통계학적 정보를 수집하고, 지정한 클러스터링 규칙으로 사용자 정보를 클러스터링한 클러스터 식별자를 획득하는 단계, 상기 표본 단말들로부터 수집한 인구통계학적 정보와 클러스터 식별자를 기초로, 클러 스터 식별자별 인구통계학적 정보를 매핑하는 단계, 임의 단말로부터, 상기 클러스터링 규칙으로 사용자 정보를 클러스터링한 결과인 특정 클러스터 식별자를 수신하는 단계, 그리고 상기 클러스터 식별자별 인구통계학적 정보를 기초로, 상기 특정 클러스터 식별자를 가진 상기 임의 단말의 인구통계학적 정보를 추정하는 단계를 포함 한다. 상기 특정 클러스터 식별자를 수신하는 단계는 상기 임의 단말로부터 상기 특정 클러스터 식별자를 포함하는 콘 텐츠 요청을 수신할 수 있다. 상기 동작 방법은 추정한 인구통계학적 정보를 기초로 추출한 타게팅 정보를 상기 임의 단말로 제공하는 단계를 더 포함할 수 있다. 상기 클러스터링 규칙은 클러스터링 대상, 클러스터링 알고리즘, 그리고 클러스터 수를 포함하는 클러스터링 파 라미터를 포함할 수 있다. 상기 클러스터링 대상은 각 단말에서 실행되는 어플리케이션에서 수집할 수 있는 사용자 정보로 지정될 수 있다. 상기 클러스터링 대상은 소셜 미디어 어플리케이션에서 이용 중인 오픈 채팅방 목록/비즈니스 채널 목록, 친구 목록, 또는 친구와의 메 시지 교환 횟수일 수 있다. 다른 실시예에 따라 적어도 하나의 프로세서에 의해 동작하는 서버의 동작 방법으로서, 단말들로 사용자 정보의 클러스터링을 위한 클러스터링 규칙을 전송하고, 상기 클러스터링 규칙으로 사용자 정보를 클러스터링하여 획득 된 클러스터 식별자들을 수신하는 클러스터링 라운드를 진행하는 단계, 상기 클러스터링 라운드에서 획득한 클 러스터별 단말 밀도를 기초로, 클러스터 조정이 필요한지 판단하는 단계, 그리고 상기 클러스터 조정이 필요한 경우, 클러스터 수가 변경된 새로운 클러스터링 규칙을 생성하고, 상기 새로운 클러스터링 규칙을 이용하여 상 기 클러스터링 라운드를 반복하는 단계를 포함한다. 상기 클러스터 조정이 필요한지 판단하는 단계는 k-익명성 기준을 만족하지 못하는 클러스터가 있으면 상기 클 러스터 조정이 필요하다고 판단할 수 있다. 상기 클러스터 조정이 필요한지 판단하는 단계는 기준 이상의 과밀 클러스터가 있으면 상기 과밀 클러스터를 세 부적으로 클러스터링하는 클러스터 조정이 필요하다고 판단할 수 있다. 상기 동작 방법은 표본 단말들로부터 사용자 동의를 받은 인구통계학적 정보를 수집하고, 상기 표본 단말들에서 상기 클러스터 조정된 클러스터링 규칙으로 사용자 정보를 클러스터링한 클러스터 식별자를 수집해서, 각 클러 스터 식별자에 인구통계학적 정보를 레이블링하는 단계를 더 포함할 수 있다. 상기 동작 방법은 임의 단말로부터, 상기 클러스터 조정된 클러스터링 규칙으로 사용자 정보를 클러스터링한 결 과인 특정 클러스터 식별자를 수신하는 단계, 그리고 상기 표본 단말들로부터 획득한 클러스터 식별자별 인구통 계학적 정보를 기초로, 상기 특정 클러스터 식별자를 가진 상기 임의 단말의 인구통계학적 정보를 추정하는 단 계를 더 포함할 수 있다. 상기 동작 방법은 추정한 인구통계학적 정보를 기초로 추출한 타게팅 정보를 상기 임의 단말로 제공하는 단계를 더 포함할 수 있다. 또 다른 실시예에 따라 적어도 하나의 프로세서에 의해 동작하는 단말의 동작 방법으로서, 클러스터링 규칙에 따라 사용자 정보를 추출하고, 상기 사용자 정보를 클러스터링하는 단계, 상기 클러스터링을 통해 획득한 클러 스터 식별자를 서버로 전송하는 단계, 그리고 상기 서버로부터, 상기 클러스터 식별자에 레이블링된 인구통계학 적 정보로 타게팅된 정보를 수신하는 단계를 포함하고, 상기 클러스터링 규칙은 클러스터링 대상, 클러스터링 알고리즘, 그리고 클러스터 수를 포함하는 클러스터링 파라미터를 포함한다. 상기 클러스터링 대상은 각 단말에서 실행되는 어플리케이션에서 수집할 수 있는 사용자 정보로 지정될 수 있다. 상기 클러스터링 대상은 상기 소셜 미디어 어플리케이션에서 이용 중인 오픈 채팅방 목록/비즈니스 채널 목록이 고, 상기 클러스터링 알고리즘은 인구통계학적 정보에 해당하는 오픈 채팅방 목록/비즈니스 채널 목록이 분류된 룰(rule)을 이용한 분류 알고리즘일 수 있다. 상기 클러스터링 대상은 상기 소셜 미디어 어플리케이션의 친구 목록이고, 상기 클러스터링 알고리즘은 해시 함 수를 이용한 클러스터링 알고리즘일 수 있다.상기 클러스터링 대상은 상기 소셜 미디어 어플리케이션에서 친구와의 메시지 교환 횟수이고, 상기 클러스터링 알고리즘은 친구를 단어로 취급하는 토픽 모델링을 이용한 클러스터링 알고리즘일 수 있다. 또 다른 실시예에 따라 적어도 하나의 프로세서에 의해 동작하는 서버의 동작 방법으로서, 표본 단말들에게, 로 컬 클러스터링 모델을 제공하고, 클러스터링 대상에 해당하는 사용자 정보로부터, 입력받은 인구통계학적 정보 또는 상기 입력받은 인구통계학적 정보에 해당하는 클러스터 식별자가 추정되도록 상기 로컬 클러스터링 모델의 학습을 요청하는 단계, 상기 표본 단말들에서 학습된 로컬 클러스터링 모델들을 기초로 하나의 글로벌 클러스터 링 모델을 생성하는 단계, 상기 글로벌 클러스터링 모델을, 인구통계학적 정보의 추정 대상 단말들에게 전송하 는 단계, 그리고 임의 단말로부터, 상기 글로벌 클러스터링 모델에서 추정된 인구통계학적 정보 또는 특정 클러 스터 식별자를 포함하는 콘텐츠 요청을 수신하는 단계, 그리고 클러스터 식별자별로 레이블링된 인구통계학적 정보를 이용하여, 상기 콘텐츠 요청에 대한 타게팅 정보를 추출하는 단계를 포함한다. 상기 동작 방법은 상기 임의 단말로부터, 상기 글로벌 클러스터링 모델에서 추정된 인구통계학적 정보를 수신한 경우, 상기 추정된 인구통계학적 정보에 해당하는 상기 특정 클러스터 식별자를 상기 임의 단말로 전송하는 단 계를 더 포함할 수 있다. 상기 글로벌 클러스터링 모델은 설치된 단말에서 획득된 사용자 정보를 입력받고, 입력받은 사용자 정보에 해당 하는 인구통계학적 정보 또는 입력받은 사용자 정보에 해당하는 클러스터 식별자를 추정하는 인공지능 모델일 수 있다."}
{"patent_id": "10-2021-0091577", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "실시예에 따르면, 서버가 사용자 정보를 가지고 있는 단말들에서 수행된 클러스터링 결과를 이용하여 인구통계 학적 정보를 추정할 수 있으므로, 개인정보를 보호하면서 대량의 정보를 수집하지 않고도 인구통계학적 정보를 이용한 타게팅을 할 수 있다. 실시예에 따르면, 클러스터별 단말 밀도를 기초로 클러스터링 라운드를 반복해가면서 각 클러스터의 분류 해상 도를 조정할 수 있고, 이를 통해 한쪽으로 편중되지 않는 고른 밀도의 클러스터들을 만들 수 있으며, 결과적으 로 k-익명성을 보장할 수 있다."}
{"patent_id": "10-2021-0091577", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참고로 하여 본 개시의 실시예에 대하여 본 개시가 속하는 기술 분야에서 통상의 지 식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 개시는 여러 가지 상이한 형태로 구현 될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 개시를 명확하게 설명하기 위 해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 또한, 명세서에 기재 된 \"…부\", \"…기\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드 웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 서버는 하나 이상의 프로세서, 프로세서에 의하여 수행되는 컴퓨터 프로그램을 로드하는 메모리, 컴퓨터 프로그 램 및 각종 데이터를 저장하는 저장 장치, 통신 인터페이스를 포함할 수 있다. 이외에도, 서버는 다양한 구성요소가 더 포함될 수 있다. 프로세서는 서버의 동작을 제어하는 장치로서, 컴퓨터 프로그램에 포함된 명령어들 을 처리하는 다양한 형태의 프로세서일 수 있고, 예를 들면, CPU(Central Processing Unit), MPU(Micro Processor Unit), MCU(Micro Controller Unit), GPU(Graphic Processing Unit) 또는 본 개시의 기술 분야에 잘 알려진 임의 형태의 프로세서 중 적어도 하나를 포함하여 구성될 수 있다. 메모리는 각종 데이터, 명령 및/또는 정보를 저장한다. 메모리는 본 개시의 동작을 실행하도록 기술된 명령어들이 프로세서에 의해 처리되도록 해당 컴퓨터 프로그램을 저장 장치로부터 로드할 수 있다. 메모리는 예를 들면, ROM(read only memory), RAM(random access memory) 등 일 수 있다. 저장 장치는 컴퓨터 프로그램, 각종 데이터를 비임시적으로 저장할 수 있다. 저 장 장치는 ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리 등과 같은 비휘발성 메모리, 하드 디스크, 착탈형 디스크, 또는 본 개시가 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터로 읽을 수 있는 기록 매체를 포함하여 구성될 수 있다. 통신 인터페이스는 유/무선 통신을 지원하는 유/무선 통신 모듈일 수 있다. 컴퓨터 프로그램은, 프로세서에 의 해 실행되는 명령어들(instructions)을 포함하고, 비일시적-컴퓨터 판독가능 저장매체(non-transitory computer readable storage medium)에 저장되며, 명령어들은 프로세서가 본 개시의 동작을 실행하도록 만든다. 단말은 컴퓨터 판독 가능한 저장 매체에 저장되는 소프트웨어인 어플리케이션/프로그램, 그리고 프로세서, 메모 리, 디스플레이, 통신 모듈 등의 하드웨어를 포함한다. 프로세서는 하드웨어들과 협력하여 어플리케이션을 구동 한다. 디스플레이는 어플리케이션에서 제공하는 사용자 인터페이스 화면을 표시하고, 사용자 입력을 수신할 수 있고, 예를 들면 터치 입력을 수신할 수 있다. 통신 모듈은 통신망을 통해 서버와 통신한다. 단말은 다양한 형 태로 구현될 수 있고, 모바일 단말을 예로 들어 설명한다. 단말은 인구통계학적 정보 추정을 위한 프로그램을 탑재한다. 인구통계학적 정보 추정 프로그램은 단말에서 실 행되는 어플리케이션들로부터 사용자 정보를 획득하고, 지정된 동작을 수행한다. 설명에서, 사용자 정보는 단말 에서 실행되는 소셜 미디어 어플리케이션에서 획득된다고 가정하나, 이에 한정되는 것은 아니다. 소셜 미디어 어플리케이션은 예를 들면 카카오톡과 같은 인스턴트 메시징 서비스 기반의 어플리케이션을 비롯하여, 페이스북, 인스타그램 등의 각종 소셜 네트워킹 어플리케이션을 포함할 수 있다. 인구통계학적 정보 추정 프로그램은 모듈 형태로 소셜 미디어 어플리케이션에 플러그인되어 배포 및 업데이트될 수 있고, 또는 단말에 설치된 다양한 어플리케이션들로부터 필요한 정보를 획득할 수 있도록 별도 프로그램으로 설치될 수 있다. 인구통계학적 정보 추정에 사용되는 사용자 정보는 단말 내에서만 이용되고, 외부로 유출되지 않으므로, 다양한 개인정보가 인구통계학적 정보 추정에 이용될 수 있다. 예를 들면, 사용자의 소셜 미디어 어플리케이션에서 관 리되는 정보(예를 들면, 친구목록, 오픈 채팅방 목록, 구독한 비즈니스채널 목록 등), 소셜 미디어 어플리케이 션에서 주고받는 메시지 관련 정보(예를 들면, 메시지 수, 메시지 교환하는 친구 수, 친구와의 메시지 교환 빈 도 등), 소셜 미디어 어플리케이션에 게시된 콘텐츠 종류 및 수 등이 인구통계학적 정보를 추론하는 데 사용될 수 있는데, 이는 일부 예시일 뿐이고, 단말에서 얻을 수 있는 다양한 형태(예를 들면, 통화 관련 정보, 송금 정 보, 구매 패턴 등)의 사용자 정보가 인구통계학적 정보 추정에 이용될 수 있다. 도 1은 한 실시예에 따른 인구통계학적 정보 추정 시스템의 구성도이다. 도 1을 참고하면, 인구통계학적 정보 추정 시스템은 서버 그리고 서버와 통신하는 복수의 단말들 (200-1~200-k, 300-1~300-n)을 포함한다. 서버는 단말들과 통신하고, 단말들의 인구통계학적 정보를 추정 한다. 여기서, 서버는 인구통계학적 정보 추정에 사용되는 사용자 정보(예를 들면, 친구목록)를 다루는 어 플리케이션(예를 들면, 카카오톡과 같은 소셜 미디어 어플리케이션)에 관계된 서버이거나, 타게팅 광고 등의 콘 텐츠를 제공하는 사업자의 서버일 수 있고, 추정한 인구통계학적 정보를 다른 서버들에게 제공하는 서버일 수도 있다. 복수의 단말들 중 일부 단말들(200-1~200-k)은 서버가 클러스터별 인구통계학적 정보를 얻기 위해 추출한 표본 단말들로서, 사용자 동의를 받고 성별, 연령, 지역 등의 필요한 인구통계학적 정보를 서버에 제공한 다. 나머지 단말들(300-1~300-n)은 인구통계학적 정보의 추정 대상들이라고 가정한다. 서버는 표본 단말들에게 사용자 정보의 클러스터링을 위한 클러스터링 규칙을 미리 제공한다. 표본 단말들 은 서버에서 지정한 클러스터링 규칙으로 사용자 정보를 클러스터링해서 클러스터 식별자를 획득하고, 클 러스터 식별자를 서버로 전송한다. 그러면, 서버는 표본 단말들로부터 수집한 인구통계학적 정보와 클러스터 식별자를 기초로 각 클러스터 식별자에 인구통계학적 정보를 레이블링할 수 있다. 예를 들면, 표 1과같이, 클러스터1의 인구통계학적 정보는 여자 및 10대가 레이블링되고, 클러스터2의 인구통계학적 정보는 여자 및 20대가 레이블링될 수 있다. 표본 단말들은 인구통계학적 정보가 고르게 분포하도록 추출될 수 있다. 표 1 클러스터 식별자 성별 연령 클러스터1 여자 10대 클러스터2 여자 20대 클러스터3 여자 30대 클러스터4 여자 40대 클러스터5 여자 50대 클러스터6 여자 60대 이상 클러스터7 남자 10대 클러스터8 남자 20대 클러스터9 남자 30대 클러스터10 남자 40대 클러스터11 남자 50대 클러스터12 남자 60대 이상 서버는 인구통계학적 정보를 추정할 단말들(300-1~300-n)에게, 사용자 정보의 클러스터링을 위한 클러스터 링 규칙을 제공하고, 각 단말로부터 클러스터링 규칙에 따라 획득된 클러스터 식별자를 획득할 수 있다. 클러스 터링 규칙은 복수일 수 있고, 클러스터링 규칙에서 지시하는 클러스터링 대상(사용자 정보)은 다양할 수 있다. 예를 들면, 클러스터링 규칙1은, 클러스터링 대상이 소셜 미디어 어플리케이션에서 이용 중인 오픈 채팅방 목록 /비즈니스 채널(예, 서비스제공사에 의해 운영 중인 카카오톡채널) 목록이고, 클러스터 수가 N이며, 클러스터링 알고리즘이 룰 기반 분류(rule based classification) 알고리즘으로 정의될 수 있다. 클러스터링 규칙2는, 클러 스터링 대상이 친구 목록이고, 클러스터 수가 N이며, 클러스터링 알고리즘이 해시 함수를 이용한 클러스터링 알 고리즘으로 정의될 수 있다. 또는 클러스터링 규칙3은 클러스터링 대상이 친구와의 메시지 교환 횟수이고, 클러 스터 수가 N이며, 클러스터링 알고리즘이 친구를 단어로 취급하는 토픽 모델링을 이용한 클러스터링 알고리즘으 로 정의될 수 있다. 클러스터링 규칙마다 클러스터 수가 동일할 필요는 없다. 각 클러스터 규칙에 의해 생성되 는 클러스터 식별자 집합이 동일할 필요는 없고, 클러스터 규칙별로 추정하는 인구통계학적 정보가 다를 수 있 다. 클러스터의 수는, 서버에서 추정하고자 하는 인구통계학적 정보의 해상도에 따라 달라진다. 예를 들면, 간 단하게 남 또는 여를 추정하고자 하는 경우, 클러스터 수는 2일 수 있다. 또는, 성별(남, 여) 및 연령대(10대, 20대, 30대, 40대, 50대, 60대 이상)를 동시에 추정하고자 하는 경우, 표 1과 같이 클러스터 수는 12(=2*6)일 수 있다. 추정하고자 하는 정보가 늘어나고 세분화될수록 클러스터의 수가 늘어나게 된다. 다른 실시예에 따르면, 서버는 표본 단말들에게 초기 로컬 클러스터링 모델을 전송하고, 각 표본 단말에서 사용자 정보와 입력받은 인구통계학적 정보를 이용하여 각 로컬 클러스터링 모델을 학습시키도록 요청할 수 있 다. 그리고, 서버는 표본 단말들로부터 개인정보나 인구통계학적 정보를 수신하는 대신, 학습된 로컬 클러 스터링 모델들을 수신한다. 서버는 로컬 클러스터링 모델들을 이용하여 하나의 글로벌 클러스터링 모델을 생성하고, 글로벌 클러스터 링 모델을 인구통계학적 정보의 추정 대상인 단말들(300-1~300-n)에게 전송할 수 있다. 그러면, 각 단말은 글로 벌 클러스터링 모델을 이용하여 사용자 정보에 해당하는 인구통계학적 정보를 추정하고, 이를 서버로 전송 할 수 있다. 서버는 인구통계학적 정보의 추정 대상인 단말들로부터 적어도 하나의 클러스터 식별자 또는 추정된 인구 통계학적 정보를 수집한다. 이때, 서버는 표본 단말들에 의해 레이블링된 클러스터별 인구통계학적 정보를 참조하여, 각 단말의 인구통계학적 정보를 추정할 수 있다. 예를 들어, 단말(300-1)의 클러스터 식별자가 클러 스터1인 경우, 서버는 단말(300-1)의 사용자를 여자 및 10대로 추정할 수 있다. 한편, 서버가 한 단말로 복수의 클러스터링 규칙들을 제공하고, 이들로부터 추출된 복수의 클러스터 식별 자들을 수집할 수 있다. 이 경우, 서버는 각 클러스터 식별자에 매핑된 인구통계학적 정보를 종합하여, 추 정 정확성이 높은 인구통계학적 정보의 클러스터로 단말을 배정할 수 있다. 또는 복수의 클러스터링 규칙들이 서로 다른 종류의 인구통계학적 정보를 추정하는 경우, 서버는 각 클러스터링 규칙으로 추정된 인구통계학적 정보를 종합해서 다양한 범위의 인구통계학적 정보를 얻을 수 있다. 이처럼, 서버가 사용자 정보로부터 인구통계학적 정보를 추정하는 것이 아니라, 단말들에서 사용자 정보를 클러스터링한 결과를 이용하여 인구통계학적 정보를 추정한다. 서버는 단말들로부터 개인정보를 포함하는 사용자 정보를 수집하지 않으므로, 개인정보를 보호하면서 대량의 정보를 수집하지 않고도 인구통계학적 정보를 이용한 타게팅을 할 수 있다. 또한, 서버는 단말로부터 수신한 클러스터 식별자를 사용자 식별키로 사용해 서, 클러스터 식별자에 해당하는 타게팅 정보를 단말로 제공할 수 있다. 단말에 제공되는 타게팅 정보는, 인구 통계학적 정보(예를 들면, 20대 남자)를 타게팅하는 콘텐츠일 수 있다. 또는 서버에서 추정된 인구통계학 적 정보 이외에 추가적인 사용자 특징의 수집이 가능한 경우, 단말에 제공되는 타게팅 정보는, 인구통계학적 정 보를 타게팅하는 콘텐츠 중에서 사용자 특징에 맞게 선택된 추천 콘텐츠일 수 있다. 한편, 개인정보 보호 방침에 의하면, 개인정보가 포함된 데이터에서 개인정보의 일부 또는 전부를 삭제하거나 대체함으로써 다른 정보와 쉽게 결합해도 특정인을 식별하기 어렵도록 비식별화해야 한다. 비식별화를 위한 대 표적인 방법으로 k-익명성(k-anonymity)이 알려져 있다. k-익명성을 보장하기 위해, 각 클러스터에 적어도 k명 이상의 구분 불가능한 사용자가 섞여 있어야 한다. 예를 들어, 1000명의 사용자들을 10개의 클러스터들로 분류 하는 경우, 10명 이상(k=10)으로 k-익명성을 보장해야 한다고 가정한다. 이때, 클러스터링 결과, 클러스터1에 991명이 배정되고, 나머지 클러스터마다 1명씩의 사용자가 배정된다면 k-익명성에 위배된다. 종래 기술의 경우, 중앙 서버가 사용자 정보를 수집하고, 수집한 사용자 정보의 분포를 알기 때문에, k-익명성 위반이 발생하지 않 으나, 단말들의 클러스터링 결과를 수집하는 본 발명은 k-익명성을 보장하기 위한 방법이 필요하다. 이를 위해, 서버는 클러스터별 단말 밀도를 확인하고, 기준 이하의 저밀 클러스터가 존재하는 경우, 유사 한 클러스터들을 병합(예를 들면, 클러스터5와 클러스터6을 병합)하는 방식(분류 해상도 하향)으로 k-익명성 기 준에 도달할 때까지 클러스터 수를 변경하면서 단말들에게 클러스터링을 요청하고, 클러스터링 결과를 확인하는 클러스터링 라운드를 반복할 수 있다. 한편, 서버는 클러스터별 단말 밀도를 확인하고, 과밀 클러스터가 존재하는 경우, 과밀 클러스터를 세부적 으로 분할(예를 들면, 클러스터1을 세부 클러스터1-1, 1-2, 1-3로 분할)하여 분류 해상도를 높일 수 있다. 이러한 반복 클러스터링을 통해, 표 1과 같이 분류된 클러스터들은 예를 들면, 표 2와 같이 해상도가 차등된 클 러스터들로 분류될 수 있다. 표 2 클러스터 식별자 성별 연령 클러스터1-1 여자 10대초반(초등학생) 클러스터1-2 여자 10대초반(중학생) 클러스터1-3 여자 10대후반(고등학생) 클러스터2 여자 20대 클러스터3 여자 30대 클러스터4 여자 40대 클러스터5 여자 50대 이상 클러스터7-1 남자 10대초반(초등학생) 클러스터7-2 남자 10대초반(중학생) 클러스터7-3 남자 10대후반(고등학생) 클러스터8 남자 20대 클러스터9 남자 30대 클러스터10 남자 40대 클러스터11 남자 50대 이상 다음에서, 단말에서 수행되는 클러스터링 방법 및 이를 이용한 인구통계학적 정보 추정 방법에 대해 자세히 설 명한다. 도 2는 한 실시예에 따른 서버의 동작 방법의 흐름도이다. 도 2를 참고하면, 서버는 랜덤 샘플링을 통해 선택된 표본 단말들로부터 사용자 동의를 받은 인구통계학적 정보를 수집하고, 지정한 클러스터링 규칙으로 사용자 정보를 클러스터링한 클러스터 식별자를 획득한다(S110). 서버는 표본 단말들로부터 수집한 인구통계학적 정보와 클러스터 식별자를 기초로, 각 클러스터 식별자에 인구통계학적 정보를 레이블링한다(S120). 서버는 인구통계학적 정보의 추정 대상인 단말들로부터, 클러스터링 규칙으로 사용자 정보를 클러스터링한 결과인 클러스터 식별자들을 수신한다(S130). 클러스터링 규칙이 단말들로 전송되는 시점은 다양할 수 있다. 예 를 들어, 클러스터링 규칙은 사용자 정보를 가지고 있는 어플리케이션(예를 들면, 소셜 미디어 어플리케이션)에 미리 포함되어 배포될 수 있고, 어플리케이션 업데이트 시 또는 어플리케이션 사용 시에 배포될 수 있고, 또는 별도 프로그램을 통해 단말에 탑재될 수 있다. 이러한 클러스터링 라운드가 종료하면, 서버는 추정 대상들로부터 획득한 클러스터 식별자들로부터 클러스 터별 단말 밀도를 계산하고, 클러스터 조정이 필요한지 판단한다(S140). 서버는 k-익명성 기준을 만족하지 못하는 저밀 클러스터 또는 기준 이상의 과밀 클러스터가 있으면 클러스터 조정이 필요하다고 판단할 수 있다. 서버는 클러스터 조정이 필요한 경우, 클러스터 수가 변경된 클러스터링 규칙을 생성하고, 변경된 클러스 터링 규칙을 이용한 새로운 클러스터링 라운드를 시작한다(S150). 서버는 클러스터링 라운드를 반복하면서, 편중된 고밀 클러스터를 세부적으로 클러스터링하고, 저밀 클러스터를 병합하는 방식으로 고른 밀 도의 클러스터들을 만들 수 있다. 서버는 클러스터 조정이 완료된 경우, 특정 클러스터 식별자를 가진 임의 단말로부터 콘텐츠 요청을 수신 하면, 특정 클러스터 식별자에 해당하는 인구통계학적 정보를 기초로 콘텐츠 요청에 관련된 타게팅 정보를 추출 하고, 적어도 일부의 타게팅 정보를 해당 단말로 제공한다(S160). 서버는 표본 단말들로부터 획득한 클러 스터 식별자별 인구통계학적 정보를 가지고 있으므로, 클러스터 식별자의 인구통계학적 정보를 알 수 있어서, 인구통계학적 정보에 맞는 콘텐츠들의 타게팅이 가능하다. 타게팅 정보는, 인구통계학적 정보를 타게팅하는 콘 텐츠, 또는 인구통계학적 정보를 타게팅하는 콘텐츠들 중에서 사용자를 위해 선택된 추천 콘텐츠일 수 있다. 서버는 단말들의 클러스터 식별자들을 저장하고 있다가, 콘텐츠 요청이 있으면, 단말에 매핑된 클러스터 식별자를 이용하여 타게팅 정보를 제공할 수 있다. 또는 서버는 단말로부터 클러스터 식별자를 포함하는 콘텐츠 요청을 수신하면, 수신한 클러스터 식별자를 이용하여 단말에 타게팅 정보를 제공할 수 있다. 이를 위해, 단말이 인구통계학적 정보를 추정한 경우, 단말이 추정한 인구통계학적 정보에 해당하는 클러스터 식별자 를 알 수 있도록, 서버가 단말에게 필요한 정보를 제공할 수 있다. 도 3은 한 실시예에 따른 룰 기반 클러스터링 방법의 흐름도이고, 도 4는 한 실시예에 따른 해싱 기반 클러스터 링 방법의 흐름도이고, 도 5는 한 실시예에 따른 토픽 모델링 기반 클러스터링 방법의 흐름도이며, 도 6은 한 실시예에 따른 클러스터 분류 모델을 이용한 클러스터링 방법의 흐름도이다. 도 3을 참고하면, 서버는 인구통계학적 정보의 추정 대상인 단말에게, 클러스터링 대상 및 클러스터 링 대상의 분류 룰(rule)을 전송한다(S210). 예를 들면, 클러스터링 대상이 소셜 미디어 어플리케이션에서 이용 중인 오픈 채팅방/비즈니스 채널인 경우, 클러스터링 알고리즘은 인구통계학적 정보에 해당하는 오픈 채팅방 목 록/비즈니스 채널 목록이 분류된 룰(rule)을 이용한 분류 알고리즘일 수 있다. 즉, 남성/여성이 관심을 가지는 오픈 채팅방/비즈니스 채널 목록, 연령대별 관심을 가지는 오픈 채팅방/비즈니스 채널 목록, 지역별로 관심을 가지는 오픈 채팅방/비즈니스 채널 목록 등이 룰로 설정될 수 있다. 이때, 서버는 단말이 인구통계학 적 정보에 해당하는 클러스터 식별자를 이용할 수 있도록, 클러스터 식별자별 인구통계학적 정보를 단말에 게 알려줄 수 있다. 단말은 클러스터링 대상에 해당하는 사용자 정보를 추출하고, 분류 룰을 기초로 사용자 정보에 해당하는 인구통계학적 정보를 추정한다(S220). 단말은 사용자가 30대 여성이 관심을 가지는 비즈니스 채널들에 다 수 가입되어 있는 경우, 사용자를 여성 및 30대로 추정할 수 있다. 단말이 추정한 사용자의 인구통계학적 정보가 정확하지 않을 수 있으나, 오히려 사용자 성향에 적합한 인구통계학적 정보로 클러스터링할 수 있는 장 점이 있다. 단말은 추정한 인구통계학적 정보에 해당하는 클러스터 식별자를 서버로 전송한다(S230). 단말 은 분류 룰을 통해 인구통계학적 정보를 추정하고, 서버로부터 제공받은 클러스터 식별자별 인구통계학적 정보를 기초로, 자신의 클러스터 식별자를 알 수 있다. 또는, 단말은 추정한 인구통계학적 정보를 서버 로 전송하고, 서버로부터 추정한 인구통계학적 정보에 해당하는 클러스터 식별자를 부여받을 수있다. 서버는 단말의 클러스터 식별자에 해당하는 인구통계학적 정보를 기초로 타게팅 정보를 추출하고, 추 출한 타게팅 정보를 단말에게 제공한다(S240). 서버는 단말의 클러스터 식별자를 저장하고 있다 가, 단말의 콘텐츠 요청이 있으면, 단말에 매핑된 클러스터 식별자를 이용하여 타게팅 정보를 제공할 수 있다. 또는 단말이 콘텐츠를 요청하면서 클러스터 식별자를 함께 전달하면, 서버는 수신한 클러스터 식별자를 이용하여 단말에 타게팅 정보를 제공할 수 있다. 도 4를 참고하면, 서버는 인구통계학적 정보를 추정할 단말에게, 클러스터링 대상, 해시 클러스터링 (hash clustering) 알고리즘 및 클러스터링 파라미터들을 포함하는 클러스터링 규칙을 전송한다(S310). 해시 클 러스터링 알고리즘은 해시 함수를 이용하여 데이터를 클러스터에 배정하는 기술로서, 예를 들면, 클러스터링 대 상이 소셜 미디어 어플리케이션의 친구 목록이고, 해시 클러스터링 알고리즘은 Locality Sensitive Hashing(LSH) 알고리즘이며, 클러스터 수를 포함하는 클러스터링 파라미터들이 클러스터링 규칙에 포함될 수 있 다. 참고로, LSH 알고리즘은 고차원 데이터를 차원 축소하는 기술로서, 친구 목록의 친구수가 100명이면, 이를 100차원 벡터에서 저차원의 벡터로 축소할 수 있다. 단말은 클러스터링 대상에 해당하는 사용자 정보(예를 들면, 친구 목록)를 추출하고, 해시 클러스터링 알 고리즘을 이용해서 사용자 정보에 해당하는 클러스터 식별자를 획득한다(S320). 단말은 클러스터 식별자를 서버로 전송한다(S330). 단말은 클러스터 식별자가 추출되면 서버 로 전송할 수 있다. 또는 단말은 클러스터 식별자를 저장하고 있다가 서버로 콘텐츠를 요청을 전송할 때 클러스터 식별자를 전송할 수 있다. 서버는 단말의 클러스터 식별자에 해당하는 인구통계학적 정보를 기초로 타게팅 정보를 추출하고, 추 출한 타게팅 정보를 단말에게 제공한다(S340). 클러스터 식별자에 해당하는 인구통계학적 정보는 표 1이나 표 2와 같이 레이블링되어 있다. 이를 위해, 서버는 표본 단말들로부터 인구통계학적 정보 및 클러스터 식 별자를 수집하고, 이를 이용하여 클러스터 식별자에 해당하는 인구통계학적 정보를 레이블링할 수 있다. 도 5를 참고하면, 서버는 인구통계학적 정보를 추정할 단말에게, 클러스터링 대상, 토픽 모델링 알고 리즘 및 클러스터링 파라미터들을 포함하는 클러스터링 규칙을 전송한다(S410). 예를 들면, 클러스터링 대상이 소셜 미디어 어플리케이션에서 친구와의 메시지 교환 횟수이고, 토픽 모델링 알고리즘은 연합학습 기반의 Latent Dirichlet Allocation(Federated LDA) 알고리즘이며, 클러스터 수를 포함하는 클러스터링 파라미터들이 클러스터링 규칙에 포함될 수 있다. 단말은 클러스터링 대상에 해당하는 사용자 정보(예를 들면, 일정 기간 동안 친구와의 메시지 교환 횟수) 를 추출하고, 토픽 모델링 알고리즘을 이용해서 사용자 정보에 해당하는 클러스터 식별자를 획득한다(S420). 참 고로, 일주일 동안 사용자가 친구A에게 10번, 친구B에게 5번의 메시지를 보낸 경우, 토픽 모델링 알고리즘은 사 용자 정보를 A단어가 10개, B단어가 5개 들어간 문서로 취급하고, 친구 분포에 해당하는 토픽 분포를 기초로 N 개의 클러스터들 중 어느 하나로 분류할 수 있다. 단말은 클러스터 식별자를 서버로 전송한다(S430). 단말은 클러스터 식별자가 추출되면 서버 로 전송할 수 있다. 또는 단말은 클러스터 식별자를 저장하고 있다가 서버로 콘텐츠를 요청을 전송할 때 클러스터 식별자를 전송할 수 있다. 서버는 단말의 클러스터 식별자에 해당하는 인구통계학적 정보를 기초로 타게팅 정보를 추출하고, 추 출한 타게팅 정보를 단말에게 제공한다(S440). 클러스터 식별자에 해당하는 인구통계학적 정보는 표 1이나 표 2와 같이 레이블링되어 있다. 이를 위해, 서버는 표준 단말들로부터 인구통계학적 정보 및 클러스터 식 별자를 수집하고, 이를 이용하여 클러스터 식별자에 해당하는 인구통계학적 정보를 레이블링할 수 있다. 도 6을 참고하면, 서버는 표본 단말들에게 초기 로컬 클러스터링 모델의 학습을 요청한다(S510). 서버 는 표본 단말들에게, 로컬 클러스터링 모델을 제공하고, 클러스터링 대상에 해당하는 사용자 정보로부터, 입력받은 인구통계학적 정보 또는 입력받은 인구통계학적 정보에 해당하는 클러스터 식별자가 추정되도록 로컬 클러스터링 모델의 학습을 요청할 수 있다. 표본 단말은 인구통계학적 정보를 입력받고, 클러스터링 대상에 해당하는 사용자 정보로부터, 입력받은 인 구통계학적 정보 또는 이에 해당하는 클러스터 식별자가 추정되도록 로컬 클러스터링 모델을 학습시킨다(S520).서버는 표본 단말로부터 학습된 로컬 클러스터링 모델을 수신한다(S530). 서버는 복수의 표본 단말들에서 학습된 로컬 클러스터링 모델들로부터 하나의 글로벌 클러스터링 모델을 생성한다(S540). 서버는 글로벌 클러스터링 모델을, 인구통계학적 정보 추정 대상인, 단말에게 전송한다(S550). 이때, 글로벌 클러스터링 모델이 인구통계학적 정보를 추정하는 경우, 서버는 인구통계학적 정보에 해당하는 클 러스터 식별자를 수신하기 위해, 클러스터 식별자별 인구통계학적 정보도 단말로 전송할 수 있다. 단말은 글로벌 클러스터링 모델을 이용하여, 클러스터링 대상인 사용자 정보에 해당하는 인구통계학적 정 보 또는 이에 대응하는 클러스터 식별자를 추정한다(S560). 글로벌 클러스터링 모델은 설치된 단말에서 획득된 사용자 정보를 입력받고, 입력받은 사용자 정보에 해당하는 인구통계학적 정보 또는 입력받은 사용자 정보에 해 당하는 클러스터 식별자를 추정하는 인공지능 모델일 수 있다. 단말은 추정한 인구통계학적 정보에 해당하는 클러스터 식별자를 서버로 전송한다(S570). 단말 이 글로벌 클러스터링 모델을 통해 인구통계학적 정보를 추정하는 경우, 서버로부터 제공받은 클러스터 식 별자별 인구통계학적 정보를 기초로, 자신의 클러스터 식별자를 알 수 있다. 또는, 단말은 글로벌 클러스 터링 모델을 통해 추정한 인구통계학적 정보를 서버로 전송하고, 서버로부터 추정한 인구통계학적 정 보에 해당하는 클러스터 식별자를 부여받을 수 있다. 서버는 단말의 클러스터 식별자에 해당하는 인구통계학적 정보를 기초로 타게팅 정보를 추출하고, 추 출한 타게팅 정보를 단말에게 제공한다(S580). 도 2에서 설명한 바와 같이, 서버는 단말의 클 러스터 식별자를 저장하고 있다가, 단말의 콘텐츠 요청이 있으면, 단말에 매핑된 클러스터 식별자를 이용 하여 타게팅 정보를 제공할 수 있다. 또는 단말이 콘텐츠를 요청하면서 클러스터 식별자를 함께 전달하면, 서버는 수신한 클러스터 식별자를 이용하여 단말에 타게팅 정보를 제공할 수 있다. 도 3부터 도 6을 참고하여 설명한 바와 같이, 단말은 다양한 방식으로 인구통계학적 정보를 추정하거나, 인구통계학적 정보에 매핑된 클러스터 식별자를 제공할 수 있다. 도 3부터 도 6에서는, 추정 대상 단말이 서버로 클러스터 식별자를 전송하고, 서버가 클러스터 식별자에 해당하는 인구통계학적 정보를 추정하는 것으로 설명하였다. 이를 변형하여, 추정 대상 단말이 클러스터 식별자별로 매핑된 인구통계학적 정보를 서버로부터 수신하고, 사용자 정보로부터 클러스터 식별 자를 획득하고, 클러스터 식별자에 해당하는 인구통계학적 정보를 추정한 후, 추정한 인구통계학적 정보를 서버 로 전달할 수 있다. 서버는 도 3부터 도 6을 참고로 설명한 방식 중 어느 하나를 통해, 단말로부터 추정된 인구통계학적 정보 또는 클러스터 식별자를 얻을 수 있다. 또는, 서버는 도 3부터 도 6을 참고로 설명한 방식들 중 복수 의 방식들을 통해, 단말로부터 추정된 인구통계학적 정보 또는 클러스터 식별자를 얻고, 이들을 종합하여 정확성이 높은 인구통계학적 정보를 추정하거나, 이들을 종합하여 다양한 종류의 인구통계학적 정보를 추정할 수 있다. 이와 같이, 실시예에 따르면, 서버가 사용자 정보로부터 인구통계학적 정보를 추정하는 것이 아니라, 사용 자 정보를 가지고 있는 단말들에서 수행된 클러스터링한 결과를 이용하여 인구통계학적 정보를 추정할 수 있다. 따라서, 서버는 개인정보를 보호하면서 대량의 정보를 수집하지 않고도 인구통계학적 정보를 이용한 타게 팅을 할 수 있다. 실시예에 따르면, 클러스터별 단말 밀도를 기초로 클러스터링 라운드를 반복해가면서 각 클러스터의 분류 해상 도를 조정할 수 있고, 이를 통해 한쪽으로 편중되지 않는 고른 밀도의 클러스터들을 만들 수 있으며, 결과적으 로 k-익명성을 보장할 수 있다. 이상에서 설명한 본 개시의 실시예는 장치 및 방법을 통해서만 구현이 되는 것은 아니며, 본 개시의 실시예의 구성에 대응하는 기능을 실현하는 프로그램 또는 그 프로그램이 기록된 기록 매체를 통해 구현될 수도 있다. 이상에서 본 개시의 실시예에 대하여 상세하게 설명하였지만 본 개시의 권리범위는 이에 한정되는 것은 아니고 다음의 청구범위에서 정의하고 있는 본 개시의 기본 개념을 이용한 당업자의 여러 변형 및 개량 형태 또한 본 개시의 권리범위에 속하는 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6"}
{"patent_id": "10-2021-0091577", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 한 실시예에 따른 인구통계학적 정보 추정 시스템의 구성도이다. 도 2는 한 실시예에 따른 서버의 동작 방법의 흐름도이다. 도 3은 한 실시예에 따른 룰 기반 클러스터링 방법의 흐름도이다. 도 4는 한 실시예에 따른 해싱 기반 클러스터링 방법의 흐름도이다. 도 5는 한 실시예에 따른 토픽 모델링 기반 클러스터링 방법의 흐름도이다. 도 6은 한 실시예에 따른 클러스터 분류 모델을 이용한 클러스터링 방법의 흐름도이다."}
