{"patent_id": "10-2023-0100315", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0019040", "출원번호": "10-2023-0100315", "발명의 명칭": "문제 풀이 영상 분석을 통한 맞춤형 수학 개념 제공방법 및 장치", "출원인": "주식회사 프로키언", "발명자": "이재윤"}}
{"patent_id": "10-2023-0100315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "서버에 의해 수행되는 학습자 맞춤형 수학 개념 제공 방법에 있어서, a) 사용자의 머리 및 손 중 적어도 하나 이상을 포함하는 신체 부위와 기설정된 문제에 대한 사용자의 풀이 과정이 포함된 영상을 수신하는 단계;b) 상기 풀이 과정을 분석하여 상기 풀이 과정에 포함된 사용자 사용 수학 개념을 추출하고, 상기 신체 부위의움직임을 기초로 상기 사용자의 행동 패턴을 분석하는 단계; 및c) 상기 사용자 사용 수학 개념과 상기 기설정된 문제에 매칭된 필수 수학 개념들을 비교하여 상기 풀이 과정에누락된 수학 개념의 설명을 상기 서버와 통신 연결된 사용자 단말로 제공하거나, 상기 행동 패턴 중 특정 행동패턴에 대응되는 수학 개념의 설명을 상기 단말로 제공하는 단계를 포함하는, 학습자 맞춤형 수학 개념 제공 방법."}
{"patent_id": "10-2023-0100315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 b) 단계는, 기설정된 시간 간격마다 상기 영상을 연속적으로 수신하여 상기 풀이 과정 및 상기 신체 부위의 움직임을 분석하는 단계를 더 포함하는, 학습자 맞춤형 수학 개념 제공 방법."}
{"patent_id": "10-2023-0100315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 b) 단계는,상기 풀이 과정 내의 텍스트를 추출하는 단계;상기 텍스트로부터 수식을 추출하는 단계;상기 수식에 대응되는 상기 사용자 사용 수학 개념을 추출하는 단계; 및시간대별로 상기 사용자 사용 수학 개념 리스트를 생성하는 단계를 포함하는, 학습자 맞춤형 수학 개념 제공 방법."}
{"patent_id": "10-2023-0100315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 b) 단계는,상기 사용자의 신체 부위마다 윤곽선을 생성하고, 윤곽선 상에 코너점을 추출하는 단계;상기 코너점을 기준으로 상기 사용자의 움직임을 추출하는 단계;상기 사용자의 움직임에 대한 벡터값을 입력으로 하여 상기 사용자의 행동 패턴을 추출하도록 학습된 인공지능모델에 기초하여 상기 사용자의 행동 패턴을 추출하는 단계; 및시간대별로 상기 사용자의 행동 패턴의 리스트를 생성하는 단계를 포함하는, 학습자 맞춤형 수학 개념 제공 방법."}
{"patent_id": "10-2023-0100315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 c) 단계는,공개특허 10-2024-0019040-3-상기 사용자 사용 수학 개념과 상기 기설정된 문제에 매칭된 필수 수학 개념들을 비교하는 단계;비교 결과, 상기 필수 수학 개념들이 상기 사용자 사용 수학 개념에 모두 포함되는 경우 상기 사용자 사용 수학개념과 상기 사용자의 행동 패턴을 시간대별로 비교하여 상기 사용자의 학습 상태를 판단하는 단계; 및상기 사용자의 학습 상태에 기초하여 상기 사용자의 행동 패턴 중 기설정된 부정 행동 패턴이 추출된 시간대에대응되는 수학 개념에 대한 설명을 상기 단말로 제공하는 단계를 포함하는, 학습자 맞춤형 수학 개념 제공방법."}
{"patent_id": "10-2023-0100315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 c) 단계는,상기 사용자 사용 수학 개념과 상기 기설정된 문제에 매칭된 필수 수학 개념들을 비교하는 단계;비교 결과, 상기 필수 수학 개념들이 상기 사용자 사용 수학 개념에 모두 포함되지 않는 경우 상기 필수 수학개념들 중 상기 사용자 사용 수학 개념에 포함되지 않은 수학 개념에 대한 설명을 상기 단말로 제공하는 단계;상기 사용자 사용 수학 개념과 상기 사용자의 행동 패턴을 시간대별로 비교하여 상기 사용자의 학습 상태를 판단하는 단계; 및상기 사용자의 학습 상태에 기초하여 상기 사용자의 행동 패턴 중 기설정된 부정 행동 패턴이 추출된 시간대에대응되는 수학 개념에 대한 설명을 상기 단말로 제공하는 단계를 포함하는, 학습자 맞춤형 수학 개념 제공방법."}
{"patent_id": "10-2023-0100315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "통신 모듈;적어도 하나의 프로세서; 및상기 프로세서와 전기적으로 연결되고, 상기 프로세서에서 수행되는 적어도 하나의 코드(code)가 저장되는 메모리를 포함하고,상기 메모리는 상기 프로세서를 통해 실행될 때 상기 프로세서가,사용자의 머리 및 손 중 적어도 하나 이상을 포함하는 신체 부위와 기설정된 문제에 대한 사용자의 풀이 과정이포함된 영상을 수신하고, 상기 풀이 과정을 분석하여 상기 풀이 과정에 포함된 사용자 사용 수학 개념을 추출하고, 상기 신체 부위의 움직임을 기초로 상기 사용자의 행동 패턴을 분석하고, 그리고, 상기 사용자 사용 수학개념과 상기 기설정된 문제에 매칭된 필수 수학 개념들을 비교하여 상기 풀이 과정에 누락된 수학 개념의 설명을 상기 통신 모듈과 통신 연결된 사용자 단말로 제공하거나, 상기 행동 패턴 중 특정 행동 패턴에 대응되는 수학 개념의 설명을 상기 단말로 제공하도록 야기하는 코드를 저장하는, 학습자 맞춤형 수학 개념 제공 장치."}
{"patent_id": "10-2023-0100315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 메모리는 상기 프로세서로 하여금, 기설정된 시간 간격마다 상기 영상을 연속적으로 수신하여 상기 풀이 과정 및 상기 신체 부위의 움직임을 분석하도록 야기하는 코드를 더 저장하는, 학습자 맞춤형 수학 개념 제공 장치."}
{"patent_id": "10-2023-0100315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 메모리는 상기 프로세서로 하여금,상기 풀이 과정 내의 텍스트를 추출하고, 상기 텍스트로부터 수식을 추출하고, 상기 수식에 대응되는 상기 사용자 사용 수학 개념을 추출하며, 시간대별로 상기 사용자 사용 수학 개념의 리스트를 생성하도록 야기하는 코드를 더 저장하는, 학습자 맞춤형 수학 개념 제공 장치.공개특허 10-2024-0019040-4-청구항 10 제7항에 있어서,상기 메모리는 상기 프로세서로 하여금,상기 사용자의 신체 부위의 윤곽선을 생성하고, 윤곽선 상에 코너점을 추출하고, 상기 코너점을 기준으로 상기사용자의 움직임을 추출하고, 상기 사용자의 움직임에 대한 벡터값을 입력으로 하여 상기 사용자의 행동 패턴을추출하도록 학습된 인공지능 모델에 기초하여 상기 사용자의 행동 패턴을 추출하며, 시간대별로 상기 사용자의행동 패턴의 리스트를 생성하도록 야기하는 코드를 더 저장하는, 학습자 맞춤형 수학 개념 제공 장치."}
{"patent_id": "10-2023-0100315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제7항에 있어서,상기 메모리는 상기 프로세서로 하여금,상기 사용자 사용 수학 개념과 상기 기설정된 문제에 매칭된 필수 수학 개념들을 비교하고, 비교 결과, 상기 필수 수학 개념들이 상기 사용자 사용 수학 개념에 모두 포함되는 경우 상기 사용자 사용 수학 개념과 상기 사용자의 행동 패턴을 시간대별로 비교하여 상기 사용자의 학습 상태를 판단하고, 그리고, 상기 사용자의 학습 상태에 기초하여 상기 사용자의 행동 패턴 중 기설정된 부정 행동 패턴이 추출된 시간대에 대응되는 수학 개념에 대한 설명을 상기 단말로 제공하도록 야기하는 코드를 더 저장하는, 학습자 맞춤형 수학 개념 제공 장치."}
{"patent_id": "10-2023-0100315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제7항에 있어서,상기 메모리는 상기 프로세서로 하여금,상기 사용자 사용 수학 개념과 상기 기설정된 문제에 매칭된 필수 수학 개념들을 비교하고, 비교 결과, 상기 필수 수학 개념들이 상기 사용자 사용 수학 개념에 모두 포함되지 않는 경우 상기 필수 수학 개념들 중 상기 사용자 사용 수학 개념에 포함되지 않은 수학 개념에 대한 설명을 상기 단말로 제공하고, 상기 사용자 사용 수학 개념과 상기 사용자의 행동 패턴을 시간대별로 비교하여 상기 사용자의 학습 상태를 판단하고, 그리고, 상기 사용자의 학습 상태에 기초하여 상기 사용자의 행동 패턴 중 기설정된 부정 행동 패턴이 추출된 시간대에 대응되는수학 개념에 대한 설명을 상기 단말로 제공하도록 야기하는 코드를 더 저장하는, 학습자 맞춤형 수학 개념 제공장치."}
{"patent_id": "10-2023-0100315", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시예는, 학습자 맞춤형 수학 개념 제공 방법을 제공한다. 본 방법은, 사용자의 머리 및 손 중 적 어도 하나 이상을 포함하는 신체 부위와 기설정된 문제에 대한 사용자의 풀이 과정이 포함된 영상을 수신하는 단 계, 상기 풀이 과정을 분석하여 상기 풀이 과정에 포함된 사용자 사용 수학 개념을 추출하고, 상기 신체 부위의 움직임을 기초로 상기 사용자의 행동 패턴을 분석하는 단계, 그리고, 상기 사용자 사용 수학 개념과 상기 기설정 된 문제에 매칭된 필수 수학 개념들을 비교하여 상기 풀이 과정에 누락된 수학 개념의 설명을 상기 서버와 통신 연결된 사용자 단말로 제공하거나, 상기 행동 패턴 중 특정 행동 패턴에 대응되는 수학 개념의 설명을 상기 단말 로 제공하는 단계를 포함한다."}
{"patent_id": "10-2023-0100315", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 문제 풀이 영상 분석을 통한 맞춤형 수학 개념 제공 방법 및 장치에 관한 것으로, 보다 상세하게는, 사용자의 행동 영상 및 풀이 과정 영상을 분석하여, 학습자의 부족한 수학 개념 설명을 제공하기 위한 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2023-0100315", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "포스트 코로나 시대와 함께 가정에서 학습하는 시간이 늘어나면서 온라인 학습의 시장이 더욱 커지고 있다. 그 러나, 온라인 학습은 오프라인 학습처럼 교수자로부터 직접적인 피드백을 받기 어렵다는 문제점이 있다. 특히, 수학 문제와 같이 여러가지 개념이 복합적으로 적용된 문제들은 문제 풀이 과정이 중요하다. 이와 관련하 여, 오프라인 학습에서는 학습자가 생성한 문제 풀이 과정을 분석하여 부족한 부분이 어디인지 파악할 수 있으 나, 온라인 학습에서는 문제 풀이 과정을 분석하여 부족한 부분을 파악하는 것은 어렵다는 문제점이 있다. 또한, 온라인 학습에서는 문제 풀이 과정을 따로 기록하지 않거나 문제를 해결하는 과정에서 어떤 행동을 취하 는지와 같이 학습자에게 제공한 콘텐츠를 학습자가 어떻게 이용하고 있는지를 파악할 수 없었다. 이에 더해, 수 학 문제는 객관식의 형태로 제공되는 문제가 많으나, 이를 제대로 풀어서 정답을 맞춘 것인지 찍어서 맞춘 것인 지에 대해 알 수 없었다. 이에 따라, 온라인 학습을 통해 수학 문제를 푸는 경우를 대비하여 문제 풀이 과정을 확인하고, 부족한 수학 개 념의 설명을 제공할 수 있는 방법에 대한 연구가 필요한 실정이다."}
{"patent_id": "10-2023-0100315", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 전술한 종래 기술의 문제점을 해결하기 위한 것으로, 사용자의 행동 영상 및 풀이 과정 영상을 분석 하여, 학습자의 부족한 수학 개념 설명을 제공하기 위한 방법 및 장치를 제공하고자 한다. 본 발명이 이루고자 하는 기술적 과제들은 상기한 기술적 과제로 제한되지 않으며, 이하의 설명으로부터 본 발 명의 또 다른 기술적 과제들이 도출될 수 있다."}
{"patent_id": "10-2023-0100315", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 해결하기 위한 기술적 수단으로서, 본 개시의 제1 측면에 따른 실시예는, 학습자 맞춤형 수학 개념 제공 방법을 제공한다. 본 방법은, 사용자의 머리 및 손 중 적어도 하나 이상을 포함하는 신체 부위 와 기설정된 문제에 대한 사용자의 풀이 과정이 포함된 영상을 수신하는 단계, 상기 풀이 과정을 분석하여 상기 풀이 과정에 포함된 사용자 사용 수학 개념을 추출하고, 상기 신체 부위의 움직임을 기초로 상기 사용자의 행동 패턴을 분석하는 단계, 그리고, 상기 사용자 사용 수학 개념과 상기 기설정된 문제에 매칭된 필수 수학 개념들 을 비교하여 상기 풀이 과정에 누락된 수학 개념의 설명을 상기 서버와 통신 연결된 사용자 단말로 제공하거나, 상기 행동 패턴 중 특정 행동 패턴에 대응되는 수학 개념의 설명을 상기 단말로 제공하는 단계를 포함한다. 또한, 본 개시의 제2 측면에 따른 실시예는, 학습자 맞춤형 수학 개념 제공 장치를 제공한다. 본 장치는, 통신 모듈, 적어도 하나의 프로세서 및 상기 프로세서와 전기적으로 연결되고, 상기 프로세서에서 수행되는 적어도 하나의 코드(code)가 저장되는 메모리를 포함한다. 상기 메모리는 상기 프로세서를 통해 실행될 때 상기 프로세 서가, 사용자의 머리 및 손 중 적어도 하나 이상을 포함하는 신체 부위와 기설정된 문제에 대한 사용자의 풀이 과정이 포함된 영상을 수신하고, 상기 풀이 과정을 분석하여 상기 풀이 과정에 포함된 사용자 사용 수학 개념을 추출하고, 상기 신체 부위의 움직임을 기초로 상기 사용자의 행동 패턴을 분석하고, 그리고, 상기 사용자 사용 수학 개념과 상기 기설정된 문제에 매칭된 필수 수학 개념들을 비교하여 상기 풀이 과정에 누락된 수학 개념의 설명을 상기 서버와 통신 연결된 사용자 단말로 제공하거나, 상기 행동 패턴 중 특정 행동 패턴에 대응되는 수 학 개념의 설명을 상기 단말로 제공하도록 야기하는 코드를 저장한다."}
{"patent_id": "10-2023-0100315", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 온라인 학습 시에 학습자의 문제 해결 과정을 분석하여 학습자의 취약점을 파악할 수 있다. 또한, 본 발명에 따르면, 수학 문제 풀이 과정 대한 이미지, 동영상에서 수식을 인식하여 학습자의 취약점을 파 악할 수 있어 온라인 수학 교육에서 발생하는 문제점들을 해결할 수 있다. 또한, 본 발명에 따르면, 문제 풀이 결과를 인식하고 이를 통해서 어떤 부분이 취약한 지 파악할 수 있어, 수집 한 데이터를 기반으로 자동으로 판별하기 때문에 기존의 사람이 필요했던 방법을 대체할 수 있다. 또한, 발견된 취약점 데이터를 활용하여 더 나은 추천 시스템을 통하여 학습자에게 좋은 문제를 추천할 수 있고, 취약점을 익힐 수 있는 컨텐츠를 제공할 수 있다."}
{"patent_id": "10-2023-0100315", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 상술한 효과들로 제한되지 않으며, 이하의 기재로부터 이해되는 모든 효과들을 포함한다."}
{"patent_id": "10-2023-0100315", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부한 도면을 참조하여 본 개시를 상세히 설명하기로 한다. 다만, 본 개시는 여러 가지 상이한 형 태로 구현될 수 있으며, 여기에서 설명하는 실시예들로 한정되는 것은 아니다. 또한, 첨부된 도면은 본 명세서 에 개시된 실시예를 쉽게 이해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않는다. 여기에 사용되는 기술용어 및 과학용어를 포함하는 모든 용어들은 본 개시가 속하는"}
{"patent_id": "10-2023-0100315", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "기술분야에서 통상의 지식을 가진 자가 일반적으로 이해하는 의미로 해석되어야 한다. 사전에 정의된 용어들은 관련기술문헌과 현재 개시된 내용에 부합하는 의미를 추가적으로 갖는 것으로 해석되어야 하며, 별도로 정의되 지 않는 한 매우 이상적이거나 제한적인 의미로 해석되지 않는다. 도면에서 본 개시를 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 도면에 나타난 각 구성요 소의 크기, 형태, 형상은 다양하게 변형될 수 있다. 명세서 전체에 대하여 동일/유사한 부분에 대해서는 동일/ 유사한 도면 부호를 붙였다. 이하의 설명에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\" 등은 명세서 작성의 용이함만이 고려되어 부 여되거나 혼용되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 또한, 본 명세서에 개시된 실시예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시 예의 요 지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략하였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결(접속, 접촉 또는 결합)\"되어 있다고 할 때, 이는 \"직접적으로 연결(접속, 접촉 또는 결합)\"되어 있는 경우뿐만 아니라, 그 중간에 다른 부재를 사이에 두고 \"간접적으로 연결 (접속, 접촉 또는 결합)\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함(구비 또는 마 련)\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소 를 더 \"포함(구비 또는 마련)\"할 수 있다는 것을 의미한다. 본 명세서에서 사용되는 제1, 제2 등과 같이 서수를 나타내는 용어들은 하나의 구성 요소를 다른 구성요소로부 터 구별하는 목적으로만 사용되며, 구성 요소들의 순서나 관계를 제한하지 않는다. 예를 들어, 본 개시의 제1구 성요소는 제2구성요소로 명명될 수 있고, 유사하게 제2구성요소도 제1구성 요소로 명명될 수 있다. 본 명세서에 서 사용되는 단수 표현의 형태들은 명백히 반대의 의미를 나타내지 않는 한 복수 표현의 형태들도 포함하는 것으로 해석되어야 한다. 도 1은 본 발명의 일 실시예에 따른 학습자 맞춤형 수학 개념 제공 장치와 이와 통신 연결된 단말을 설명하기 위해 도시한 도면이다. 도 1을 참조하면, 학습자 맞춤형 수학 개념 제공 장치는 기설정된 통신 네트워크를 통해 단말과 통신 연결될 수 있다. 학습자 맞춤형 수학 개념 제공 장치는 서버, 컴퓨팅 장치 또는 각종 스마트 디바이스의 형태로 구현될 수 있고, SaaS (Software as a Service), PaaS (Platform as a Service) 또는 IaaS (Infrastructure as a Service)와 같은 클라우드 컴퓨팅 서비스 모델에서 동작 할 수 있다. 또한, 학습자 맞춤형 수학 개념 제공 장치 는 사설(private) 클라우드, 공용(public) 클라우드 또는 하이브리드(hybrid) 클라우드 시스템과 같은 형 태로 구축될 수도 있으나, 본 발명의 범위가 이에 제한되는 것은 아니다. 학습자 맞춤형 수학 개념 제공 장치는 사용자의 머리 및 손 중 적어도 하나 이상을 포함하는 신체 부위와 기설정된 문제에 대한 사용자의 풀이 과정이 포함된 영상을 수신한다. 다만, 이에 한정되는 것은 아니며, 학습자 맞춤형 수학 개념 제공 장치는 사용자의 머리 및 손 중 적어도 하나 이상을 포함하는 신체 부위와 기설정된 문제에 대한 사용자의 풀이 과정이 포함된 일정 시간 간격의 복수 개의 이미지를 수신할 수 있다. 학습자 맞춤형 수학 개념 제공 장치는 단말, 내부 카메라 및 외부 카메라 중 적어도 하나로부터 영상 및 이미지를 수신할 수 있다. 예컨대, 내부 카메라 및 외부 카메라는 사용자의 행동 및 사용자가 학습하고 있는 문제 지문 및 문제 풀이를 포함하는 텍스트를 촬영할 수 있다. 내부 카메라 및 외부 카메라는 스마트디바이스카메라 및 웹캠과 같은 영상 및 이미지를 촬영하기 위한 카메라를 포함하고 있는 장치일 수 있다. 학습자 맞춤형 수학 개념 제공 장치는 풀이 과정을 분석하여 풀이 과정에 포함된 사용자 사용 수학 개념을 추출하고, 신체 부위의 움직임을 기초하여 사용자의 행동 패턴을 분석한다. 학습자 맞춤형 수학 개념 제공 장치는 사용자 사용 수학 개념과 기설정된 문제에 매칭된 필수 수학 개념들 을 비교하고, 행동 패턴 중 특정 행동 패턴에 대응되는 수학 개념의 설명을 단말로 제공한다. 행동 패턴은 긍정 행동 패턴과 부정 행동 패턴을 포함할 수 있으며, 특정 행동 패턴은 부정 행동 패턴일 수 있다. 기설정된 필수 수학 개념은 복수개의 개념으로 구성된 개념군일 수 있다. 예컨대, 기설정된 문제에 대한 해설 또는 풀이가 여 러 개인 경우 해당 문제를 풀기 위한 필수 수학 개념이 풀이법에 따라 상이할 수 있다. 단말은 학습자 맞춤형 수학 개념 제공 장치로부터 누락된 필수 수학 개념에 대한 설명 및 사용자의 학습 상태에 따라 어려움을 겪는 필수 수학 개념에 대한 설명을 수신할 수 있다. 단말은 학습자 맞춤형 수 학 개념 제공 장치로 사용자의 신체 부위의 움직임 및 풀이 과정을 포함한 영상 및 이미지를 전송할 수 있 다. 단말은 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱(desktop), 랩톱(laptop), 휴대성과 이동성 이 보장되는 무선 통신 장치 또는 스마트폰, 태블릿 PC 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 의미할 수 있다. 도 2는 도 1에 도시된 학습자 맞춤형 수학 개념 제공 장치(이하, 서버라 칭함.)의 세부구성을 도시한 도면이다. 도 2를 참조하면, 서버는 통신 모듈, 프로세서 및 메모리를 포함할 수 있다. 통신 모듈은 다른 네트워크 장치와 유무선 연결을 통해 제어 신호 또는 데이터 신호와 같은 신호를 송수신 하기 위해 필요한 하드웨어 및 소프트웨어를 포함하는 장치를 포함할 수 있다. 통신 모듈은 단말로 누락된 필수 수학 개념에 대한 설명 및 사용자의 학습 상태에 따라 어려움을 겪는 필 수 수학 개념에 대한 설명을 전송할 수 있다. 또한, 통신 모듈은 단말로부터 사용자의 신체 부위의 움직임 및 풀이 과정을 포함한 영상 및 이미지를 수신할 수 있다. 프로세서는 데이터를 제어 및 처리하는 다양한 종류의 장치들을 포함할 수 있다. 프로세서는 프로그 램 내에 포함된 코드 또는 명령으로 표현된 기능을 수행하기 위해 물리적으로 구조화된 회로를 갖는, 하드웨어 에 내장된 데이터 처리 장치를 의미할 수 있다. 일 예에서, 프로세서는 마이크로프로세서(microprocessor), 중앙처리장치(central processing unit: CPU), 프로세서 코어(processor core), 멀티프로세서(multiprocessor), ASIC(application-specific integrated circuit), FPGA(field programmable gate array) 등의 형태로 구현될 수 있으나, 본 발명의 범위가 이에 한정 되는 것은 아니다. 프로세서는 메모리에 저장된 코드에 따라 동작을 수행한다. 메모리는 통신 모듈로 입력되는 정보 및 데이터, 프로세서에 의해 수행되는 기능에 필요한 정보 및 데이터, 프로세서의 실행에 따라 생성된 데이터 중 적어도 어느 하나 이상을 저장할 수 있다. 메모리는 전원이 공급되지 않아도 저장된 정보를 계속 유지하는 비휘발성 저장장치 및 저장된 정보를 유지 하기 위하여 전력을 필요로 하는 휘발성 저장장치를 통칭하는 것으로 해석되어야 한다. 메모리는 저장된 정보를 유지하기 위하여 전력이 필요한 휘발성 저장장치 외에 자기 저장 매체(magnetic storage media) 또는 플 래시 저장 매체(flash storage media)를 포함할 수 있으나, 본 발명의 범위가 이에 한정되는 것은 아니다. 메모리는 프로세서와 전기적으로 연결되고, 프로세서에서 수행되는 적어도 하나의 코드가 저장 된다. 메모리는 프로세서를 통해 실행될 때 프로세서가 다음과 같은 기능 및 절차들을 수행하도 록 야기하는 코드가 저장된다. 메모리에는 사용자의 머리 및 손 중 적어도 하나 이상을 포함하는 신체 부위와 기설정된 문제에 대한 사용 자의 풀이 과정이 포함된 영상을 수신하도록 야기하는 코드가 저장된다. 메모리에는 풀이 과정을 분석하여 풀이 과정에 포함된 사용자 사용 수학 개념을 추출하고, 신체 부위의 움 직임을 기초하여 사용자의 행동 패턴을 분석하도록 야기하는 코드가 저장된다. 메모리에는 사용자 사용 수학 개념과 기설정된 문제에 매칭된 필수 수학 개념들을 비교하여 상기 풀이 과 정에 누락된 수학 개념의 설명을 상기 서버와 통신 연결된 사용자 단말로 제공하거나, 상기 행동 패턴 중 특정 행동 패턴에 대응되는 수학 개념의 설명을 상기 단말로 제공하도록 야기하는 코드가 저장된다. 메모리에는 기설정된 시간 간격마다 학습자의 행동과 풀이과정이 포함된 영상들을 연속적으로 수신하여 풀 이 과정 및 신체 부위의 움직임을 분석하도록 야기하는 코드가 저장될 수 있다. 예컨대, 메모리에는 사용 자의 움직임과 동작에 대한 점의 움직임 값을 프레임 단위로 분석하여 일정 시간 동안 값의 변화 여부를 파악하 도록 야기하는 코드를 저장할 수 있다. 메모리에는 풀이 과정에 포함된 사용자 사용 수학 개념을 추출하기 위해 영상 내의 필기 텍스트를 추출하 도록 야기하는 코드가 저장될 수 있다. 예컨대, 메모리에는 풀이 과정을 기설정된 방법을 통해 분석하여, 풀이 과정 내의 텍스트를 추출하도록 야기하는 코드가 저장될 수 있다. 여기서, 기설정된 방법은 OCR 텍스트 인 식 방법일 수 있다. 메모리에는 추출된 텍스트로부터 수식을 추출하도록 야기하는 코드가 저장될 수 있다. 메모리에는 추출된 수식에 대응되는 사용자 사용 수학 개념을 추출하도록 야기하는 코드가 저장될 수 있다. 예컨대, 메모리에는 추출된 수식과 연관성이 높은 수학 개념을 추출하고, 추출된 수학 개념을 사용 자 사용 수학 개념으로 매칭할 수 있다. 메모리에는 시간대별로 사용자 사용 수학 개념의 리스트를 생성할 수 있다. 메모리에는 영상 내의 사용자의 얼굴 및 손 중 적어도 하나 이상을 포함하는 신체 부위의 윤곽선을 생성하 고, 움직임을 파악하기 위해 윤곽선 상에 코너점을 추출하도록 야기하는 코드가 저장될 수 있다. 메모리에는 코너점을 기준으로 사용자의 움직임을 추출하도록 야기하는 코드가 저장될 수 있다. 메모리에는 사용자의 움직임에 대한 벡터값을 입력으로 하여 사용자의 행동 패턴을 추출하도록 학습된 인 공지능 모델에 기초하여 사용자의 행동 패턴을 추출하도록 야기하는 코드가 저장될 수 있다. 여기서, 인공지능 모델은 익스트림 다중 분류(Extreme Multi-classfication) 알고리즘 기반의 모델일 수 있다. 사용자의 행동 패 턴은 눈 움직임, 머리 움직임 및 손의 제스쳐 중 적어도 하나에 따라 파악된 손 움직임, 손 움직임 정지, 문제 파악 및 고개 갸우뚱 중 적어도 하나를 포함할 수 있다. 메모리에는 시간대별로 사용자의 행동 패턴 리스트를 생성하도록 야기하는 코드를 저장할 수 있다. 일 예 로서, 사용자의 행동 패턴은 긍정 패턴 및 부정 패턴을 포함할 수 있다. 일정 시간 이내에 사용자의 손이 움직 이는 동작, 사용자가 풀이를 기재하고 있는 동작 등은 긍정 행동 패턴으로 분류될 수 있다. 사용자의 고개가 기 울거나, 사용자의 시선이 풀이 과정에서 다시 문제로 향하거나, 사용자의 손이 움직이지 않는 동작, 사용자가 필기도구를 만지는 동작 등은 부정 행동 패턴으로 분류될 수 있다. 메모리에는 사용자 사용 수학 개념과 기설정된 문제에 매칭된 필수 수학 개념들을 비교하고, 행동 패턴 중 기설정된 부정 행동 패턴에 대응되는 수학 개념의 설명을 단말로 제공하도록 야기하는 코드가 저장된다. 메모리에는 사용자 사용 수학 개념과 기설정된 문제에 매칭된 필수 수학 개념들을 비교하도록 야기하는 코 드가 저장될 수 있다. 메모리에는 비교 결과, 상기 필수 수학 개념들이 상기 사용자 사용 수학 개념에 모두 포함되는 경우에 사 용자 사용 수학 개념과 사용자의 행동 패턴을 시간대별로 비교하여 사용자의 학습 상태를 판단하도록 야기하는 코드가 저장될 수 있다. 예컨대, 사용자의 학습 상태는 부정, 긍정 및 문제 풀이 중 적어도 하나일 수 있다. 좀 더 자세하게, 같은 시간대의 사용자의 행동 패턴이 고개 갸우뚱이고 사용자 사용 수학 개념이 이차 다항식이 면, 메모리에 저장된 코드에 기초하여 사용자의 학습 상태는 이차 다항식에서 부정으로 판단될 수 있다. 메모리에는 비교 결과, 상기 필수 수학 개념들이 상기 사용자 사용 수학 개념에 모두 포함되지 않는 경우 사용자 사용 수학 개념에 포함되지 않은 필수 수학 개념들에 대한 설명을 단말로 제공하도록 야기하는 코드가 저장될 수 있다. 예컨대, 필수 수학 개념이 곱셈 공식, 다항식 정리 방법 및 이차방정식이 될 조건이고, 사용자 사용 수학 개념이 곱셈 공식 및 다항식 정리 방법이라면, 메모리에 저장된 코드에 기초하여 이차방정식이 될 조건에 대한 설명이 단말로 제공될 수 있다. 다른 예로서, 필수 수학 개념이 '곱셈 공식', '다항식 정리 방 법' 및 '이차방정식이 될 조건'이고, 사용자 사용 수학 개념이 '곱셈 공식', '다항식 정리 방법', '완전제곱식', 및 '분모의 유리화'라면, 메모리에 저장된 코드에 기초하여 이차방정식이 될 조건에 대한 설명이 단말로 제공될 수 있다.메모리에는 사용자의 학습 상태에 기초하여 사용자의 행동 패턴 중 기설정된 부정 행동 패턴이 추출된 시 간대에 대응되는 수학 개념에 대한 설명을 단말로 제공하도록 야기하는 코드가 저장될 수 있다. 예컨대, 사용자 의 학습 상태가 이차 다항식에서 부정일 경우, 메모리에 저장된 코드에 기초하여 단말로 이차 다항식에 대 한 설명이 제공될 수 있다. 또한, 본 발명의 일 실시예에 따라 사용자 단말로 제공되는 수학 개념 설명 이후에 해당 수학 개념과 관련된 수 학 문제, 강의 영상 등의 수학 콘텐츠를 제공하도록 야기하는 코드가 메모리에 저장될 수 있다. 도 3은 도 1에 도시된 학습자 맞춤형 수학 개념 제공 장치를 이용하여 학습자 맞춤형 수학 개념 및 사용자의 움 직임을 추출하는 일 예를 도시한 도면이다. 도 3을 참조하면, 학습자 맞춤형 수학 개념 제공 장치는 신체 부위를 인식하고, 신체 부위의 윤곽선을 생성할 수 있다. 예컨대, 학습자 맞춤형 수학 개념 제공 장치는 사용자의 얼굴 및 손의 윤곽선(310, 320)을 생성할 수 있다. 학습자 맞춤형 수학 개념 제공 장치는 움직임을 파악하기 위해 생성된 얼굴 윤곽선 상에 얼굴 코너점(31 1)을 추출할 수 있다. 학습자 맞춤형 수학 개념 제공 장치는 움직임을 파악하기 위해 생성된 손 윤곽선 상에 손 코너점을 추출할 수 있다. 학습자 맞춤형 수학 개념 제공 장치는 추출된 코너점(311, 321)의 변화에 따른 벡터값에 기초하여 사용자의 행 동 패턴을 산출할 수 있다. 학습자 맞춤형 수학 개념 제공 장치는 OCR 텍스트 인식 방법에 기초하여 영상 내의 텍스트를 추출할 수 있 다. 도 4는 도 1에 도시된 학습자 맞춤형 수학 개념 제공 장치를 이용하여 사용자 사용 수학 개념 및 사용자의 행동 패턴을 시간대별로 리스트화한 일 예를 도시한 도면이다. 도 4를 참조하면, 학습자 맞춤형 수학 개념 제공 장치는 풀이 과정에서 인식된 수학 개념을 시간대별로 나 타낼 수 있다. 예를 들어, 제1 시간에 곱셈 공식이 인식되고, 제2 시간에 이차방정식이 될 조건이 인식되었다고 시간순으로 나타낼 수 있다. 학습자 맞춤형 수학 개념 제공 장치는 풀이 과정에서 인식된 사용자의 행동 패턴을 시간대별로 나타낼 수 있다. 예컨대, 제3 시간에 문제 인식, 제4 시간에 손 움직임, 제5 시간에 문제 재인식, 제6시간에 손 움직임 멈 춤, 제7시간에 고개 갸우뚱 및 제8시간에 손 움직임이 인식되었다고 시간순으로 나타낼 수 있다. 해당 시간들 각각은 사용자의 영상의 프레임들 각각에 해당할 수 있다. 학습자 맞춤형 수학 개념 제공 장치는 영상 시작 시간을 기준으로 순차적으로 나타낸 수학 개념 및 사용자의 행 동 패턴을 비교하여 부족한 필수 수학 개념을 단말로 제공할 수 있다. 일례로, 학습자 맞춤형 수학 개념 제공 장치는 문제 풀이에 필요한 개념과 실제 풀이에 사용된 개념들을 비교했 을 때, 다항식의 정리 방법이 없을 경우, 다항식의 정리 방법을 이해하고 있지 않다고 판단하여, 다항식의 정리 방법에 대한 설명을 단말로 제공할 수 있다. 다른 예로, 학습자 맞춤형 수학 개념 제공 장치는 곱셈 공식을 알고 풀이를 진행 중에 손 움직임 멈춤 및 고개 갸우뚱의 행동을 인식하고, 해당 행동을 부정으로 인식하여 곱셈 공식에 대해 완벽하게 이해하지 못했다고 판단 하여 곱셈 공식에 대한 설명을 단말로 제공할 수 있다. 도 5는 본 발명의 다른 실시예에 따른 학습자 맞춤형 수학 개념 제공 방법의 순서를 도시한 흐름도이다. 이하에서 설명될 학습자 맞춤형 수학 개념 제공 방법은 앞서 도 1 내지 도 4를 참조하여 설명한 학습자 맞춤형 수학 개념 제공 장치에 의해 수행될 수 있다. 따라서, 앞서 도 1 내지 도 4를 참조하여 설명한 본 개시의 실시 예에 대한 내용은 이하에서 설명될 실시예에도 동일하게 적용될 수 있으며, 이하에서 상술한 설명과 중복되는 내용은 생략하도록 한다. 이하에서 설명되는 단계들은 반드시 순서대로 수행되어야 하는 것은 아니고, 단계들의 순서는 다양하게 설정될 수 있으며, 단계들은 거의 동시에 수행될 수도 있다. 도 5를 참조하면, 학습자 맞춤형 수학 개념 제공 방법은 신체 부위 및 풀이 과정이 포함된 영상 수신 단계 (S100), 사용자 사용 수학 개념 추출 및 사용자의 행동 패턴 분석 단계(S200) 및 수학 개념에 대한 설명 제공단계(S300)를 포함한다. 신체 부위 및 풀이 과정이 포함된 영상 수신 단계(S100)는 사용자의 머리 및 손 중 적어도 하나 이상을 포함하 는 신체 부위와 기설정된 문제에 대한 사용자의 풀이 과정이 포함된 영상을 수신하는 단계이다. 사용자 사용 수학 개념 추출 및 사용자의 행동 패턴 분석 단계(S200)는 풀이 과정을 분석하여 풀이 과정에 포함 된 사용자 사용 수학 개념을 추출하고, 신체 부위의 움직임을 기초하여 사용자의 행동 패턴을 분석하는 단계이 다. 수학 개념에 대한 설명 제공 단계(S300)는 사용자 사용 수학 개념과 기설정된 문제에 매칭된 필수 수학 개념들 을 비교하고, 행동 패턴 중 특정 행동 패턴에 대응되는 수학 개념의 설명을 서버와 통신 연결된 단말로 제공하 는 단계이다. 도 6내지 도 8은 도 5에 도시된 학습자 맞춤형 수학 개념 제공 방법의 일부 단계에 대한 세부 단계들을 도시한 도면이다. 도 6을 참조하면, 사용자 사용 수학 개념 추출 및 사용자의 행동 패턴 분석 단계(S200)에서, 사용자 사용 수학 개념 추출을 위해 풀이 과정 내의 텍스트 추출 단계(S211), 텍스트 내의 수식 추출 단계(S212), 사용자 사용 수 학 개념 추출 단계(S213) 및 사용자 사용 수학 개념 리스트 생성 단계(S214)를 포함할 수 있다. 풀이 과정 내의 텍스트 추출 단계(S211)는 풀이 과정을 기설정된 방법을 통해 분석하여 풀이 과정 내의 텍스트 를 추출하는 단계일 수 있다. 예컨대, 기설정된 방법은 OCR 텍스트 인식 방법일 수 있다. 텍스트 내의 수식 추출 단계(S212)는 텍스트로부터 수식을 추출하는 단계일 수 있다. 예컨대, 텍스트 내의 수식 추출 단계(S212)에서 기저장된 수식에 기초하여 텍스트 내의 수식을 추출할 수 있다. 사용자 사용 수학 개념 추출 단계(S213)는 수식에 대응되는 사용자 사용 수학 개념을 추출하는 단계일 수 있다. 예컨대, 사용자 사용 수학 개념 추출 단계(S213)에서 기저장된 수식과 매칭된 수학 개념에 기초하여 사용자 사 용 수학 개념을 추출할 수 있다. 사용자 사용 수학 개념 리스트 생성 단계(S214)는 시간대별로 사용자 사용 수학 개념의 리스트를 생성하는 단계 일 수 있다. 도 7을 참조하면, 사용자의 행동 패턴을 추출하기 위해 코너점 추출 단계(S221), 사용자의 움직임 추출 단계 (S222), 사용자의 행동 패턴 추출 단계(S223) 및 사용자의 행동 패턴 리스트 생성 단계(S224)를 포함할 수 있다. 코너점 추출 단계(S221)는 사용자의 신체 부위의 윤곽선을 생성하고, 윤곽선 상에 코너점을 추출하는 단계일 수 있다. 사용자의 움직임 추출 단계 (S222)는 코너점을 기준으로 사용자의 움직임을 추출하는 단계일 수 있다. 예컨대, 사용자의 움직임은 벡터값일 수 있다. 사용자의 행동 패턴 추출 단계(S223)는 사용자의 움직임에 대한 벡터값을 입력으로 하여 사용자의 행동 패턴을 추출하도록 학습된 인공지능 모델에 기초하여 사용자의 행동 패턴을 추출하는 단계일 수 있다. 예컨대, 사용자 의 행동 패턴은, 손 움직임, 손 움직임 멈춤, 고개 갸우뚱 및 문제 인식 중 적어도 하나를 포함할 수 있다. 사용자의 행동 패턴 리스트 생성 단계(S224)는 시간대별로 사용자의 행동 패턴의 리스트를 생성하는 단계일 수 있다. 도 8을 참조하면, 수학 개념에 대한 설명 제공 단계(S300)는 필수 수학 개념 및 사용자 사용 수학 개념이 일치 하는지 판단하는 단계(S311), 사용자의 학습 상태 판단 단계(S312), 학습 상태에 따라 필수 수학 개념 설명 제 공 단계(S313) 및 누락 필수 수학 개념 설명 단계(S314)를 포함할 수 있다. 필수 수학 개념 및 사용자 사용 수학 개념이 일치하는지 판단하는 단계(S311)는 사용자 사용 수학 개념과 기설 정된 문제에 매칭된 필수 수학 개념들을 비교하는 단계일 수 있다. 예컨대, 필수 수학 개념 및 사용자 수학 개 념이 일치하는지 판단하는 단계(S311)에서 필수 수학 개념 및 사용자 사용 수학 개념이 비교 결과, 상기 필수 수학 개념들이 상기 사용자 사용 수학 개념에 모두 포함되는 경우 사용자의 학습 상태 판단 단계(S312)를 수행 하고, 일치하지 않을 경우 누락 필수 수학 개념 설명 단계(S314)를 수행할 수 있다. 사용자의 학습 상태 판단 단계(S312)는 사용자 사용 수학 개념과 사용자의 행동 패턴을 시간대별로 비교하여 사 용자의 학습 상태를 판단하는 단계일 수 있다. 예컨대, 사용자의 학습 상태 판단 단계(S312)에서 다항식 곱셈을 풀이하는 과정 중 사용자의 행동 패턴이 고개 갸우뚱이면 다항식 곱셈에서 부정이라고 판단할 수 있다. 학습 상태에 따라 필수 수학 개념 설명 제공 단계(S313)는 사용자의 학습 상태에 기초하여 사용자의 행동 패턴 중 특정 행동 패턴이 추출된 시간대에 대응되는 필수 수학 개념에 대한 설명을 단말로 제공하는 단계일 수 있다. 예컨대, 다항식 곱셈에서 부정이라는 사용자의 학습 상태에 기초하여 다항식 곱셈에 대한 설명을 단말로 제공할 수 있다. 누락 필수 수학 개념 설명 단계(S314)는 사용자 사용 수학 개념에 포함되지 않은 필수 수학 개념들에 대한 설명 을 단말로 제공하는 단계일 수 있다. 예컨대, 사용자 사용 수학 개념이 1, 3, 4이고 필수 수학 개념이 1, 2, 3, 4이면, 누락 필수 수학 개념 설명 단계(S313)에서 필수 수학 개념 2에 대한 설명을 단말로 제공할 수 있다. 누락 필수 수학 개념 설명 단계(S314)를 수행한 후 사용자의 학습 상태 판단 단계(S312) 및 학습 상태에 따라 필수 수학 개념 설명 제공 단계(S313)를 순차적으로 더 수행할 수 있다. 또한, 본 발명의 일 실시예에 따라 사용자 단말로 제공되는 수학 개념 설명 이후에 해당 수학 개념과 관련된 수 학 문제, 강의 영상 등의 수학 콘텐츠를 제공하는 단계가 더 수행될 수 있다."}
{"patent_id": "10-2023-0100315", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "본 개시가 속하는 기술분야의 통상의 지식을 가진 자는 상술한 설명을 기초로 본 개시의 기술적 사상이나 필수 적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해할 수 있을 것이다. 그러 므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해되어야만 한다. 본 개시의 범위는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개 념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 개시의 범위에 포함되는 것으로 해석되어야 한다. 본원 의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범 위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본원의 범위에 포함되는 것으로 해석 되어야 한다."}
{"patent_id": "10-2023-0100315", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 학습자 맞춤형 수학 개념 제공 장치와 이와 통신 연결된 단말을 설명하기 위해 도시한 도면이다. 도 2는 도 1에 도시된 학습자 맞춤형 수학 개념 제공 장치의 세부구성을 도시한 도면이다. 도 3은 도 1에 도시된 학습자 맞춤형 수학 개념 제공 장치를 이용하여 학습자 맞춤형 수학 개념 및 사용자의 움 직임을 추출하는 일 예를 도시한 도면이다. 도 4는 도 1에 도시된 학습자 맞춤형 수학 개념 제공 장치를 이용하여 사용자 사용 수학 개념 및 사용자의 행동 패턴을 시간대별로 리스트화한 일 예를 도시한 도면이다. 도 5는 본 발명의 다른 실시예에 따른 학습자 맞춤형 수학 개념 제공 방법의 순서를 도시한 흐름도이다. 도 6내지 도 8은 도 5에 도시된 학습자 맞춤형 수학 개념 제공 방법의 일부 단계에 대한 세부 단계들을 도시한 도면이다."}
