{"patent_id": "10-2018-0165209", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0076272", "출원번호": "10-2018-0165209", "발명의 명칭": "패널 운반 장치 및 이를 포함하는 시스템", "출원인": "엘지디스플레이 주식회사", "발명자": "김정겸"}}
{"patent_id": "10-2018-0165209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "공정 장비에 의한 디스플레이 공정 동안 패널을 운반하기 위한 상기 패널이 장착된 지그에 있어서,상기 패널의 주변 환경을 측정하고, 측정 결과에 따라 상태 정보를 생성하는 센서;상기 패널의 공정 이력 정보, 상기 패널의 측정 정보 및 상기 공정 장비의 현재의 장비 파라미터를 수신하는 통신 회로; 및상기 상태 정보, 상기 공정 이력 정보, 상기 측정 정보 및 상기 장비 파라미터를 이용하여 상기 패널에 대한 상기 공정 장비의 최적 장비 파라미터를 도출하는 제어 회로를 포함하고,상기 상태 정보는 상기 패널의 온도 및 상기 패널의 진동 수준 중 적어도 하나를 포함하고,상기 공정 이력 정보는 상기 패널에 대해 수행된 공정에 대한 정보를 포함하고,상기 측정 정보는 상기 패널의 물리적 특성 및 전기적 특성 중 적어도 하나와 관련된 정보이고,상기 장비 파라미터는 상기 공정 장비에 의한 상기 디스플레이 공정을 제어하기 위한 파라미터인,지그."}
{"patent_id": "10-2018-0165209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 제1항에 있어서, 상기 공정 이력 정보는 상기 패널에 대해 수행된 공정들의 식별번호, 수행된 공정들의 명칭, 수행된 공정들의조업 일자, 수행된 공정들에 해당하는 공정 장비의 식별 번호, 상기 패널이 면취된 글래스(glass)의 식별번호또는 상기 패널이 글래스 상에서 면취된 섹션의 식별번호 중 적어도 하나를 포함하고,상기 측정 정보는 상기 패널의 두께, 상기 패널의 대표 전압, 이전 공정에서 계산된 상기 패널에 대한 공정 결과 예측값 및 상기 패널의 수리 여부 중 적어도 하나를 포함하는,지그."}
{"patent_id": "10-2018-0165209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 상태 정보는 상기 패널의 물리적 특성에 대한 정보를 더 포함하고,상기 센서는 빛을 방사하기 위한 발광부 및 빛을 수신하기 위한 수광부를 포함하고, 상기 발광부와 상기 수광부는 상기 지그를 중심으로 대향하여 배치되고,상기 센서는 상기 수광부에 의해 수신된 빛을 분석함으로써 상기 패널의 특성을 측정하고, 측정 결과에 따라 상기 상태 정보를 생성하는,지그."}
{"patent_id": "10-2018-0165209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 통신 회로는,상기 제어 회로에 의해 도출된 최적 장비 파라미터를 상기 공정 장비로 전송함으로써 상기 공정 장비로 하여금수신된 최적 장비 파라미터에 기초하여 상기 패널에 대한 공정을 수행하도록 상기 공정 장비를 제어하는,지그.공개특허 10-2020-0076272-3-청구항 5 제1항에 있어서, 상기 제어 회로는,상기 최적 장비 파라미터를 도출하기 위한 연산을 수행하는 프로세서; 및상기 최적 장비 파라미터를 도출하기 위한 인공지능 기반 예측 모델을 저장하는 메모리를 포함하고,상기 프로세서는,상기 상태 정보, 상기 공정 이력 정보, 상기 측정 정보 및 상기 장비 파라미터를 상기 예측 모델의 입력으로서사용하여 상기 패널에 대한 공정 결과 예측값을 계산하고, 상기 공정 결과 예측값이 기준 값 이상일 때의 장비 파라미터를 상기 최적 장비 파라미터로서 도출하는,지그."}
{"patent_id": "10-2018-0165209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 프로세서는,상기 공정 결과 예측값이 상기 기준 값 이상이 될 때까지, 상기 상태 정보, 상기 공정 이력 정보 및 상기 측정정보는 변화시키지 않고 상기 장비 파라미터를 변경시키면서 상기 예측 모델에 기초하여 상기 패널에 대한 공정결과 예측값을 반복적으로 계산하는,지그."}
{"patent_id": "10-2018-0165209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서, 상기 공정 결과 예측값은,상기 공정 장비에 의한 공정이 상기 패널에 대해 수행되었을 때 예상되는 공정 결과의 발생할 확률에 대해, 상기 공정 결과의 수준을 가중치로서 반영한 가중치 확률인,지그."}
{"patent_id": "10-2018-0165209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "서버, 공정 장비 및 상기 공정 장비에 의한 디스플레이 공정 동안 패널을 운반하기 위한 지그를 이용하여 상기패널에 대한 상기 공정 장비의 장비 파라미터를 최적화하기 위한 방법에 있어서,상기 지그가 상기 패널의 온도 및 상기 패널의 진동 수준 중 적어도 하나를 포함하는 상태 정보를 생성하는 단계;상기 서버가 상기 패널에 대해 수행된 공정에 대한 공정 이력 정보 및 상기 패널의 물리적 특성 및 전기적 특성중 적어도 하나에 대한 측정 정보를 상기 지그로 전송하는 단계;상기 공정 장비가 현재의 장비 파라미터를 상기 지그로 전송하는 단계;상기 지그가 상기 상태 정보, 상기 공정 이력 정보, 상기 측정 정보 및 상기 장비 파라미터를 이용하여 상기 패널에 대한 상기 공정 장비의 최적 장비 파라미터를 도출하는 단계;상기 지그가 상기 최적 장비 파라미터를 상기 공정 장비로 전송하는 단계; 및상기 공정 장비가 상기 최적 장비 파라미터에 기초하여 상기 패널에 대하여 공정을 수행하는 단계를 포함하는,방법."}
{"patent_id": "10-2018-0165209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 공정 장비가 상기 최적 장비 파라미터에 기초하여 상기 패널에 대하여 공정을 수행하는단계는,상기 공정 장비가 상기 패널로부터 상기 패널을 식별하기 위한 패널 식별자를 획득하고, 획득된 패널 식별자에해당하는 상기 최적 장비 파라미터를 리드하고, 리드된 상기 최적 장비 파라미터에 따라 상기 패널에 대한 공정공개특허 10-2020-0076272-4-을 수행하는 단계를 포함하는,방법."}
{"patent_id": "10-2018-0165209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서, 상기 지그가 상기 패널에 대한 상기 공정 장비의 상기 최적 장비 파라미터를 도출하는 단계는, 상기 지그가 상기 최적 장비 파라미터를 도출하기 위한 인공지능 기반 예측 모델을 리드하는 단계;상기 지그가 상기 상태 정보, 상기 공정 이력 정보, 상기 측정 정보 및 상기 장비 파라미터를 상기 예측 모델의입력으로서 사용하여 상기 패널에 대한 공정 결과 예측값을 계산하는 단계; 및상기 지그가 상기 공정 결과 예측값이 기준 값 이상일 때의 상기 장비 파라미터를 상기 최적 장비 파라미터로서도출하는 단계를 포함하는,방법."}
{"patent_id": "10-2018-0165209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 지그가 상기 패널에 대한 상기 공정 장비의 상기 최적 장비 파라미터를 도출하는단계는,상기 지그가 상기 공정 결과 예측값이 상기 기준 값 이상이 될 때까지, 상기 상태 정보, 상기 공정 이력 정보및 상기 측정 정보는 변화시키지 않고 상기 장비 파라미터를 변경시키면서 상기 예측 모델에 기초하여 상기 패널에 대한 공정 결과 예측값을 반복적으로 계산하는 단계를 더 포함하는,방법."}
{"patent_id": "10-2018-0165209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서,상기 공정 장비는 상기 패널 상에 표시되는 얼룩을 보정하기 위한 카메라 보상 공정을 수행하고,상기 공정 장비는 상기 패널을 촬영하기 이전에, 상기 지그로부터 전송된 상기 최적 장비 파라미터에 따라 상기패널을 촬영하기 위한 설정을 수행하고, 상기 최적 장비 파라미터에 기초하여 상기 패널을 촬영하고, 촬영 결과에 따라 상기 패널 상에 표시되는 얼룩을 보정하기 위한 보상 데이터를 생성하는,방법."}
{"patent_id": "10-2018-0165209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항의 지그의 작동을 수행하기 위한 명령어들을 포함하는 컴퓨터 프로그램을 저장하는 컴퓨터 판독 가능한 저장 매체."}
{"patent_id": "10-2018-0165209", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "공정 장비에 의한 디스플레이 공정 동안 패널을 운반하기 위한 패널이 장착된 지그가 개시된다. 상기 지그는, 상 기 패널의 주변 환경을 측정하고, 측정 결과에 따라 상태 정보를 생성하는 센서, 상기 패널의 공정 이력 정보, 상기 패널의 측정 정보 및 상기 공정 장비의 현재의 장비 파라미터를 수신하는 통신 회로, 및 상기 상태 정보, 상기 공정 이력 정보, 상기 측정 정보 및 상기 장비 파라미터를 이용하여 상기 패널에 대한 상기 공정 장비의 최 적 장비 파라미터를 도출하는 제어 회로를 포함하고, 상기 상태 정보는 상기 패널의 온도 및 상기 패널의 진동 수준 중 적어도 하나를 포함하고, 상기 공정 이력 정보는 상기 패널에 대해 수행된 공정에 대한 정보를 포함하고, 상기 측정 정보는 상기 패널의 물리적 특성 및 전기적 특성 중 적어도 하나와 관련된 정보이고, 상기 장비 파라미터는 상기 공정 장비에 의한 상기 디스플레이 공정을 제어하기 위한 파라미터이다."}
{"patent_id": "10-2018-0165209", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 실시 예들은 패널 운반 장치 및 이를 포함하는 시스템에 관한 것으로, 특히, 패널 별 최적 장비 파라 미터를 도출하기 위한 패널 운반 장치 및 이를 포함하는 시스템에 관한 것이다."}
{"patent_id": "10-2018-0165209", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "핸드폰(mobile phone), PDA, 노트북 컴퓨터와 같은 각종 휴대용 전자기기가 발전함에 따라, 이에 적용될 수 있 는 디스플레이 장치(display device)에 대한 요구가 점차 증대되고 있다. 디스플레이 장치는 화면을 표시하기 위한 패널을 포함하는데, 패널을 생성하기 위해서는 다양한 공정이 필요하 다. 이 때, 패널을 각 공정 단계에서 운반하기 위해 패널 운반 장치가 사용된다."}
{"patent_id": "10-2018-0165209", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2018-0165209", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는 패널 별 최적 장비 파라미터를 도출하기 위한 패널 운반 장치 및 이를 포함 하는 시스템을 제공하는 것에 있다."}
{"patent_id": "10-2018-0165209", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시 예들에 따른 공정 장비에 의한 디스플레이 공정 동안 패널을 운반하기 위한 상기 패널이 장착된 지그는, 상기 패널의 주변 환경을 측정하고, 측정 결과에 따라 상태 정보를 생성하는 센서, 상기 패널의 공정 이력 정보, 상기 패널의 측정 정보 및 상기 공정 장비의 현재의 장비 파라미터를 수신하는 통신 회로, 및 상기 상태 정보, 상기 공정 이력 정보, 상기 측정 정보 및 상기 장비 파라미터를 이용하여 상기 패널에 대한 상기 공 정 장비의 최적 장비 파라미터를 도출하는 제어 회로를 포함하고, 상기 상태 정보는 상기 패널의 온도 및 상기 패널의 진동 수준 중 적어도 하나를 포함하고, 상기 공정 이력 정보는 상기 패널에 대해 수행된 공정에 대한 정 보를 포함하고, 상기 측정 정보는 상기 패널의 물리적 특성 및 전기적 특성 중 적어도 하나와 관련된 정보이고, 상기 장비 파라미터는 상기 공정 장비에 의한 상기 디스플레이 공정을 제어하기 위한 파라미터이다. 본 발명의 실시 예들에 따른 서버, 공정 장비 및 상기 공정 장비에 의한 디스플레이 공정 동안 패널을 운반하기 위한 지그를 이용하여 상기 패널에 대한 상기 공정 장비의 장비 파라미터를 최적화하기 위한 방법은, 상기 지그 가 상기 패널에 대한 상태 정보를 생성하는 단계, 상기 서버가 상기 패널의 공정 이력 정보 및 상기 패널의 측 정 정보를 상기 지그로 전송하는 단계, 상기 공정 장비가 현재의 장비 파라미터를 상기 지그로 전송하는 단계, 상기 지그가 상기 상태 정보, 상기 공정 이력 정보, 상기 측정 정보 및 상기 장비 파라미터를 이용하여 상기 패 널에 대한 상기 공정 장비의 최적 장비 파라미터를 도출하는 단계, 상기 지그가 상기 최적 장비 파라미터를 상 기 공정 장비로 전송하는 단계 및 상기 공정 장비가 상기 최적 장비 파라미터에 기초하여 상기 패널에 대하여 공정을 수행하는 단계를 포함한다. 본 발명의 실시 예들에 따른 컴퓨터 판독 가능한 저장 매체는, 제1항의 지그의 작동을 수행하기 위한 명령어들 을 포함하는 컴퓨터 프로그램을 저장한다."}
{"patent_id": "10-2018-0165209", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예들에 따른 지그 및 이를 포함하는 시스템은 패널에 대한 공정이 수행되기 전이라도, 패널의 특성 및 공정 파라미터에 기초하여 상기 패널이 해당 공정을 겪은 후의 결과를 사전에 예측할 수 있는 효과가 있다. 본 발명의 실시 예들에 따른 지그 및 이를 포함하는 시스템은 패널 각각의 특성이 고려된 최적 장비 파라미터를 도출할 수 있는 효과가 있다. 이에 따라, 상기 최적 장비 파라미터를 사용하는 공정 장비에 의한 공정 결과가 양호할 가능성이 높다."}
{"patent_id": "10-2018-0165209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면들을 참조하여 본 발명의 실시 예들을 설명한다. 도 1은 본 발명의 실시 예들에 따른 최적 장비 파라미터를 도출하기 위한 장비 파라미터 최적화 시스템(이하, 최적화 시스템; 10)을 나타낸다. 도 1을 참조하면, 최적화 시스템은 지그(jig; 100), 공정 장비 및 서 버을 포함한다. 최적화 시스템은 디스플레이 공정에서 사용될 수 있고, 후술하는 바와 같이, 패널 별 최적화 장비 파라미터 를 이용하여 상기 패널에 대한 공정을 처리할 수 있다. 지그는 디스플레이 공정 상에서 패널을 운반하기 위한 장치이다. 실시 예들에 따라, 패널은 지 그 상에 부착되어 운반될 수 있다. 실시 예들에 따라, 지그는 패널이 디스플레이 공정을 겪는 (undergo) 동안, 패널을 고정 및 지지하기 위한 장치일 수 있다. 패널은 이미지 데이터를 표시하기 위한 픽셀(pixel)들을 포함하는 디스플레이용 패널일 수 있다. 실시 예 들에 따라, 패널에 포함된 픽셀들은 패널상에 수평 및 수직으로 배열될 수 있다. 상기 픽셀들은 각각 레드 픽셀, 그린 픽셀 및 블루 픽셀 중 어느 하나일 수 있으나, 이에 한정되는 것은 아니다. 예컨대, 패널은 CRT(cathode ray tube), LCD(liquid crystal display), LED(light emitting diode), PDP(plasma display panel), OLED(organic LED) 또는 플렉서블 디스플레이(flexible display) 패널일 수 있으 나, 이에 한정되는 것은 아니다. 패널은 지그에 의해 운반되어 공정 장비에 의해 처리(공정)될 수 있다. 공정 장비는 디스플레이 공정을 수행하는 임의의 장비일 수 있다. 실시 예들에 따라, 공정 장비는 지 그를 통해 운반되는 패널에 대해 디스플레이 공정을 수행할 수 있다. 비록 도 1에는 하나의 공정 장 비만이 도시되어 있으나, 공정 장비는 하나 이상의 기능을 수행하는 공정 장비들을 집합적으로 의미 할 수 있다. 예컨대, 공정 장비는 증착 공정, 식각 공정, 노광 공정, 현상 공정, 박리 공정, ELA(eximer laser annealing) 공정, 이온 임플란트(ion implant) 공정, 테스트 공정, 리페어 공정, 세정 공정, AOI(auto optical inspection 공정), 카메라 보상 공정 등 다양한 공정에 사용되는 장비를 의미할 수 있으나, 공정 장비의 용도가 본 명세서에 기재된 공정에 한정되는 것은 아니다. 공정 장비는 입력된 또는 저장된 장비 파라미터(EP)에 기초하여, 디스플레이 공정을 수행할 수 있다. 장비 파라미터(EP)는 공정 장비에 의한 디스플레이 공정을 제어 또는 설정하기 위한 파라미터일 수 있다. 서버는 지그 및 공정 장비와 통신할 수 있다. 서버는 데이터를 수신하거나 송신하고, 처리 할 수 있는 임의의 하드웨어 또는 소프트웨어를 통칭할 수 있다. 실시 예들에 따라, 서버는 지그와 데이터를 주고받을 수 있고, 공정 장비와 데이터를 주고받을 수 있다. 서버는 데이터 베이스(DB; 310)에 액세스할 수 있고, DB에 데이터를 저장(또는 라이트)하거나, 또는 DB로부터 데이터를 리드(또는 검색)할 수 있다. 한편, 본 명세서에서, 서버에 데이터가 저장되어 있 다 함은, 서버에 의해 액세스 가능한 데이터베이스에 데이터가 저장되어 있음을 의미한다. 도 2는 본 발명의 실시 예들에 따른 최적화 시스템을 세부적으로 나타낸다. 도 1과 도 2를 참조하면, 지그(10 0)는 공정 장비로부터 공정 장비의 현재 장비 파라미터(EP)를 수신하고, 패널과 관련된 정보들 및 장비 파라미터(EP)를 이용하여 예측 모델(EM)에 따라 패널에 대한 공정 장비의 공정 결과 예측값 을 계산하고, 최적 장비 파라미터(OEP)를 도출할 수 있다. 여기서, 공정 결과 예측값이라 함은 공정 장비에 의한 공정이 패널에 대해 수행되었을 때, 그 공정 결과의 수준 및 그러한 결과가 발생할 확률을 나타낼 수 있다. 즉, 대략적으로, 공정 결과 예측 값이 높을 수록 패널에 대한 공정 결과가 좋음을 의미한다. 예컨대, 공정 결과 예측값이 높을 수록, 패널에 대한 공 정 결과의 수준이 높고(더 좋고), 그러한 높은 수준의 공정 결과가 많이 발생(확률이 높고)함을 의미한다. 공정 결과 예측 값은 공정 결과의 수준을 반영한 가중치 확률을 의미할 수 있다. 예컨대, 공정 결과의 수준이 A 급, B급 및 C급으로 분류되고, 상기 A급에 대한 가중치가 w1, 상기 B급에 대한 가중치가 w2, 상기 C급에 대한 가중치가 w3라고 가정한다. 이 때, 예측 모델(EM)에 따라 패널의 공정 결과가 A급일 확률이 p1, B급일 확 률이 p2, 및 C급일 확률이 p3라 하면, 공정 결과 예측 값은 p1*w1+p2*w2+p3+w3일 수 있다. 그러나, 상술한 수학 식은 예시적인 것일 뿐이며, 본 발명의 실시 예들이 이에 한정되는 것은 아니다. 최적 장비 파라미터(OEP)는 패널마다 존재하는 것으로서, 공정 장비가 패널에 대해 공정을 수행 할 때 가장 좋은 결과를 야기하는 장비 파라미터일 수 있다.실시 예들에 따라, 지그는 상태 정보(SI), 공정 이력 정보(PHI), 측정 정보(MI) 및 장비 파라미터(EP) 중 적어도 하나에 기초하여 최적 장비 파라미터(OEP)를 도출할 수 있다. 예컨대, 지그는 인공 지능 기반 최적 화 모델을 이용하여 최적 장비 파라미터(OEP)를 도출할 수 있다. 실시 예들에 따라, 상태 정보(SI)는 패널의 주변 환경과 관련된 정보를 의미할 수 있다. 예컨대, 상태 정 보(SI)는 패널 주변의 온도, 패널이 위치한 장소의 진동 정도 또는 패널 주변의 진공 정도, 패 널 상에 이물질이 존재하는지 여부를 나타낼 수 있다. 또한, 실시 예들에 따라, 상태 정보(SI)는 패널의 물리적 또는 전기적 특성을 나타낼 수 있다. 예컨대, 상 태 정보(SI)는 패널의 레이어 증착 두께 또는 패널의 균일도(uniformity), 패널의 픽셀의 구동 특성(휘도, 명도, 또는 불량 여부)과 관련된 정보를 나타낼 수 있으나, 이에 한정되는 것은 아니다. 실시 예들에 따라, 공정 이력 정보(PHI)는 패널에 대해 수행된 (과거의) 공정과 관련된 정보일 수 있다. 예컨대, 공정 이력 정보(PHI)는 패널에 대해 수행된 공정들의 식별번호, 수행된 공정들의 명칭, 수행된 공 정들의 조업 일자, 수행된 공정들에 해당하는 공정 장비의 식별 번호, 패널이 면취된 글래스(glass)의 식 별번호 또는 패널이 글래스 상에서 면취된 섹션의 식별번호를 나타낼 수 있다. 실시 예들에 따라, 측정 정보(MI)는 패널의 물리적 및 전기적 특성과 관련된 정보일 수 있다. 예컨대, 측 정 정보(MI)는 패널의 물리적 차원(dimension)에 대한 정보(증착막 두께 등), 패널의 전기적 특성에 대한 정보(예컨대, 패널의 대표 전압), 이전 공정에서 계산(또는 예측)된 패널에 대한 공정 결과 예 측값 또는 패널의 수리(repair) 여부를 나타낼 수 있다. 실시 예들에 따라, 상태 정보(SI)는 측정 정보 (MI)를 포함할 수 있다. 예컨대, 장비 파라미터(EP)는 증착막 두께, 식각 깊이, 노광량, 현상 시간, 공정 장비의 온도 또는 공정 장비의 구동 속도(또는 성능)을 의미할 수 있으나, 이에 한정되는 것은 아니다. 즉, 본 발명의 실시 예들에 따른 지그는 전체 디스플레이 공정만을 고려하는 것이 아니라, 개별 패널(11 0)의 특성을 고려함으로써 패널에 의존적인 최적 장비 파라미터(OEP)를 도출할 수 있다. 이에 따라, 실시 간으로 유입되는 패널들에 대해 보다 나은 공정 결과를 얻을 수 있을 뿐만 아니라, 패널에 대해 공정 상 문제점이 발생한 경우 그 원인을 쉽게 찾을 수 있는 효과가 있다. 이하, 이러한 본 발명의 지그에 대해 상세히 설명한다. 지그는 제어 회로, 센서 및 통신 회로를 포함할 수 있다. 제어 회로는 지그의 전반적인 작동을 제어할 수 있다. 실시 예들에 따라, 제어 회로는 센서 및 통신 회로의 전반적인 작동을 제어할 수 있다. 즉, 제어 회로는 데이터를 이용하여 연산을 수행하고, 연산 결과에 따라 지그의 작동을 제어할 수 있다. 제어 회로는 센서로부터 상태 정보(SI)를 수신할 수 있고, 통신 회로로부터 공정 이력 정보 (PHI), 측정 정보(MI) 및 장비 파라미터(EP)를 수신할 수 있다. 제어 회로는 최적 장비 파라미터(OEP)를 통신 회로로 전송할 수 있다. 제어 회로는 프로세서 및 메모리을 포함할 수 있다. 프로세서는 연산 능력을 가진 하드웨어로 구성될 수 있다. 실시 예들에 따라, 프로세서는 CPU(central processing unit), MCU(micro controller unit), MPU(micro processor unit), FPU(floating point unit), DSP(digital signal processor), 프로그램 가능 논리 회로, 필드 프로그래머블 게이트 어레이 (field-programmable gate array, FPGA) 또는 프로그램 가능 논리 어레이(programmable logic array, PLA)일 수 있으나, 이에 한정되는 것은 아니다. 프로세서는 메모리에 저장된 데이터를 이용하여 연산을 수행할 수 있다. 실시 예들에 따라, 프로세서 는 메모리에 저장된 프로그램(또는 소프트웨어)를 로딩하고, 로딩된 프로그램에 포함된 명령어들의 세트에 기초하여 지그를 제어할 수 있다. 메모리는 지그의 작동에 필요한 데이터를 저장할 수 있다. 실시 예들에 따라, 메모리는 상태 정 보(SI), 공정 이력 정보(PHI), 측정 정보(MI), 장비 파라미터(EP) 및 패널 식별자(PID)를 저장할 수 있다. 또한, 메모리는 최적 파라미터(OEP)를 도출하기 위한 인공지능 기반 최적화 모델을 저장할 수 있다. 메모 리에 저장된 데이터는 프로세서에 의해 로딩되어 이용될 수 있다. 즉, 프로세서는 메모리에 저장된 데이터를 리드하고, 리드된 데이터에 기초하여 제어 작동을 수행할 수 있다. 또한, 프로세서는 데이터를 메모리에 저장할 수 있다. 센서는 지그(또는 패널)의 주변 환경을 측정하고, 측정 결과에 따라 상태 정보(SI)를 생성할 수 있다. 실시 예들에 따라, 센서는 패널의 물리적 또는 전기적 특성을 측정하고, 측정 결과에 따라 상 태 정보(SI)를 생성할 수 있다. 예컨대, 센서는 온도 센서, 습도 센서, 초음파 센서, 가속도 센서, 적외선 센서, 압력 센서, 자기 센서, 광 센서, 전류 센서, 전압 센서, 물 감지 센서 및 기압 센서 중 적어도 하나를 포함할 수 있으나, 이에 한정되 는 것은 아니다. 즉 센서는 하나 또는 그 이상의 센서들을 포함할 수 있다. 실시 예들에 따라, 센서가 패널의 물리적 특성을 측정할 수 있을 때, 센서는 빛을 방사하는 발 광부 및 빛을 수신하는 수광부를 포함하고, 상기 발광부는 지그의 일측에 설치되고 상기 수광부는 지그 의 타측에 설치되어 상기 발광부로부터 방사된 빛은 패널의 측면을 투과하여 상기 수광부에서 수신될 수 있다. 즉, 상기 발광부 및 상기 수광부는 지그를 중심으로 대향하여 배치될 수 있다. 센서는 수광 부에 의해 수신된 빛을 분석함으로써 패널의 특성을 측정할 수 있다. 예컨대, 센서는 패널 및 패널에 포함되는 적어도 하나의 층의 두께를 측정할 수 있다. 실시 예들에 따라, 센서가 패널의 전기적 특성을 측정할 수 있을 때, 지그는 패널에 전압 을 공급하는 전원 공급부(미도시)를 더 포함하고, 센서는 패널의 특정 지점에 인가되는 전압 또는 전 류를 측정할 수 있다. 예컨대, 센서는 패널의 대표 전압을 측정할 수 있다. 통신 회로는 외부로부터 수신된 데이터를 제어 회로로 전달하거나, 또는, 제어 회로로부터 데이 터를 수신하고, 수신된 데이터를 외부로 전송할 수 있다. 실시 예들에 따라, 통신 회로는 서버로부터 공정 이력 정보(PHI) 및 측정 정보(MI)를 수신하고 공정 이력 정보(PHI) 및 측정 정보(MI)를 를 제어 회로(12 0)로 전달할 수 있고, 공정 장비(EP)로부터 장비 파라미터(EP)를 수신하고 수신된 장비 파라미터(EP)를 제어 회 로로 전송할 수 있다. 또한, 통신 회로는 패널 식별자(PID) 및 최적 파라미터(OEP)를 공정 장비 및 서버로 전송할 수 있다. 실시 예들에 따라, 통신 회로는 네트워크를 통해 공정 장비 및 서버와 통신할 수 있다. 상기 네 트워크는, 개인 영역 네트워크(personal area network, PAN), 근거리 통신망(local area network, LAN), 홈 영 역 네트워크, 저장 영역 네트워크(storage area network, SAN), 캠퍼스 영역 네트워크, 백본(backbone) 네트워 크, 메트로폴리탄(metropolitan) 영역 네트워크, 광역 네트워크(wide area network, WAN), 기업 사설망, 가상 사설망, 가상 네트워크, 위성 네트워크, 컴퓨터 클라우드 네트워크, 인터네트워크, 셀룰러 네트워크 등과 같은 임의의 스케일(scale)을 가질 수 있다. 네트워크는 인트라넷 또는 익스트라넷일 수 있거나 이를 포함할 수 있다. 네트워크는 인터넷일 수 있거나 인터넷을 포함할 수 있다. 네트워크는 다른 네트워크를 포함할 수 있거나, 서브네트워크이든 별개의 네트워크이든, 구조 또는 동작에서 네트워크와 동일하든 상이하든 관계없이 다른 네트워크와의 통신을 허용할 수 있다. 네트워크는 하드웨어 기반이든 소프트웨어 기반이든 관계없이 컴퓨 터, 네트워크 인터페이스 카드, 중계기, 허브, 브리지, 스위치, 확장기, 안테나 또는 방화벽과 같은 하드웨어를 포함할 수 있다. 네트워크는, 본 개시의 내용과의 임의의 관계와 무관하게, 하나 이상의 엔티티 또는 행위자 (actor)에 의해 또는 이를 대신하여 직간접적으로 운영될 수 있다. 네트워크는 WiFi, 셀룰러, V2X 등과 같은 상 이한 타입의 무선 기술을 사용할 수 있다. 또한, 공정 장비 및 서버 또한 다른 장치들과 상기 네트워크를 통해 통신할 수 있다. 공정 장비는 지그로 장비 파라미터(EP)를 전송할 수 있고, 지그로부터 패널 식별자(PID) 및 최 적 장비 파라미터(OEP)를 수신할 수 있다. 공정 장비는 패널 식별자(PID) 및 최적 장비 파라미터(OEP)에 기초하여 패널에 대하여 공정을 수행할 수 있다. 실시 예들에 따라, 도 2에는 도시되어 있지 않으나, 공정 장비는 서버를 통해 지그와 통신할 수 있다. 즉, 공정 장비는 서버를 통해, 장비 파 라미터(EP)를 지그로 전송하고 지그로부터 최적 장비 파라미터(OEP)를 수신할 수 있다. 공정 장비는 컨트롤러 및 통신 회로를 포함할 수 있다. 컨트롤러는 공정 장비의 전반적인 작동을 제어할 수 있다. 실시 예들에 따라, 컨트롤러는 장비 파라미터(EP) 및 최적 장비 파라미터(OEP)를 입력받을 수 있고, 입력된 파라미터(EP 또는 OEP)에 기초하여 공정 장비를 제어할 수 있다.통신 회로는 지그 및 서버와 데이터를 주고받을 수 있다. 실시 예들에 따라, 통신 회로는 최적 장비 파라미터(OEP)를 수신하고, 최적 장비 파라미터(OEP)를 컨트롤러로 전송할 수 있다. 서버는 지그로 공정 이력 정보(PHI) 및 측정 정보(MI)를 전송할 수 있고, 지그로부터 패널 식별 자(PID)와 최적 장비 파라미터(OEP)를 수신할 수 있다. 공정 이력 정보(PHI) 및 측정 정보(MI)는 사전에 미리 DB에 저장되어 있을 수 있고, 서버는 DB 로부터 공정 이력 정보(PHI) 및 측정 정보(MI)를 리드할 수 있다. 서버는 수신된 패널 식별자(PID)와 최적 장비 파라미터(OEP)를 DB에 저장할 수 있다. 도 3은 본 발명의 실시 예들에 따른 최적화 시스템의 데이터 처리도를 나타낸다. 도 1 내지 도 3을 참조하면, 지그는 패널 또는 패널의 주변 환경을 측정하고, 측정 결과에 따라 상태 정보(SI)를 생성한다 (S310). 서버는 패널에 대한 공정 이력 정보(PHI) 및 측정 정보(MI)를 지그로 전송한다(S320). 실시 예 들에 따라, 서버는 사전에 지그로부터 전송된 패널 식별자(PID)를 이용하여, DB로부터 패널 식 별자(PID)에 해당하는 공정 이력 정보(PHI) 및 측정 정보(MI)를 리드하고, 리드된 공정 이력 정보(PHI) 및 측정 정보(MI)를 지그로 전송할 수 있다. 공정 장비는 장비 파라미터(EP)를 지그로 전송한다(S330). 실시 예들에 따라, 공정 장비는 현재 패널 이전의 패널에 대해 사용된 장비 파라미터(EP)(즉, 현재 설정된 장비 파라미터)를 지그로 전송 할 수 있다. 지그는 상태 정보(SI), 공정 이력 정보(PHI), 측정 정보(MI) 및 장비 파라미터(EP)에 기초하여 최적 장비 파라미터(OEP)를 도출한다(S340). 실시 예들에 따라, 지그는 상태 정보(SI), 공정 이력 정보(PHI), 측정 정보(MI) 및 장비 파라미터(EP)를 사전에 저장된 최적화 모델의 입력값으로 하여 최적 장비 파라미터(OEP)를 도 출할 수 있다. 즉, 본 발명의 실시 예들에 따른 지그는, 지그에 장착된 패널에 대한 정보들(SI, PHI, MI) 및 장비 파라미터(EP)를 이용하여, 최적화 모델에 따라 패널에 가장 적합한 최적 장비 파라미터(OEP)를 도출 하고, 도출된 최적 장비 파라미터(OEP)를 공정 장비로 전송할 수 있다. 지그는 도출된 최적 장비 파라미터(OEP)를 공정 장비로 전송한다(S350). 실시 예들에 따라, 지그 는 도출된 최적 장비 파라미터(OEP)와 패널 식별자(PID)를 공정 장비로 전송할 수 있다. 예컨대, 지 그는 최적 장비 파라미터(OEP)를 전송함과 동시에 공정 시작 명령을 공정 장비로 전송할 수 있다. 공정 장비는 최적 장비 파라미터(OEP)에 기초하여 패널에 대한 공정을 수행한다(S360). 실시 예들에 따라, 공정 장비는 기존에 설정된 장비 파라미터(EP)를 최적 장비 파라미터(OEP)로 변경하고, 변경된 최적 장비 파라미터(OEP)에 기초하여 공정을 수행할 수 있다. 공정 장비는 지그로부터 수신된 패널 식별자(PID)와 대응하는 최적 장비 파라미터(OEP)를 저장할 수 있다. 실시 예들에 따라, 공정 장비는 공정 라인에 패널이 위치할 때, 패널의 패널 식별자(PI D)를 이용하여 메모리(미도시)에 저장된 패널 식별자(PID)에 해당하는 최적 장비 파라미터(OEP)를 리드하고, 리 드된 최적 장비 파라미터(OEP)에 따라 패널에 대한 공정을 수행할 수 있다. 예컨대, 공정 장비는 태그(ta) 방식 또는 스캔(scan) 방식을 통해, 또는, 서버로부터 패널 식별자 (PID)를 수신할 수 있다. 공정 장비는 최적 파라미터(OEP)를 서버로 전송한다(S370). 실시 예들에 따라, 공정 장비는 최 적 파라미터(OEP)와 대응하는 패널 식별자(PID)를 서버로 전송할 수 있다. 한편, 서버는 지그로 부터도 최적 파라미터(OEP)와 대응하는 패널 식별자(PID)를 수신할 수 있다. 도 4는 본 발명의 실시 예들에 따른 지그의 공정 파라미터 최적화 과정을 설명하기 위한 도면이다. 도 1 내지 도 4를 참조하면, 앞에서 설명한 바와 같이, 지그는 메모리에 저장된 인공지능 기반 예측 모델(EM)에 따라 최적 장비 파라미터(OEP)를 도출할 수 있다. 이하, 이를 상세히 설명한다. 예측 모델(EM)은 인공지능 기반의 최적화 모델일 수 있다. 실시 예들에 따라, 예측 모델(EM)은 머신 러닝 (machine learning) 기반의 최적화 모델일 수 있다. 예컨대, 예측 모델(EM)은 인공 신경망 기반의 최적화 모델일 수 있다. 실시 예들에 따라, 예측 모델(EM)은 3가지 종류의 층들을 가질 수 있다. 예측 모델(EM)은 제1노드들(N1~N4)로 구성되는 입력층(IL), 제2노드들(N5~N13)로 구성되는 은닉층(HL) 및 제3노드들(N14~N15)로 구성되는 출력층(O L)을 포함할 수 있다. 도 4에 도시된 각 층들(IL, HL 및 OL)의 개수 및 각 층들(IL, HL 및 OL)에 포함되는 노 드들(N1~N15)의 개수는 도 4에 도시된 것에 한정되지 않는다. 이하 설명되는 예측 모델(EM)에 포함되는 층들은 물리적인 층들이 아니고 기능들, 또는 기능 별로 분류된 명령 어들의 세트로 이해될 수 있다. 입력층(IL)은 입력 데이터를 수신하고, 수신된 입력 데이터를 은닉층(HL)로 전달한다. 실시 예들에 따라, 입력 층(IL)은 상태 정보(SI), 공정 이력 정보(PHI), 측정 정보(MI) 및 장비 파라미터(EP)를 입력으로서 수신하고, 수신된 상태 정보(SI), 공정 이력 정보(PHI), 측정 정보(MI) 및 장비 파라미터(EP)를 은닉층(HL)로 전달할 수 있다. 은닉층(HL)은 상태 정보(SI), 공정 이력 정보(PHI), 측정 정보(MI) 및 장비 파라미터(EP)를 이용하여 연산을 수 행하고, 연산 결과(즉, 은닉 출력)를 출력층(OL)로 전달할 수 있다. 실시 예들에 따라, 은닉층(HL)의 각 노드들 (N5~N13)은 가중치 및 바이어스를 가질 수 있고, 은닉층(HL)은 가중치 및 바이어스 각각에 기초하여 상태 정보 (SI), 공정 이력 정보(PHI), 측정 정보(MI) 및 장비 파라미터(EP)를 입력으로 한 출력을 생성할 수 있다. 예컨 대, 은닉층(HL)의 가중치 및 바이어스는 주어진 상태 정보(SI), 공정 이력 정보(PHI), 측정 정보(MI) 및 장비 파라미터(EP) 각각의 우선 순위 및 중요도를 의미할 수 있다. 출력층(OL)은 은닉층(HL)으로부터 전달된 연산 결과를 이용하여, 최종적으로 패널에 대한 공정 장비 의 공정 결과 예측값(P)을 계산할 수 있다. 즉, 예측 모델(EM)은 주어진 상태 정보(SI), 공정 이력 정보(PHI), 측정 정보(MI) 및 장비 파라미터(EP)에 대하 여 공정 장비에 의한 공정이 수행되었을 때 패널에 대한 공정 장비의 공정 결과 예측값을 계산 할 수 있다. 따라서, 본 발명의 실시 예들에 따른 지그는 패널에 대한 공정이 수행되기 전이라도, 패 널의 특성(SI, PHI 및 MI) 및 공정 파라미터(EP)에 기초하여 패널이 해당 공정을 겪은 후의 결과를 예측할 수 있는 효과가 있다. 패널에 대한 공정 결과 예측값(P)이 계산된 후, 제어 회로는 공정 결과 예측값(P)에 기초하여 최적 장비 파라미터(OEP)를 도출할 수 있다. 실시 예들에 따라, 제어 회로는 패널에 대한 공정 결과 예측 값(P)이 기준 값 이상일 때의 입력값으로서 사용된 장비 파라미터를 최적의 장비 파라미터(OEP)로서 도출할 수 있다. 예컨대, 제어 회로는 가장 높은 공정 결과 예측값(P)을 야기한 장비 파라미터를 최적 장비 파라미터 (OEP)로서 도출할 수 있다. 예컨대, 제어 회로는 공정 결과 예측값(P)이 기준 값 이상이 될 때까지, 상태 정보(SI), 공정 이력 정보(PHI) 및 측정 정보(MI)를 변화시키지 않은 채 장비 파라미터(EP)만을 변경시키면서 예측 모델(EM)에 따라 공정 결과 예측값(P)을 반복적으로 계산할 수 있다. 한편, 장비 파라미터(EP)가 복수인 경우 복수의 장비 파라미터(EP) 중 적어도 하나를 변경할 수 있다. 공정 결과 예측값(P)이 기준 값 이상이거나 또는 최대값인 경우의 장비 파라미터는, 주어진 패널의 특성에 대하여 가장 좋은 공정 결과를 야기하는 최적 장비 파라미터(OEP)가 된다. 따라서, 본 발명의 실시 예들에 따른 지그는 패널별로 패널의 특성을 고려한 최적 장비 파라미 터(OEP)를 도출할 수 있다. 도 5는 본 발명의 실시예들에 따른 지그의 작동 방법을 나타내는 플로우 차트이다. 도 1 내지 도 5를 참조하면, 지그는 상태 정보(SI)를 생성한다(S510). 실시 예들에 따라, 지그는 패널의 주변 환경을 측정하 고, 측정 결과에 따라 상태 정보(SI)를 생성할 수 있다. 지그는 공정 이력 정보(PHI), 측정 정보(MI) 및 장비 파라미터(EP)를 수신한다(S520). 지그는 상태 정보(SI), 공정 이력 정보(PHI), 측정 정보(MI) 및 장비 파라미터(EP)를 이용하여, 패널(11 0)에 대한 공정 결과 예측값(P)을 계산한다(S530). 실시 예들에 따라, 지그는 인공지능 기반의 예측 모델 (EM)에 따라 공정 결과 예측값(P)을 계산할 수 있다. 지그는 예측된 공정 결과 예측값(P)이 기준 값 이상인지 여부를 판단한다(S540). 실시 예들에 따라, 상기 기준 값은 미리 설정된 값이거나, 패널 이전에 공정 장비에 의해 공정이 수행된 패널에 대한 공정 결과 예측값이거나, 또는, 패널이 공정 장비에 의한 공정 이전의 공정에서 계산된 공정 결과 예측값일 수 있다. 공정 결과 예측값(P)이 기준 값 이상일 때(S540의 Y), 지그는 이 때의 장비 파라미터(EP)를 최적 장비 파 라미터(OEP)로서 도출한다. 실시 예들에 따라, 지그는 공정 결과 예측값(P)이 기준 값 이상일 때의 장비 파라미터(EP)를 최적 장비 파라미터(OEP)로서 출력할 수 있다. 공정 결과 예측값(P)이 기준 값 미만일 때(S540의 N), 지그는 장비 파라미터(EP)를 변경할 수 있다(S560). 실시 예들에 따라, 지그는 이전의 변경 이력에 기초하여 장비 파라미터(EP)를 변경할 수 있다. 예컨대, 지 그는 이전에 도출되었던 최적 장비 파라미터들을 참조하여 장비 파라미터(EP)를 변경할 수 있다. 그 후, 지그는 변경된 장비 파라미터(EP), 상태 정보(SI), 공정 이력 정보(PHI) 및 측정 정보(MI)에 기초 하여 패널에 대한 공정 결과 예측값(P)을 다시 계산할 수 있다(S530). 즉, 지그는 공정 결과 예측값 (P)이 기준 값 이상일 때까지 장비 파라미터(EP)를 변경시켜가면서 공정 결과 예측값(P)을 반복적으로 계산(또 는 예측)할 수 있다. 도 6은 본 발명의 실시 예들에 따른 최적화 과정이 적용되지 않은 카메라 보상 공정을 나타낸다. 도 6을 참조하 면, 카메라 보상 장비에 의한 카메라 보상 공정이 도시되어 있다. 카메라 보상 공정이란, 패널을 카메라로 촬영하여 패널의 일부 영역에 존재하는 (또는 표시되는) 흠결(예컨대, 얼룩(mura))을 검출하고, 촬영된 영상 데이터를 이용하여 흠결을 보상하기 위한 보상 데이터를 생성하고, 생성 된 보상 데이터에 따른 보상 결과를 검사하는 공정을 의미한다. 카메라 보상 공정에 따르면, 카메라 보상 장비는 주어진 장비 파라미터(EP)에 따라 패널을 촬영할 수 있다. 실 시 예들에 따라, 카메라 보상 장비에 대한 장비 파라미터(EP)는 카메라와 패널 사이의 물리적인 거리, 카메라 렌즈의 조리개 개방 수준, 카메라 렌즈의 노출 시간, 카메라의 화이트 밸런스, 카메라 렌즈와 패널 사이의 초점 및 취득 이미지 해상도(예컨대, CCD 센서 개수 등)) 중 적어도 하나를 포함할 수 있다. 본 발명의 실시 예들에 따른 최적화 시스템이 적용되지 않은 경우, 카메라 보상 장비는 주어진 또는 미리 설정된 장비 파라미터(EP)에 따라 패널을 촬영하게 된다. 도 6에서 적용된 장비 파라미터(EP)는 패널 별로 존재 하는 것이 아니라, 공정 전반에 걸쳐 공통적으로 사용될 수 있다. 이후, 카메라 보상 장비는 보상 데이터를 생성하고 생성된 보상 데이터를 패널에 적용할 수 있다. 보상 데이터 적용 이후, 패널의 양품 및 불량품 여부를 검사하고, 검사 결과에 따라 패널이 양품인 경우에는 출하를 하고, 패널이 불량품인 경우에는 수리(repair) 후 재검사를 수행한다. 이 경우, 패널 마다 특성이 상이함에도 불구하고 하나의 장비 파라미터(EP)를 사용하기 때문에 패널 마다 공정 결과의 편차가 클 수 있을 뿐만 아니라, 카메라 검사 공정 전에는 패널에 대한 공정 결과를 예측할 수 없기에, 불량품으로 판정된 패널을 수리하고 재검사하는 데 많은 비용과 시간이 소모될 수 있다. 도 7은 본 발명의 실시예들에 따른 최적화 과정이 적용된 카메라 보상 공정을 나타낸다. 즉, 도 7은, 도 1에서 의 공정 장비가 카메라 보상 공정을 위한 공정 장비인 경우를 나타낸다. 도 1 내지 도 7을 참조하면, 본 발명의 실시 예들에 따른 지그는 공정 장비의 장비 파라미터(EP) 뿐 만 아니라 패널에 대한 상태 정보(SI), 공정 이력 정보(PHI) 및 측정 정보(MI)를 이용하여 예측 모델(EM) 에 따라 패널에 대한 공정 결과를 예측할 수 있고, 예측 결과에 따라 장비 파라미터(EP)를 최적화하여 최 적 장비 파라미터(OEP)를 도출할 수 있다. 이에 따라, 공정 장비는 전송된 최적 장비 파라미터(OEP)에 기초하여 공정 장비를 설정하고 패널 을 촬영한다. 즉, 도 6에 도시된 바와 달리, 공정 장비는 패널 별로 최적화된(즉, 공정 결과가 좋은) 최적 장비 파라미터(OEP)에 따라 패널을 촬영한다. 이후, 공정 장비는 보상 데이터를 생성하고 생성된 보상 데이터를 패널에 적용할 수 있다. 한편, 도 7의 경우, 사전에 최적 장비 파라미터(OEP)를 설정하여 패널에 대한 촬영 및 보상을 수행하였으므로, 패널 에 대한 공정 결과가 좋을 확률이 높다. 이에 따라, 패널의 양품 및 불량품 여부를 검사하지 않을 수 있고, 설사 검사하더라도 불량품으로 판정되는 패널의 개수가 매우 적을 수 있다. 즉, 본 발명의 실시 예들에 따른 최적화 과정이 적용된 카메라 보상 공정의 경우, 패널 각각의 특성이 고려된 최적 장비 파라미터(OEP)를 사용하므로 패널에 대한 공정 결과가 양호할 가능성이 높아, 공정 이후, 패널의 양품 및 불량품 여부를 검사, 패널 수리 및 패널 재검사에 소요되는 비용과 시간이 절약될 수 있는 효과가 있다. 본 발명의 실시 예들에 따른 지그 또는 최적화 시스템의 작동은 컴퓨터로 판독 가능한 저장 매체에 저 장되어 프로세서에 의해 실행될 수 있는 명령어들로 구현될 수 있다. 즉, 명령어들은, 프로세서로 하여금 패널 의 특성과 장비 파라미터(EP)를 이용하여 패널에 대한 공정 결과 예측값(P)을 계산하고, 최적 장비 파라미터(OEP)를 도출하기 위한 방법을 수행하도록 지시할 수 있다. 저장 매체는, 직접 및/또는 간접적이든, 원시 상태, 포맷화된 상태, 조직화된 상태 또는 임의의 다른 액세스 가 능한 상태이든 관계없이, 관계형 데이터베이스, 비관계형 데이터베이스, 인-메모리(in-memory) 데이터베이스, 또는 데이터를 저장할 수 있고 저장 제어기를 통해 이러한 데이터에 대한 액세스를 허용할 수 있는 다른 적절한 데이터베이스와 같이 분산형을 포함하는 데이터베이스를 포함할 수 있다. 또한, 저장 매체는, 1차 저장 장치 (storage), 2차 저장 장치, 3차 저장 장치, 오프라인 저장 장치, 휘발성 저장 장치, 비휘발성 저장 장치, 반도 체 저장 장치, 자기 저장 장치, 광학 저장 장치, 플래시 저장 장치, 하드 디스크 드라이브 저장 장치, 플로피 디스크 드라이브, 자기 테이프, 또는 다른 적절한 데이터 저장 매체와 같은 임의의 타입의 저장 장치를 포함할 수 있다. 본 명세서에서, 명령어는 어셈블러 명령어, 명령어 세트 아키텍처(instruction-set-architecture, ISA) 명령어, 머신 명령어, 머신 의존 명령어, 마이크로 코드, 펌웨어 명령어, 상태 설정 데이터, 또는 Smalltalk, C ++ 등과 같은 객체 지향 프로그래밍 언어 및 \"C\" 프로그래밍 언어 또는 유사한 프로그래밍 언어와 같은 종래의 절차적 프로그래밍 언어를 포함하는 하나 이상의 프로그래밍 언어의 임의의 조합으로 작성된 소스 코드 또는 객 체 코드 중 어느 하나일 수 있다. 본 발명은 도면에 도시된 실시 예를 참고로 설명되었으나 이는 예시적인 것에 불과하며, 본 기술 분야의 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시 예가 가능하다는 점을 이해할 것이다. 따라서, 본 발명의 진정한 기술적 보호 범위는 첨부된 등록청구범위의 기술적 사상에 의해 정해져야 할 것이다."}
{"patent_id": "10-2018-0165209", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 예들에 따른 최적 장비 파라미터를 도출하기 위한 장비 파라미터 최적화 시스템을 나타 낸다. 도 2는 본 발명의 실시 예들에 따른 최적화 시스템을 세부적으로 나타낸다. 도 3은 본 발명의 실시 예들에 따른 최적화 시스템의 데이터 처리도를 나타낸다. 도 4는 본 발명의 실시 예들에 따른 지그의 공정 파라미터 최적화 과정을 설명하기 위한 도면이다. 도 5는 본 발명의 실시예들에 따른 지그의 작동 방법을 나타내는 플로우 차트이다. 도 6은 본 발명의 실시 예들에 따른 최적화 과정이 적용되지 않은 카메라 보상 공정을 나타낸다. 도 7은 본 발명의 실시예들에 따른 최적화 과정이 적용된 카메라 보상 공정을 나타낸다."}
