{"patent_id": "10-2022-7040921", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0009401", "출원번호": "10-2022-7040921", "발명의 명칭": "트랙에서 열리는 모터 스포츠 이벤트를 나타내는 대화형 하이브리드 환경을 제어하는 시스템", "출원인": "아이 알 키네틱스 리미티드", "발명자": "가드너, 데이비드"}}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "트랙에서 열리는 모터 스포츠 이벤트를 나타내는 대화형 하이브리드 환경을 제어하는, 컴퓨터로 구현되는 방법에 있어서, 상기 대화형 하이브리드 환경은 트랙 상의 실제 및 가상 차량들의 표현들을 포함하고, 상기 방법은,실제 센서 데이터의 스트림을 수신하는 단계, 상기 실제 센서 데이터는 a. 트랙 상의 실제 차량의 실제 운동학적 데이터, 상기 실제 운동학적 데이터는 트랙에 있는 적외선 센서들에의해 캡쳐되고, 및b. 운전자에 의한 실제 차량의 제어에 관한 실제 제어 데이터를 포함하고, 상기 실제 제어 데이터는 차량 센서들에 의해 캡쳐되고 실제 차량으로부터의 원격측정 시스템들을 통해 획득되고; 상기 실제 운동학적 데이터를 이용하여 상기 대화형 하이브리드 환경 내의 실제 차량의 표현의 위치 및 운동학적 행위를 결정하는 단계; 상기 실제 제어 데이터에 기초하여 트랙 상의 실제 차량의 위치의 블랙 박스 결정을 생성하기 위해 상기 실제제어 데이터 및 상기 실제 운동학적 데이터를 이용하는 단계; 상기 대화형 하이브리드 환경을 사용자에게 보여주고 또한 가상 차량의 표현의 운동학적 행위를 제어하기 위해사용자 입력들을 캡쳐하는 컴퓨터와 사용자 상호작용에 의해 획득되는 컴퓨터-생성 제어 데이터의 스트림을 수신하는 단계; 및 상기 블랙 박스 결정 및 상기 컴퓨터-생성 제어 데이터를 이용함으로써 상기 대화형 하이브리드 환경 내에서 가상 차량의 표현의 위치 및 운동학적 행위를 결정하는 단계를 포함하는, 컴퓨터로 구현되는 방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 실제 센서 데이터는 트랙 상의 복수의 실제 차량들의 실제 운동학적 데이터 및 각각의운전자에 의한 복수의 실제 차량들 각각의 제어에 관한 실제 제어 데이터를 포함하는, 컴퓨터로 구현되는 방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서, 복수의 실제 차량들 중 각각의 실제 차량의 실제 센서 데이터는 차량 식별자를 포함하는, 컴퓨터로 구현되는 방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2 항 또는 제 3 항에 있어서, 상기 컴퓨터-생성 제어 데이터의 스트림은 컴퓨터-생성 데이터의 복수의 스트림들을 포함하고, 각각의 스트림은 개별 사용자 입력들의 캡쳐 및 개별 컴퓨터와의 서로 다른 사용자 상호작용에 의해 생성되는, 컴퓨터로 구현되는 방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서, 상기 컴퓨터-생성 데이터의 복수의 스트림들 각각의 컴퓨터-생성 제어 데이터의 스트림은 컴퓨터 장치 식별자를 포함하는, 컴퓨터로 구현되는 방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 2 항 내지 제 4 항 중 어느 한 항에 있어서, 상기 복수의 실제 차량들은 상기 컴퓨터-생성 데이터 스트림들의 복수의 스트림들보다 적고, 상기 방법은 연결된 표현을 생성하기 위해 가상 차량들의 복수의 표현들의 서브셋을 하나의 실제 차량의 표현과 연결하는 단계를 더 포함하는, 컴퓨터로 구현되는 방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2023-0009401-3-제 6 항에 있어서, 상기 서브셋의 가상 차량의 위치가 실제 차량의 오차 한계 내에 있을 동안 상기 대화형 하이브리드 환경 내의 가상 차량들의 복수의 표현들의 서브셋을 표현하기 위해 상기 연결된 표현을 이용하는 단계를더 포함하는, 컴퓨터로 구현되는 방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6 항 또는 제 7 항에 있어서, 컴퓨터-생성 데이터의 복수의 스트림들은 복수의 실제 차량들의 복수 배이고상기 연결하는 단계는 상기 복수의 컴퓨터-생성 데이터 각각을 실제 차량들의 복수의 표현들에 고른 분포로 연결하는 단계를 포함하는, 컴퓨터로 구현되는 방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 6 항 또는 제 7 항에 있어서, 상기 컴퓨터-생성 데이터의 복수의 스트림들은 복수의 실제 차량들의 복수 배이고 상기 연결하는 단계는 상기 복수의 컴퓨터-생성 데이터 각각을 실제 차량들의 복수의 표현들에 로그 분포로 연결하는 단계를 포함하는, 컴퓨터로 구현되는 방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항 내지 제 9 항 중 어느 한 항에 있어서, 수신된 실제 센서 데이터 및 컴퓨터-생성 데이터에 의해 결정된대로 상기 실제 및 가상 차량들의 표현들의 새로운 위치들로 상기 대화형 하이브리드 환경을 갱신하는 단계; 상기 갱신된 대화형 하이브리드 환경을 생성하는 단계; 및상기 갱신된 대화형 하이브리드 환경을 중앙 서버로부터 복수의 원격으로 위치된 컴퓨터들로 방송하는 단계를더 포함하는, 컴퓨터로 구현되는 방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1 항 내지 제 9 항 중 어느 한 항에 있어서, 상기 블랙 박스 결정 및 상기 실제 센서 데이터를 중앙 서버로부터 복수의 원격으로 위치된 컴퓨터들로 방송하는 단계; 각각의 원격으로 위치되는 컴퓨터에서 상기 대화형 하이브리드 환경을 생성하는 단계; 수신된 실제 센서 데이터 및 컴퓨터-생성 데이터에 의해 결정된 대로 상기 실제 및 가상 차량들의 표현들의 새로운 위치들로 상기 대화형 하이브리드 환경을 갱신하는 단계; 및 가상 차량들의 표현들의 새로운 위치들을 상기 중앙 서버로 전송하는 단계를 더 포함하는, 컴퓨터로 구현되는방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1 항 내지 제 11 항 중 어느 한 항에 있어서, 상기 블랙 박스 결정을 참조하는, 인공지능 엔진을 이용해 상기 컴퓨터-생성 제어 데이터와 상기 가상 차량의 결과 위치 사이의 연관성을 변경하는 단계를 더 포함하는, 컴퓨터로 구현되는 방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 1 항 내지 제 12 항 중 어느 한 항에 있어서, 수신된 실제 운동학적 데이터는 상기 트랙에 대한 길이방향 위치 데이터, 상기 트랙에 대한 측면 위치 데이터 및 상기 트랙에 대한 차량 방향 데이터를 포함하는, 컴퓨터로구현되는 방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 1 항 내지 제 13 항 중 어느 한 항에 있어서, 상기 실제 제어 데이터는 실제 차량의 운전대 위치, 가속기 위치, 제동 페달 위치 및 기어 선택 중 하나 또는 그 이상을 포함하는, 컴퓨터로 구현되는 방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 1 항 내지 제 14 항 중 어느 한 항에 있어서, 실제 센서 데이터가 생성되었을 때 실제 센서 데이터의 복사본공개특허 10-2023-0009401-4-을 저장하고 있는 데이터 저장소로부터 상기 실제 센서 데이터를 검색하는 단계를 더 포함하는, 컴퓨터로 구현되는 방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 1 항 내지 제 14 항 중 어느 한 항에 있어서, 상기 수신하는 단계는 스포츠 이벤트가 발생하고 있을 때 실질적으로 실시간으로 상기 실제 센서 데이터를 수신하는 단계를 포함하는, 컴퓨터로 구현되는 방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 1 항 내지 제 16 항 중 어느 한 항에 있어서, 상기 실제 센서 데이터의 스트림은 적어도 25 Hz의 샘플링 속도를 가지고 또한 한 시점에서 실제 차량의 위치가 캡쳐되어 캡쳐된 40 밀리초 이내에 상기 대화형 하이브리드환경으로 제공되는, 컴퓨터로 구현되는 방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 1 항 내지 제 16 항 중 어느 한 항에 있어서, 상기 실제 센서 데이터의 스트림은 적어도 60 Hz의 샘플링 속도를 가지고 또한 한 시점에서 실제 차량의 위치가 캡쳐되어 캡쳐된 16.7 밀리초 이내에 상기 대화형 하이브리드 환경으로 제공되는, 컴퓨터로 구현되는 방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 1 항 내지 제 18 항 중 어느 한 항에 있어서, 상기 대화형 하이브리드 환경을 생성하기 위해 저장된 데이터모델들을 이용하는 단계를 더 포함하는, 컴퓨터로 구현되는 방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 1 항 내지 제 19 항 중 어느 한 항에 있어서, 상기 실제 차량으로부터 비디오 데이터의 스트림을 수신하고또한 상기 대화형 하이브리드 환경에 상기 비디오 데이터의 스트림을 포함시키는 단계를 더 포함하는, 컴퓨터로구현되는 방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 1 항 내지 제 20 항 중 어느 한 항에 있어서, 상기 실제 차량으로부터 오디오 데이터의 스트림을 수신하고또한 상기 대화형 하이브리드 환경에 상기 오디오 데이터의 스트림을 포함시키는 단계를 더 포함하는, 컴퓨터로구현되는 방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제 2 항 또는 제 3 항 내지 제 21 항 중 어느 한 항에 있어서, 상기 가상 차량의 표현의 위치가 상기 실제 차량의 표현의 위치의 미리 정해진 임계치 이내에 있을 때 한 시점에서 상기 복수의 가상 차량들 중 하나의 가상 차량의 표현을 상기 복수의 실제 차량들 중 하나의 실제 차량의표현에 연결하고 또한 상기 대화형 하이브리드 환경 내의 가상 차량의 표현으로서 상기 실제 차량의 표현을 이용하는 단계를 더 포함하는, 컴퓨터로 구현되는 방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제 22 항에 있어서, 상기 연결하는 단계는 수신된 상기 실제 차량으로부터의 오디오 또는 비디오 데이터의 스트림을 사용자에게 상기 대화형 하이브리드 환경을 보여주는 상기 컴퓨터로 제공하는 것을 활성화시키는, 컴퓨터로 구현되는 방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제 22 항 또는 제 23 항에 있어서, 상기 가상 차량의 표현의 위치가 상기 실제 차량의 표현의 위치의 미리 정해진 임계치 외부에 있을 때 한 시점에서 상기 복수의 가상 차량들 중 하나의 가상 차량의 표현을 상기 복수의 실제 차량들 중 하나의 실제 차량의 표현에 연결해제하고 또한 상기 가상 차량의 표현을 상기 대화형 하이브리드환경 내의 실제 차량의 표현과 별개로 보여주는 단계를 더 포함하는, 컴퓨터로 구현되는 방법. 공개특허 10-2023-0009401-5-청구항 25 제 22 항 내지 제 24 항 중 어느 한 항에 있어서, 상기 실제 차량의 표현에 연결된 가상 차량의 세부사항들을원격으로 위치되는 제3 자 컴퓨터에 제공하는 단계를 더 포함하는, 컴퓨터로 구현되는 방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제 2 항 또는 제 3 항 내지 제 25 항 중 어느 한 항에 있어서, 각각의 실제 차량은 성능 특성들의 집합을 가지고 상기 방법은 상기 가상 차량의 표현에 상기 복수의 실제 차량들 중 최근접하게 위치되는 실제 차량의 표현을결정하고 또한 상기 최근접하게 위치되는 실제 차량의 표현의 성능 특성들의 집합을 상기 가상 차량의 성능 특성들로서 채택하는 단계를 더 포함하는, 컴퓨터로 구현되는 방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제 1 항 내지 제 26 항에 있어서, 상기 적외선 센서들을 이용해 트랙 상의 실제 차량의 위치 데이터를 캡쳐하는단계, 시간에 따른 상기 위치 데이터를 실제 운동학적 데이터의 스트림으로 변환하는 단계 및 이를 실시간으로중앙 서버로 전송하는 단계를 더 포함하는, 컴퓨터로 구현되는 방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제 27 항에 있어서, 상기 캡쳐하는 단계는 상기 트랙의 서로 다른 부분들을 모니터링하는 센서들의 그룹들을 이용해 위치 데이터를 캡쳐하는 단계를 포함하고, 센서들의 각 그룹 내의 각 센서는 센서의 시야(FOV) 내에서 상기 트랙 상에서 작동하는 하나 또는 그 이상의 차량들로부터 방출, 반사 또는 전송되는 적외선을 검출하는, 컴퓨터로 구현되는 방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제 28 항에 있어서, 상기 트랙 상의 하나 또는 그 이상의 실제 차량들의 운동학적 데이터를 결정하기 위해 상기적외선 센서에 의해 검출되는 적외선을 처리하는 단계를 더 포함하는, 컴퓨터로 구현되는 방법."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "트랙에서 열리는 모터 스포츠 이벤트를 나타내는 대화형 하이브리드 환경을 제어하는 컴퓨터 시스템에 있어서,상기 대화형 하이브리드 환경은 트랙 상의 실제 및 가상 차량들의 표현들을 포함하고, 상기 시스템은,실제 센서 데이터의 스트림을 수신하는 수신기, 상기 실제 센서 데이터는 트랙 상의 실제 차량의 실제 운동학적 데이터 및 운전자에 의한 실제 차량의 제어에 관한 실제 제어 데이터를 포함하고, 상기 실제 운동학적 데이터는 트랙에 있는 적외선 센서들에 의해 캡쳐되고 또한 상기 실제 제어 데이터는 차량 센서들에 의해 캡쳐되고실제 차량으로부터의 원격측정 시스템들을 통해 획득되고; 사용자에게 상기 대화형 하이브리드 환경을 보여주고 상기 가상 차량의 표현의 운동학적 행위를 제어하기 위해사용자 입력들을 캡쳐하는 컴퓨터와 사용자 상호작용에 의해 획득되는 컴퓨터-생성 제어 데이터의 스트림을 수신하도록 구성된 가상 레이스 명령 프로세서; 및 가상 레이스 시뮬레이션 엔진을 포함하고, 상기 가상 레이스 시뮬레이션 엔진은, 상기 실제 운동학적 데이터를 이용해 상기 대화형 하이브리드 환경 내에서 상기 실제 차량의 표현의 위치 및 운동학적 행위를 결정하기 위한 레이스 시뮬레이션 출력 엔진; 상기 실제 제어 데이터에 기초하여 트랙 상의 실제 차량의 위치의 블랙 박스 결정을 생성하기 위해 상기 실제제어 데이터 및 상기 실제 운동학적 데이터를 이용하도록 구성된 기준 블랙 박스 모델 생성기; 및 상기 블랙 박스 결정 및 상기 컴퓨터-생성 제어 데이터를 이용해 상기 대화형 하이브리드 환경 내에서 상기 가상 차량의 표현의 위치 및 운동학적 행위를 결정하도록 구성된 게이밍 블랙 박스 구현 엔진을 포함하는, 컴퓨터시스템."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "제 30 항에 있어서, 상기 가상 차량의 최종 위치 사이의 상관도가 변하도록 구성되는 인공 지능 엔진을 더 포함공개특허 10-2023-0009401-6-하는, 컴퓨터 시스템."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "제 31 항에 있어서, 상기 가상 차량의 주어진 위치를 생성하기 위해 상기 인공지능 엔진은 수신된 컴퓨터-생성제어 데이터에 필요한 임계치들을 넓히도록 구성되는, 컴퓨터 시스템."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_33", "content": "중앙 서버로 제정 영역 상에서 작동하는 하나 또는 그 이상의 이동 개체들의 위치 데이터를 제공하는 센싱 시스템에 있어서, 상기 센싱 시스템은 복수의 센서 그룹들을 포함하고, 상기 센서 그룹들 각각은 상기 제정 영역의일 부분을 모니터링하도록 구성되고, 상기 센서 그룹들 각각은 상기 제정 영역 주변에 위치되는 복수의 위치 센싱 장치들을 포함하고, 상기 위치 센싱 장치들 각각은 승강된위치로부터 상기 제정 영역의 서로 다른 부분을 모니터링하도록 구성되고, 상기 위치 센싱 장치들 각각은 FOV 내에서 상기 제정 영역 상에서 작동하는 하나 또는 그 이상의 이동 개체들로부터 방출, 반사 또는 전송되는적외선을 검출하기 위한 FOV를 갖고 센서 출력을 생성하는 적외선 센서; 상기 적외선 센서의 센서 출력, 또는 이로부터 도출된 정보를, 그 센서 그룹을 위한 통신 노드로서 행동하는 그센서 그룹의 복수의 위치 센싱 장치들 중 하나로 전송하도록 구성된 전송기; 및센서 그룹 내에서 통신 노드로서 행동하는 위치 센싱 장치에 통신가능하게 결합되는 통신 장비를 포함하고, 상기 통신 장비는 중앙 수집 서버로 상기 센서 그룹의 각 적외선 센서의, 상기 센서 출력, 또는 이로부터 도출된정보를 전송하도록 구성되는, 센싱 시스템."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_34", "content": "제 33 항에 있어서, 상기 센서 그룹들 각각은 10 또는 그 이하의 위치 센싱 장치들을 포함하는, 센싱 시스템."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_35", "content": "제 33 항 또는 제 34 항에 있어서, 상기 센서 그룹의 상기 위치 센싱 장치들 중 적어도 하나는 상기 센서 출력,또는 이로부터 도출된 정보에 기초하여, 적어도 2차원으로, 상기 FOV 내에서 상기 제정 영역 상에서 작동하는하나 또는 그 이상의 이동 개체들의 현재 운동학적 데이터를 결정하도록 구성된 프로세서를 포함하는, 센싱 시스템."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_36", "content": "제 33 항 내지 제 35 항 중 어느 한 항에 있어서, 상기 복수의 센서 그룹들 중 제1 센서 그룹은 상기 복수의 센서 그룹들 중 제2 센서 그룹으로 상기 제1 센서 그룹에 의해 결정된, 상기 센서 출력, 또는 이로부터 도출된 정보를 릴레이하도록 구성되는, 센싱 시스템."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_37", "content": "제 33 항 내지 제 36 항 중 어느 한 항에 있어서, 상기 복수의 센싱 장치들 중 하나 또는 그 이상은 상기 제정영역 상에서 하나 또는 그 이상의 실제 이동 개체들에 의해 방출되는 열적외선을 검출하도록 구성된 LWIR(LongWave Infra-Red) 마이크로볼로미터 또는 MWIR(Medium Wave Infra-Red) 광자 감지 카메라를 포함하는, 센싱 시스템."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_38", "content": "제 33 항 내지 제 37 항 중 어느 한 항에 있어서, 상기 복수의 센싱 장치들 중 하나 또는 그 이상은 이동 개체로부터 방출 또는 반사 또는 전송되는 광대역 또는 협대역 광을 검출하기 위해 SWIR(Short Wave Infra-Red) 또는 NIR(Near Infra-Red) 광자 감지 카메라를 포함하는, 센싱 시스템."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_39", "content": "제 33 항 내지 제 38 항 중 어느 한 항에 있어서, 상기 복수의 위치 센싱 장치들 중 하나 또는 그 이상은 적어도 60 Hz의 프레임 속도를 가지는, 센싱 시스템. 공개특허 10-2023-0009401-7-청구항 40 제 33 항 내지 제 39 항 중 어느 한 항에 있어서, 상기 복수의 위치 센싱 장치들 중 하나 또는 그 이상은 제정영역의 일 부분을 향하는 LED 투광등을 포함하고 또한 상기 LED 투광등으로부터 나오는 반사광을 검출하도록 구성되는, 센싱 시스템."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_41", "content": "제 33 항 내지 제 40 항 중 어느 한 항에 있어서, 상기 복수의 위치 센싱 장치들 중 하나 또는 그 이상은 변조된 적외선 광을 구성하는 상기 이동 개체의 적외선 서명을 검출하도록 구성되는, 센싱 시스템."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_42", "content": "제 41 항에 있어서, 상기 복수의 위치 센싱 장치들 중 하나 또는 그 이상은 상기 적외선 서명에 기초하여 상기이동 개체의 고유한 식별자를 검출하도록 구성되는, 센싱 시스템."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_43", "content": "제 33 항 내지 제 42 항 중 어느 한 항에 있어서, 상기 복수의 위치 센싱 장치들 중 하나 또는 그 이상은 상기제정 영역의 엣지들에서 반사 또는 방출되는 적외선을 검출하도록 구성되고 상기 시스템은 상기 이동 개체의 측면 위치를 결정하기 위해 기준 프레임으로서 검출된 정보를 이용하도록 구성되는, 센싱 시스템."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_44", "content": "제 33 항 내지 제 43 항 중 어느 한 항에 있어서, 상기 위치 센싱 장치들 중 적어도 일부는 수평 평면과 예각인그 시야(FOV)의 보어사이트를 가지도록 배치되고 또한 상기 제정 영역을 통해 진행할 때 사용중인 다가오는 이동 개체들에 직면하는, 센싱 시스템."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_45", "content": "제 33 항 내지 제 44 항 중 어느 한 항에 있어서, 상기 복수의 위치 센싱 장치들 중 적어도 일부는 검출 범위는50 미터까지이고 20 내지 30도의 FOV를 포함하는, 센싱 시스템."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_46", "content": "제 33 항 내지 제45 항 중 어느 한 항에 있어서, 상기 복수의 위치 센싱 장치들 중 적어도 일부는 검출 범위는15 미터까지이고 70도의 FOV를 포함하는, 센싱 시스템."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_47", "content": "제 33 항 내지 제 46 항 중 어느 한 항에 있어서, GPS 수신기를 더 포함하고, 상기 GPS 수신기는 상기 센서 출력, 또는 이로부터 도출되는 정보를 위한 타임 스탬프를 제공하고, 상기 시스템은 상기 위치 센싱 장치들 중 적어도 일부로부터의 센서 출력 또는 이로부터 도출되는 정보를 위한 공통 시간 기준을 설립하기 위해 상기 타임스탬프를 이용하도록 구성되는, 센싱 시스템."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_48", "content": "제 33 항 내지 제 47 항 중 어느 한 항에 있어서, 상기 통신 장비는 상기 중앙 서버로 상기 제정 영역 상에서작동하는 하나 또는 그 이상의 이동 개체들의, 상기 센서 출력 또는 이로부터 도출되는 정보를 제공하기 위해최소 25 Hz 리프레쉬 속도에서 작동하도록 구성되는, 센싱 시스템."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_49", "content": "제 33 항 내지 제 47 항 중 어느 한 항에 있어서, 상기 통신 장비는 상기 중앙 서버로 상기 제정 영역 상에서작동하는 하나 또는 그 이상의 이동 개체들의, 상기 센서 출력 또는 이로부터 도출되는 정보를 제공하기 위해최소 60 Hz 리프레쉬 속도에서 작동하도록 구성되는, 센싱 시스템."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_50", "content": "제 33 항 내지 제 48 항 중 어느 한 항에 있어서, 상기 시스템은 상기 제정 영역을 따른 길이방향 위치, 상기공개특허 10-2023-0009401-8-제정 영역을 가로지르는 측면 위치 및 상기 이동 개체의 회전 방향을 결정하도록 구성되는, 센싱 시스템."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_51", "content": "제 33 항 내지 제 50 항 중 어느 한 항에 있어서, 상기 센서 그룹의 복수의 위치 센싱 장치들은 순서대로 배치되고 상기 순서의 중간점에 있는 위치 센싱 장치는 상기 센서 그룹의 통신 노드로서 행동하는, 센싱 시스템."}
{"patent_id": "10-2022-7040921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_52", "content": "제 33 항 내지 제 51 항 중 어느 한 항에 있어서, 상기 이동 개체들은 차량들을 포함하고 상기 제정 영역은 트랙을 포함하는, 센싱 시스템."}
{"patent_id": "10-2022-7040921", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "트랙에서 열리는 모터 스포츠 이벤트를 나타내는 대화형 하이브리드 환경을 제어하는, 컴퓨터로 구현되는 방법이 기술된다. 상기 대화형 하이브리드 환경은 트랙 상의 실제 및 가상 차량들의 표현들을 포함한다. 상기 방법은 실 제 센서 데이터의 스트림을 수신하는 단계, 상기 실제 센서 데이터는 트랙 상의 실제 차량의 실제 운동학적 데이 (뒷면에 계속)"}
{"patent_id": "10-2022-7040921", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 트랙에서 열리는 모터 스포츠 이벤트를 나타내는 대화형 하이브리드 환경을 제어하는 시스템들 및 방 법들에 관한 것이다. 보다 상세하게는, 배타적이지는 않지만, 본 발명은 원격으로 위치되는 게이밍 컴퓨터들 및 가능한 다른 오락 장치들을 이용해 실제 모터 스포츠 이벤트들에 대규모 참여를 위한 방법들 및 시스템들에 관 한 것이다. 본 발명은 또한 보다 더 인터랙티브한 방식으로 원격으로 위치되는 게이머들이 모터 스포츠 이벤트 에의 실제 참여자들과 경쟁할 수 있는 게이밍 또는 시청 경험의 새로운 형식을 제공하기 위해 실시간 라이브 모 터 스포츠 이벤트들로부터의 매우 정밀한 실시간 차량 추적 및 차량 제어 데이터의 캡쳐 및 라이브 방송 및 그 데이터의 사용으로 확장된다. 정밀한 운동학적 데이터의 캡쳐는 축구, 야구, 사이클링 및 스키와 같은, 다른 종 류들의 실내 및 야외 스포츠 이벤트들의 범위에서 대규모 참여에 이 시스템들 및 방법들의 적용을 가능하게 해 준다."}
{"patent_id": "10-2022-7040921", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "모터 스포츠 이벤트들의 플레이어-제어 가상 표현들을 위한 실감 시스템들 및 방법들을 제공하기 위해 다양한 접근법들이 사용되어 왔다. 이러한 접근법들 대부분은 실제와 유사한 외관을 제공하기 위해 시도하는 사용자 액 츄에이터 입력들에 응답하여 가상 차량들의 운동학적 행위를 결정하는 복잡한 모델들을 이용하는, 철저한 가상 이다. 이러한 사실주의는 종종 레이스 중 차량들의 움직임을 기록함으로써 획득되는 실제 운동학적 데이터를 이 용해 모델들을 구축하는 것에 의해 제공된다. 하지만, 이러한 모델들은 구축하기 복잡하고 어려울 뿐만 아니라, 종종 부정확한 운동학적 데이터에 기초한다. 또한, 이러한 종래 기술의 접근법들은 종종 한 명 또는 서너 명의 플레이어들에 관한 것이고 이것은 다른 플레이어들과의 상호작용의 범위가 매우 한정됨을 의미한다. 이 모두는 확장불가하고 비현실적인 시뮬레이션 및 게이밍 경험들로 귀결된다. 실제 라이브 레이스와 상호작용하기 위해 플레이어-제어 시뮬레이션들을 위한 시스템들 및 방법들을 정의하고자 시도하는 알려진 어떠한 종래 기술도 컴퓨터 게임 플레이어에게 만족스럽고 도전적임을 입증하고 이스포츠 토너 먼트들의 대규모 경쟁을 지원하며 또한 게임을 하지 않는 추종자들에게 라이브 모터 스포츠 이벤트에 대한 몰입 도와 즐거움을 향상시키기 위해 원하는 기능들을 제공하는 방식으로 실제 운전자들, 차들, 레이스 팀들, 트랙, 오프-트랙 및 이벤트 환경들과 동시에 다수의 플레이어들 및 추종자들의 대규모 참여를 위한 실용적인 방법들을 제공하는 데까지 확장되지 않는다. 이 목적들 중 어느 하나를 달성하면 예를 들어 전통적인 텔레비젼 시청자 또 는 운전자 개인 팬에서 모터 레이스 컴퓨터 게임 팬들의 핵심을 통해 '최고' 레이스 및 기술 데이터 서비스들의 소비자들까지 확장되는 팬 기반으로 모터 레이싱을 위한 매력을 확장시키고 강화시킬 것이다. 본 발명자들은 다른 응용들 중에서도, 실제 라이브 전동차 레이스(예. 포뮬러 1)에서 정확하게 차량들을 추적하 고, 수동적으로 그리고 극강의 날씨 상황들을 제외한 모든 상황들에서, 컴퓨터 게이머들에게 이 차량들 중 하나 를 가상의 차량으로 교체할 수 있는 능력을 부여하고 또한, 사실상, 라이브 레이스에서 경쟁하는 시스템들, 방 법들 및 기술을 개시하는 선행 특허 GB2518602B를 저술하였다. GB2518602B에 의해 제공되는 데이터는 레이싱 써 킷 상의 상당한 고도(1-2km)에 위치되는 하나의 IR 추적 센서, 예를 들어 헬리콥터, 드론, 또는 공기보다 가벼 운 차량(lighter-than-air vehicle)에 의해 비침습적으로 감지된 트랙 상의 전동차들의 위치 정보와 관련 있다. 이것은 전체 제정 영역(enactment area)을 포괄하는 하나의 센서의 시야(FOV)에 의존한다. 포뮬러 1을 예를 들 면, 이 접근법은 FOV가 초목(위로 튀어나온 나무), 관람석 또는, 도시 레이싱 써킷의 경우에 있어서 모든 종류의 건물들 및 기타 구조물들에 의해 방해받을 때에는 비실용적이다. 따라서, 이 종래 기술의 접근법은 실제 적 용에 있어서 한계들을 가진다. 플레이어-제어 가상 차량이 라이브 이벤트로부터 전통적인 컴퓨터 레이싱 게임으로 스트리밍되는 데이터를 통해 제한적이고 다소 인위적인 방식으로 실제 차량들의 표현들과 상호작용하기 위한 인-게임 방법들을 개시하는 라 이브 이벤트들과 상호작용하는 비디오 게임들은, 알려져 있고 예를 들어 US 2010/0271367을 참고한다. 가상 차 량의 성능은 플레이어의 입력들 및 차량의 소프트웨어 모델들 및 그 환경의 조합에 의해 결정된다. 물리학-기반 의 모델들은 비디오 게임 소프트웨어의 일부이고 또한 모터 레이싱 이벤트의 전형적인 매우 복잡하고 역동적인 시나리오들을 시뮬레이션하려는 시도를 달성할 수 있는 충실도에 있어서 많은 제한을 받는다. 이것은 가상 차량 과 실제 차량의 표현 간의 상호작용의 품질을 좋지 않게 한다. 다른 종래 기술 문헌들(예. GB2365360A)은 컴퓨터 게임 내의 그 환경 및 가상 차량의 동역학의 물리학 모델 시 뮬레이션들은 연습 실행(practice runs)으로부터 수집된 데이터에 의해 미리 조절될 수 있거나 또는 게임 플레 이어에 의해 제어될 수 있는 환경 및 차량의 '최적 물리학 모델'을 생성하기 위한 환경 및 실제 차량들로부터 라이브로 전송되는 성능 데이터로부터 실시간으로 조절될 수 있음을 제안하는 것에 의해 그 주요한 결함을 해결 하고자 시도해 왔다. 이 접근법은 매우 고성능의 추적을 달성하고자 기술되는 실질적인 수단이 없고 또한 이에 더하여 매우 복잡한 환경에서 작동하는 매우 복잡한 전동차들을 수반하는 실제 시나리오들의 소프트웨어 모델들 은 매우 많은 변수들 및 변수들 간의 정교한 관계들을 포함하여, 더 많은 명확한 변수들 중 일부가 지속적으로 측정되고 사용될 때조차도, 그 모델들은 a) 모델들 내의 많은 근사들 및 부족분들로 인해 현실로부터 매우 빠르게 벗어나거나; 또는 b) 엄청난 양의 계산 성능을 필요로 하여 최대 컴퓨터들에서도 실시간으로 작동하는 것이 가능하지 않을 수 있 다는 점에서 동일한 근본적인 제한을 받는다. 또 다른 종래 기술 문헌들(예. US6155927)은 추상적인 형태로 컴퓨터 게임 플레이어들이 라이브 및 기록된 실제 레이스들로 경쟁하는 것을 가능하게 해주는 시스템들을 기술하지만 그 추상적인 개념들의 실질적인 실현을 가능 하게 할 수 있는 GB2518602B에 기술된 것과 같은 구체적인 방법들 및 시스템 설명들은 제공하지 않는다. 또한 본 발명자들에 의해 공동-저술된 GB2585165A는, 추적 장치가 가로등 기둥과 같은 로우-레벨의 인프라에 위 치되고 IR 방출기들은 검출을 가능하게 하기 위해 차량들 상에 배치되거나, 또는 IR 반사기들이 차량들 상에 배 치되고 선택적으로 IR 램프가 추적 장치 내에 포함되는, 고속도로, 도로 및 거리 교통 네트워크들 상의 일반 차 량들, 로리들 등의 적외선(IR) 추적을 위한 접근을 기술한다. 차량 및 그 주변을 위한 고정밀의, 실시간 추적 데이터는 그후 내비게이션 및 자율 또는 반자율 주행을 보조하기 위해 추적 장비에 의해 차량으로 통신된다. 추 적 장치들은 선형의 높은 무결성 네트워크로 서로 연결될 수 있고 이로써 차량들은 연속적이고 균일한 도로를 따라 추적될 수 있다. GB2585165A의 추적 장치들의 배치는 현재 발명과는 무관한 특성들을 가진다(예를 들어, 추적 장치들로부터 전동차들로의 높은 무결성 데이터의 집합 및 전달). 나아가, 모터 스포츠 이벤트들은 전형적 으로 도전적인 기하구조(좁은 커브들, 이중 급커브들, 경사로들, 능선들(crests), 정비소들 등)를 갖는 폐쇄된 비균일한 써킷 주위의 차량들, 모터싸이클들 등과 같은 고성능 차량들의 추적을 필요로 하기 때문에, GB2585165A에서 기술되는 시스템들 및 방법들은 전반적으로 더 느리게 움직이는 차량들을 모니터링하도록 설계 되었기 때문에 대처할 수 없을 수 있다."}
{"patent_id": "10-2022-7040921", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "그러므로, 본 발명의 목적은 상기에서 설명된 종래 기술 문헌들의 한계들을 극복하는 데 있다. 또한, 다양한 실 시예들에 있어서, GB2518602B에서 정의되고 상기에서 설명된 정밀한 추적 능력에 있어서의 한계들을 극복하고, 개선된, 처음으로 실질적으로 달성가능한, 복잡한 환경들에서의 고성능 모터 스포츠 이벤트들을 위한 전세계 동 시로 다수의 플레이어들 및 추종자들의 대화형 실제-가상 모터 레이싱 대규모 참여를 위한 시스템들 및 방법들 을 제공할 것이 요망된다. 다양한 실시예들에 있어서, 플레이어들의 경험을 향상시키고 또한 지역적, 영역적, 국가적 또는 세계적 이스포츠 또는 공정하게 작동하면서 실제 모터 스포츠 이벤트들과 경쟁을 잘 통합할 수 있 는 경쟁적인 모터 레이싱 이벤트들을 가능하게 하기 위해 가상의 운전자들이 어떻게 실제 레이스 및 실제 운전 자들과 상호작용할 수 있을지 구체화할 것이 요망된다. 본 발명은 또한 경쟁하는 차량들의 운동학적 데이터, 및 차량 제어 데이터(가능하다면 운전자 입력들)이 GB2518602B에 상술된 컴퓨터 게이밍을 위한 정확도 및 지연시간요건들을 위해 기록되거나 또는 공정하게 재구축된, 실제 모터 스포츠 이벤트들에 관한 기록된 데이터의 생성 및 사용에 적용가능하다."}
{"patent_id": "10-2022-7040921", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 측면에 따라 트랙에서 열리는 모터 스포츠 이벤트를 나타내는 대화형 하이브리드 환경을 제어하는 컴퓨터-구현 방법이 제공되는데, 상기 대화형 하이브리드 환경은 트랙 상의 실제 및 가상 차량들의 표현들을 포 함하고, 상기 방법은, 실제 데이터의 스트림을 수신하는 단계, 상기 실제 데이터는 트랙 상의 실제 차량의 실제 운동학적 데이터 및 운전자에 의한 실제 차량의 제어에 관한 실제 제어 데이터를 포함하고, 상기 실제 운동학적 데이터는 트랙에 있는 적외선 센서들에 의해 캡쳐되고 상기 실제 제어 데이터는 차량 센서들에 의해 캡쳐되고 실제 차량으로부터의 원격측정 시스템들을 통해 획득되고; 상기 실제 운동학적 데이터를 이용하여 상기 대화형 하이브리드 환경 내의 실제 차량의 표현의 위치 및 운동학적 행위를 결정하는 단계; 상기 실제 제어 데이터에 기초하여 트랙 상의 실제 차량의 위치의 블랙 박스 결정을 생성하기 위해 상기 실제 제어 데이터 및 상기 실제 운동학적 데이터를 이용하는 단계; 상기 대화형 하이브리드 환경을 사용자에게 보여주고 또한 가상 차량의 표현 의 운동학적 행위를 제어하기 위해 사용자 입력들을 캡쳐하는 컴퓨터와 사용자 상호작용에 의해 획득되는 컴퓨 터-생성 제어 데이터의 스트림을 수신하는 단계; 및 상기 블랙 박스 결정 및 상기 컴퓨터-생성 제어 데이터를 이용함으로써 상기 대화형 하이브리드 환경 내에서 가상 차량의 표현의 위치 및 운동학적 행위를 결정하는 단계 를 포함한다. 대화형 하이브리드 환경에 운동학적 데이터 및 제어 데이터 모두를 포함하는 실제 데이터의 사용은 정확한 블랙 박스 결정이 되는 것을 가능하게 해준다. 이것은 차례로 수신된 컴퓨터-생성 제어 데이터에 대한 기준을 제공하 고 트랙 상의 실제 차량의 표현들과 관련하여 가상 차량의 정확한 실감 운동 제어를 가능하게 해준다. 사용자가 액츄에이터를 조작하는 정도는, 예를 들어, 실제 차량 내의 운전자에 의한 제어들의 조작이 실제 차량의 운동학 적 데이터(예를 들어 속도, 방향, 가속도, 및 위치)에 영향을 미칠 수 있는 동일한 방식으로 가상 차량에 영향 을 미치는 것으로 정확하게 미러링된다. 이것은 종래 기술 접근법들로는 가능하지 않았던 현실감을 제공하고 또 한 가상 영역 및 실제 영역 양자에서의 움직임을 정확하게 반영되도록 할 수 있다. 나아가, 이 특성들의 조합은 현실적이고 정확한 방식으로 동일한 하이브리드 환경에서 제공되는 서로 다른 영역들로부터의 차량들의 표현들 의 상호운용성 문제들을 극복한다. 실제 데이터가 라이브 데이터일 때, 소위 데이터가 대화형 하이브리드 환경 의 제어로 동시에 발생하는 이벤트로부터 스트리밍될 때, 예를 들어, 그때 본 발명은 가상 영역 내의 가상의 운 전자들이 실시간으로 실제 영역 내의 실제 운전자들과 경쟁하는 것을 가능하게 해주는데, 이것은 이전에는 가능 하지 않았다. 바람직하게 상기 실제 센서 데이터는 트랙 상의 복수의 실제 차량들의 실제 운동학적 데이터 및 각각의 운전자 에 의한 복수의 실제 차량들 각각의 제어에 관한 실제 제어 데이터를 포함한다. 본 발명의 실시예들은 복수의 차량들의 경쟁적 행위가 전체로 캡쳐되는 것이 가능하도록, 예를 들어 포뮬러 1 레이스에서 보이는 바와 같이 설계된다. 복수의 실제 차량들의 행위를 나타내는 실제 데이터의 스트림들은 이러한 경쟁적 환경이 생성되도록 할 수 있다. 각각의 실제 데이터 스트림은 별개로 처리될 수 있고 또한 고유한 차량 식별자를 포함할 수 있다. 유사하게, 상기 컴퓨터-생성 제어 데이터의 스트림은 컴퓨터-생성 데이터의 복수의 스트림들을 포함할 수 있고, 각각의 스트림은 개별 사용자 입력들의 캡쳐 및 개별 컴퓨터와의 서로 다른 사용자 상호작용에 의해 생성된다. 이것은 복수의 사용자들이 스포츠 이벤트와 연관되도록 할 수 있고 유리하게는 대규모 게이밍이 실현되도록 허 용한다. 각각의 컴퓨터-생성 데이터 스트림은 별개로 처리될 수 있고 또한 고유한 컴퓨터 장치 식별자를 포함할 수 있다. 바람직하게 상기 복수의 실제 차량들은 상기 컴퓨터-생성 데이터 스트림들의 복수의 스트림들보다 적고, 상기 방법은 연결된 표현을 생성하기 위해 가상 차량들의 복수의 표현들의 하나 또는 그 이상의 서브셋을 하나의 실 제 차량의 표현과 연결하는 단계를 더 포함할 수 있다. 물론 대규모 게이밍 환경에서 게이밍 컴퓨터들/장치들을 통해 참가하는 사용자들의 수는 레이스 내의 차량들의 수를 훨씬 초과한다(통상적으로 안전을 이유로 레이스 내 에 참가할 수 있는 차량들의 수에 대한 물리적 한계들이 있기 때문에). 따라서, 가상 차량들의 2 또는 그 이상 의 표현들을 실제 차량의 하나의 표현에 연결함으로써 어떠한 수의 사용자들도 수용될 수 있다. 이것은 이 방법 이 가상 영역 내의 수 십만 명의 사용자들이 동시에 실제 영역 내의 운전자들과 경쟁할 수 있는 대규모 게이밍 시나리오들을 위해 확장가능하도록 해준다. 일부 실시예들에 있어서, 이 방법은 상기 서브셋의 가상 차량의 위치가 실제 차량의 오차 한계 내에 있을 동안 상기 대화형 하이브리드 환경 내의 가상 차량들의 복수의 표현들의 서브셋을 표현하기 위해 상기 연결된 표현을이용하는 단계를 더 포함한다. 컴퓨터-생성 데이터의 복수의 스트림들은 통상적으로 많은 실시예들에 있어서 복수의 실제 차량들의 복수 배 크 고 상기 연결하는 단계는 상기 복수의 컴퓨터-생성 데이터 스트림들 각각을 실제 차량들의 복수의 표현들에 고 른 분포로 연결하는 단계를 포함한다. 상기 컴퓨터-생성 데이터의 복수의 스트림들은 복수의 실제 차량들의 복 수 배 큰 다른 실시예들에 있어서, 상기 연결하는 단계는 상기 복수의 컴퓨터-생성 데이터 각각을 실제 차량들 의 복수의 표현들에 로그 분포로 연결하는 단계를 포함할 수 있다. 어떠한 방식이라도 조심스러운 수의 실제 차 량 표현들이 있을 수 있는 대화형 하이브리드 환경에서 방대한 수의 플레이어들/사용자들을 수용하는 것이 가능 하다. 일 실시예에 있어서, 대화형 하이브리드 환경을 생성하고 그후 이를 통신 네트워크을 통해 게이밍 장치들 모두 에게 제공하는 중앙 게이밍 서버를 가지는 것이 가능하다. 이 경우에 있어서, 이 방법은 수신된 실제 센서 데이 터 및 컴퓨터-생성 데이터에 의해 결정된 대로 상기 실제 및 가상 차량들의 표현들의 새로운 위치들로 상기 대 화형 하이브리드 환경을 갱신하는 단계; 상기 갱신된 대화형 하이브리드 환경을 생성하는 단계; 및 상기 갱신된 대화형 하이브리드 환경을 중앙 서버로부터 복수의 원격으로 위치된 컴퓨터들로 방송하는 단계를 더 포함할 수 있다. 중앙집중식 해법은 더 큰 처리 능력을 필요로 할 수 있지만 상대적으로 갱신 및 제어가 용이하다. 다른 일 실시예에 있어서, 각 사용자/플레이어의 게이밍 장치는 대화형 하이브리드 환경을 지역적으로 생성할 수 있고, 복수의 이러한 생성된 지역 환경들이 있을 수 있다. 이 경우에 있어서, 이 방법은 상기 블랙 박스 결 정 및 상기 실제 센서 데이터를 중앙 서버로부터 복수의 원격으로 위치된 컴퓨터들로 방송하는 단계; 각각의 원 격으로 위치되는 컴퓨터에서 상기 대화형 하이브리드 환경을 생성하는 단계; 수신된 실제 센서 데이터 및 컴퓨 터-생성 데이터에 의해 결정된 대로 상기 실제 및 가상 차량들의 표현들의 새로운 위치들로 상기 대화형 하이브 리드 환경을 갱신하는 단계; 및 가상 차량들의 표현들의 새로운 위치들을 상기 중앙 서버로 전송하는 단계를 더 포함할 수 있다. 이러한 분산 해법은 더 많은 관리가 필요할 수 있지만 잠재적인 병목 현상은 겪지 않고 또한 일반적으로 대화형 하이브리드 환경의 생성에 있어서 시간 지연 및 랙에 덜 민감하다. 일부 실시예들에 있어서, 이 방법은 상기 블랙 박스 결정을 참조하는, 인공지능 엔진을 이용해 상기 컴퓨터-생 성 제어 데이터와 상기 가상 차량의 결과 위치 사이의 연관성을 변경하는 단계를 더 포함한다. 이러한 인공 지 능 엔진의 이용은 각 플레이어의 가상 차량의 제어에 있어서 지원(assistance)을 각 플레이어에게 제공되도록 해줄 수 있다. 이러한 지원은 더 약한 가상 게이머들이 실제 영역의 전문 운전자들과 더 공정하게 경쟁할 수 있 도록 해주는 핸디캡 요인을 제공할 수 있다. 대부분의 실시예들에 있어서, 수신된 실제 운동학적 데이터는 상기 트랙에 대한 길이방향 위치 데이터, 상기 트 랙에 대한 측면 위치 데이터 및 상기 트랙에 대한 차량 방향 데이터를 포함한다. 이러한 종류의 데이터는 차량 의 운동학적 행위가 가상 영역으로 정확히 매핑되는 것을 가능하게 해준다. 일부 실시예들에 있어서, 상기 실제 제어 데이터는 실제 차량의 운전대 위치, 가속기 위치, 제동 페달 위치 및 기어 선택 중 하나 또는 그 이상을 포함한다. 이것들은 텔레매틱스 시스템이 정보를 제공하고 또한 실제 차량의 트랙 위치를 결정하는 운전자 제어 입력들을 결정하는 데 도움을 주는 전형적인 제어 데이터이다. 또한, 유리하 게도 이 데이터는 가상 세계에서 플레이어에 의해 제어될 수 있는 대응하는 액츄에이터들과 쉽게 관련될 수 있 다. 다양한 실시예들이 다양한 소스들의 실제 데이터로부터 대화형 하이브리드 환경을 생성한다. 일 실시예에 있어 서 소스는 이전에 기록되었던 실제 데이터 저장소이다. 따라서, 이 방법은 실제 센서 데이터가 생성되었을 때 실제 센서 데이터의 복사본을 저장하고 있는 데이터 저장소로부터 상기 실제 센서 데이터를 검색하는 단계를 더 포함할 수 있다. 다른 일 실시예에 있어서, 이 소스는 스포츠 이벤트 그 자체로부터 나오고 이 경우에 있어서 상기 수신하는 단계는 스포츠 이벤트가 발생하고 있을 때 실질적으로 실시간으로 상기 실제 센서 데이터를 수신 하는 단계를 포함한다. 일 실시예에 있어서, 상기 실제 센서 데이터의 스트림은 적어도 25 Hz의 샘플링 속도를 가지고 또한 한 시점에 서 실제 차량의 위치가 캡쳐되어 캡쳐된 40 밀리초 이내에 상기 대화형 하이브리드 환경으로 제공된다. 이것은 25 Hz의 최소 리프레쉬 속도에서 작동하는 가상 영역 내에서 실제 영역의 실시간 실현을 가능하게 해준다. 보다 바람직하게, 일부 실시예들에 있어서, 상기 실제 센서 데이터의 스트림은 적어도 60 Hz의 샘플링 속도를 가지고 또한 한 시점에서 실제 차량의 위치가 캡쳐되어 캡쳐된 16.7 밀리초 이내에 상기 대화형 하이브리드 환경으로제공된다. 이 리프레쉬 속도는 통상적으로 대부분의 컴퓨터 모니터들에서 발견되고 이로써 가상 영역 내에서 실 시간 이벤트의 고품질 표현을 지원한다. 상기 대화형 가상 환경의 생성을 보조하기 위해, 이 방법은 저장된 데이터 모델들을 이용하는 단계를 더 포함할 수 있다. 이것은 가상 환경을 플레이어에게 보다 더 현실적으로 만들어 줄 수 있다. 나아가, 상기 대화형 하이브리드 환경을 향상시키기 위해 상기 실제 차량으로부터 비디오 및 오디오 데이터 스 트림들을 수신하는 것이 가능하다. 이 경우에 있어서 이 방법은 상기 실제 차량으로부터 비디오 데이터 또는 오 디오 데이터의 스트림을 수신하고 또한 상기 대화형 하이브리드 환경에 상기 비디오 데이터 또는 오디오 데이터 의 스트림을 포함시키는 단계를 포함할 수 있다. 대규모 게이밍을 용이하게 하기 위해, 일부 실시예들에 있어서 이 방법은 상기 가상 차량의 표현의 위치가 상기 실제 차량의 표현의 위치의 미리 정해진 임계치 이내에 있을 때 한 시점에서 상기 복수의 가상 차량들 중 하나 의 가상 차량의 표현을 상기 복수의 실제 차량들 중 하나의 실제 차량의 표현에 연결하고 또한 상기 대화형 하 이브리드 환경 내의 가상 차량의 표현으로서 상기 실제 차량의 표현을 이용하는 단계를 더 포함한다. 이것은 유 리하게도 대량의 가상 차량들이 엄청난 수의 가상 차량들의 표현들로 화면을 어지럽히지 않고도 상기 대화형 하 이브리드 환경에 포함되는 것을 가능하게 해준다. 실제로, 이러한 형태의 표현은 한정된 화면 크기 내에 수백 만의 플레이어들이 관여하는 모터 스포츠 이벤트를 어떻게 나타낼지에 대한 기술적 문제를 해결한다. 나아가, 수백 만의 컴퓨터 게임 플레이어들 및 전세계의 기타 팬들을 모터 스포츠 이벤트들과 실시간으로 연결하는 문제 는 게이머들 및 시청자들에게 및 결정적으로 전문 게임 플레이어들을 점점 많이 유치하는 이스포츠 이벤트들에 있어서, 도전적이고 만족스럽고 또한 즐거운 상호작용 경험들을 제공하고, 실제-가상 모터 레이싱 이벤트의 통 합된 부분으로서 모든 플레이어들을 공정하게 관리하고 등급을 매길 수 있는, 본 실시예들의 일부에 의해 처리 된다. 오디오 및/또는 비디오 데이터가 실제 차량으로부터 제공되는, 일부 실시예들에 있어서, 상기 연결하는 단계(여 기서 '스냅핑(snapping)'으로 지칭됨)는 수신된 상기 실제 차량으로부터의 오디오 또는 비디오 데이터의 스트림 을 사용자에게 상기 대화형 하이브리드 환경을 보여주는 상기 컴퓨터로 제공하는 것을 활성화시킬 수 있다. 이 것은 특정 실제 차량에 의해 경험되는 광경들과 음향들을 가상 영역으로 제공하여 대화형 하이브리드 환경을 더 사실적으로 만들도록 해줄 수 있다. 일부 실시예들에 있어서, 이 방법은 상기 가상 차량의 표현의 위치가 상기 실제 차량의 표현의 위치의 미리 정 해진 임계치 외부에 있을 때 한 시점에서 상기 복수의 가상 차량들 중 하나의 가상 차량의 표현을 상기 복수의 실제 차량들 중 하나의 실제 차량의 표현에 연결해제하고 또한 상기 가상 차량의 표현을 상기 대화형 하이브리 드 환경 내의 실제 차량의 표현과 별개로 보여주는 단계를 더 포함한다. 이것은 가상 차량 표현이 실제 차량 표 현에 일치되지 않을 때 이를 디스플레이되도록 해줄 수 있고 이로써 플레이어는 실제 차량들의 표현들과 관련하 여 그들의 가상 차량의 실제 위치를 알 수 있어 대화형 하이브리드 환경 내에서 실제 차량들의 표현들 간의 전 이를 가능하게 해준다. 대화형 하이브리드 환경의 측면들을 위한 일부 실시예들에 있어서 이후에 설명되는 바와 같이 실제 차량들과 관 련된 팀들로 다시 릴레이되는 것 또한 가능하다. 이 경우에 있어서, 이 방법은 상기 실제 차량의 표현에 연결된 가상 차량의 세부사항들을 원격으로 위치되는 제3자 컴퓨터에 제공하는 단계를 더 포함할 수 있다. 일부 실시예들에 있어서 가상 차량의 성능을 근접하게 위치되는 실제 차량의 표현에 매칭시키는 것이 가능하다. 각각의 실제 차량은 성능 특성들의 집합을 가지고 이것은 더 공정한 게이밍을 가능하게 할 수 있다. 이 실시예 에 있어서, 이 방법은 상기 가상 차량의 표현에 상기 복수의 실제 차량들 중 최근접하게 위치되는 실제 차량의 표현을 결정하고 또한 상기 최근접하게 위치되는 실제 차량의 표현의 성능 특성들의 집합을 상기 가상 차량의 성능 특성들로서 채택하는 단계를 더 포함한다. 일부 실시예들은 또한 상기 적외선 센서들을 이용해 트랙 상의 실제 차량의 위치 데이터를 캡쳐하는 단계, 시간 에 따른 상기 위치 데이터를 실제 운동학적 데이터의 스트림으로 변환하는 단계 및 이를 실시간으로 중앙 서버 로 전송하는 단계를 더 포함한다. 바람직하게, 상기 캡쳐하는 단계는 상기 트랙의 서로 다른 부분들을 모니터링하는 센서들의 그룹들을 이용해 위 치 데이터를 캡쳐하는 단계를 포함하고, 센서들의 각 그룹 내의 각 센서는 센서의 시야(FOV) 내에서 상기 트랙 상에서 작동하는 하나 또는 그 이상의 차량들로부터 반사 또는 전송되는 적외선을 검출한다. 이 배치는 상기 대 화형 하이브리드 환경을 위한 정확한 실시간 정보를 제공하기 위해서 특히 유리하고 이하에서 설명된다. 일부 실시예들에 있어서, 이 방법은 상기 트랙 상의 하나 또는 그 이상의 실제 차량들의 운동학적 데이터를 결 정하기 위해 상기 적외선 센서에 의해 검출되는 적외선을 처리하는 단계를 더 포함한다. 바람직하게 이 처리는 각 센서에서 수행되고 또한 더 적은 양의 데이터가 상기 대화형 하이브리드 환경에서 사용되기 위해 전송될 수 있도록 한다. 본 발명의 다른 측면에 따라 트랙에서 열리는 모터 스포츠 이벤트를 나타내는 대화형 하이브리드 환경을 제어하 는 컴퓨터 시스템이 제공되는데, 상기 대화형 하이브리드 환경은 트랙 상의 실제 및 가상 차량들의 표현들을 포 함하고, 상기 시스템은, 실제 센서 데이터의 스트림을 수신하는 수신기, 상기 실제 센서 데이터는 트랙 상의 실제 차량의 실제 운동학적 데이터 및 운전자에 의한 실제 차량의 제어에 관한 실제 제어 데이터를 포함하고, 상기 실제 운동학적 데이터는 트랙에 있는 적외선 센서들에 의해 캡쳐되고 또한 상기 실제 제어 데이터는 차량 센서들에 의해 캡쳐되고 실제 차량으로부터의 원격측정 시스템들을 통해 획득되고; 사용자에게 상기 대화형 하 이브리드 환경을 보여주고 상기 가상 차량의 표현의 운동학적 행위를 제어하기 위해 사용자 입력들을 캡쳐하는 컴퓨터와 사용자 상호작용에 의해 획득되는 컴퓨터-생성 제어 데이터의 스트림을 수신하도록 구성된 가상 레이 스 명령 프로세서; 및 가상 레이스 시뮬레이션 엔진을 포함하고, 상기 가상 레이스 시뮬레이션 엔진은, 상기 실제 운동학적 데이터를 이용해 상기 대화형 하이브리드 환경 내에서 상기 실제 차량의 표현의 위치 및 운동학적 행위를 결정하기 위한 레이스 시뮬레이션 출력 엔진; 상기 실제 제어 데이터에 기초하여 트랙 상의 실제 차량의 위치의 블랙 박스 결 정을 생성하기 위해 상기 실제 제어 데이터 및 상기 실제 운동학적 데이터를 이용하도록 구성된 기준 블랙 박스 모델 생성기; 및 상기 블랙 박스 결정 및 상기 컴퓨터-생성 제어 데이터를 이용해 상기 대화형 하이브리드 환경 내에서 상기 가상 차량의 표현의 위치 및 운동학적 행위를 결정하도록 구성된 게이밍 블랙 박스 구현 엔진을 포 함한다 . 이 컴퓨터 시스템은 일부 실시예들에 있어서 상기 가상 차량의 최종 위치 사이의 연관성(association)이 변하도 록 구성되는 인공 지능 엔진을 더 포함한다. 인공 지능 엔진은 일부 실시예들에 있어서 상기 가상 차량의 주어 진 위치를 생성하기 위해, 수신된 컴퓨터-생성 제어 데이터에 필요한 임계치들을 넓히도록 구성될 수 있다. 이하에서 더 상세하게 설명되는 바와 같이, 본 발명의 일부 실시예들은 컴퓨터 게이밍, 이스포츠 토너먼트, 스 트리밍, 시청, 도박 및 모터 스포츠에 대한 팬 참여의 일반적인 증강에 한정되지 않지만 이를 포함하는 어떠한 오락 목적으로든지 전세계 모터 스포츠 컴퓨터 게임들의 수 백만 플레이어들이 동시에 실제의 라이브 모터 스포 츠 이벤트들과 상호작용하도록 하는 시스템들 및 방법들에 있어서 또는 이와 관련된 개선들과 관련 있다. 일 실 시예는 컴퓨터 게임 플레이어들이 특정 파라미터들에 따라, 실제 자동차들 중 하나를 이용해 디지털 트위닝하여 레이스를 시작하고 자동차 간 이동하거나, 또는 추가적인 자동차로서 작동하는 것을 가능하게 해준다. 용어 '자 동차(car)' 및 '차량(vehicle)'은 본 명세서 내에서 상호교환적으로 사용되지만 더 넓은 운송수단의 의미를 가 짐이 이해되어야 한다. 자동차를 이용해 트위닝될 때, 그 환경에서 가상 자동차의 성능이 실제에 거의 일치하고, 이로써 현실적이고 도전적이며 즐겁고 또한 컴퓨터 게임 플레이어와 실제 운전자들 간 공정한 경쟁을 제공함을 보장하기 위해 동적인 블랙 박스 시뮬레이션 방법이 사용될 수 있다. 한 플레이어를 위한 이 시스템 및 방법은 이후에 수 백만의 플레이어들이 동시에 경쟁적으로 실제 이벤트와 상호작용하도록 하는 확장된 시스 템 및 방법의 기초를 형성한다. 이 시스템들 및 방법들은 또한 컴퓨터 게임을 하기 보다는 단지 모터 레이스들 을 시청하는 참가자들이 훨씬 더 많이 호감을 가지고 모터 스포츠 이벤트들과 상호작용하도록 해주는 데 사용될 수 있다. 이 시스템들 및 방법들은 또한 다른 스포츠 범위에 대한 시청자 및 컴퓨터 게이머 참여를 향상시키는 데 사용될 수 있다. 일반적으로, 본 발명의 실시예들은 전동차 레이스(예. 포뮬러 1)에서 고정밀 실시간 차량 추적 데이터를 캡쳐하 고 라이브 방송하기 위한 알려진 종래 기술에 대한 개선들과 관련이 있고 이로써 기타 다양한 범위의 시청 및 오락 향상들에 더하여 컴퓨터 게이머들과 전문 운전자들 간에 진정으로 공정하고, 경쟁적이고 즐거운 레이스를 가능하게 해준다. 이 개선들은 라이브 이벤트에서 경쟁하는 상당한 수의 고성능 차량들에 대한 모터 스포츠 장 소로부터의 추적 데이터의 캡쳐 및 방송을 망라하고 이로써 방송 데이터는 라이브든 또는 이전에 기록된 것이든 지 간에, 충분히 정확하고, 실시간으로 또한 컴퓨터 게임들 및 기타 오락 매체가 데이터를 통합하고 이용할 수 있는 적절한 형식이며, 이로 인해 컴퓨터 게이밍 경험을 향상시키고 및/또는 모터 스포츠 주최자들 및 팬들에게 사용자-선택가능 관점들, 맞춤 스트리밍, 사용자-타겟팅 광고, 라이브 도박 등과 같은 추가적인 이익들을 제공 하게 된다. 일부 실시예들에 있어서, 라이브로-연결된 레이스에서 경쟁하면서 게이머는 레이스 시작시 선택된 실제 자동차를 레이스 중 다른 실제 자동차들로 변경하는 것, 또는 소정의 파라미터들이 주어지면, 추가적인 자 동차로서 작동하는 것이 허용되고, 이로써 게이머는 레이스 도중 그 자신들이 있는 어떠한 위치에서든 그들의능력들을 다른 자동차 운전자들과 일치시키는 것이 허용된다. 새로운 실제 차량으로 변경하는 옵션을 선택할 때 게이머의 자동차의 능력은 새로운 실제 운전자와 공정하고 경쟁적인 레이스를 다시 설립하면서 새로운 실제 자 동차에 일치된다. 여기의 이 시스템들 및 방법들은 그후 무제한의 게이머들이 매력적이고, 공정하고 경쟁적인 방식으로 참여하는 것을 가능하게 해주기 위해 확장된다. 소정의 환경들에 있어서 게이머는 또한 다른 가상 자 동차들을 보고 상호작용할 수 있지만, 모든 환경들에 있어서 여기의 시스템들 및 방법들은 가상 환경의 무제한 의 게이머들 및 실제 환경의 실제 운전자들 간의 공정하고 경쟁적인 레이스를 가능하게 해주고, 이러한 통합은 대화형 하이브리드 환경이라고 지칭된다. 여기의 시스템들 및 방법들은 또한 다른 스포츠 이벤트들에 적용될 수 있고 복수의 대표적인 예들이 설명된다. 이로써, 본 발명의 실시예들은 대화형 실제-가상 모터 레이싱 이벤트를 위한 작동 시스템들 및 방법들을 편리하 게 제공하고 이로써, 이 시스템들 및 방법들이 사용될 때, 가상 환경(대화형 하이브리드 환경)을 이용하는 몇 명의 참가자들이든 실제 라이브 이벤트 및 실제 운전자들과 다음 중 하나에 의해: a) 현실적이고 만족스럽고 도전적이고 공정한 방식으로 라이브의 양립가능한 모터 스포츠 이벤트에서 실제 운전 자들 중에서 모든 경험 및 스킬 레벨들을 갖는 각 개별적인 가상 운전자들 및 가능하다면 한정된 수의 기타 가 상 운전자들(가상 운전자들의 총 수는 실제 운전자들의 수까지이다)로서 경쟁하는 것에 의해, 또는 b) 현실적이고 만족스럽고 도전적인고 공정한 방식으로 라이브의 호환가능한 모터 스포츠 이벤트와 고도로 통합 되는, 대규모 멀티-플레이어가 주최하는 이스포츠 컴퓨터 게이밍 이벤트, 또는 기타 컴퓨터 게이밍 이벤트 또는 활동(종종 친구들 또는 관계자들 사이에서 자체-주최되는)에서 경쟁하는 것에 의해, 또는 c) 라이브 시청 또는 라이브 스트리밍 경험들을 향상시키기 위해 현재 실시예들의 시스템들 및 방법들을 이용 하여 관찰자들로서 참여하는 것에 의해 상호작용할 수 있다. 본 발명의 다른 측면에 따르면, 중앙 서버로 제정 영역 상에서 작동하는 하나 또는 그 이상의 이동 개체들의 위 치 데이터를 제공하는 센싱 시스템이 제공되는데, 상기 센싱 시스템은 복수의 센서 그룹들을 포함하고, 상기 센 서 그룹들 각각은 상기 제정 영역의 일 부분을 모니터링하도록 구성되고, 상기 센서 그룹들 각각은 상기 제정 영역 주변에 위치되는 복수의 위치 센싱 장치들을 포함하고, 상기 위치 센싱 장치들 각각은 승강된 위치로부터 상기 제정 영역의 서로 다른 부분을 모니터링하도록 구성되고, 상기 위치 센싱 장치들 각각은 FOV 내에서 상기 제정 영역 상에서 작동하는 하나 또는 그 이상의 이동 개체들로부터 반사 또는 전송되는 적외선을 검출하기 위 한 FOV를 갖고 센서 출력을 생성하는 적외선 센서; 및 상기 적외선 센서의 센서 출력, 또는 이로부터 도출된 정 보를, 그 센서 그룹을 위한 통신 노드로서 행동하는 그 센서 그룹의 복수의 위치 센싱 장치들 중 하나로 전송하 도록 구성된 전송기; 및 센서 그룹 내에서 통신 노드로서 행동하는 위치 센싱 장치에 통신가능하게 결합되는 통 신 장비를 포함하고, 상기 통신 장비는 중앙 수집 서버로 상기 센서 그룹의 각 적외선 센서의, 상기 센서 출력, 또는 이로부터 도출된 정보를 전송하도록 구성된다. 일부 실시예들에 있어서, 상기 센서 그룹들 각각은 10 또는 그 이하의 위치 센싱 장치들을 포함한다. 위치 센싱 장치들의 수를 최소화하는 것은 유리하게 데이터 전송 지연과 추가적인 통신 경로들의 필요에 의한 시스템 복잡 도 간의 최적 밸런스를 보장한다. 일부 실시예들의 그룹 내에서, 상기 센서 그룹의 상기 위치 센싱 장치들 중 적어도 하나는 상기 센서 출력, 또 는 이로부터 도출된 정보에 기초하여, 적어도 2차원으로, 상기 FOV 내에서 상기 제정 영역 상에서 작동하는 하 나 또는 그 이상의 이동 개체들의 현재 운동학적 데이터를 결정하도록 구성된 프로세서를 포함한다. 이 특징은 시스템 주변에서 전송되는 데이터의 양을 감소시키도록 크게 개선시킬 수 있고 이로써 센서 출력이 통신 노드로 전송되기 전에 처리되기 때문에 정보의 전송 속도를 증가시킬 수 있다. 일부 실시예들에 있어서, 상기 복수의 센서 그룹들 중 제1 센서 그룹은 상기 복수의 센서 그룹들 중 제2 센서 그룹으로 상기 제1 센서 그룹에 의해 결정된, 상기 센서 출력, 또는 이로부터 도출된 정보를 릴레이하도록 구성 된다. 다양한 실시예들에 있어서 상기 복수의 센싱 장치들 중 하나 또는 그 이상은 상기 제정 영역 상에서 하나 또는 그 이상의 실제 이동 개체들에 의해 방출되는 열적외선을 검출하도록 구성된 LWIR(Long Wave Infra-Red) 마이크 로볼로미터 또는 MWIR(Medium Wave Infra-Red) 광자 감지 카메라를 포함할 수 있다. 또한, 상기 복수의 센싱 장 치들 중 하나 또는 그 이상은 이동 개체로부터 방출 또는 반사되는 광대역 또는 협대역 광을 검출하기 위해 SWIR(Short Wave Infra-Red) 또는 NIR(Near Infra-Red) 광자 감지 카메라를 포함할 수 있다. 바람직하게 매우 빠른-이동 차량들을 정확하게 검출하기 위해, 상기 복수의 위치 센싱 장치들 중 하나 또는 그 이상은 적어도 60 Hz 및 보다 바람직하게는 적어도 100 Hz의 프레임 속도를 가질 수 있다. 이것은 통상 25 Hz 내지 60 Hz의 최소 게이밍 리프레쉬 속도와 유리하게 비교된다. 바람직하게 일부 실시예들에 있어서, 상기 복수의 위치 센싱 장치들 중 하나 또는 그 이상은 적외선 서명 (infra-red signature)에 기초하여 상기 이동 개체의 고유한 식별자를 검출하도록 구성된다. 이것은 위치 센싱 장치의 동일 FOV 내에서 추적되는 복수의 이동 개체들이 있는 경우 추적 목적들을 위해서는 매우 유용하다. 고 유한 식별자는 이동 개체 상의 방출기로부터의 변조된 IR 신호일 수 있고, 각각의 다른 개체는 다른 변조된 신 호를 가진다. 상기 복수의 위치 센싱 장치들 중 하나 또는 그 이상의 기타 선택적인 특징들은 LED 투광등(LED floodlamp)으로 부터 나오는 반사광을 검출하도록 구성된 트랙의 진행 부분을 향하는 LED 투광등을 포함한다. 실제 차량의 이러 한 조명은 열악한 조명과 악천후 조건들에서 더 많은 탄력성을 제공한다. 일부 실시예들에 있어서, 상기 복수의 위치 센싱 장치들 중 하나 또는 그 이상은 변조된 적외선 광을 구성하는 차량의 적외선 서명을 검출하도록 구성 된다. 이러한 변조는 가변적인 환경 요인들에 대하여 더욱 더 탄력성을 제공하고 또한 유리하게도 거리 측정들 이 더 정확해지도록 할 수 있다. 상대적 위치 결정을 보조하기 위해, 상기 복수의 위치 센싱 장치들 중 하나 또는 그 이상은 상기 제정 영역의 엣지들에서 반사 또는 방출되는 적외선을 검출하도록 구성될 수 있고 상기 시스템은 상기 이동 개체의 측면 위 치를 결정하기 위해 기준 프레임으로서 검출된 정보를 이용하도록 구성될 수 있다. 위치 센싱 장치들은, 일부 실시예들에 있어서, 다가오는 실제 차량들에 직면하도록 향할 수 있다. 실제 차량의 적외선 서명을 캡쳐하기 위해 수평 및 수직 방향들에 각도를 가지고 위치될 수 있다. 보다 상세하게 이 실시예 들에 있어서 상기 위치 센싱 장치들 중 적어도 일부는 수평 또는 수직 평면들과 예각인 그 시야(FOV)의 보어사 이트(중앙선)을 가지고 또한 상기 제정 영역을 통해 진행할 때 사용중인 다가오는 이동 개체들에 직면하도록 배 치된다. 다른 구성들이 가능하고 따라서 일부 실시예들에 있어서 상기 복수의 위치 센싱 장치들 중 적어도 일부 는 검출 범위는 50 미터까지이고 20 내지 30도의 FOV를 포함한다. 다른 실시예들에 있어서, 상기 복수의 위치 센싱 장치들 중 적어도 일부는 검출 범위는 15 미터까지이고 70도의 FOV를 포함한다. 일부 실시예들에 있어서, 이 시스템은 GPS 수신기를 더 포함한다. 상기 GPS 수신기는 상기 센서 출력, 또는 이 로부터 도출되는 정보를 위한 타임 스탬프를 제공하고, 상기 시스템은 상기 위치 센싱 장치들 중 적어도 일부로 부터의 센서 출력 또는 이로부터 도출되는 정보를 위한 공통 시간 기준을 설립하기 위해 상기 타임 스탬프를 이 용하도록 구성된다. 상기에서 언급된 바와 같이, 일부 실시예들에 있어서 상기 통신 장비는 상기 중앙 서버로 상기 제정 영역 상에 서 작동하는 하나 또는 그 이상의 이동 개체들의, 상기 센서 출력 또는 이로부터 도출되는 정보를 제공하기 위 해 최소 25 Hz 리프레쉬 속도에서 작동하도록 구성된다. 이 리프레쉬 속도를 사용하면, 대화형 하이브리드 환경 에 제공되는 운동학적 데이터 및 고속 차량들(예를 들어 220 mph까지 작동하는)이 추적될 수 있는 충분한 데이 터 해상도를 제공한다. 하지만, 보다 더 바람직한 일 실시예에 있어서 상기 통신 장비는 상기 중앙 서버로 상기 제정 영역 상에서 작동하는 하나 또는 그 이상의 이동 개체들의, 상기 센서 출력 또는 이로부터 도출되는 정보 를 제공하기 위해 최소 60 Hz 리프레쉬 속도에서 작동하도록 구성된다. 이 리프레쉬 속도의 사용은 대부분의 컴 퓨터 게이밍 모니터들과 일치하고 따라서 예를 들어 대화형 하이브리드 환경 내에서 실제 실감나는 개체들의 움 직임의 표현을 제공하는 데 도움을 준다. 각 위치 센싱 장치의 프로세서는 일부 실시예들에 있어서 상기 제정 영역을 따른 길이방향 위치(longitudinal position), 상기 제정 영역을 가로지르는 측면 위치(lateral position) 및 상기 이동 개체의 회전 방향 (rotational orientation)을 결정하도록 구성될 수 있다. 일부 실시예들에 있어서, 상기 센서 그룹의 복수의 위치 센싱 장치들은 순서대로 배치되고 상기 순서의 중간점 에 있는 위치 센싱 장치는 상기 센서 그룹의 통신 노드로서 행동한다. 이 배치는 통신 노드까지 위치 센싱 장치 들 간의 통신 홉들을 최소화한다. 따라서 예를 들어 9 개의 센서들의 한 그룹 중 5번째 센서가 통신 노드가 되 고, 통신 노드에 도달하는 위치 센싱 장치의 센서 출력, 또는 이로부터 도출되는 정보를 위한 최대 홉 수는, 4 홉이다. 모터 스포츠 이벤트 실시예들에 있어서, 상기 이동 개체들은 차량들을 포함하고 상기 제정 영역은 트랙을 포함 한다. 본 발명의 다른 측면에 따르면 트랙에서 열리는 모터 스포츠 이벤트를 나타내는 대화형 하이브리드 환경을 생성 하고 제어하는, 시스템이 제공되는데, 상기 대화형 하이브리드 환경은 트랙 상의 실제 및 가상 차량들의 표현들 을 포함하고, 상기 시스템은 상기에서 언급된 센싱 시스템과 조합되는 상기에서 언급된 컴퓨터 시스템을 포함한 다. 본 발명의 다른 측면에 따르면 트랙 상에서 작동하는 하나 또는 그 이상의 물리적 차량들로부터의 데이터를 이 용하여 트랙의 가상 표현 상의 하나 또는 그 이상의 사용자-작동 가상 차량들의 갱신된 위치를 결정하는, 컴퓨 터로 구현되는 방법이 제공되는데, 이 방법은 프로세서에서, 하나 또는 그 이상의 사용자-작동 가상 차량들과 하나 또는 그 이상의 물리적 차량들 중 하나와 연관시키는 단계; 프로세서에서, 첫번째 트랙 상의 위치를 지시 하는 하나 또는 그 이상의 물리적 차량들의 초기 위치 데이터를 수신하는 단계; 프로세서에서, 연관된 물리적 차량의 초기 위치 데이터에 기초하여 트랙의 가상 표현 상에서 하나 또는 그 이상의 사용자-작동 가상 차량들 각각에 대한 초기 위치 데이터를 결정하는 단계; 프로세서에서, 두번째 트랙 상의 위치를 지시하는 하나 또는 그 이상의 물리적 차량들의 위치 데이터; 하나 또는 그 이상의 물리적 차량들 각각에 대한 운전자 입력 데이터; 및 하나 또는 그 이상의 사용자 작동 가상 차량들의 작동을 제어하기 위한 사용자 입력들을 연속해서 수신하는 단계; 및 세번째로 연속해서 수신된 위치 데이터, 운전자 입력 데이터 및 사용자 입력들에 기초하여 하나 또는 그 이상의 사용자 작동 가상 차량들의 위치를 결정하는 단계를 포함한다."}
{"patent_id": "10-2022-7040921", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일부 실시예들은 특히 대도시, 도시 또는 교외 환경의 모든 유형의 환경에서 전세계적으로 개최될 수 있는 레이싱 이벤트를 위한 레이싱 써킷 주변의 매우 빠른-이동 차량들에 의해 요구되는, 복수의 차량들로부터 의 데이터의 데이터 지연 및 코디네이션 측면에서, 추적 능력을 제공한다. 특히, 이 실시예들은 단일 시선, 고 지대 IR 센서에 의해 추적을 방해하는 터널들, 인접 건물들 및 기타 장애물들이 있는 복잡하고 어수선한 도시 기반의 트랙 주변에서 실제 운전자들의 추적이 동시에 어떻게 달성될 수 있는지 구체화한다. 본 발명을 구체화 하는 시스템들은 컴퓨터, 통신 및 컴퓨터 소프트웨어를 포함하는 센서 하드웨어의 특수한 아키텍쳐들을 특징으 로 하는데, 이 전체는 개별적으로 구성되거나 또는 광범위한 모터 스포츠 장소들에 구성되어 편리하게 배치할 수 있어서 모든 경쟁 차량들은 성능 한계까지 차량을 밀어붙일 수 있도록 맞춤화된 다양한 구성들 및 환경들의 복잡한 레이싱 써킷 주변에서 동시에 추적될 수 있다. 개별적인 레이싱 써킷에 맞춤화된, 장비 및 소프트웨어 각각의 구성된 아키텍쳐는 적어도 실제 레이싱 써킷의 토폴로지의 대표적인 컴퓨터-기반 모델 내의 실제 경쟁 차량들 모두의 정확한 위치들을 나타내는 실시간, 하나의 동적 데이터 스트림으로 전달될 수 있고, 데이터 스트 림은 인터넷 또는 기타 통신 기술을 통해 수백만의 컴퓨터 게이밍 장치들로 동시에 분배되도록 하기 위해 정확 도, 지연 및 가능하다면 표현 충실도 측면에서 적절하다. 컴퓨터 게이밍 장치들은 이하에서 설명되는 방법들 모 두 또는 일부를 구체화하고 또한 전통적으로 모터스포츠-관련 컴퓨터 게임들을 플레이하거나 또는 모터 스포츠 이벤트 또는 기록들을 상업적 또는 기타 공급자들에 의해 제공되는 디지털 데이터 스트림들을 통해 경험하기 위 해 참가자들이 사용하는 어떠한 범위의 컴퓨터 하드웨어든지 포함한다. 본 실시예들은 GB 2,585,165 A에 설명된 기술들의 향상들을 제공하는데 이 문헌에 의하면 복잡한 환경들에서 고 성능 모터 스포츠 차량들을 추적하는 극한 도전을 처리하고 또한 게이밍 및 기타 오락 환경들에서 방송 및 사용 에 적합한, 동시에 모든 경쟁자들에 대한 고정밀의, 실시간 추적 데이터를 포함하는 하나의 통합된 실시간 데이 터 스트림을 생성할 수 있는 추적 장치들이 아키텍쳐에 배치된다. 여기서 추적 장치들의 IR 센싱 능력은 GB 2,585,165 A에 설명된 것들을 포함하지만, GB 2,585,165 A에 설명된 열 IR 추적 기술을 이 출원에 포함하는 것 은 GB 2,518,602 B에 설명된 기술을 넘어서 단지 열 IR 서명들에만 기초하여 모터 스포츠 차량들을 추적할 수 있는 가능성을 허용한다. 상기에서 설명된 실시예들의 특징들은 다양한 방식으로 결합될 수 있고 또한 여기에 구체적으로 설명되지 않았 다면 이하의 본 발명의 실시예들의 상세한 설명에 추가될 수 있다."}
{"patent_id": "10-2022-7040921", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서 설명되는 컴퓨터 게이밍 방법들은 모두 시스템의 각 컴퓨터 게이밍 요소(게임 플레이어의 컴퓨터/태블 릿/폰/...및/또는 원격 서버 하드웨어 및 모든 관련 소프트웨어를 포함하여)는 모터 스포츠-관련 게임들에 전형 적인 전통적인 기능들을 제공할 수 있고 이로써 플레이어는 실제 레이싱 트랙의 상세화된 데이터 모델 주변 시 뮬레이션된 전동차의 진행을 제어하기 위해 입력들을 컴퓨터 시스템에 제공할 수 있다. 플레이어의 시뮬레이션 된 차량은 트랙 모델과 그리고 인공 지능(AI) 기능들 및 게임의 물리학적 모델들, 또는 다른 유형의 시뮬레이션 들에 의해, 또는 다른 플레이어들에 의해 제어되는 다른 시뮬레이션된 차량들과 상호작용할 수 있다. 이러한 다 른 플레이어들은 출석하여 동일한 컴퓨터 시스템에 입력들을 제공하거나 또는 다른 위치들에서 인터넷 또는 다 른 적절한 네트워크를 통해, 종종 게임 서버들의 관여로, 모든 차량들 간 및 모든 차량들과 트랙 간의 현실적인 상호작용들을 제공하기 위해 원 플레이어 또는 플레이어들과 통신하는 원격 컴퓨터 시스템들을 이용할 수 있다. 이하에서 설명되는 방법들 및 실시예들은 전통적인 기능들을 모두 추가 또는 변형 또는 대체한다. 전체적으로 고려하면, 본 발명을 구현하는 시스템이 상주하는 새로운 환경은 라이브 모터 스포츠 및 다른 유형 의 스포츠 이벤트들에 컴퓨터 게임 플레이어들 및 기타 인터랙티브 시청자들의 대규모 참여를 지원하는 멀티- 컴포넌트 인프라로 고려될 수 있다. 본 실시예가 상주하는 이 새로운 환경은 3 가지 요소들을 포함한다: a. 게이밍 콘솔들, 개인 컴퓨터들, 시뮬레이터들, 아케이드 게이밍 장치들, 위성 수신&처리 장비, 스마트 폰들, 태블릿 등과 같은, 플레이어들 및 시청자들에 의해 사용되는 복수의 장치들, 가능하다면 전세계 도처에 위치한, 참가자들로부터 스트리밍을 위한 카메라 및 오디오 캡쳐 장치들을 포함함. b. 실시간으로 플레이어들 및 시청자들로부터 도출된 데이터의 수신, 조작, 결합, 저장 및 전파를 지원하기 위 한, 서버들, 실시간 데이터 센터들, 실시간 서버 클라우드들 및 가능하다면 전용 게임 및 오락 서버들과 같은, 인터넷 및 연관된 컴퓨팅 장비, 가능하다면 가상 자동차들을 운전할 때 오디오, 비디오, 게임 데이터 및 제어 입력들을 포함하지만 이에 한정되지 않음; 및 c. 특히 GB 2518602B 및 GB 2365360A의 시스템들, 및 발생할 때 실제 라이브 이벤트에 대한 기타 데이터를 수집 및 제공하는 기타 시스템들 및 추후 사용을 위한 라이브 이벤트들에 관련된 데이터를 저장하는 시스템에 여기서 설명된 향상들 및 개선들을 포함하는 실제 라이브 모터 스포츠들 또는 기타 스포츠 이벤트들. 구체적인 실시예들이 이제 첨부된 도면들을 참조하여 설명된다. 도 1을 이제 참조하면, 상기에서 설명된 3 개의 기본 요소들은 본 발명의 한정적이지 않은 일 실시예를 포괄하며 대략적으로 도시되어 있다. 보다 상세하게, 도 1은 통신 네트워크를 통해 중앙 게이밍 서버에 연결된 수 개의 서로 다른 게이밍 장치들을 보여준다. 게이밍 서버는 또한 다양한 유형의 운동 및 제어 데이터를 비교분석하기 위한 지역 데이터 저장소를 포함한 다. 도 1은 또한 트랙 주변의 다른 위치들에 위치되는 실제 차량들을 포함하는 모터 스포츠 이벤트의 트 랙을 보여준다. 각 차량에는 써킷 주변의 통신 인프라를 통해 무선으로 대응하는 팀 원격측정 데이터 캡쳐 컴퓨터로 데이터 스트림을 제공하는 차량 원격측정 시스템이 구비되어 있고 이로써 제어 데이터(차량의 운 전자 제어들) 뿐만 아니라 차량의 작동에 관련된 기타 데이터가 분석될 수 있다. 원격측정 데이터의 이 스 트림은 또한 차량 상의 온-보드 카메라로부터의 라이브 비디오 데이터 및 차량 상에 제공된 마이크로부 터의 오디오 데이터를 포함할 수 있다. 이 전체 원격측정 시스템은 각 팀의 데이터가 a. 팀 전용으로, b. 조직 및 관리 조직에 정의된 부분에서 이용가능하고 및 c. TV 및 기타 미디어 스트림에서 방송하기 위해 정의된 부분에서 이용가능하게 유지되는 것을 보장할 수 있다. 트랙에는 또한 센서들의 복수의 그룹들이 구비되어 있다(9 개의 이러한 그룹들이 대략적으로 도시되어 있고, 이에 한정되지 않고, 다른 수가 다른 실시예들에서 제공될 수 있다). 각 센서 그룹은 트랙 주변을 레이싱할 때 차량들로부터 방출되는 적외선 광을 검출하고 이 센서 데이터를 센서들의 시야(FOV)에서 각 차량에 대한 실제 운동학적 데이터로 변환하도록 구성된 복수의 트랙 측 적외선 센서들로 구성된다. 각 센서 그룹은 이 실제 운동학적 데이터를 개별적인 운동학적 데이터의 스트림들을 비교분석하여 트랙 상 의 모든 차량들에 대하여 운동학적 데이터의 스트림을 라이브 이벤트 데이터 캡쳐 서버로 제공하는 위치 데이터 캡쳐 시스템으로 통신할 수 있다. 팀 원격측정 데이터 캡쳐 시스템들로부터의 원격측정 데 이터의 스트림들 또한 라이브 이벤트 데이터 캡쳐 서버로 제공된다. 라이브 이벤트 데이터 캡쳐 서버는 추적 센서들의 복수의 그룹들, 팀 원격측정 시스템들을 포함하 여, 위치 데이터 캡쳐 시스템으로부터 수신된 정보를 비교분석한다. 이 모든 정보(실제 센서 데이터 스트림 )는 이 실시예에 있어서 데이터 통합을 제공하고 가상 레이스 시뮬레이션을 생성하는 게이밍 서버로 제 공된다. 가상 레이스 시뮬레이션은 이 실시예에 있어서 모든 게이밍 장치들로 제공된다. 하지만, 다른 실시예에 있어서(도 16 내지 도 20을 참조하여 이하에서 설명되는), 가상 레이스 시뮬레이션은 각 게이밍 장치/컴퓨터 상에서 생성되고 게이밍 서버는 단순히 전체 게이밍 프로세스를 통합한다. 도 5를 참조하여 이하에서 설명될 다른 일 실시예에 있어서, 라이브 이벤트 데이터 캡쳐 시스템은 또한 팀들에 의해 생성되는 모든 데이터를 포함하여 팀들로부터 수신된 기타 정보를 비교분석하고, 또한 오락 및 게이밍 기 능들에 관련될 수 있는 모터 스포츠 이벤트에 관련된 모든 기타 데이터를 망라하는, 일반적인 이벤트 데이터 캡 쳐 시스템을 가진다. 이 다른 일 실시예에 있어서, 모든 정보는 게임을 플레이하지 않는 팬들에 대하여 오락 피 드들을 제공하는 오락 및 게이밍 서버로, 가능하다면 허가받은 유통업체들을 통해, 제공되고, 그 전체는 원격측 정 데이터에 대하여 상기의 단락 62에서 설명된 모든 이해관계자들의 데이터 보안 니즈가 이하에서 설명되는 바 와 같이 충족됨을 보장한다. 도 6에 도시된 시스템의 게이밍 서버의 게이밍 측면들을 구성하는 요소들은 도 2에 대략적으로 도시되어 있다. 게이밍 서버는 라이브 이벤트 데이터 캡쳐 서버로부터 수신된 실제 데이터(센서 데이터 스트림들)을 처 리하기 위한 실제 데이터 프로세서를 가지고, 라이브 이벤트 데이터 캡쳐 서버는 이하에서 상세하게 설 명되는 바와 같이 그 기여하는 데이터 소스들(운동학적 데이터의 스트림들 및 라이브 원격측정 데이터 의 스트림들) 모두의 동기화를 보장한다. 이 수신된 라이브 이벤트 데이터는 라이브 이벤트로부터 현재 기록된 실제 데이터로서 데이터 저장소에 저장되고 또한 각각의 차량의 실제 운전자 입력들(제어 데이터 )를 그 차량의 운동 위치 데이터로 매핑하는 기준 블랙 박스 모델 생성기(이하에서 설명되는)를 생 성하는 데 사용되는 가상 레이스 시뮬레이션 엔진으로 전달된다. 용어 '블랙 박스'는 해당 기술 분야에서의 일반적인 의미로, 소위 입력 포트들에 적용되는 신호들에 대한 응답을 특징으로 하는 시스템 또는 엔진으로 사 용된다. 이 기준 블랙 박스 모델 생성기의 출력은 그후 가상 레이스 엔진 내에서 각각의 가상 차량의 위치 가 그 결과가 되어야 하는 위치를 결정하기 위해 통신 네트워크를 통해 게이밍 장치들로부터 수신되는 플 레이어 가상 레이스 명령들(운전 입력들, 38)에 접근하기 위해 사용된다. 해당 실시예에 있어서, 가상 레이스 명령 처리 엔진은 이 플레이어 가상 레이스 명령 데이터 스트림들을 수신하고, 이를 필요하다면 명령 형식으로 변환하여 이것을 가상 레이스 시뮬레이션 엔진에 제공하기 위해 제공된다. 실시간 라이브 레이스 데이터의 대체로서, 데이터 저장소 내에 저장된 라이브 이벤트로부터 이전에 기록 된 실제 데이터는 또한 가상 블랙 박스 기능을 생성하는 데 사용될 수 있다. 가상 레이스 시뮬레이션 엔진 은 또한 가상 레이스 시뮬레이션을 생성하기 위해 데이터 저장소 내에 저장된 데이터 모델들을 이 용한다. 마지막으로, AI 엔진이 기준 블랙 박스 모델 생성기(이하에서 설명되는)에 의해 생성된 블랙 박스 모델을 참조하여 운전자 입력들(가상 레이스 명령들)에 대한 가상 자동차의 응답을 조절하는 데 도움을 주 고 또한 스킬 및 경험 레벨들이 다른 실제 운전자와 가상 운전자들 간의 레이싱을 더 공정하게 만들기 위해, 가 능하다면 예를 들어 가상 운전자의 적립된 핸디캡을 참조하여, 가능하다면 다양한 정도로 가상 자동차의 운전자 (플레이어)에 도움을 주기 위해 선택적으로 제공된다. 예를 들어, 이 도움은 각 플레이어 입력(가상 레이스 명 령들) 주변의 임계치들을 확장하여 가상 차량에 대한 최적 위치와 동일시할 수 있다. 그러므로, 주어진 차 량 위치를 결과로 내기 위한 제어 데이터 입력들의 최적 세트를 결정하기 위해 기준 블랙 박스 모델 생성기를 이용하지만, 플레이어 제어 입력들은 자동차에 대한 주어진 위치를 결과로 내기 위해 이 특정 제어 데이터 입력들의 임계치들 내에 있을 수 있다. 이 임계치들이 조정되는 정도는 대응하는 가상 자동차의 제어 및 주 어진 플레이어에 대하여 AI 엔진에 의해 적용되는 핸디캡을 결정할 수 있다. AI 엔진은 특정 차량 위치 출력을 제공하기 위해 제어 데이터 입력들의 복잡한 조합들의 어레이에 대해 훈련될 수 있기 때문에 사용됨이 이해되어야 한다. 라이브 이벤트 데이터 캡쳐 서버로부터 이 실시예에서 수신되는 실제 차량 데이터는 도 3a에 대략적으 로 도시되어 있다. 여기서 특정 차량 데이터는 차량 ID 연결되고 또한 운동학적 실제 차량 데이터(예를 들어 길이방향 위치(52b), 측면 위치(52c) 및 방향 데이터(52a)) 뿐만 아니라, 운전대 위치(54a), 제동기 위치(54b), 가속기 위치(54c), 기어 선택(54d) 및 가능하다면 기타 액츄에이터 제어 입력들(미도시)와 같은 운 전자 입력 데이터(제어 데이터를 포함한다. 이것은 트랙 주변에서 레이싱하는 실제 차량들 각각에 대하여 제공된다. 게이밍 장치들/시뮬레이터들/컴퓨터들로부터 게이밍 서버에 이 실시예에 있어서 수신되는 가상 차량 제어 데이터(가상 레이스 명령들)는 도 3b에 대략적으로 도시되어 있다. 이 가상 제어 데이터는 게이밍 컴퓨 터 ID 뿐만 아니라 가상 차량 및 가능하다면 기타 데이터를 제어하기 위한 플레이어 액츄에이터 입력들(5 8)을 포함한다. 차량 제어 플레이어 입력들은 운전대 위치 데이터(58a), 제동기 위치 데이터(58b), 가속기 위치 데이터(58c), 기어 선택 데이터(58d) 및 가능하다면 기타 액츄에이터 제어 입력들(미도시)을 포함하고 또 한 실제 운전자로부터 측정된 정도 만큼 통상적으로 매칭되거나 또는 달라지므로 이로써 기준 블랙 박스는 이러 한 입력들의 결과로서 가상 차량 위치를 결정하는 데 사용될 수 있다. 게이밍 서버에서의 시스템의 일반적인 작동 방식은 도 4의 대략적인 흐름도에 도시되어 있다. 방법은 무 엇보다도 가상 참가자들 모두가 레이스에 참여하는 실제 차량들 중 하나에 할당되는 셋업 단계로 단계 62에 서 시작된다. 하나의 실제 차량은 이하에서 상세하게 설명되는 바와 같이 이에 할당된 복수의 플레이어들을 가질 수 있다. 다음으로, 가상 레이스 환경 모델은 레이스 써킷 데이터 모델 및 실제 차량들의 가상 표현들 의 초기 위치들을 포함하는 단계 64에서 생성된다. 이전에 언급된 바와 같이 이것은 라이브 이벤트로부터의 라이브 데이터 또는 이전에 기록된 라이브 이벤트로부터의 미리 기록된 데이터에 기초될 수 있다. 써킷 데이터 모델 및 가능하다면 기타 데이터 모델들은 가상 레이스 환경을 생성하기 위해 지역 데이터 저장 소 내에 저장된다. 레이스가 단계 66에서 시작되기만 하면, 라이브 이벤트로부터의 또는 미리 기록된 이벤트 로부터의 데이터(28, 42)의 스트림은, 레이스 기간에 걸쳐 정확한 시간 포인트 시퀀스에서 측정 및 동기화된 값 이 단계 68에서 수신되기 때문에 실제 자동차들 모두에 대한 정확한 운동학적 데이터를 포함하고 또한 이를 이용해, 실제 레이스 차량들의 표현들의 위치들은 변경될 수 있다. 이 새로운 위치들은 단계 68에서 관련된 플레이어에게 디스플레이하기 위해 이 레이스에 대해 등록된 게이밍 장치들로 이후에 전송(미도시)되 는 가상 레이스 환경에서 실제 차량들의 표현들을 위한 새로운 위치들을 생성하는 데 사용된다. 응답하여, 게이밍 서버는 단계70에서 그의 가상 차량을 제어하기 위한 플레이어의 사용자 입력들을 나타내는 게이밍 제 어 데이터를 수신한다. 이 플레이어의 사용자 입력들은 그후 기준 블랙 박스 모델 생성기의 입력들에 비교되고 이것은 단계 72에서 플레이어의 사용자 입력들의 결과로서 가상 차량들의 후속 위치들을 생성하는 데 사용된다. 가상 차량들의 이 새로운 위치들은 일부 실시예들에 있어서(이하의 다른 실시예의 상세한 설명 참 조) 그후 게이밍 장치들 각각으로 전송(미도시)될 수 있다. 단계 68 내지 74의 이 절차는 단계 76에서 결정 되는 레이스의 종료까지 계속된다. 본 실시예의 시스템의 작동 방법은 이하의 유리한 특징들을 특징으로 한다: a) 수백 만 명의 플레이어들 및 전세계 추종자들에게 동시에 어떠한 유형의 환경에서든 실제 모터 스포츠 이벤 트로부터의 정확하고 시기적절한 라이브 데이터를 제공하고; b) 모든 스킬 및 경험 레벨들의 컴퓨터 게임 플레이어들에게 이하 중 하나로서 실제 레이스에 참여하는, 실감나 고, 도전적이고, 만족스럽고 공정한 시뮬레이션을 제공하고; i. 실제 운전자들 및 게임에서 표현되는 모든, 제한된(실제 운전자들의 수 - 1) 수의 다른 플레이어들과 레이싱 하는 한 명의 플레이어로서; 또는 ii. 어떠한 수(잠재적으로 수백만 명의) 다른 플레이어들 및 가능하다면 게임에서 표현되는 모든 또는 일부의 실제 운전자들을 포함하여, 조직화된 이스포츠 이벤트 또는 기타 컴퓨터 게이밍 이벤트에서 한 명의 플레이어이 자 경쟁자로서; c) 이에 한정되지 않지만, 팀들(또는 심지어 운전자들)에게 이벤트에 참여하는 플레이어들에 대한 정보를 실시 간으로 보여주는 것을 포함하는 목적으로, 레이스 이벤트 중 전세계 어떠한 수의 플레이어들 및 추종자들로부터 실제 레이스 팀들 및 실제 운전자들로 데이터를 선택적으로 제공하고; 및 d) 모터 스포츠 추종자들에게 이들이 이벤트에 대한 참여와 즐거움을 향상시키고 상호작용하도록 라이브 이벤트 에 연결된 실제 이벤트 및/또는 모든 플레이어들 및/또는 모든 이스포츠 경쟁자들로부터의 데이터를 선택적으로 제공한다. 다른 일 실시예에 있어서, 도 2를 참조하여 상기에서 설명되는, 게이밍 서버는 도 5에 도시된 바와 같이 게 이밍 & 오락 서버(4a)로 대체될 수 있다. 이 게이밍 및 오락 서버(4a)는 게이밍 서버와 동일한 방식으로 작동하 지만 추가적인 기능을 부가한다. 따라서, 간결함을 위해, 도 2의 게이밍 서버와 도 5의 게이밍 및 오락 서버 (4a) 사이의 차이들만 이제 설명될 것이다. 도 5를 참조하면, 게이밍 & 오락 서버(4a)의 구성요소들은 도 2의 게이밍 서버와 동일하고, 동일한 참조부호들 이 사용된다. 차이들이 있다면, 새로운 참조부호들이 도입된다. 따라서, 이 실시예에 있어서 게이밍 & 오락 서 버(4a)는 추가적으로 게이밍 장치들 및 기타 오락 장치들(미도시)로부터 기타 데이터(38a), 가상 레이스 명 령들 및 시청자 명령들을 수신하는 레이스 시뮬레이션 & 오락 엔진(36a)을 포함함을 알 수 있다. 이 데이터는 오락/레이스 명령 & 데이터 처리 엔진(40a)을 거쳐 레이스 시뮬레이션 및 오락 엔진(36a)을 통해 수집되고 라우 팅된다. 나아가 레이스 시뮬레이션 및 오락 엔진(36a)으로 데이터를 제공하는 도박 엔진 및 광고 엔진이 제 공된다. 위치 데이터 캡쳐 시스템으로부터의 정확한 추적 데이터의 이용가능성에 기초하여 제공될 수 있는 많은 오락 향 상 특징들이 있고 단 3 가지만 이하에서 예를 들어 설명될 것이다. 첫번째는 이동하는 시점으로서, 이로써 오락 장치로부터의 시청자 명령들에 기초하여, 도 2의 가상 레이스 시뮬레이션 엔진과 공통되거나 또는 매우 유사한 오락 엔진 내의 소프트웨어 기능들에 의해, 라이브 비디오 스트림이, 예를 들어 실제 자동차들 중 하나의 운전 자의 관점으로부터, 심리스하게 예를 들어 자동차 상의, 컴퓨터-생성 관점으로 스위칭되거나 또는 보여질 수 있 다. 두번째 예는 센서들 또는 자동차 상의 기타 소스들로부터 도출되는 라이브한 기술적 데이터에 기초하여, 예 를 들어 온도에 따른 타이어들의 색상 또는 자동차 부품들의 내부('under-the-hood’) 그래픽들과 같이, 라이브 비디오에 확실하게 통합되는, 컴퓨터 생성 디스플레이들 또는 오버레이들을 갖는 라이브 비디오 스트림의 증강 이다. 이것은 예를 들어 실제 자동차들 중 하나의 운전자의 관점으로부터, 트랙 주변 광고판들 또는 다리들 또 는 자동차 상에 확실하고 심리스하게 통합된 광고 이미지들을 갖는, 라이브 비디오 스트림의 증강으로 확장될 수 있고, 광고 엔진으로부터의 컴퓨터 생성 광고들은 트랙 주변 풍경 또는 자동차들과 함께 역동적으로 움 직여서 라이브 비디오 스트림에 등장하는 광고들과 구별불가하게 된다. 이 광고는 특정의, 알려진 사용자에게 스트리밍하기 위해 결합되기 때문에, 광고는 오락 명령들 및 데이터 처리 기능들에 수신된 데이터 및 광고 엔진 에 포함된 알고리즘에 기초하여 사용자에게 맞춰질 수 있다. 세번째 예는 예를 들어 \"1호차가 다음 20초 안 에 인사이드 라인에서 2호차를 추월한다\"와 같이, 오락 시청자가 실제 레이스에서 펼쳐지는 이벤트에 라이브 배 팅을 할 수 있는 능력이다. 도박 엔진은 이러한 기능을 가능하게 해주고 이것을 레이스 시뮬레이션 및 오락 엔 진(36a)으로 제공한다. 이제 본 발명에 의해 제공되는 시스템들 및 방법들의 예를 통해, 상기에서 한정적이지 않은 실시예에 도입되는, 추적 센서 그룹들을 포괄하는 위치 데이터 캡쳐 시스템의 구체적인 작동의 설명이 이어진다. 상기의 실 시예의 위치 데이터 캡쳐 시스템을 더 명확하게 이해하기 위해 먼저 요구되는 레이싱 트랙을 참조한다. 도 6을 참조하면, 하나의 고성능 IR 센서에 의해 상부에서 모니터링될 수 없는, 특히 요구되는 레이싱 써킷 의 일 예가 도시되어 있고 또한 실시간 대화형 게이밍을 위해 필요한 데이터를 제공하기 위해, 센서들 및 통신 장비의 새로운 시스템을 필요로 한다. 라이브 모터 스포츠 이벤트의 설명 예가 12 개 팀들에 24 대의 실제 자동차들을 포함하는 국제 포뮬러 1 레이스이기 때문에, 그 각각은 정비소들, 창고들, 및 기타 장비를 가 진다. 레이스 위치는 특히 도 6에 도시된 복잡한 써킷이다. 이것은 높은 건물들, 다리들 및 터널들을 포함하는 시가지에 있고 다양한 유형들의 영구적인 도로 및 교통 인프라 뿐만 아니라 관중석과 같은 일시적인 인프라도 가진다. 이벤트가 열리는 연중 시기와 장소에 따라 광범위한 대기, 날씨 및 조명 조건들이 적용된다. 도 7a 및 도 7b는 써킷 표현의 충실도가 충분히 정확하고 올바름을 증명하는 문제를 극복할 수 있는 방식으로 실제 차량들의 측정된 운동학적 데이터와 게임 플레이어의 가상 자동차의 가상 운동학적 데이터 간의 연결 들이 실시간으로 만들어질 수 있음을 보장하기에 적절한 레이싱 써킷의 매우 대표적인 컴퓨터 기반의 데이터 모델을 생성하기 위한 해당 실시예들에서 사용되는 2 가지의 가능한 전략들을 보여준다. 이 모델은 추 적 센서들의 네트워크 내의 각각의 추적 센서가 써킷의 일 부분의 실제 시야(FOV) 뿐만 아니라 실제 FOV 와 레이싱 써킷의 데이터 모델의 일 부분 사이의 관계를 그 메모리 내에 가질 것이기 때문에 실제 환경 및 실제 이벤트와 컴퓨터 게이밍 환경 및 컴퓨터 게이밍 이벤트 간의 필수적인 연결이다. 이러한 방식 으로, 자동차 상의 IR 반사기들 또는 IR 방출기들의 이미지들, 또는 자동차로부터의 자연적인 열 적외선 방출들 의 이미지는 추적 센서 내에서 레이싱 써킷 데이터 모델의 항들로 표현되는 운동학적 데이터로 변환된 다. 또한 추적 센서들로부터의 원시 데이터가 전체 시스템의 다른 구성요소로 먼저 통신되는 것 또한 써킷 데이터 모델에 대한 원시 데이터의 관계가 처리를 위해 게이밍 서버로 전달되기 전에 계산되는 다른 실시예에서 가능함에 유의해야 한다. 도 7a를 더 상세하게 참조하면, 근접하게 이격된 경도 및 위도 선들의 직교 그리드를 포함하는 데이터 모델 을 위한 기초의 일 예가 도시되어 있다. 그리드 선들의 간격은 추적 센서들에 의해 달성될 수 있고 또 한 컴퓨터 게이밍 소프트웨어에 의해 요구되는 추적 정밀도에 적절하다. 이 모델에 있어서의 운동학적 데이터는 통상적으로 각각의 차량에 대한 적어도 길이방향 데이터(52b), 측면 데이터(52c) 및 회전 방향 데이터(52 a)를 포함한다. 써킷 모델은 또한 가상 대화형 하이브리드 환경이 수직 중력(g-forces), 가속도 등을 시뮬레이 션할 수 있도록 위-경도 그리드 내의 각 셀에 대한 정확한 고도 데이터를 포함할 수 있다. 도 7b는 계산에 있어서 우아함을 촉진시키는 다른 모델을 보여주는데; 써킷은 그 각각이 측면 스트립의 측면 중 심점의 지리적 위치(위도, 경도 및 고도), 방향, 측면 폭 및 가능하다면(일부 실시예들에 있어서) 측면 경사각 또는 고도 프로파일을 가지는, 측면 스트립들의 연속으로 모델링된다. 각각의 자동차에 대한 운동학적 데이터는 이때 - 도 3a에 반영되어 있는 바와 같이 - 적어도 트랙을 따르는 길이방향의 위치(52b), 트랙의 폭을 가 로지르는 측면 위치(52c) 및 회전 방향(52a)를 포함한다. 써킷의 컴퓨터 게임 데이터 모델과 실제에 있어서의 써킷의 지형 간에 매우 높은 정확도를 갖는 관계는 역사적 으로 놀라울 정도로 설립하기에 어려웠다. 현재 실시예의 전체 시스템을 이용해, 이것은 예를 들어 정적 IR 반 사/방출 마커들(미도시)을 각 카메라의 FOV 내의 레이스트랙의 둘레를 따라 정확하게 측정 위치들에 배치하 고 매우 정확한 물리학적 데이터-모델 매핑을 생성하는 것에 의해, 각 센서의 시스템 셋업 시에 캘리브레이 션에 의해 해결될 수 있다. 동적 캘리브레이션은 일부 실시예들에 있어서, 추적 성능을 조정하고 센서들 간 의 연속성을 달성하기 위해 예를 들어 레이스트랙의 각 모서리를 따라 특수 목적의 캘리브레이션 차량을 운 전하거나 또는 단계를 이동하는 것에 의해 달성된다. 본 발명자들은 도 6에 도시된 바와 같은 이러한 복잡한 환경의 지형은 '스타' 구성에 있어서 요구되는 100 또는 그 이상의 추적 센서들을 중앙 위치 데이터 캡쳐 시스템에 연결하는 것을 배제하여 이들 모두가 병렬로 통신한 다는 것을 이해한다. 무선 통신에 있어서 100 개의 독립적이고 신뢰할 수 있는 신호 경로들이 발견될 가능성은 거의 없고 유선 연결들은 도시 전체에 걸쳐 방사상으로 퍼져 있는 100 km 정도의 케이블을 수반할 것이므로 이 는 매우 불리하다. 이 기술에 있어서 신뢰할 수 있는 하나의 경로는 써킷 주변에 추적 센서들을 폐루프 기하구조로 연결하는 것이다. - 이 경우에 있어서 그 써킷 상의 또는 그 근방의 적어도 하나의 점은 실시간으로 데이터를 누적해야 할 것이다. 단지 하나의 점이라면, 그때는 일부 센서들로부터 필요한 장비 간 적어도 50 개 의 개별적인 데이터 홉들이 있을 것이고 또한 누적된 데이터 전송 지연들은 참을 수 없을 것이다. 2 명의 지리적으로 분리된 플레이어들/컴퓨터들(A & B) 간의 실시간 대화형 게이밍은 게이밍 장치(A)에의 플레 이어 입력들의 효과들이 20 내지 40 ms 이내에 게이밍 장치(B)에 의해 수신되고 처리될 것을 필요로 하고, 또한 마찬가지로 병렬로, 25 내지 50 Hz의 전형적인 컴퓨터 게임 업데이트 속도에 의해 결정된다. 용어 '컴퓨터 게임'은 시뮬레이션된 환경과 동의어이고 또한 대화형 하이브리드 환경을 포함하는 것으로 이해되어야 한다. 현 재 실시예들에 있어서, 추적 센서들을 포함하는, 전체 위치 데이터 캡쳐 시스템은, 써킷 상의 24 대의 실제 자동차들 모두를 위한 플레이어 입력들과 등가를 제공하는 것으로 간주될 수 있고 이 데이터는 유사한 지연 시 간 딜레이 이내에서 원격 게이밍 장치들로 공급되어야 한다. 동기화를 보장하기 위해 데이터-시간 태깅을 이 용함으로써 데이터 스트림에 1 초의 전체 시간 지체를 도입하는 것은 가능하지만 (이하에서 보다 더 상세하게 옵션으로 설명되는), 이것은 전체 라이브 게이밍 경험을 라이브 비디오와 같은, 다른 정보 스트림들 뒤에 배치 하게 될 것이고, 이것은 바람직하지 않다. 따라서, 100Hz (10 ms 지연까지)의 적외선 카메라 프레임 속도를 가 지고 또한 원시 이미지 신호 처리를 위해 5 ms을 더 허용하면, 써킷 주변 센서들로부터 데이터 집계 및 그 전방 통신을 위해 대략 20 내지 30 ms만이 허용될 수 있다. 유선 또는 무선 기술들에 있어서 발명자들은 이 를 고려하여 추적 센서 써킷을 따르는 50 홉들은 이 실시예에 있어서 허용될 수 없고 또한 추적 센서 써킷을 따 르는 10 홉들 이하가 통신 기술 에있어서 예상되는 발전을 고려하더라도 필수적이라고 결정했다. 도 1에 도시된 센서들의 그룹들은 이로써 고성능 지역 네트워크로 배치되는 센서들의 소그룹들을 갖는 IP 센서 네트워크 아키텍쳐로 변환되지만, 시청 각도 기하구조, 시선들, 엄폐물들(자동차들 간 및 자동차들 과 인프라 간), 이용가능한 장착 점들, 이미지 해상도(통상적으로 640x512 또는 1280x1024) 및 프레임 속도(통 상적으로 100Hz)와 같은 IP 센서 능력들, \"목표 화소들(pixels-on-target)\"(통상적으로 >4가 요구되는)의 수와 같은 이미지 처리 파라미터들, 요구되는 추적 정밀도(측면으로는 10cm 이상이고, 고속이지만 차간 상대 속도는 훨씬 더 낮기 때문에 길이방향으로는 덜 엄격함), 각 센서의 FOV 내에서 최대 자동차 속도, 최악의 경우에 있어 서 실행 시간 등을 포함하는 다양한 기타 요인들을 고려하여 도 6의 실제 써킷에 대하여 맞춰지고, 전반적인 목표는 적어도 25Hz의 업데이트 주파수 및, 실시간 지체가 필요하다면, 1초 이하의 전체 실시간 지체를 가지고, 공통의 정확한 시간 기반으로 동기화된, 24 대의 자동차들 각각에 대한 도 3a(예를 들어)의 운동학적 데이 터를 포함하는, 도 1의 포지셔닝 데이터 캡쳐 시스템으로부터의 출력을 가지는 데 있다(도 3a의 실제 운전 자 입력 데이터는, 팀들에 민감하고 비밀스러운 것으로서, 게이밍 장치들로 전송되거나 또는 중앙 게이밍 서버 에서 사용되고 모든 게이밍 장치들로 전송되지 않는다면 정해진 또는 동적인 암호화를 이용해 보호됨에 유의해 야 한다). 특정 써킷에 대한 아키텍쳐 정의 방법을 설명하기 위해, 복수의 가능한 센서 그룹들에의 예시적인 접근 들은 이하에서 보다 상세하게 설명된다. 이 예들은 어느 정도는 오늘날의 이용가능한 기술들의 기능들 (capabilities), 예를 들어 IR 카메라 이미지 해상도들, 프레임 속도들, LED 세기 등에 달려 있고, 이 기술들은 빠르게 발전하고 개선되고 있음에 유의해야 한다. 도 8은 특정 등급의 레이싱 자동차들이 있는 특정 유형의 레이싱 써킷 부분들을 모니터링하는 데 적합한 특 정 센서 배치들의 대표적인 구성들을 보여준다. 이 특정(F1) 자동차들은 공기역학적으로, 앞으로 기울 어진 낮은 프로파일을 가지는데, 이것은 추적 센서들이 트랙에 비해 높은 위치에 있다고 가정하고, 전진하 는 자동차들을 향하면, 즉 FOV가 전진하는 자동차들을 바라볼 때 수평 면에 예각인 보어사이트(boresight)를 가 지고, 고속에서 신뢰성 있게 검출될 가능성이 높음을 의미한다. FOV의 보어사이트는 FOV의 중심축으로 간주된다. 이 배치는 또한 센서들이 편리하게 지면에 더 근접하여 위치될 수 있고 GB2585165A의 바로 아래 로 향하는 센서들에 비해 증가된 FOV를 가짐을 의미한다. 일부 상황들에 있어서, 더 적은 수의 센서들이 트 랙을 모니터링하는 데 필요할 수 있는 경우에 있어서는 훨씬 더 긴 기둥들 또는 다른 구조적 장착 점들이 적절할 수 있고 또한 수평에 대한 보어사이트 각도는 증가될 것이다. 다른 유형의 위치들 또는 다른 유형의 모 터 레이싱 이벤트들, 예를 들어 파워 보트 레이싱(power boat racing) 또는 나스카 모터 레이싱(NASCAR motor racing)에 대하여 다른 구성들이 유사하게 정의될 수 있다. 도 6에 도시된 써킷 예를 구체적으로 참조하여, 센서들이 위치 데이터 캡쳐 시스템을 제공하기 위해 배 치될 수 있는 방식이 이제 설명된다. 첫번째로, 표준 가로등들이 비치된 도 6의 써킷 중 전체 2km 부분들에 대하여, 도 8은 트랙의 이 부분의 가 로등들에 장착된 IR 센서들의 그룹들의 다양한 가능한 배치들 중 하나를 보여준다. 각 센서(센싱 장치)는 640x512 화소들의 예시적인 해상도, 대략 20°에서 30°만큼의 시야(관점들(A 및 B 참조)) 및 50m 까지 의 검출 범위를 가진다. 이 기하구조에서, 이하의 구현 센서 장치 배치들 중 어느 하나를 이용해, 못해도 10cm의 해상도까지 신뢰할 수 있는 검출을 달성하는 것이 가능한 것으로 간주된다: a) 자동차(그 타이어들, 엔진, 배기관 등)에 의해 방출되는 열 IR을 검출하거나 또는 자동차에 IR 비방출 마커 들 또는 물질을 적용하거나 또는 부착함으로써 생성되는 열 IR '냉점들'을 검출하는, 장파 적외선(long wave infra-red, LWIR) 마이크로볼로미터(microbolometer) 또는 중파 적외선(medium wave infra-red, MWIR) 광자 감 지(photon detecting) (또는 기타 적절한 기술의) 카메라. b) 자동차에 장착된 적어도 2 개의 작은 LED들 또는 LED 클러스터들에 의해 방출되는 광대역(또는 협대역) 광을 검출하거나 또는 자동차 상의 반사기들로부터 천연(태양광 유도) IR 광을 검출하거나 또는 자동차 상의 IR 비- 방출기들로부터 냉점들을 검출하는, 단파 적외선(short-wave infra-red, SWIR) 또는 근적외선(near infra-red, NIR) 광자 감지(또는 기타 적절한 기술의) 카메라. LED들에 의해 방출되는 광은 일정하거나 또는 시간에 따라 변조될 수 있다. c) IR 카메라 근방에 위치되는 LED 투광등에 의해 제공되고 또한 자동차에 장착된 적어도 2 개의 작은 반사기들 에 의해 반사되는 광대역(또는 협대역) SWIR 또는 NIR 광을 검출하거나 또는 자동차 상의 IR 비-방출기들로부터 반사된 이미지 내에서 냉점들을 검출하는, SWIR 또는 NIR 카메라. 이것은 야간 레이싱을 가능하게 할 것이고 LED 투광등은 극한 날씨 환경들에서 검출 성능을 개선시키기 위해 펄스화 및 카메라의 이미지 캡쳐에 동기화될 수 있다. 상기에서 기술된 바와 같이, 카메라 초점 평면 어레이 상의 원시 이미지에 있어서 개별적인 목표들(LED 방출기 들, 반사기들, 비-방출기들 또는 자동차/타이어들) 모두의 위치는 신호 처리 및 추적 센서들의 특정 배치들, 구 성들 및 방향들에 맞춰진 지형학적 계산들에 의해, 가능하다면 그 외부의 물리적 엔벨롭과 관련하여 자동차 상의 2 개의 방출기들(또는 반사기들 또는 비-방출기들) 각각의 측정된 상대적 위치들을 포함하여, 써킷 모델 내의 정확한 위치들로 변환된다. 이러한 기술들은 당업자의 능력 내에 있으므로 여기에서 더 설명할 필요는 없다. 개별적인 자동차들의 식별 및 추적의 연속성은 GB2585165A에서와 같이 자동차가 그 FOV를 떠남에 따라 자동 차의 위치를 다음 센서로 통신하는 각각의 추적 센서에 의해 달성될 수 있다. 상기의 b)에서 설명된 SWIR 또는 NIR 카메라의 배치와 관련하여, LED 광은 일정하거나 또는 각각의 자동차에 대하여 상이한 패턴(또는 IR 서 명)을 방출하는 방식으로 변조될 수 있음에 유의해야 한다. 이것은 각각의 추적 센서에 의한 동시 추적 및 식별 을 가능하게 하여 추적 센서들이 다음 추적 센서로 차량 식별자를 '인계(handing over)'할 필요성을 제거할 수 있다. 두번째로, 건물의 상단에 또는 이동식 붐 리프트(최대 45m) 또는 접근 플랫폼(최대 100m)에 장착되거나 또는 드 론 또는 테더드 드론과 같은 공중 운송수단에 실려(이로써 전력은 연장된 비행 시간 동안 지상국들(ground stations)로 전달되는 데이터를 위해 공급될 수 있음), 더 높은 높이에 위치되는 하나의 IR 카메라에 부여 되는 써킷 주변 위치들(예를 들어 도 6의 흑색 사각형들)이 있을 수 있다. 100m 높이에서, 광각 렌즈가 장착된 하나의 IR 센서의 FOV는 140m x140m 정도 연장된다(도 6 상의 흑색 사각형들은 축적에 있어서 예시적이다). 일부 써킷들 상에 완전한 폐루프 네트워크를 형성하기 위해 써킷 주변에 수 개의 드론-장착 센 서들을 배치하는 것은 바람직할 수 있다. 각각의 드론은 그 자체의 온보드 GPS를 이용해 스테이션 상에 정 지하여 이로부터 절대적 추적 검출 정확도가 달성될 수 있도록 지면 상에 고정된 IR 비콘들의 배치를 참조하여 정확한 이미지를 제공할 수 있다. 이것은 전체 써킷을 커버하기 위해 더 적은 수의 센서들이 필요하기 때문에 효율적인 배치이고 이 배치의 배치 용이성은 센서들이 영구적으로 설치될 필요가 없는 써킷들에 매우 좋다. 고 성능 모터 레이스 위로 날아다니는 드론들에 있어서 안전한 예는, 드론들이 써킷 또는 관중석 바로 위에 있을 필요가 전혀 없기 때문에, 실행가능하다. 테더드 드론들(tethered drones)은 고장난 드론이 기지국 주변의 정의 된 사고 구역(crash zone)으로 조속하게 감겨 내려질 수 있기 때문에 특별한 장점을 가질 수 있다. 세번째로, 도 8의 짧은 가로등들(84a)에는 그 각각이 대략 15m 길이의 짧은 도로 부분을 커버하는 넓은 FOV(70 °) IR 센서들이 장착될 수 있고, 센서들이 터널의 지붕에 부착될 수 있는 터널 내에도 동일하게 적용 된다. 다른 실시예에 있어서, 짧은 가로등들을 사용하지 않고 그 각각이 최대 50m 길이의 도로 부분을 커버"}
{"patent_id": "10-2022-7040921", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "하는, 최대 30m 높이의 이동식 기둥들을 채용하는 것이 더 비용효율적일 수 있다. 요약하면, 3.3 km 길이의 복 잡한 써킷인 이 예는 50 개의 표준 센서들, 50 개의 광각 센서들 및 2 개의 장거리 하이 플랫폼 또는 드론-장착 센서들을 필요로 한다. 많은 레이싱 써킷들 상에 가로등들은 안전 문제로 존재하지 않을 수 있거나 또는 더 넓게 이격되고 더 길 수 있 거나 또는 자동차들에 안전 위험을 부여하지 않도록 보호되어야 할 수 있음에 유의해야 한다. 건물들 상에 일시 적으로 추적 센서들을 장착하거나 또는 적절하게 배치되는 이동식 기둥들을 사용하는 것이다양한 실시예들에 있어서 필요하거나 또는 바람직할 수 있다. 마지막으로, 상기에서 기술된 실시간 데이터 스트리밍 성능 기준을 달성하기 위해 이 예의 지상-기반 및/또는 드론-장착 추적 센서들은 도 1에 대략적으로 도시된 바와 같이 복수의 그룹들로 조직되지만, 도 9에 보다 상세하게 도시된다. 도 9는 위치 데이터 캡쳐 시스템의 전체 실시간 성능을 달성하기 위해 어떻게 센서들 이 그룹들 내에 배치되는지 또한 실시간 대화형 게이밍 환경으로의 전송에 적합한 적절한 지연을 갖는 하나의 완전한 지속적인 동기화된 데이터 스트림을 제공하기 위해 어떻게 센서들 및 그룹들이 데이터를 통신할 수 있는지에 대한 예시적인 일 예를 보여준다. 도 9는 다른 구성들이 다른 실시예들에 있어서 는 가능하지만, 가로등들 상에 장착된 7 개의 센서들의 하나의 그룹을 보여준다. 요구되는 완전한 커버 리지를 제공하기 위해 복수의 그룹들이 트랙 주변에 생성된다. 이러한 방식으로, 레이싱 써킷 주변에 제공되는 추적 센서들의 완전한 세트는 대화형 게이밍에 요구되는 낮은 지연 및 동시성을 달성하면서 병렬 적으로 실제 자동차들 모두에 대하여 하나의 데이터 스트림을 생성하는 하나의 그룹으로서 행동하도록 만들 수 있다. 도 9를 보다 더 상세하게 참조하면, 각 그룹 내의 센서들은 고성능, 저지연 통신 링크로 연결된다. 이러한 통신 링크들은 적절한 통신 기술을 이용한다(지상-기반 센서들에 대해서는 데이터 속도 > 900Mbit/s, 지연 100 내지 500 ㎲를 갖는 - 기가비트 이더넷과 같은 유선 연결을 통해서일 수 있거나 또는 지상-기반 또는 드론- 장착 센서들은 데이터 속도 > 90 Mb/s, 지연 1 내지 2ms - 듀얼밴드 Wi-Fi와 같은 무선 연결일 수 있다). 센서 들의 각 그룹에는 통상적으로 광섬유(\"유선\") 또는 무선 네트워크들에서 사용되고 또한 종종 모터 레이싱 스포츠에서 원격측정 데이터를 스트리밍하기 위해 사용되는 것과 같이, 전방 통신 노드(onward communication node, 88)가 장착될 수 있다. 전방 통신 노드는 유선 또는 무선으로 라이브 이벤트 데이터 캡쳐 서버로 통신하도록 구성되고 모든 24 대의 자동차들에 대한 위치 데이터는 전방 전송을 위해 적어도 25 Hz의 리프레쉬 속 도로 누적된다. 이에 더하여, 또한 써킷별로 네트워크 주변의 사실상의 통신 시간 지연에 따라, 센서들의 전체 세트, 또는 센서들의 각 그룹, 또는 일부 실시예에 있어서 각 센서에는 GPS 수신기가 장착될 수 있고 이로써 공통의, 정확한 시간 기준이 센서 네트워크에 설립될 수 있다. 자동차들에 대한 정확한 위치 측정들 은 그후 이것이 게이밍 서버로의 전방 전송에 작은 지체(<1초)를 발생시킬지라도, 라이브 이벤트 데이터 캡 쳐 서버가 자동차 위치 데이터를 요구되는 동시발생 세트들(contemporaneous sets)로 집계할 수 있도록 시 간 태깅될 수 있다. 또한, 본 발명에 의해 제공되는 대화형 하이브리드(실제-가상) 게이밍 환경과 관련된 시스템들 및 방법들의 예로서, 도 10a 내지 도 14를 참조하여 제공되는 상기의 한정적이지 않은 실시예의 구체적인 작동의 상세한 설 명이 이어진다. 이 예에 있어서 도 10a는 24 대의 실제 자동차들 및 운전자들이 관여하는 포뮬러 1 모터 레이스의 시작 구성을 보여준다. 이 실제 자동차들의 표현들(89a, 89b, 89c, 89d,...89x)은 컴퓨터 게임에 단지 한 명의 플레이어 와 연결되고, 여기서 실제 자동차 표현(89f)은 그 시작 위치로서 플레이어에게 할당되거나 또는 선택되어, 그의 시뮬레이션되는 자동차의 표현은 실제 자동차 표현(89f)에 정확히 오버레이된다. 도 10a에 따르면 상기에서 설명된 첫번째 경우는 실제 자동차(12f)가 실제 이벤트 내에 있기 때문에 레이스 시 작 시 컴퓨터 게임 내의 동일한 위치에 있는 시뮬레이션된 자동차를 제어하는 한 명의 컴퓨터 게임 플레이 어와 관련이 있다. 레이스 시작 후, 시뮬레이션된 자동차의 진행은 플레이어가 그 컴퓨터 장비(게이밍 장치 /컴퓨터)로 발생시키는 입력들 및 게이밍 서버에 의한 환경 및 자동차의 시뮬레이션들에 의해 결정된다. 실제 자동차 표현의 진행은 운전자가 실제 자동차에 발생시키는 입력들 및 극히 복잡한 환경에서 극히 복잡한 자동차의 물리학적 행위에 의해 결정된다. i) 자동차 및 그 환경의 시뮬레이션들의 충실도에 있어서 의 부족들 또는 ii) 플레이어와 운전자 간의 입력들의 차이들 중 하나로 인해, 시뮬레이션된 자동차의 진행 은 실제 자동차(12f)로부터 벗어날 것이다. 해당 실시예는 이전의 원인을 최소화하고 이로써 실제 운전자와 가 상 플레이어 간의 경쟁을 가능한 한 공정하고, 현실적이고 즐겁게 만든다. 설명된 실시예들의 방법들의 주요 특징들 중 하나는, 시뮬레이션된 자동차가 실제 자동차 표현(89f)에 충분 히 근접함을 유지하는 동안 다양한 방식들로 정의될 수 있는 허용범위 내에서(이하의 설명은 시뮬레이션된 자동 차가 실제 자동차 표면에 '스냅핑'되는 것으로 지칭될 것임), 컴퓨터 게임은 가능하다면 이하를 포함하 지만 이에 한정되지 않는, 특정 행위들을 보여주고 또한 실제 자동차와의 상호작용들을 증가시킬 것이다: a) 실제 자동차 표현은 디스플레이되지 않고 또한 스냅핑된 플레이어의 게임의 일부로서 플레이어의 시뮬레 이션된 자동차와 상호작용하지 않을 것이고; b) 스냅핑된 플레이어의 자동차는 실제 자동차 표현과 '디지털 트위닝(digitally twinned)'될 수 있고, 시뮬레이션된 자동차는 실제 자동차 표현의 성능을 운전자와 플레이어 간의 경쟁에 있어서 공정하도록 충분히 근접하게 복제하고; c) 실제 운전자의 입력들(제어 데이터)(운전대, 가속기, 기어 선택 등)은 스트리밍될 수 있고 또한 실시간 으로 게이밍 서버에 의해 생성된 대화형 하이브리드 환경에 이용가능하고, d) 실제 자동차, 그 운전자 및 더 넓은 레이싱 팀로부터의 오디오, 비디오 및 기타 데이터 피드들은 실시간 으로 게이밍 서버에 의해 생성되는 컴퓨터 게임(대화형 하이브리드 환경)으로 스트리밍될 수 있고; e) 스냅핑된 플레이어로부터의 오디오, 비디오 및 기타 데이터 피드들은 실제 자동차 및/또는 팀 및/또는 다른 컴퓨터 게이머들에 역으로 이용가능하다. 도 10b는 플레이어의 시뮬레이션된 자동차가 순간적인 위치 및 가능하다면 실제 자동차 표현(89f)으로부터 알려진 정도로 속력, 속도 및 가속도와 같은 기타 특성들에서 벗어나는 레이싱 상황을 보여준다. 여기서 플레이 어의 자동차가 실제 자동차 표현(89f)에 스냅핑될 때를 정의하는 단순히 비한정적인 방법이 도시되어 있다. 게이밍 서버에서 실행되는 컴퓨터 게임 소프트웨어 내에서, 실제 자동차 표현(89f) 상의 기준점(94f)의 레이 스 트랙 상의 위치는 근접 영역(96f), 이 경우에 있어서는 사각 박스를 정의하는 데 사용된다. 시뮬레이션된 자 동차 상의 등가의 기준점의 위치가 근접 영역(96f) 내에 포함되면, 그때는 플레이어의 자동차가 실제 자동차 표현(89f)에 '스냅핑'된다. 실제 자동차 표현에 대하여 플레이어의 자동차 표현이 시간상으로 얼마나 앞서거나 뒤쳐졌는지와 같은 기타 파라미터들에 종속할 수 있는, 많은 다른 가능한 스냅핑 방법들이 있다(앞선 자동차의 특정 범위 내에 있 다면 추격하는 자동차가 '부스트'를 달성할 수 있는 F1 DRS(Drag Reduction System)에서 사용되는 바와 같이). 다른 스냅핑 방법들은 속력, 속도 벡터들, 각 운동량, ...을 포함할 수 있지만, 원칙은 명확하다. 이에 더하여, 컴퓨터 게임 AI 엔진은 더 유연한 오차범위들을 제공하는 '정지 마찰(stiction)' 정도를 구현하기 위해 알고리즘 또는 다른 전략들을 이용할 수 있어 스냅핑은 지터(jitter)에 종속되지 않고 또한, 핸디캡핑 시 스템들이 채용되는 경우에 있어서, 더 높은 순위의 플레이어들은 더 낮은 순위의 플레이어들보다 \"AI 지원\"을 덜 받을 수 있다. 나아가, 실제 자동차 표현으로부터 '미-스냅핑'될 때 게이밍 서버 상에서 실행되는 게임 소프트웨어는 다른 플레이어의 가상 자동차들의 근접을 고려할 수 있다. 플레이어의 시뮬레이션된 자동차가 24 대의 실제 자동차들의 표현 중 하나에 스냅핑되지 않을 때, 자동차들 의 표현들 모두는 전통적인 방식으로 컴퓨터 게임 내에 디스플레이된다. 플레이어의 시뮬레이션된 자동차가 실제 자동차 표현에 스냅핑될 때, 그때는 다른 23 대의 실제 자동차 표현들만이 그 플레이어에게 디스 플레이되고 또한 특히 라이브 오디오 피드들이 팀으로부터 플레이어에게 제공되면. 플레이어가 그 실제 자동차 를 운전하고 있고 매우 호감을 가지고 실제 운전자와 레이스 팀과 상호작용하고 있는 것처럼 느낄 가능성이 크 다. 이 스냅핑 방법은 실제 자동차 표현들을 차단하거나 또는 실제 자동차 표현에서 스냅핑된 실제 자동차 표현(또는 플레이어가 조작에 의해 선택하지 않는)으로 이동시킴으로써, 플레이어가 레이스 전체에 걸쳐 진 행하는 것을 가능하게 해준다. 도 11a는 레이스 시작 후 오래지 않은 한 시점에서의 레이싱 상황을 보여준다. 여기서 시뮬레이션된 자동차는 3 대의 최근접한 실제 자동차 표현들(89c, 89b, 89e) 사이에 다소 있다. 플 레이어의 시뮬레이션된 자동차는 그것을 능가함으로써 그 원본(original twin, 레이스 자동차 표현(89f))으 로부터 스냅핑되지 않게 되고 이제 그것보다 앞서 있다. 플레이어의 가상 자동차에 최근접한 실제 자동차 표현 은 이제 실제 자동차 표현들(89b, 89c, 및 89e)이다. 플레이어 및 3 명의 실제 운전자들의 스킬 및 행동들에 따 라서, 위치 관계들(98b, 98c 및 98e)은 빠르게 진화할 것이다. 도 11a의 시간에서, 컴퓨터 게임(가상 레이스 시 뮬레이션)은 실제 자동차 표현(89c)을 플레이어의 자동차 앞에 디스플레이하고 또한 실제 자동차 표현(89 e)은 그 백미러들에 디스플레이한다. 도 11b는 시뮬레이션된 자동차가 점점 실제 자동차 표현(89c)에 근접하는 약간 이후의 시간에서의 도 11a의 계속되는 레이싱 상황을 보여준다. 시뮬레이션된 자동차가 실제 자동차 표현(89c)의 근접 구역(96c)에 들어 왔고 이제 스냅핑됨을 보여준다. 게이밍 서버는 이제 실제 자동차 표현(89c)이 플레이어의 화면 상에 디스플레 이되는 것을 차단하고 상기에서 설명된 것과 같은 기능들이 활성화된다. 도 11c는 더 긴 시간 후 써킷의 다른 부분에서, 시뮬레이션된 자동차가 이제 지정되고 선두의 실제 자동 차 표현(89a) 상에 근접하게 되는 도 11b의 다른 연속되는 레이싱 상황을 보여준다. 여기서 컴퓨터 게임 플레이 어의 시뮬레이션된 자동차는 실제 자동차 표현(89c)에 훨씬 앞서 이동했고 실제 자동차 표현(89c)과 레이스 리더 실제 자동차 표현(89a) 사이의 중간 이상임을 알 수 있다. 하지만, 플레이어의 가상 자동차는 아직 실 제 자동차 표현(89a)의 스냅 구역(96a)에 도달하지 않았고 이를 추격하고 있다. 이 도면은 각각의 실제 자동차 표현 주변에 2 개의 추가적인 구역들을 도입한다. 제1 구역(98a)은 실제 자동차 표현(89a) 앞에 있고 \"피추 격 구역(chased zone)\"으로 지칭되고 제2 구역(100a)은 실제 자동차 표현(89a) 뒤에 있고 \"추격 구역(chasing zone)\"으로 지칭된다. 3 개의 구역들(96a, 98a, 100a)은 함께, 도 11c에 도시된 바와 같이, 연속적인 세트를 형 성할 수 있고, 이로써 시뮬레이션된 자동차가 실제 자동차 표현과 연관된 3 개의 구역들 중 하나에 있 을 때, 시뮬레이션된 자동차의 성능이 실제 자동차 표현의 성능에 매우 근접하게 일치한다는 측면에서 디지 털 트위닝된다. 이 특징은 실제 자동차 표현을 추격하는 가상 자동차 또는 그 역의 가능성들을 균등하 게 하고 DRS와 같은 실제 기능들과의 자연스러운 통합을 가능하게 한다. 따라서, 시뮬레이션된 자동차는 이 제 실제 자동차 표현(89a)의 추격 구역(100a) 내에 있다. 시뮬레이션된 자동차가 실제 자동차 표현(96c)의 피추격 구역(98c)으로부터 실제 자동차(89a)의 추격 구역(100a)으로 이동하자마자 그 성능 특성은 실제 자동차 표현(89c)과 실제 자동차 표현(89a) 사이에서 스위칭된다. 이것은 시뮬레이션된 자동차의 성능은 항상 가장 근접하게 상호작용하고 경쟁하는 실제 자동차 표현에 일치되고, 컴퓨터 게임 플레이어와 실제 운전자들 간 에 운전 스킬들에만 기초한 공정한 경쟁을 보장함을 의미한다. 이 구역화 방법은 구역화 원리의 예이고 이 방법 에 대하여 가능한 수 개의 변형들이 있을 수 있다. 상기의 단락 a)에서 기술된 바와 같이, 라이브의, 또는 기록된 레이스에 연결되어 있는 레이스 시뮬레이 션에 관여하는 한 명 이상의 컴퓨터 게임 플레이어가 있을 수 있다. 종래 기술의 모터 스포츠 컴퓨터 게임들에있어서, 1 명부터 실제 레이스 내의 실제 정상 참가자들의 수에 이르기까지, 다수의 플레이어들이 전세계 어디 에 있든지 상관없이 함께 온라인으로 플레이하는 것은 일반적이다. 그래서, 상기의 포뮬러 1 예의 비교되는 종 래의 구현에 있어서, 최대 24 명의 플레이어들이 플레이하는 것이 보통일 수 있고, 그 각각은 시작 그리드 상에 배치되고, 채워지지 않은 장소들은 게임 소프트웨어의 알고리즘 및 AI에 의해 제어되는 시뮬레이션된 자동차들 에 의해 채워진다. 이러한 유형의 한정된 플레이어 게이밍 모드는 현재 실시예에서 여전히 가능할 수 있다. 하 지만, 이하에서 설명되는 다른 실시예들에 있어서, 플레이어들의 수에 의해 한정되지 않는 다른 게이밍 모드들 을 구현하는 것이 가능하다. 본 발명의 상기에서 설명되는 실시예에 따르면, 채워지지 않은 플레이어 장소들이 실제 레이스 내의 실제 자동차 표현들에 할당되고 이벤트로부터 라이브로 스트리밍되는 데이터는 게임 내에 서 그들의 행위들을 제어할 수 있는 상기에서 설명되는 한정된 플레이어 게이밍 모드를 구현하는 것이 가능하다. 이 경우에 있어서, 항상 컴퓨터 게임 내에 표현되는 24 명의 운전자들 및/또는 플레이어들이 있을 수 있고, 컴퓨터 플레이어들의 수, 즉 'n'은 '24-n' 실제 자동차들 중에서 경쟁할 것이다. 상기에서 설명되는 '추 격 & 스냅' 방법들의 모든 측면들은 적용가능할 것이고 각각의 자동차 시뮬레이션의 성능은, 레이스 내에 표현된 실제 자동차 표현들의 '추격 & 스냅' 구역들 내에 있었을 때를 제외하고, 시작 그리드 상에 대체되 는 실제 자동차 표현과 동일(twinned)할 것이다. 한정된 플레이어 게이밍 모드를 구현하는 다른 일 실시예에 따르면, 24 명의 게임 플레이어들 및 24 명의 실제 운전자들이 있을 수 있고 플레이어의 가상 자동차가 실제 자동차 표현에 스냅핑되지 않을 때마다, 가상 자동차는 컴퓨터 게임 환경에 등장할 것이고 다른 플레이어의 가상 자동차들에게 보일 것이고 이 모두 와 상호작용할 것이다. 따라서 24 개의 실제 자동차 표현들이 있을 것이고 또한 언제든 컴퓨터 레이스 시뮬레이 션에서 보이는 0에서 24까지의 스냅핑되지 않은, 시뮬레이션된 자동차들 어디든 있을 수 있다. 이 게이밍 모드의 이 2 가지 방법 변형들은 예시적이고, 많은 다른 가능한 변형들이 있지만 이 방법의 원리는 명확하다. 다양한 유형들의 전동 스포츠에 있어서(포뮬러 1은 본 발명의 훨씬 많은 일반적인 적용가능성의 일 예에 불과하 다) 실제 자동차들은 유지보수 또는 수정 작업들, 예를 들어 손해 복구, 재충전, 또는 새로운 타이어 장착을 위 해 레이스 밖에서 시간을 보낼 수 있다. 따라서, 해당 실시예들에 있어서, 컴퓨터 게임 플레이어는 실제 자동차 와 동일한 유지보수 또는 수정 작업들의 시뮬레이션된 버전을 위해 레이스 밖에서 동일 시간을 보내도록 선택할 수 있다. 이 경우에 있어서 게임 플레이어의 시뮬레이션된 자동차는 실제 자동차 표현의 변경된 성능 특성들을 상속받는다. 또는, 컴퓨터 게임 플레이어의 자동차가 실제 자동차 표현에 스냅핑되지 않을 때 컴퓨터 게임 플레이어는 시뮬레이션된 유지보수 또는 수정 작업들을 위해 레이스 밖에서 시간을 보내도록 선택 할 수 있고, 이것은 레이스로 복귀할 때, 컴퓨터 게임 플레이어의 자동차가 유사하거나 또는 호환가능한 유 지보수 또는 수정 작업들을 하는 실제 자동차 표현과 연결되도록 자격을 부여할 것이다. 이것은 실제 자동 차들이 레이스 도중 유지보수 또는 수정을 겪을 수 있을 때 경쟁이 공정함을 유지하도록 보장하는 방법의 다수 의 가능한 구현들 중 하나이다. 상기에서 언급된 바와 같이, 플레이어들의 수에 의해 한정되지 않는 다른 게이밍 모드들을 구현하는 것이 가능 하다. 상기의 단락 b)에서 설명된 상황과 일치하는 이러한 한 실시예는 게임에 참가하는 매우 많은 수의 컴퓨터 게임 플레이어들이 있고 게임은 라이브 또는 기록된 실제 이벤트에 연결되는 경우가 이제 설명된다. 이 러한 상황의 일 예는 대규모 이스포츠 레이스에 있고 여기서 각각의 플레이어는 현실적이고, 매력적이고 또한 도전적인 방식으로 실제 레이스와 상호작용하고 또한 거기에 이스포츠 이벤트에서 그 결과 및 종료 위치 관점에 서 매우 많은 수의 플레이어들을 순위매기는 공정한 방법이 요구된다. 도 12a 및 도 12b는 실제 자동차들의 시작 위치들에 그 시작 위치들이 분포되어 있는 수 천만 명의 게임 플레이 어들이 참가하는 이스포츠 또는 온라인 게이밍 레이스와 라이브로 연결되고 상호작용하는 24 대의 실제 자동차 들이 참가하는 레이스에 대한 가능한 시작 구성들의 2 가지 예들을 보여준다. 보다 상세하게, 도 12a는 24 대의 실제 자동차들이 시작 위치들에 고르게 분포되어 있는 천만 명의 비디오 게임 플레이어들에 연결되어 있는 레이 스에 대한 시작 구성을 보여준다. 도 12b는 도 12a에 도시된 다른 시작 구성을 보여주는데, 일억 명 이상의 비 디오 게임 플레이어들이 24 대의 실제 자동차 표현들에 로그적으로 분포되어 있어, 최고 순위의 가상 자동차 만 선두의 실제 자동차 표현에 연결된다. 이 게이밍 모드들은 무한 플레이어 게이밍 모드들로 지칭된다. 이 예들은 많은 유사한 옵션들 중 단지 2 개에 불과하고, 본 실시예들의 방법들의 목적들을 위해서는 참가하는 모든 컴퓨터 게임 플레이어가 자동차들 중 하나에 할당되기만 하면 된다. 따라서 모든 플레이어는 실 제 자동차 표현들 중 하나에 스냅핑되어 레이스를 시작한다. 동일한 실제 자동차 표현에 스냅핑된 모든 플 레이어는 그 실제 자동차와 디지털 트위닝(digitally twinned)되고 그 환경에서 실제 자동차 표현에 대하여 동일한 성능 모델을 가진다. 도 13은 24 대의 실제 자동차들과 그 각각이 실제 자동차 표현에 연결된 가상 자동차를 가지는 다수의 컴퓨터 게임 플레이어들이 있는 레이스 중인 레이싱 상황 부분을 보여준다. 도 13의 실제 레이스 상황은 실제 자동차 표현(89a)이 선두에 있고 이어서 실제 자동차 표현(89c)이 두번째 위치에 그리고 실제 자동차 표현(89 b)이 세번째 위치에 있는, 도 11c에서와 유사하다. 각각의 컴퓨터 게임 플레이어는 24 대의 실제 자동차들의 표 현들과 상호작용하는 한 명의 플레이어에 대하여 상기에서 설명된 것과 거의 동일한 방식으로 레이스를 경험한 다. 도 13에 도시된 상황은 3 명의 플레이어들(102a)의 시뮬레이션된 자동차들이 선두(실제 자동차 표현 (89a)) 앞의 구역(98a)에 있고, 트랙 상에 점선으로 표시된 하나의 자동차에 의해 또한 확대하여 구체적이고 정 확하며 밀접하게 분리된 위치들에 3 대의 개별적인 시뮬레이션된 자동차들(90c, 90f, 90z) 모두가 도시되어 있 다. 이 선두 구역에서, 각각의 플레이어는 선두 위치들에 대하여 상호작용적인 경쟁을 촉진시키기 위해 그 구역 내의 다른 플레이어들 모두 또는 일부의 표현 및/또는 이에 대한 정보와 함께 디스플레이될 수 있다. 4 대의 자 동차들(104a)이 실제 자동차 표현(89a)의 스냅 구역(96a)에 있고 그 실제 자동차 표현(89a)에 스냅핑된다. 이 자동차들은 도 3에 트랙 상에 점선으로 표시된 하나의 자동차로서 또한, 확대하여, 그 각각이 실제 자동 차 표현(89a)과 관련하여 게임 내의 그 정확한 위치에, 점선으로 표시된 자동차 표현들(90b, 90m, 90w, 90s)로 서 도시되어 있다. 9 명의 플레이어들(106a)은 실제 자동차 표현(89a)의 추격 구역(100a) 내에 있다. 구역들 (96a, 98a 및 100a) 내의 모든 시뮬레이션된 자동차들은 실제 자동차 표현(89a)에 디지털 트위닝된다. 실제 자 동차 표현(89c)은 현재 스냅핑된 25 대의 자동차들(104c)을 갖는 스냅 구역(96c), 18 명의 플레이어들 (102c)을 포함하는 피추격 구역(98c) 및 57 명의 플레이어들(106c)을 포함하는 추격 구역(100c)을 가 지고 이 모두는 실제 자동차 표현(89c)에 디지털 트위닝되어 있다. 피추격 및 추격 구역들 내에서 각 플레이어 의 가상 자동차는 피추격 및 추격 구역들(98, 100) 내에서 가상 플레이어들 간 상호작용적인 경쟁을 촉진시 키기 위해 동일한 구역 내에 가상 자동차들을 가지는 다른 플레이어들 모두 또는 그 일부의 표현 및/또는 이에 대한 정보와 함께 디스플레이될 수 있다. 이 표현 방법은 유리하게도 작은 화면 크기를 갖는 게이밍 장치 들이 디스플레이되는 정보의 양을 최대화할 수 있도록 많은 플레이어 정보가 작은 화면 크기 내에 제공되는 것 을 가능하게 해준다. 실제 자동차가 실제 레이스에서 충돌하면, 스냅핑된 가상 자동차들은 블랙 박스 모델 을 참조하여 결정되는 바와 같이, 그 플레이어의 입력 명령들이 그 충돌을 완화하고 방지하는 것과 같은 것이 아니라면 따를 것이고, 그렇지 않다면 가상 자동차들은 성공적으로 이탈된 점으로부터 스냅핑되지 않은 자동차 로서 계속될 것이다. 따라서 이 무한 플레이어 모드에서, 상기에서 설명된 방법은 어떠한 수의 컴퓨터 게임 플레이어들에 대하여서도 라이브 레이스와 상호작용하고 그 각각은 이벤트를 경험하고 또한 매력적이고 흥미진진한 방식으로 실제 자 동차들의 전체 필드와 경쟁하도록 편리하게 제공한다. 이것은 써킷 주변 실제 자동차들의 진행의 라이브 데이터 스트림 및 운전자 입력들(가상 레이스 시뮬레이션 내) 및, 적절하다면 팀 오디오 및 운전자 비디오와 같은 기타 데이터 스트림들을 수신하는 모든 플레이어의 게이밍 장치에 의해 활성화된다. 이에 더하여, 플레이어들이 대규모 참여 라이브-연결 레이스에 참가하고 있는 경우에, 써킷 주변의 모든 플레이어의 진행은 통상적으로 통 신되고 중앙 게이밍 서버에 모이게 된다. 이것은 전체 써킷에 대하여 실시간으로 수집되고 분석되어 다수 의 플레이어들의 가상 자동차들의 레이스 내의 상대적 위치들이 지속적이고 어느 정도의 정확도까지 모니터 링될 수 있도록 도 13에 도시된 관점을 가능하게 한다(예를 들어 컴퓨터 게임 소프트웨어 시뮬레이션은 어느 순 간에서라도 원하는 정확도까지 시뮬레이션된 자동차의 순간적인 위치를 나타낼 수 있다). 이것은 그후 a) 레이스의 종료 시 모든 플레이어들의 최종 위치들이 모호하지 않고 공정하게 결정되는 것을 가능하게 하고, 또한 b) 컴퓨터 게임 플레이어들 간의 경쟁이 향상될 수 있는 상황들에서, 상기에서 설명된 바와 같이 개별적인 플레 이어가 근방의 다른 관련 플레이어들의 자동차들의 이미지들과 함께 표시될 수 있도록 해준다. 이에 더하여, 모든 플레이어의 컴퓨터 게임은 행위들 및 실제 이벤트와의 상호작용들을 표시할 수 있지만 많은 플레이어들의 대규모 참여에 의해 향상된다. 예를 들어, 실제 운전자 및 팀의 라이브 오디오 피드들이 모 든 스냅핑된 플레이어들에게 스트리밍될 뿐만 아니라, 다수의 스냅핑된 추격 및 피추격 플레이어들이 개별적인 플레이어들의 이름들로서 실제 팀, 또는 관찰자들의 대규모 청중, 또는 심지어 실제 운전자에게 표시될 수 있어 실제 운전자는 스냅핑된 운전자들 모두 또는 누구에게든지 댓글을 달 수 있고, 선택된 스냅핑된 운전자들은 대 댓글을 달 수 있다(물론 이것은 안전 관점에서 허용가능한 것으로 평가되어야 함). 해당 실시예들에 의해 가능 하게 되는 이와 같은 잠재적으로 많은 다른 몰입형 오락 특성들이 있다. 컴퓨터 게임 플레이어들이 대규모로 참여하는 라이브-연결 이벤트에 있어서, 어떻게 조직화되는지에 따라, 게임 플레이어들 내에 폭넓게 스킬 레벨들이 있을 수 있다. 현재 실시예들은 상기에서 언급된 바와 같이, 각 플레이어에 대하여 핸디캡 파라미터를 포함함으로써 '희망자 전원(all-comers)’ 또는 '공개(open)’ 이벤트들을 허용하도록 용이하게 확장될 수 있다 (모든 핸디캡 시스템들과 같이 이전의 경험에 대한 공정한 평가에 기초하 여). 예를 들어, 각 플레이어는 0과 100 사이의 핸디캡을 달성할 수 있는데, 0은 프로 게이머 상태를 나타내고 100은 초보 게이머 상태를 나타낸다. 핸디캡 0은 플레이어의 입력들이 발생하고 이를 써킷 주변의 가상 자동 차의 진행으로 변환할 때 게이밍 서버의 AI 엔진이 게임에서 어떠한 지원도 하지 않음을 의미할 것이고, 핸디캡 5는 플레이어의 데이터 입력들이 실제 운전자의 5% 이내에 있다면 그때 이것은 일치(matching) 로 간주하는 것 등을 의미할 수 있다. 상기에서 설명된 방법들 모두는 유리하게 이하의 특징을 표시할 수 있다. 즉 그 환경 내에서 실제 자동차의 성 능의 컴퓨터 게임 시뮬레이션은 게임 플레이어들 간 뿐만 아니라 게임 플레이어들과 실제 운전자들 간의 공정하 고 즐거운 경쟁을 나타낼 수 있다. 다시 말하면, 실제 운전자가 실제 차량에 대한 실제 제어 입력들을 만들 기 때문에 게임 플레이어가 시뮬레이션된 자동차에 등가의 시뮬레이션된 입력들을 만들 때, 시뮬레이션된 자동차의 진행은 수용가능한 정확도까지 실제 자동차 표현에 일치할 것이다. 고도의 충실도를 달성하는 것은 다년간 모터 카 레이싱 컴퓨터 게임 개발 및 전문가용 시뮬레이터들의 목적이었고 이미 상당한 능력이 있 다. 하지만, 대규모 참여 라이브-연결 이벤트들에 있어서 측정되어 컴퓨터 게임으로 통신될 필요가 있고 또한 컴퓨터 게임 알고리즘 및 AI에서 혈실적으로 설명되는 이벤트 플레이에 있어서의 많은 인자들이 있을 수 있다. 상기에서 설명된 바와 같이, 전통적인 물리학적 모델에 기반한 시뮬레이션들을 향상시키기 위해 많은 이러한 측 정들을 라이브로 컴퓨터 게임으로 전송하는 것을 제시하는 종래 기술이 있다. 다른 바람직한 접근은 이하에서 설명되는 마지막 실시예에서 실현되고 또한 본질적으로 '실제-가상 상호작용을 위한 실시간 동적 블랙-박스 시"}
{"patent_id": "10-2022-7040921", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "뮬레이션' 방법으로 그 특성이 요약된다. 본 실시예들은 라이브 이벤트에 연결된 컴퓨터 게임 내에서 동적 블랙-박스 시뮬레이션 모델을 구현할 수 있다. 이 실시예들에 있어서, 컴퓨터 게임에 도 1에 도시된 위치 데이터 캡쳐 시스템을 통해 실시간으로 실제 자 동차에 대한 정확한 위치 데이터가 제공되는 것에 더하여, 실제 운전자에 의한 실제 자동차로의 제어 입력들 또한 측정되어 게이밍 서버로 실시간으로 전송된다. 도 14는 블랙 박스 동적 시뮬레이션 방법의 원리들을 설명하기 위한 라이브 이벤트 데이터 캡쳐 서버에 의해 전송되는 다양한 파라미터들의 시간에 따른 그래프이다. 도 14를 참조하면, 본 실시예들은 실제 자동차로의 운전자 입력들(제어 입력들)- 즉 운전대 위치(54a), 가속기 위치(54c) 및 제동 페달 위치(54b) - 의 예시적이고 단순한 세트에 대한 실시간 동적 블랙-박스 시뮬레이션 모 델을 이용하고 실제로 기어 변경(도 14에 미도시)과 같은 더 많은 운전자 입력들이 있을 수 있다. 이것들은 블 랙-박스 모델로의 동적 데이터 입력들이다. 블랙-박스 모델로부터의 동적 출력들은 시간에 따른 위치 관점에서 의 실제 자동차의 진행이고, 이 예시적인 모델에 있어서 이것들은 트랙 상에서 이동하는 길이방향 거리 (52b) 및 측면 위치(52c)로서 설명된다. 도 5는 운전자 입력들에 있어서의 편차들이 시간에 따른 실제 자동차 의 트랙 위치의 출력들에 있어서의 편차들에 일치될 수 있음을 보여준다. 한 랩 동안 입력들 및 출력들의 시간-히스토리를 기록 및 연관시키는 것은 한 랩에 대한 블랙-박스 동적 모델의 가장 단순한 버전을 제공하는데, 이것은 그후 사용자의 컴퓨터-생성 입력들에 기초하여 가상 자동차의 가능한 트랙 위치를 결정하는 데 사용될 수 있다. 본 실시예는 중앙 서버에서 발생하는 레이스 시뮬레이션에 기초한다. 이 경우에 있어서, 가상 레이스 시뮬레 이션 엔진이 어떻게 동적 블랙 박스 시뮬레이션을 구현하는지에 대한 일 예가 이제 설명되고 도 15에 도시 되어 있다. 운동학적 레이스 위치 데이터는 기준 블랙 박스 모델 생성기에 의해 라이브 또는 기록된 이벤트로부터의 실제 운전자 입력들에 일치된다 (이전에 언급된). 이 출력은 차례로 이 기준을 레이스 에서 제어하고 있는 가상 차량의 위치에 대한 플레이어 입력 데이터(운전 명령들, 38)의 영향을 결정하기 위해 사용하는, 게이밍 블랙 박스를 구현하는 생성기로 제공된다. 결과적으로 기준 블랙 박스 생성기는 게 이밍 블랙 박스를 구현하는 엔진에 의해 사용될 수 있는 출력들에 대한 입력들의 전달 함수를 정의한다. AI 엔진이 또한 상기에서 설명된 바와 같이 실제 차량의 프로 운전자와 경쟁하는 플레이어를 돕기 위해 제 공된다. 가상 차량의 위치가 게이밍 블랙 박스를 구현하는 엔진에 의해 결정되기만 하면, 레이스 시뮬 레이션 출력 엔진으로 전달되고, 이것은 이를 레이스 내의 그 차량의 표현을 생성하는 데 사용한다. 레이싱하는 모든 차량들(89, 90)의 대화형 하이브리드 레이스 환경은 저장된 데이터 모델들을 사용하여 모 든 관련된 게이밍 장치들로 가상 레이스 환경을 출력하는, 레이스 시뮬레이션 출력 엔진에 의해 생성된 다. 블랙-박스 동적 모델은 극히 복잡하고 역동적으로 변하는 환경에서 극히 복잡하고 역동적으로 변하는 자동차의 정교한 '화이트-박스' 모델들(즉, 차례로 더 상세한 모델들을 결합하는 복잡한 물리학에 기초한 더 상세한 모델 들을 결합하는 모델들)을 생성할 필요를 최소화한다. 그래서, 기계의 마모와 같이 동적으로 측정하고 모델링하 기에 불가능한 복합 인자들, 바퀴 점착에 영향을 주는 트랙 표면에의 타이어 화합물의 증착, 자동차의 진행의 공기역학에 영향을 주는 돌풍(예를 들어 3가지만 언급함)은 모두 측정된 블랙-박스 모델의 현실에 포함된다. 기 준 블랙 박스 생성기에 의해 생성된, 측정된 블랙-박스 모델은, 그후 기준 모델 입력들과 다른, 컴퓨터 게 임 플레이어에 의한 입력들이 주어지면 상응하여, 비례적으로, 현실적으로 출력들을 변경할 수 있는, 게임 내의 AI 엔진의 AI 알고리즘을 위한 기준 모델로서 행동한다. 한 대의 자동차를 위한 블랙-박스 모델은 랩마다 상당한 편차들을 갖는 운전자 입력들 및 (보통은 지속적이고 점진적이고, 때때로 불연속적인) 기타 물리적 인자들에 있어서의 편차들로 인해 랩(lap)마다 다를 것이다. 하지 만, 이 방법이 레이스 내내 최상의 역동적으로 정확한 시뮬레이션을 제공함을 보장하기 위해, 이하를 포함하지 만 이에 한정되지 않는, 현재 실시예들에 사용될 수 있는 많은 구체적인 전략들 및 기술들이 있다: i. 그 날의 운전자, 자동차 및 트랙을 가장 잘 나타내는 기준 블랙-박스 랩 모델을 생성하기 위해 연습 세션들 및 실제 레이스에서의 복수의 랩들로부터의 블랙-박스 모델 데이터를 평균하거나 또는 조합함. ⅱ. a)와 동일하지만 트랙의 더 짧은 부분, 예를 들어 특정 코너 또는 특정 직선에 대하여 수행함. ⅲ. 그 날의 운전자, 자동차 및 트랙의 궁극적 성능을 위한 기준 블랙-박스 모델로서 최상의 랩 타임을 갖는 랩 을 선택함. ⅳ. c)와 동일하지만 트랙의 더 짧은 부분, 예를 들어 특정 코너 또는 특정 직선에 대하여 수행함. ⅴ. 초단위로 블랙-박스 모델을 건설하고, 게임 플레이어 입력들을 실제 운전자 입력들에 대하여 비교 하고 또한 직접적이고 즉각적인 응답으로 출력을 제어함(이 방법은 이용가능한 히스토리가 없을 때, 또는 \"정비 소\" 후 첫번째 랩에서 및 이에 따른 실제 자동차의 수정 후, 첫번째 랩에 대하여 특히 유용할 수 있다). ⅵ. 연속성과 상대적 단순함이 적용되는 것으로 알려져 있는 알려진 물리학 법칙들의 모델링을 블랙-박스 모델 에 제공함. ⅶ. 자동차의 성능에 대한 알려진 한계들, 예를 들어 최대 직선 가속도, 최고 직선 속도 등을 모델링함. 많은 다른 기술들이 있지만, 이 방법의 핵심은 실시간으로 월등히 복잡한 물리 시스템들의 화이트-박스 모델들 을 생성하는 것보다, 유효하다고 알려진 하나 또는 그 이상의 동적 블랙-박스 기준 모델들 주변의 편차들 측면 에서 모델링하고 시뮬레이션하는 것이 더 실용적이라는 것이다. 실제 모터 스포츠 이벤트들에의 라이브 연결 뿐만 아니라, 본 발명의 다른 실시예들은 또한 컴퓨터 게임들 플레이어들의 상호작용이 이전의 라이브 레이스의 기록된 버전과 하는 상황에 적용가능하고, 기록은 이 전 레이스의 환경에서 실제 자동차들의 매우 정밀한, 측정된 운동학적 성능 및 레이스 동안 실제 자동 차들에의 실제 운전자들의 입력들로 구성된다. 이 실시예들에 있어서, 상기의 상세한 설명 모두는 기록된 레이스에의 컴퓨터 게임 플레이어들의 참여에 적용할 수 있다. 대안적으로, 실제 레이스의 기록이 환경에서 실제 자동차들의 매우 정밀한, 측정된 운동학적 성능 으로만 구성되고, 실제 운전자들의 입력들에 대한 기록이 없는, 다른 실시예에 있어서, 디지털 트위닝은 이 후에 게임 플레이어와 실제 운전자 또는 자율주행 자동차 간의 공정한 경쟁을 생성하도록 그 환경에서 게임 플 레이어의 자동차의 시뮬레이션된 성능이 그 환경에서 실제 자동차의 성능에 충분히 근접한 표현임을 보 장하는 다른 방법에 기초될 수 있다. 이것은 예를 들어, 운전자 리허설 및 그후 운전자가 기록된 레이스 내에서 실제 자동차 각각의 성능을 재현할 수 있도록 해주는 입력 히스토리들을 기록하는 것을 포함하는 매우 충실 한 레이싱 자동차 시뮬레이션을 이용한 운전자 입력들의 역 엔지니어링을 수반할 수 있다. 이것은 원본 이 벤트로부터의 데이터가 이용가능하지 않을 때 동적 블랙-박스 모델로의 입력들을 재구축하는 방법의 예시적 인 일 예이다. 도 16 내지 도 20을 이제 참조하면, 주로 더 분산되는 방식으로 구현되는 것에 의해 상기에서 설명된 실시예와 다른 본 발명의 또 다른 일 실시예가 개시되어 있다. 도 1 내지 도 4의 실시예와 유사한 방식으로 작동하는 다 른 실시예의 많은 구성요소들이 있고 불필요한 반복을 방지하기 위해 차이점들만 여기서 설명될 것이다. 도 16 을 참조하면, 게이밍 장치의 구성이 도시되어 있다. 여기서 가상 레이스 시뮬레이션 엔진이 중앙 서버 보다는, 게이밍 장치 내에 제공되어, 플레이어 입력들로부터 도출되는 플레이어 입력 명령들은 중앙 서버로 전달될 필요 없이 가상 레이스 시뮬레이션 엔진으로 직접 입력될 수 있다. 이것은 효율성 및 대역폭 소비를 크게 개선시킨다. 가상 레이스 시뮬레이션 엔진에는 통신 엔진을 통해, 적어도 라이브 이 벤트로부터 위치 데이터 및 실제 자동차들의 운전자 입력 데이터, 게이밍 서버로부터 기록 된 기준 블랙 박스 데이터 및 보충 데이터가 제공된다. 이 수신된 데이터는 지역 데이터 저장소에 저장되고 또한 도 2의 실시예에서 상기에서 설명된 것과 유사한 방식으로 가상 레이스 시뮬레이션 엔진에 의해 사용된다. 유사하게, 데이터 모델들은 시뮬레이션된 레이스 환경의 생성을 위한 추가적인 지원을 제공한다. AI 엔진은 이전에 설명된 바와 같이 플레이어가 실제 운전자와 경쟁하는 것을 돕도록 지원을 제 공하도록 제공된다. 가상 레이스 시뮬레이션에 대한 보다 분산된 접근의 한 가지 결과는 중앙 서버가 각 플 레이어의 가상 차량의 위치로 갱신되어야 한다는 것이다. 따라서, 통신 엔진은 레이스의 시작을 위한 레이스 자동차 선택 및 레이스 동안 이에 대한 변경들 뿐만 아니라 레이스 중 중앙 게이밍 서버로 가상 레이스 시뮬레이션 엔진에 의해 결정되는 가상 차량 위치 데이터를 전송되도록 배치된다. 도 17을 이제 참조하면, 이 분산된 실시예의 게이밍 서버(4a)가 도시되어 있다. 게이밍 서버(4a)는 각 가상 차 량 위치와 비교분석하고 이것을 가상 레이스 관리 엔진으로 제공하는 가상 차량 위치 프로세서를 가진다. 가상 레이스 관리 엔진은 그후 각 게이밍 장치에게 레이스에서의 그들의 위치 및 상대적 성능 에 대한 정보 및 가능하다면(가상 플레이어들 간의 레이스가 향상되거나 또는 더 경쟁적으로 만들어질 것임을 결정하는 경우), 레이싱 환경을 완성하기 위해 레이스에서 다른 가상 차량들의 위치들을 제공한다. 가상 레 이스 관리 엔진은 또한 이전에 기록된 데이터에 대한 기준 블랙 박스를 생성하고 이를 게이밍 장치들 모두로 제공할 수 있다. 이것은 미리 기록된 데이터이므로, 그 정보는 실시간 레이싱과 연관될 수 있는 시간 결정적인 방식으로는 제공되지 않을 수 있다. 게이밍 서버(4a)는 그후 모든 경쟁자의 위치들 - 가상 및 실 제의, 가능하다면 원격측정 및 기타 데이터를 '스냅핑된' 자동차에 공급하는(그래서 라이브 이벤트 데이터 캡쳐 서버로부터의 연결이 필요함), 가능하다면 각각의 가상 경쟁자에게 선택된 경쟁 영상들을 공급하는, 가능하 다면 실제 팀들로 가상 경쟁에 대한 통계를 공급하는 등. - 을 알기 때문에 경쟁의 감독만을 다룬다. 또한, 실제 라이브 이벤트 데이터는 이 실시예에 있어서 라이브 이벤트 데이터 캡쳐 서버로부터 게이밍 장치들로 분배되는 게이밍 서버(4a)로 라우팅된다. 이것은 동기화에 이점들을 가진다. 하지만, 다른 실시예 에 있어서, 실제 라이브 이벤트 데이터는 게이밍 장치들 각각으로 직접 라우팅될 수 있고 이것은 지연을 감 소시키는 이점을 가지고 또한 중앙 서버에서 필요한 처리 전력을 감소시킨다. 도 18a는 라이브 이벤트 데이터 캡쳐 서버로부터의 데이터 및 게이밍 서버(4a)에서 게이밍 장치로부터 수신되는 가상 자동차 위치 데이터를 보여준다. 도 8a와 도 13a는 매우 유사하지만, 이 실시예에 있어서 기타 데이터 또한 중앙 서버(4a)로 제공된다. 이 기타 데이터는 라이브 원격측정 데이터, 팀들과 운전자 간의 무선 통신 데이터 등일 수 있다. 이 추가적인 데이터 스트림들은 상기에서 설명된 바와 같이 게이밍 이 더 현실적이거나 또는 매력적이도록 만들 수 있다. 도 18b는 게이밍 서버(4a)로부터 게이밍 장치로 보내지는 가상 자동차 위치 데이터를 보여준다. 데이터 는 또한 게이밍 컴퓨터 식별자를 포함한다. 이 위치 데이터는 가상 차량의 위치를 갱신하는 데 사 용되고 이로써 위치는 게이밍 장치들을 이용하는 동일한 레이스 내의 다른 참여자들에게 게이밍 서버(4a)에 의해 결정된 바와 같이 통신될 수 있다. 기타 데이터 필드는 연관된 실제 차량의 선택 또는 핸디캡 데이터 와 같은 기타 데이터와 관련 있다. 도 19를 이제 참조하면, 게이밍 서버(4a) 내의 가상 레이스 관리 엔진이 도시되어 있다. 가상 레이스 관리 엔진은 어떠한 게이밍 장치들이 어떠한 갱신된 위치 데이터를 수신하는지 결정한다. 그 중심에는 레이스 엔진 관리 프로세서가 있는데, 이것은 중앙 서버(4a)로 제공되는 다양한 데이터 스트림들로부터 레 이스의 그림(picture)을 조립할 수 있다. 이에 더하여, 가상 레이스 관리 엔진은 이전에 기록된 이벤트 데 이터에서만 작동된다는 것을 제외하고, 도 15를 참조하여 상기의 실시예에서 설명된 것과 동일한 기준 블랙 박스 모델 생성기를 포함한다. 라이브 데이터 기준 블랙 박스 모델 생성은 각각의 게임 장치에 위임된 다. 통신 엔진은 위치 데이터 및 기준 블랙 박스 모델 데이터를 적절한 게이밍 장치들 각각으 로 제공한다. 이에 더하여, 통신 엔진은 또한 각각의 게이밍 장치으로 직접 제공되지 않는다면 라이브 이벤트 데이터를 통해 라우팅할 뿐만 아니라 기타 레이스 데이터(상기에서 언급된 바와 같이)를 게이밍 장 치들 각각으로 제공한다. 도 20을 참조하면, 게이밍 장치에서의 이 실시예의 시스템의 작동 방법이 도시되어 있다. 이 방법(15 0)은 단계 152에서 게이밍 장치가 레이스 참여를 위한 요청을 게이밍 서버(4a)로 송신하는 것으로 시작한다. 이 요청은 게임 서버(4a)가 게이밍 장치와 상호작용하도록 해주는 특정 구성 상세사항들을 포함할 수 있고 또한해당 장치의 플레이어가 연결될 실제 차량을 특정할 수 있다. 예를 들어, 게이밍 장치는 라이브 이벤 트 데이터 캡쳐 서버로부터 라이브 데이터의 직접 피드 및/또는 라이브 원격측정 피드를 필요로 한다면, 이 게이밍 옵션들은 특정될 수 있다. 다음 단계에서, 게이밍 서버는 단계 154에서, 라이브 이벤트 데이 터 캡쳐 서버로부터 라이브 데이터 피드로의 링크 및 가상 레이스 관리 엔진에 의해 결정되는 레이스 에서 다른 가상 플레이어들의 위치들과 같은 필요한 정보를 제공한다. 도시되지 않았지만, 이 정보로 평가 된 게이밍 서버(4a)는 특정 이벤트에 할당된 활성화된 게이밍 장치들의 전체 그림을 생성할 수 있다. 이 전에 설명된 실시예에서와 같이, 한 대의 실제 차량은 이에 할당된 복수의 플레이어들을 가질 수 있다. 이 에 따라, 가상 레이스 환경은 단계 156에서, 실제 차량들의 가상 표현들의 초기 위치들을 포함하여 게이밍 장치 상에 지역적으로 생성된다. 이전에 언급된 바와 같이 이것은 라이브 이벤트로부터의 라이브 데이터 또 는 이전에 기록된 라이브 이벤트로부터 미리 기록된 데이터에 기초할 수 있다. 지역 데이터 저장소에 저 장된 데이터 모델들은 가상 레이스 환경을 생성하는 데 사용된다. 레이스가 단계 158에서 시작하기만 하면, 라이브 이벤트로부터 또는 미리 기록된 이벤트로부터의 데이터의 스트림(28, 42)은 단계 160에서 수신되고, 이 를 이용해, 실제 레이스 차량들의 표현들의 위치들은 단계 162에서 변경될 수 있다. 이 새로운 위치들은 단계 160에서, 이후에 게이밍 장치에서 플레이어에게 표현되는 가상 레이스 환경에서 실제 차량들의 표현들 에 대한 새로운 위치들을 생성하는 데 사용된다. 응답으로, 게이밍 장치는 단계 162에서, 그들의 가상 차량 을 제어하기 위해 플레이어의 사용자 입력들로부터 도출되는 게이밍 제어 데이터(가상 레이스 명령들)을 생 성한다. 이 가상 레이스 명령들은 그후 가상 레이스 시뮬레이션 엔진 내의 기준 블랙 박스의 출력에 비교되 고 이것은 단계 166에서, 플레이어의 사용자 입력들의 결과로서 가상 차량의 후속 위치들을 생성하는 데 사용된 다. (이 실시예에 있어서 실시간 블랙 박스 생성은 도 10을 참조하여 설명된 것과 같음이 이해되어야 한다). 이 가상 차량의 새로운 위치는 그후 단계 168에서, 게이밍 서버(4a)로 전달될 수 있고 다른 플레이어의 가상 차량 들의 위치는 게이밍 서버(4a)로부터 수신되어 이에 의해 관련된 것으로 결정된다. 관련된 가상 차량들의 새 로운 위치들은 그후 단계 170에서, 게이밍 장치 상의 플레이어에게 표시된다. 이 프로세스는 레이스의 종료 가 단계 172에서 결정될 때까지 계속된다. 마지막으로, 본 발명의 특징들은 실시간으로 한정된 플레이 필드 내에서 추적되는 이동하는 객체가 전동차들은 아니지만 예를 들어 축구장 또는 농구장에 있는 선수들, 활강 스키 이벤트의 경쟁자들 또는 경마장의 그레이하 운드들일 수 있는, 광범위한 스포츠 이벤트들에 적용하기 위해 확장될 수 있음을 명확히 해야 한다. 이것들은 모두 트랙이 아닌 실행 영역들 및 차량들이 아닌 이동 개체들의 예들이다. 위치 데이터 캡쳐 시스템은 센서들, 컴퓨팅 및 통신 장비의 맞춤형 아키텍쳐일 수 있다. 적외선 비방출 패브릭 또는 작은 적외선 방출 장치들(일정 하거나 또는 변조된 광을 방출할 수 있고 가능하다면 트리거될 수 있는)은 추적 및 식별에 적절한 냉점 또는 열 점을 제공하는 실제 경쟁자들의 의복에 통합될 수 있다. 실제 플레이어들 또는 팀들 및 가상 플레이어들 또는 팀들의 상호작용적 경쟁이 모터 스포츠에 대해서만큼 실용적이지 않을 수 있지만, 상기의 18)에 설명된 몰입형 오락 및 시청 향상 기능은 다음과 같다. 스포츠 통계 및 분석의 수집은 간단한 방식으로 자동화될 수 있다. 이 에 더하여, 예를 들어 축구공 또는 농구공은 인간에게 보이지 않는 적외선 반사 또는 비방출 마커를 통합하도록 설계될 수 있고 추적 장치들의 성능은 공의 회전이 지속적으로 측정되는 것을 가능하게 할 수 있다. 이것은 또 한 예를 들어 테이블 위에 하나의 센서를 갖는 스누커 또는 당구 게임의 큐볼에 적용할 수 있다. 공통적이고 현 저하고 새로운 특징은 수동 또는 능동 적외선 마커들, 반사기들, 흡수기 또는 방출기들을 검출하기 위한 광각 적외선 센서들 및 조명기들 및 연관된 컴퓨팅 및 통신 장비를 이용하여 상대적으로 짧은 범위(<100m)에서 이동 객체들(차량들, 플레이어들, 공들, ...)를 추적하는 데 있다. 이렇게 획득된 실시간 데이터는 광범위한 대화형 오락 및 게이밍 경험들을 향상시키는 데 사용된다. 본 실시예들의 특징들은 이하의 조항들에 의해 표현되고 설명될 수 있다: 1) 운전자들이 있는 실제 자동차들, 또는 자율주행 실제 자동차들이 관여된 라이브 실제 레이스들과 컴퓨터 게 임 플레이어들의 상호작용을 위한 시스템 및 방법이 개시되는데, 이로써 한 명의 플레이어가 실제 자동차들 중 하나와 시뮬레이션된 자동차를 연결하는 레이스를 시작하고 초기 자동차에의 연결을 유지하는 것에 의해 또는 정의된 근접 파라미터들에 기초하여 실제 자동차에서 실제 자동차로 연결하는 것에 의해 진행할 수 있고, 이에 인해 경쟁적인 방식으로 실제 운전자들의 실제 레이스에서 가상 운전자로서 경쟁하게 된다. 2) 컴퓨터 게임 플레이어의 시뮬레이션된 자동차가 실제 자동차에 연결되지 않을 때 실제 자동차들 모두는 레이 스에 등장하고 컴퓨터 게임 플레이어는 실제 자동차들을 선택하는 것을 피할 수 있고, 독립적인 개체로서 경쟁 하게 되거나, 또는 정의된 근접 파라미터들에 기초하여 실제 자동차와의 연결이 선택되는, 시스템 및 방법이 개 시된다. 플레이어의 시뮬레이션된 자동차가 실제 자동차와 연결될 때 실제 자동차는 플레이어의 컴퓨터 게임 내에서 경쟁하는 자동차로서 등장하지 않는다. 3) 컴퓨터 게임 플레이어의 자동차가 실제 자동차와 연결될 때 게임 플레이어의 자동차의 시뮬레이션은 실제 자 동차의 디지털 트윈인, 시스템 및 방법이 개시되는데, 이것은 그 환경에서 게임 플레이어의 자동차의 성능이 그 환경에서 실제 자동차의 성능의 충분히 근접한 시뮬레이션이어서 게임 플레이어와 실제 운전자 또는 자율주행 자동차 간에 공정한 경쟁을 생성하게 됨을 의미한다. 4) 디지털 트위닝이 그 환경에서 실제 자동차의 성능 및 실제 자동차에의 실제 운전자의 입력들의 매우 정밀하 고, 측정된 운동학적 성능의 동적, 블랙 박스 시뮬레이션에 기초하는, 시스템 및 방법이 개시된다. 5) 컴퓨터 게임이 가상 구역들을 각 실제 자동차와 동적으로 연관시켜 컴퓨터 게임 플레이어의 자동차가 그 구 역들 내에 있을 때 실제 자동차의 디지털 트윈이 되거나 또는 실제 자동차에 관련된 특정 성능 특성을 상속받는, 시스템 및 방법이 개시된다. 6) 컴퓨터 게임 플레이어의 자동차가 실제 자동차와 연결되고 실제 자동차가 유지보수 또는 수정 작업(손해 복 구, 재충전, 새 타이어, ...)을 위해 레이스 밖에서 시간을 보낼 때 컴퓨터 게임 플레이어는 레이스 밖에서 동 일한 시간을 보내도록 선택될 수 있는(가능하다면 1 랩 만큼 지체되는), 시스템 및 방법이 개시되고, 이 경우에 있어서 이 시뮬레이션된 자동차는 실제 자동차의 변경된 성능 특성을 상속받는다. 7) 컴퓨터 게임 플레이어의 자동차가 실제 자동차와 연결되지 않을 때 컴퓨터 게임 플레이어는 시뮬레이션된 유 지보수 또는 수정 작업을 위해 레이스 밖에서 시간을 보내도록 선택될 수 있는, 시스템 또는 방법이 개시되고 실제 레이스로 복귀할 때 유사한 유지보수 또는 수정 작업을 한 어떠한 실제 자동차와도 연결하도록 컴퓨터 게 임 플레이어의 자동차에 자격을 부여할 것이다. 8) 레이스 내의 실제 자동차들의 수까지의, 다수의 컴퓨터 게임 플레이어들이 레이스 내내 실제 자동차들에 연 결될 수 있고 이로써 하나의 라이브 실제 레이스 내의 실제 자동차들 뿐만 아니라 서로 경쟁할 수 있게 되는, 시스템 및 방법이 개시된다. 9) 수많은 컴퓨터 게임 플레이어들과 운전자들이 있는 실제 자동차들 또는 자율주행 실제 자동차들이 관여된 라 이브 실제 레이스들과의 대규모 상호작용을 위한 시스템 및 방법이 개시되고, 이로써 모든 플레이어는 자신의 시뮬레이션된 자동차를 실제 자동차들 중 하나와 연결하여 레이스를 시작하고 또한 정의된 파라미터들에 기초하 여 실제 자동차에서 실제 자동차로 연결하는 것에 의해 진행할 수 있고, 이로 인해 경쟁적인 방식으로 실제 운 전자들 및 모든 다른 컴퓨터 게임 플레이어들 간의 실제 레이스 내에서 가상 운전자로서 경쟁하게 된다. 10) 게임 플레이어들이 대규모 이스포츠 레이스에서 경쟁하는 시스템 및 방법이 개시되는데, 이때 각 플레이어 는 현실적이고 매력적이고 도전적인 방식으로 실제 레이스와 상호작용할 필요가 있고 또한 매우 많은 수의 플레 이어들을 그 성능 및 그 이스포츠 이벤트 내의 종료 위치 측면에서 순위매기는 공정한 방법이 있어야 하고 그 방법은 서로에 대해 컴퓨터 게임 플레이어들의 시뮬레이션된 자동차들의 매우 정밀한 위치들에 기초한다. 11) 컴퓨터 게임 플레이어들이 이전의 레이스의 기록된 버전과 상호작용하는, 시스템 또는 방법이 개시되는데, 이 기록은 이전 레이스의 환경에서의 실제 자동차들의 매우 정밀한, 측정된 운동학적 성능 및 레이스 내내 실제 자동차들로의 실제 운전자들의 입력들로 구성된다. 12) 대안으로서, 컴퓨터 게임 플레이어들이 이전의 레이스의 기록된 버전과 상호작용하는, 시스템 또는 방법이 개시되는데, 이 기록은 이전 레이스의 환경에서의 실제 자동차들의 매우 정밀한, 측정된 운동학적 성능만으로 구성된다. 이 경우에 있어서 디지털 트위닝은 게임 플레이어와 실제 운전자 또는 자율주행 자동차 간의 공정한 경쟁을 생성하도록 그 환경에서 게임 플레이어의 자동차의 시뮬레이션된 성능이 그 환경에서 실제 자동차의 성 능에 충분히 근접한 표현임을 보장하는 다른 방법과 조합되는, 그 환경에서의 실제 자동차들의 운동학적 성능의 디지털 기록에 기초한다. 13) 컴퓨터 게임 플레이어의 시뮬레이션된 자동차가 실제 자동차를 대체할 때 게임 플레이어의 컴퓨터 시스템과 실제 자동차 및/또는 이에 연관된 팀 및 그들의 시설들 간에 어떠한 방향이든 어떠한 목적에서든 비디오, 오디 오, 또는 기타 기술적 데이터 교환이 있는, 시스템 및 방법이 개시된다. 14) 이전의 경험 및 누적된 스킬들의 공정한 평가에 기초하여, 각 컴퓨터 게임 플레이어에게 핸디캡이 할당되는, 시스템 및 방법이 개시되고, 이 핸디캡은 플레이어의 입력들에 대한 그 환경에서의 자동차의 응답을 조정하기 위해 실제 자동차들의 실제 운전자들과 경쟁 및/또는 서로에 대해 경쟁하고 레이스에서 승리하는, 다 양한 레벨들의 경험 및 스킬을 갖는 플레이어들의 기회들을 거의 균등화하는 방식으로 컴퓨터 게임에 의해 사용된다. 15) 컴퓨터 게임 플레이어들이 아닌 모터 레이싱 팬들이 이전에 설명된 방법들 중 하나를 마음대로 사용하여 어 떠한 수의 실제 자동차들 및 컴퓨터 게임 플레이어의 자동차들에 연결되는 것에 의해 상호작용적인 시청 경험에 참여할 수 있고 또한 이전에 설명된 시스템들 및 방법들과 관련된 기술적 데이터, 비디오 스트림들, 오디오 스 트림들 또는 기타 데이터를 수신할 수 있는, 시스템 및 방법이 개시된다. 16) 게이밍 플레이어들의 가상 차량들이 실제 전동 차량들의 표현들에 연관될 수 있고 또한 실제 운전자 입력들 및 레이스 내의 실제 차량들에 관한 위치 데이터를 입력들로서 선택하여 이를 기준 블랙 박스 표현을 생성하는 데 사용할 수 있는, 시스템 및 방법이 개시되고, 이에 대하여 레이스 도중 게이밍 플레이어 입력들은 가상 플레 이어 차량들이 현실적인 레이싱 환경을 시뮬레이션하기 위해 실제 차량들의 표현에 일치될 수 있는, 시뮬레이션 된 게이밍 환경을 결정하기 위해 평가될 수 있다. 17) 블랙-박스 모델링 방법들을 이용해 실제 차량들의 동적 입력 및 출력 데이터가 캡쳐되고 분석되는, 시스템 및 방법이 개시되고, 그 결과들은 실시간으로 그 환경에서의 운전자 및 자동차의 성능의 이해를 돕기 위해 특히 그 팀들에게 지금까지 획득하기 불가능했던 자동차들의 성능에 대한 매우 정확한 운동학적 데이터를 제공하기 위해 경쟁 팀들로 피드백될 수 있다. 차량 움직임이 레이스 트랙 주변에 위치되는 위치 센싱 장치들의 그룹들에 의해 감지되는, 시스템 및 방법이 개 시되는데, 센싱 장치들 각각은 차량의 트랙 위치를 결정하기 위해 차량으로부터 방출되거나, 반사되거나 또는 전송되는 IR 광을 검출하기 위한 IR 센서 및 그 위치 데이터를 데이터가 비교분석되고 이 차량들과 관련된 레이 싱 이벤트 주변의 라이브 위치 데이터로서 게이밍 장치 또는 서버로 제공될 수 있는 위치 데이터 캡쳐 시스템으 로 전송하기 위한 통신 수단을 포함한다.하지만, 움직임 추적 시스템은 상기에서 설명된 바와 같이 차량 움직임 에 한정되지 않는 것으로 이해되어야 한다. 적외선 센서들의 다른 그룹들에의 연결들 및 적절한 구성을 갖는 적 외선 센서들의 그룹들을 이용하는 정확도는 이동 몸체들의 정확한 위치 검출을 가능하게 하고 또한 예를 들어 인간 또는 동물의 움직임에 관련된 비-전동 스포츠들에 적용될 수 있다. 개시된 실시예들에 다양한 변형들이 가능하고 한 실시예의 요소들은 어려움 없이 다른 실시예들의 요소들과 결 합될 수 있음이 또한 이해되어야 한다. 따라서, 여기에 개시된 방법들 및 시스템은 본 발명의 다양한 측면이 어 떻게 구현될 수 있는지에 대한 비-한정적인 예들이고 또한 본 발명은 본 개시의 사상 및 범위에 의해 결정됨이 이해되어야 한다. 도면 도면1 도면2 도면3a 도면3b 도면4 도면5 도면6 도면7a 도면7b 도면8 도면9 도면10a 도면10b 도면11a 도면11b 도면11c 도면12a 도면12b 도면13 도면14 도면15 도면16 도면17 도면18a 도면18b 도면19 도면20"}
{"patent_id": "10-2022-7040921", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명이 더 용이하게 이해될 수 있도록, 이제 예를 들어 첨부된 도면들을 참조할 것이다. 도 1은 본 발명의 일 실시예를 포함하는 3부(three-part) 게이밍 환경을 보여주는 대략도이다. 여기서 3부는, 복수의 게이밍 장치들, 게이밍 서버 및 라이브 이벤트 데이터 캡쳐 시스템을 포함한다. 도 2는 도 1의 게이밍 서버를 더 상세하게 보여주는 대략도이다. 도 3a는 도 1의 라이브 이벤트 데이터 캡쳐 시스템으로부터 수신된 실제 데이터의 형식을 보여주는 대략적인 블록도이다. 도 3b는 도 1의 게이밍 컴퓨터들/장치들로부터 수신된 가상 레이스 명령들의 형식을 보여주는 대략적인 블록이 다. 도 4는 도 1의 게이밍 서버의 작동 방법을 보여주는 흐름도이다. 도 5는 도 1의 게이밍 서버를 대체하는 본 발명의 다른 실시예의 게이밍 및 오락 서버를 보여주는 대략도이다. 도 6은 다양한 유형의 IR 센서들의 위치를 보여주는 모나코 그랑프리 경로맵(Monaco grand prix route map)의 평면도이다. 도 7a 및 도 7b는 레이싱 써킷의 매우 대표적인 컴퓨터-기반의 데이터 모델을 생성하기 위해 본 실시예들에서 사용되는 2 가지 가능 전략들을 보여주는 대략도들이다. 도 8은 본 발명의 일 실시예에 따른 레이싱 트랙 주변 센서 배치들 및 그 각각의 시야들을 보여주는 3차원 도면 들의 집합이다. 도 9는 도 1의 센서들의 그룹 및 더 상세하게 센서들의 그룹과 레이싱 트랙 주변 그 각각의 시야 간의 통신 배 치들을 보여주는 3차원 도면이다. 도 10a는 단 한 명의 플레이어와 비디오 게임에 연결된 24 대의 실제 자동차들 및 운전자들을 포함하는 포뮬러 1 모터 레이스의 시작 구성의 대략적인 평면도이다. 여기서 실제 자동차는 그 시작 위치로서 플레이어에 의해 선택되거나 할당되었다. 도 10b는 트랙 상의 플레이어의 시뮬레이션된 차량과 실제 차량 표현의 대략적인 평면도이다. 여기서 플레이어 의 시뮬레이션된 차량은 알려진 양 만큼 실제 차량 표현으로부터 속력, 속도 및 가속도와 같은 가능한 기타 속 성들 및 순간적인 위치에서 벗어난다. 도 11a는 레이싱 상황의 대략적인 평면도이다. 여기서 시뮬레이션된 자동차는 3 개의 최근접한 실제 자동차 표 현들 사이에 위치된다. 도 11b는 조금 후의 도 11a의 레이싱 상황의 연속을 보여주는 대략적인 평면도이다. 여기서 시뮬레이션된 자동 차는 점점 앞선 실제 자동차 표현에 근접하게 된다. 도 11c는 조금 더 긴 시간 후 써킷의 다른 부분에서의 도 11b의 레이싱 상황의 대략적인 평면도이다. 여기서 시 뮬레이션된 자동차는 선두의 실제 자동차 표현에 근접하고 있다. 도 12a는 천만 명의 비디오 게임 플레이어들이 시작 위치들에 고르게 분포되고 이스포츠 또는 온라인 게이밍 레 이스에 통합되고 라이브로 연결된 24 대의 실제 자동차들을 포함하는 레이스를 위한 시작 구성을 보여주는 시작 그리드의 대략적인 평면도이다. 도 12b는 일억 명의 비디오 게임 플레이어들이 로그적으로 분포되어 최고 순위의 가상 자동차가 선두의 실제 자 동차와 연결되는, 도 12a에 도시된 다른 시작 구성을 보여주는 시작 그리드의 대략적인 평면도이다. 도 13은 24 대의 실제 자동차들 및 그 각각이 실제 자동차에 연결된 다수의 컴퓨터 게임 플레이어들의 레이스 중 레이싱 상황 부분을 보여준다. 도 14는 블랙 박스 동적 시뮬레이션 방법의 원리를 설명하기 위해 라이브 이벤트 데이터 캡쳐 서버에 의해 전송 되는 다양한 파라미터들의 시간에 따른 그래프이다. 도 15는 도 2의 가상 레이스 시뮬레이션 엔진을 더 상세하게 보여주는 대략도이다. 도 16은 다른 일 실시예에 따른 분산 처리 시스템의 도 1의 게이밍 장치를 보여주는 대략적인 블록도이다. 도 17은 도 16의 게이밍 장치를 사용하기 위한 분산 처리 시스템의 도 1의 게이밍 서버를 보여주는 대략적인 블 록도이다. 도 18a는 도 16의 게이밍 장치에 사용하기 위한 라이브 이벤트 데이터 캡쳐 시스템으로부터 수신된 실제 데이터 의 형식을 보여주는 대략적인 블록도이다. 도 18b는 도 16의 게이밍 장치로부터 수신된 가상 자동차 위치 데이터의 형식을 보여주는 대략적인 블록도이다. 도 19는 도 17의 가상 레이스 관리 엔진을 더 상세하게 보여주는 대략적인 블록도이다. 도 20은 도 16의 게이밍 장치의 작동 방법을 보여주는 흐름도이다."}
